Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/blockscad-parts-simple.po
Languages: ca

source: Piezas simples
ca: Peces senzilles

source: En este tutorial vamos a programar seis piezas de los `ejercicios simples de vistas y perspectivas <dibujo-vistas.html#ejercicios-simples>`__.
ca: En aquest tutorial anem a programar sis peces de les `visions senzilles de visualitzacions i perspectives <dibujo-vistas.html#ejercicios-simples>`__.

source: Pieza simple 01
ca: Peça senzilla 01

source: Primero vamos a abrir el `editor online de BlocksCAD <https://www.blockscad3d.com/editor/>`__.
ca: Primer, obrirem `l’editor en línia de BlocksCAD <https://www.blockscad3d.com/editor/>`__.

source: Los bloques necesarios para realizar la figura son los siguientes:
ca: Els blocs necessaris per fer la figura són els següents:

source: Pieza simple 02
ca: Peça senzilla 02

source: Pieza simple 03
ca: Peça senzilla 03

source: Pieza simple 04
ca: Peça senzilla 04

source: Pieza simple 05
ca: Peça senzilla 05

source: Pieza simple 06
ca: Peça senzilla 06
