Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/comm-curso-redes.po
Languages: ca

source: `8.22. Alta disponibilidad. <https://www.aulaclic.es/redes/secuencias/p08_22_alta_disponibilidad.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/WDXKeicKL3c>`__
ca: `8.22. Alta disponibilitat. <https://www.aulaclic.es/redes/secuences/p08_22_alta_disponibility.htm>`__` (YouTube). <https://www.youtube-nocokie.com/embed/wdxkeickl3c>`__

source: `8.23. Duplicidad de direcciones. <https://www.aulaclic.es/redes/secuencias/p08_23_duplicidad_direcciones.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/FGjchehMdN8>`__
ca: `8.23. Duplicitat de les adreces. <https://www.aulaclic.es/redes/secuences/p08_23_duplicity_direcciones.htm> `__ `(YouTube). <https://www.youtube-nocokie.com/embed/fgjchehmdn8>`__

source: `8.24. Ejercicios. <https://www.aulaclic.es/redes/secuencias/p08_24_ejercicios.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/zT7q7ZcfvPo>`__
ca: `8.24. Exercicis. <https://www.aulaclic.es/redes/seciones/p08_24_ejercicios.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/zt7q7zcfvpo>`__

source: Protocolos e Internet
ca: Protocols i Internet

source: `9.1. Resolución inversa de direcciones: protocolo RARP. <https://www.aulaclic.es/redes/secuencias/p09_01_rarp.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/6N4uB1p6MqA>`__
ca: `9.1. Resolució d'adreces inverses: Protocol RARP. <https://www.aulaclic.es/redes/secuences/p09_01_rarp.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/6n4ub1p6mqa>`__

source: `9.2. Resolución inversa de direcciones: protocolo BOOTP. <https://www.aulaclic.es/redes/secuencias/p09_02_bootp.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/6AA5CRnMIKM>`__
ca: `9.2. Resolució d'adreces inverses: protocol Bootp. <https://www.aulaclic.es/redes/secuences/p09_02_bootp.htm>`__ `(YouTube). <https://www.youtube-nocoakie.com/embed/6aa5crnmikm>`__

source: `9.3. Resolución inversa de direcciones: protocolo DHCP. <https://www.aulaclic.es/redes/secuencias/p09_03_dhcp.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/r_8YCvfcNM4>`__
ca: `9.3. Resolució d'adreces inverses: protocol DHCP. <https://www.aulaclic.es/redes/secuences/p09_03_dhcp.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/r_8ycvfcnm4>`__

source: `9.4. Ataques relacionados con DHCP. <https://www.aulaclic.es/redes/secuencias/p09_04_ataques_dhcp.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/mmuvHcGK-8M>`__
ca: `9.4. Atacs relacionats amb DHCP. <https://www.aulaclic.es/redes/secuences/p09_04_ataques_dhcp.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/mmuvhcgk-8m>`__

source: `9.5. Ataques de spoofing. <https://www.aulaclic.es/redes/secuencias/p09_05_ataques_spoofing.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/B_teAa7M-uQ>`__
ca: `9.5. Atacs de spoofing. <https://www.aulaclic.es/redes/secuences/p09_05_ataques_spofing.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/b_teaa7m-uq>`__

source: `9.6. Protocolos de routing: aspectos generales. <https://www.aulaclic.es/redes/secuencias/p09_06_routing.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/yypuhnxWZTg>`__
ca: `9.6. Protocols d’encaminament: aspectes generals. <https://www.aulaclic.es/redes/secuences/p09_06_routing.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/ypuhnxwztg>`__

source: `9.7. Protocolos de routing: RIP e IGRP/EIGRP. <https://www.aulaclic.es/redes/secuencias/p09_07_routing_rip.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/bga8fR8E570>`__
ca: `9.7. Protocols d’encaminament: RIP i IGRP/Eigrp. <https://www.aulaclic.es/redes/secuences/p09_07_routing_rip.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/bga8fr8e570>`__

source: `9.8. Protocolos de routing: OSPF. <https://www.aulaclic.es/redes/secuencias/p09_08_routing_ospf.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/KB18rUEGFIo>`__
ca: `9.8. Protocols d’encaminament: OSPF. <https://www.aulaclic.es/redes/secuences/p09_08_routing_ospf.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/kb18ruegfio>`__

source: `9.9. Protocolos de routing: IS-IS. <https://www.aulaclic.es/redes/secuencias/p09_09_routing_is_is.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/se1R34dmk7Q>`__
ca: `9.9. Protocols d’encaminament: IS-IS. <https://www.aulaclic.es/redes/secuences/p09_09_routing_is_is.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/se1r34dmk7q>`__

source: `9.10. Mecanismo de enrutado. <https://www.aulaclic.es/redes/secuencias/p09_10_enrutado.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/KKQPVghhKBQ>`__
ca: `9.10. Mecanisme encaminat. <https://www.aulaclic.es/redes/secuences/p09_10_enrute.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/kkqpvghkbq>`__

source: `9.11. Routing entre sistemas autónomos. Protocolo BGP. <https://www.aulaclic.es/redes/secuencias/p09_11_autonomos_bgp.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/PCAjtxbGU-g>`__
ca: `9.11. Enrutament entre sistemes autònoms. Protocol BGP. <https://www.aulaclic.es/redes/secuences/p09_11_autonomos_bgp.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/pcajtxbgu-g>`__

source: `9.12. Organizaciones con dos conexiones a Internet. <https://www.aulaclic.es/redes/secuencias/p09_12_dos_conexiones.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/vN3ZSarT1dE>`__
ca: `9.12. Organitzacions amb dues connexions a Internet. <https://www.aulaclic.es/redes/secuences/p09_12_dos_conexions.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/vn3zart1de>`__

source: `9.13. Arquitectura de Internet. <https://www.aulaclic.es/redes/secuencias/p09_13_arquitectura_internet.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/_l1ieN2pTpE>`__
ca: `9.13. Arquitectura a Internet. <https://www.aulaclic.es/redes/secuences/p09_13_arquitectura_internet.htm> `__ `(YouTube). <https://www.youtube-nocookie.com/embed/_l1ien2ptpe>`__

source: `9.14. Fragmentación. <https://www.aulaclic.es/redes/secuencias/p09_14_fragmentacion.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/KaHpC2W9-l4>`__
ca: `9.14. Fragmentació. <https://www.aulaclic.es/redes/secuences/p09_14_fragmentacion.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/kahpc2w9-l4>`__

source: `9.15. Historia de Internet. <https://www.aulaclic.es/redes/secuencias/p09_15_historia_internet.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/v_-bHKhDhzA>`__
ca: `9.15. Historial d'Internet. <https://www.aulaclic.es/redes/secuences/p09_15_historia_internet.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/v_-bhkhdhza>`__

source: `9.16. Organización administrativa de Internet. <https://www.aulaclic.es/redes/secuencias/p09_16_organizacion_internet.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/8pLe8K1yAnA>`__
ca: `9.16. Organització administrativa a Internet. <https://www.aulaclic.es/redes/secuences/p09_16_organizacion_internet.htm> `__ `(YouTube). <https://www.youtube-nocokie.com/embed/8ple8k1yana>`__

source: Nivel de Transporte
ca: Nivell de transport

source: `10.1. Nivel de transporte, aspectos generales. <https://www.aulaclic.es/redes/secuencias/p10_1_nivel_transporte.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/lJVs93IwSU8>`__
ca: `10.1. Nivell de transport, aspectes generals. <https://www.aulaclic.es/redes/secuences/p10_1_ level_transporte.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/ljvs93iwsu8> `` `

source: `10.2. Protocolo UDP (1/2). <https://www.aulaclic.es/redes/secuencias/p10_2_protocolo_udp.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/ez82JeEMYjQ>`__
ca: `10.2. Protocol UDP (1/2). <https://www.aulaclic.es/redes/secuences/p10_2_protocol_udp.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/ez8JeAmyjq>`__

source: `10.3. Protocolo UDP. Ejemplo (2/2). <https://www.aulaclic.es/redes/secuencias/p10_3_protocolo_udp_ejemplo.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/vqeapa1MWWA>`__
ca: `10.3. Protocol UDP. Exemple (2/2). <https://www.aulaclic.es/redes/secuences/p10_3_protocol_udp_ejemplo.htm> `__ `(YouTube). <https://www.youtube-nocokie.com/embed/vqepa1mwwa>`__

source: `10.4. Protocolo TCP. Funciones y cabecera. <https://www.aulaclic.es/redes/secuencias/p10_4_protocolo_tcp_cabecera.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/0MlNpTgO97c>`__
ca: `10.4. Protocol TCP. Funcions i cap. <https://www.aulaclic.es/redes/secuences/p10_4_protocol_tcp_cabecera.htm> `__ `(YouTube). <https://www.youtube-nocoakie.com/embed/0mlnptgo97c>`__

source: `10.5. Protocolo TCP. Multiplexación. <https://www.aulaclic.es/redes/secuencias/p10_5_protocolo_tcp_multiplexacion.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/By20rTaXFIw>`__
ca: `10.5. Protocol TCP. Multiplexation <https://www.aulaclic.es/redes/secuences/p10_5_protocol_tcp_multiplexacion.htm> `__ `(YouTube). <https://www.youtube-nocokie.com/embed/by20rtaxfiw>`__ __

source: `10.6. Protocolo TCP: establecimiento de conexión. <https://www.aulaclic.es/redes/secuencias/p10_6_protocolo_tcp_conexion.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/blRsbnSUbls>`__
ca: `10.6. Protocol TCP: establiment de connexió. <https://www.aulaclic.es/redes/secuences/p10_6_protocol_tcp_conexion.htm> `__ `(YouTube). <https://www.youtube-nocoakie.com/embed/blrsbnsubls>`__

source: `10.7. Protocolo TCP: números de secuencia. <https://www.aulaclic.es/redes/secuencias/p10_7_protocolo_tcp_secuencia.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/drBwqN038vM>`__
ca: `10.7. Protocol TCP: números de seqüència. <https://www.aulaclic.es/redes/secuences/p10_7_protocol_tcp_secion.htm>`__` (YouTube). <https://www.youtube-nocoakie.com/embed/drbwqn038vm>`__

source: `10.8. Protocolo TCP: desconexión. <https://www.aulaclic.es/redes/secuencias/p10_8_protocolo_tcp_desconexion.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/EpCOiSCxCgY>`__
ca: `10.8. Protocol TCP: desconnexió. <https://www.aulaclic.es/redes/secuences/p10_8_protocol_tcp_desconexion.htm> `__ `(YouTube). <https://www.youtube-nocokie.com/embed/epcoiscxcgy>`__

source: `10.9. Protocolo TCP: ejemplo de conexión/desconexión. <https://www.aulaclic.es/redes/secuencias/p10_9_protocolo_tcp_ejempo.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/7vrjiF7F3pY>`__
ca: `10.9. Protocol TCP: exemple de connexió/desconnexió. <https://www.aulaclic.es/redes/secuences/p10_9_protocol_tcp_ejempo.htm>`__` (YouTube). <https://www.youtube-nocokie.com/embed/7vrjif7f3py>`__

source: `10.10. TCP: desconexión simultánea y pérdida de mensajes de desconexión. <https://www.aulaclic.es/redes/secuencias/p10_10_protocolo_tcp_simultanea.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/w8qI1krG00k>`__
ca: `10.10. TCP: Desconnexió simultània i pèrdua de missatges de desconnexió. <https://www.aulaclic.es/redes/secuences/p10_10_protocol_tcp_simultanea.htm> `__ `(YouTube). <https://www.youtube-nocokie.com/embed/w8qi1krg00k>`__

source: `10.11. Protocolo TCP: desconexión unilateral. <https://www.aulaclic.es/redes/secuencias/p10_11_protocolo_tcp_unilateral.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/5utodCo7U20>`__
ca: `10.11. Protocol TCP: desconnexió unilateral. <https://www.aulaclic.es/redes/secuences/p10_11_protocol_tcp_unilateral.htm> `__ `(YouTube). <https://www.youtube-nocokie.com/embed/5utodco7u20>`__

source: `10.12. Protocolo TCP: programación sockets. <https://www.aulaclic.es/redes/secuencias/p10_12_protocolo_tcp_sockets.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/SC8LVgVYDEg>`__
ca: `10.12. Protocol TCP: programació de socket. <https://www.aulaclic.es/redes/secuences/p10_12_protocol_tcp_sockets.htm> `__ `(YouTube). <https://www.youtube-nocokie.com/embed/sc8lvgvydeg>`__

source: `10.13. Protocolo TCP: intercambio de datos. <https://www.aulaclic.es/redes/secuencias/p10_13_protocolo_tcp_intercambio.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/0LAZKtK4iCY>`__
ca: `10.13. Protocol TCP: intercanvi de dades. <https://www.aulaclic.es/redes/secuences/p10_13_protocol_tcp_intercambio.htm> `__ `(YouTube). <https://www.youtube-nocokie.com/embed/0lazktk4icy>`__

source: `10.14. Negociación de la MTU. <https://www.aulaclic.es/redes/secuencias/p10_14_ntu.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/p-rhMXQ2Bxw>`__
ca: `10.14. Negociació MTU. <https://www.aulaclic.es/redes/secuences/p10_14_ntu.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/p-rhmxq2bxw>`__

source: `10.15. Datos 'pushed' y datos urgentes. <https://www.aulaclic.es/redes/secuencias/p10_15_pushed.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/R7XAhXpz9lc>`__
ca: `10.15. Dades "pressionades" i dades urgents. <https://www.aulaclic.es/redes/seciones/p10_15_pushed.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/r7xahxpz9lc>`__

source: `10.16. Flujo de datos de TCP: datos interactivos. <https://www.aulaclic.es/redes/secuencias/p10_16_flujo_datos.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/hRsUxMcXsxI>`__
ca: `10.16. Flux de dades TCP: dades interactives. <https://www.aulaclic.es/redes/seciones/p10_16_fluxo_datos.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/hrsuxmcxxi>`__

source: `10.17. Flujo de datos de TCP: datos masivos. <https://www.aulaclic.es/redes/secuencias/p10_17_flujo_masivo.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/OAj-vahYHYI>`__
ca: `10.17. Flux de dades TCP: dades de massa. <https://www.aulaclic.es/redes/secuences/p10_17_fluxo_masivo.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/oaj-vahyhyi>`__

source: `10.18. Timer de persistencia. <https://www.aulaclic.es/redes/secuencias/p10_18_timer_persistencia.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/xnCw16fGR78>`__
ca: `10.18. Temporitzador de persistència. <https://www.aulaclic.es/redes/secuences/p10_18_timer_persistencia.htm>`__` (YouTube). <https://www.youtube-nocokie.com/embed/xncw16fgr78>`__

source: `10.19. Pipeline de TCP y reenvío de segmentos. <https://www.aulaclic.es/redes/secuencias/p10_19_pipeline.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/bfbgXEe7UoA>`__
ca: `10.19. Pipeline TCP i segments. <https://www.aulaclic.es/redes/secuences/p10_19_pipeline.htm>`__ `(YouTube). <https://www.youtube-nocoakie.com/embed/bfbgxee7uoa>`__

source: `10.20. Mejoras de rendimiento de TCP. <https://www.aulaclic.es/redes/secuencias/p10_21_protocolo_tcp_keepalive.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/eQxvfHpyXes>`__
ca: `10.20. Millores de rendiment TCP. <https://www.aulaclic.es/redes/seciones/p10_21_protocol_tcp_keepalive.htm> `__ `(YouTube). <https://www.youtube-nocoakie.com/embed/eqxvfhpyxes>`__ __

source: `10.21. Timer de Keepalive de TCP. <https://www.aulaclic.es/redes/secuencias/p10_21_protocolo_tcp_keepalive.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/DHA4SKH6Aos>`__
ca: `10.21. TCP Temporitzador de Keepalive. <https://www.aulaclic.es/redes/seciones/p10_21_protocol_tcp_keepalive.htm> `__ `(YouTube). <https://www.youtube-nocoakie.com/embed/dha4skh6aos>`__

source: `10.22. Timer de retransmisión en TCP. <https://www.aulaclic.es/redes/secuencias/p10_22_tcp_timer_retransmision.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/x17GIy75Ng4>`__
ca: `10.22. Temporitzador de retransmissió TCP. <https://www.aulaclic.es/redes/secuences/p10_22_tcp_timer_retransmision.htm> `__ `(YouTube). <https://www.youtube-nocoakie.com/embed/x17giy75ng4>`__ __

source: `10.23. Control de congestión de TCP. <https://www.aulaclic.es/redes/secuencias/p10_23_tcp_control_congestion.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/nS08p-lsbPM>`__
ca: `10.23. Control de congestió TCP. <https://www.aulaclic.es/redes/secuences/p10_23_tcp_control_congestion.htm> `__ `(YouTube). <https://www.youtube-nocoakie.com/embed/ns08p-sbpm>`__ __

source: `10.24. Congestión Avoidance de TCP. <https://www.aulaclic.es/redes/secuencias/p10_24_tcp_congestion_avoidance.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/aVTNnvv2E8M>`__
ca: `10.24. Congestió d’evitació de TCP. <https://www.aulaclic.es/redes/secuences/p10_24_tcp_congestion_avoidance.htm> `__ `(YouTube). <https://www.youtube-nocokie.com/embed/avtnnv2e8m>`__ __

source: `10.25. Control avanzado de congestión. <https://www.aulaclic.es/redes/secuencias/p10_25_tcp_congestion_red.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/D9CrKZcu8CA>`__
ca: `10.25. Control de congestió avançat. <https://www.aulaclic.es/redes/secuences/p10_25_tcp_congestion_red.htm>`__` (YouTube). <https://www.youtube-nocokie.com/embed/d9crkzcu8ca>`__

source: `10.26. Uso del factor de escala. <https://www.aulaclic.es/redes/secuencias/p10_26_tcp_factor_escala.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/Z1VEOOqlOAc>`__
ca: `10.26. Ús del factor d’escala. <https://www.aulaclic.es/redes/secuences/p10_26_tcp_factor_calala.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/z1veooqloac>`__

source: `10.27. Opciones de TCP. <https://www.aulaclic.es/redes/secuencias/p10_27_tcp_opciones.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/9soiAMdmRQw>`__
ca: `10.27. Opcions TCP. <https://www.aulaclic.es/redes/secuences/p10_27_tcp_options.htm>`__ `(YouTube). <https://www.youtube-nocoakie.com/embed/9soamdmrqw>`__

source: `10.28. Resumen de TCP/UDP. <https://www.aulaclic.es/redes/secuencias/p10_28_tcp_resumen.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/iobUcKZ0lSw>`__
ca: `10.28. Resum TCP/UDP. <https://www.aulaclic.es/redes/seciones/p10_28_tcp_resumen.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/iobuckz0lsw>`__

source: Network Address Translation
ca: Traducció d'adreces de xarxa

source: `11.1. NAT I. <https://www.aulaclic.es/redes/secuencias/p11_1_nat_i.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/lFyIgt7iVKA>`__
ca: `11.1. Nat I. <https://www.aulaclic.es/redes/seciones/p11_nat_i.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/lfyigt7ivka>`__

source: `11.2. NAT II. <https://www.aulaclic.es/redes/secuencias/p11_1_nat_ii.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/eGgZCJA1X_E>`__
ca: `11.2. Nat II. <https://www.aulaclic.es/redes/secuences/p11_nat_ii.htm>`__` (YouTube). <https://www.youtube-nocoakie.com/embed/eggzcja1x_e>`__
