Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/comm-curso-redes.po
Languages: ca

source: Curso de Redes Telemáticas
ca: Curs de xarxa telemàtica

source: Curso de nivel universitario sobre Redes Telemáticas publicado en 2018 por Rogelio Montañana en `AulaClic. <https://www.aulaclic.es/redes/index.htm>`__
ca: Curs de nivell universitari a les xarxes telemàtiques publicades el 2018 per Rogelio Montañana a `Aulaclic. <https://www.aulaclic.es/redes/index.htm> `__

source: El curso contiene 175 vídeos de alrededor de 20 minutos cada uno y equivale a dos asignaturas de 3 créditos cada una. La primera parte abarca desde la capa física hasta la capa de enlace de datos. La segunda parte abarca las capas de red y de transporte de datos.
ca: El curs conté 175 vídeos d’uns 20 minuts cadascun i equival a dos temes de 3 crèdits cadascun. La primera part cobreix des de la capa física fins a la capa d’enllaç de dades. La segona part cobreix les capes de xarxa i el transport de dades.

source: Índice de contenidos:
ca: Índex de contingut:

source: Introducción
ca: Presentació

source: `1.1. Introducción. Conceptos básicos. <https://www.aulaclic.es/redes/secuencias/p01_01_introduccion.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/BrqH4PVyYF4>`__
ca: `1.1. Introducció. Conceptes bàsics. <https://www.aulaclic.es/redes/secuences/p01_01_inttuccion.htm>`__ `(YouTube). <https://www.youtube-nocoakie.com/embed/brqh4pvyyf4>`__

source: `1.2. Tipos de redes. LAN y WLAN. <https://www.aulaclic.es/redes/secuencias/p01_02_tipos_redes.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/ASXYvGV6sqE>`__
ca: `1.2. Tipus de xarxes. LAN i WLAN. <https://www.aulaclic.es/redes/secuences/p01_02_tipos_redes.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/asxyvgv6sqe>`__

source: `1.3. Modelo de capas, una analogía. <https://www.aulaclic.es/redes/secuencias/p01_03_capas.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/EDXSvhbaTvM>`__
ca: `1.3. Model de capa, una analogia. <https://www.aulaclic.es/redes/secuences/p01_03_capas.htm>`__ `(YouTube). <https://www.youtube-nocoakie.com/embed/edxsvhbatvm>`__

source: `1.4. Arquitecturas de redes. Descripción de las capas. <https://www.aulaclic.es/redes/secuencias/p01_04_arquitectura.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/gyk3Fq7g95o>`__
ca: `1.4. Arquitectures de xarxa. Descripció de les capes. <https://www.aulaclic.es/redes/secuences/p01_04_arquitectura.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/gyk3fq7g95o>`__

source: `1.5. El modelo TCP/IP y su arquitectura. <https://www.aulaclic.es/redes/secuencias/p01_05_tcp_ip.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/yZivRoQW8D4>`__
ca: `1.5. El model TCP/IP i la seva arquitectura. <https://www.aulaclic.es/redes/secuences/p01_05_tcp_ip.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/yzivroqw8d4>`__

source: `1.6. Protocolos e información de control. <https://www.aulaclic.es/redes/secuencias/p01_06_protocolos.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/-sQIFuYorTc>`__
ca: `1.6. Protocols i informació de control. <https://www.aulaclic.es/redes/secuencias/p01_06_protocolos.htm>`__ `(YouTube). <https://www.youtube-nocoakie.com/embed/-sqifuyortc>`__

source: `1.7. El modelo de internetworking de Cisco. <https://www.aulaclic.es/redes/secuencias/p01_07_internetworking.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/lojGC2fsPE8>`__
ca: `1.7. Model de treball internet de Cisco. <https://www.aulaclic.es/redes/secuences/p01_07_internetworking.htm>`__ `(YouTube). <https://www.youtube-nocoakie.com/embed/lojgc2fspe8>`__

source: `1.8. Estándares. <https://www.aulaclic.es/redes/secuencias/p01_08_estandares.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/QuTUyaMvXdM>`__
ca: `1.8. Normes <https://www.aulaclic.es/redes/secuences/p01_08_stanes.htm> `__ `(YouTube). <https://www.youtube-nocokie.com/embed/qutuyamvxdm>`__

source: `1.9. Breve historia de la telemática. <https://www.aulaclic.es/redes/secuencias/p01_09_historia.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/waRsyLpwmuU>`__
ca: `1.9. Breu història de la telemàtica. <https://www.aulaclic.es/redes/secuences/p01_09_historia.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/warsylpwmuu>`__

source: `1.10. Principios de diseño: una pincelada. <https://www.aulaclic.es/redes/secuencias/p01_10_disenyo.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/CnSz0XbP1J4>`__
ca: `1.10. Principis de disseny: un pinzell. <https://www.aulaclic.es/redes/secuences/p01_10_disenyo.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/cnsz0xbp1j4>`__

source: Medios de transmisión
ca: Mitjans de transmissió

source: `2.1. Medios de transmisión. Introducción. <https://www.aulaclic.es/redes/secuencias/p02_01_medios.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/pz39xEwygFU>`__
ca: `2.1. La transmissió significa introducció. <https://www.aulaclic.es/redes/secuences/p02_01_medios.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/pz39xewygfu>`__

source: 2.2. Cables metálicos.
ca: 2.2. Cables metàl·lics.

source: `2.2.1. Corrientes eléctricas. <https://www.aulaclic.es/redes/secuencias/p02_02_01_corrientes.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/NzcAbQO2a0Y>`__
ca: `2.2.1. Corrents elèctrics. <https://www.aulaclic.es/redes/seciones/p02_02_01_corrientes.htm>`__ `(YouTube). <https://www.youtube-nocoakie.com/embed/nzcabqo2a0y>`__

source: `2.2.2. Trenzado. <https://www.aulaclic.es/redes/secuencias/p02_02_02_trenzado.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/GzVI-k2-4yI>`__
ca: `2.2.2. Trenat. <https://www.aulaclic.es/redes/seciones/p02_02_02_trenzado.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/gzvi-k2-4yi>`__

source: `2.2.3. Atenuación y pérdida de retorno. <https://www.aulaclic.es/redes/secuencias/p02_02_03_atenuacion.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/vA2JobdSfnU>`__
ca: `2.2.3. Atenuació i pèrdua de retorn. <https://www.aulaclic.es/redes/secuences/p02_02_03_atenuacion.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/va2jobdsfnu>`__

source: `2.2.4. Diafonía. <https://www.aulaclic.es/redes/secuencias/p02_02_04_diafonia.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/-7IV-Nlyaf4>`__
ca: `2.2.4. Diaphon <https://www.aulaclic.es/redes/secuences/p02_02_04_diafonia.htm>`__ `(YouTube). <https://www.youtube-nocoakie.com/embed/-7iv-nlyof4>`__

source: `2.2.5. ACR. <https://www.aulaclic.es/redes/secuencias/p02_02_05_acr.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/Ek-OARF2UXg>`__
ca: `2.2.5. Acr. <https://www.aulaclic.es/redes/secuences/p02_02_05_acr.htm> `__ `(YouTube). <https://www.youtube-nocokie.com/embed/ek-oarf2uxg>`__

source: `2.2.6. Diafonía 'alien'. <https://www.aulaclic.es/redes/secuencias/p02_02_06_alien.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/5xKDqwnXFzU>`__
ca: `2.2.6. Diafonia "alienígena". <https://www.aulaclic.es/redes/secuences/p02_02_06_alien.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/5xkdqwnxfzu>`__

source: `2.2.7. Comparación de NEXT, FEXT, ANEXT y AFEXT. <https://www.aulaclic.es/redes/secuencias/p02_02_07_comparacion.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/JGjO47sDRAA>`__
ca: `2.2.7. Comparació de Next, Fext, ANEXT i AFEXT. <https://www.aulaclic.es/redes/secuences/p02_07_comaracion.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/jgjo47sdraa>`__

source: 2.3. Sistemas de cableado estructurado.
ca: 23. Sistemes de cablejat estructurats.

source: `2.3.1. Origen y normativas. <https://www.aulaclic.es/redes/secuencias/p02_03_01_origen.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/S55IpAovx1w>`__
ca: `2.3.1. Origen i regulacions. <https://www.aulaclic.es/redes/secuences/p02_03_01_origen.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/s55ipaovx1w>`__

source: `2.3.2. Tipos de cables y de apantallamiento. <https://www.aulaclic.es/redes/secuencias/p02_03_02_tipos.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/17oNQpVZ5Fo>`__
ca: `2.3.2. Tipus de cables i blindatge. <https://www.aulaclic.es/redes/secuences/p02_03_02_tipos.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/17onqpvz5fo>`__

source: `2.3.3. Cables y categorías. <https://www.aulaclic.es/redes/secuencias/p02_03_03_categorias.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/0GVoZZs7W54>`__
ca: `2.3.3. Cables i categories. <https://www.aulaclic.es/redes/secuences/p02_03_03_categorias.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/0gvozzs7w54>`__

source: `2.3.4. Comprobación de cables. <https://www.aulaclic.es/redes/secuencias/p02_03_04_comprobacion.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/Us2BY7Hf2yQ>`__
ca: `2.3.4. Comprovació de cables. <https://www.aulaclic.es/redes/secuences/p02_03_04_comprobacion.htm>`__ `(YouTube). <https://www.youtube-nocoakie.com/embed/us2by7hf2yq>`__

source: `2.3.5. Consejos prácticos. <https://www.aulaclic.es/redes/secuencias/p02_03_05_consejos.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/8puqCreEfgk>`__
ca: `2.3.5. Consells pràctics <https://www.aulaclic.es/redes/secuences/p02_03_05_consjos.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/8puqcreefgk>`__

source: `2.3.6. Conectores. <https://www.aulaclic.es/redes/secuencias/p02_03_06_conectores.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/GG_E0Ca_Ow0>`__
ca: `2.3.6. Connectors <https://www.aulaclic.es/redes/secuences/p02_03_06_conector.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/g_e0ca_ow0>`__

source: `2.3.7. PoE e interferencias externas. <https://www.aulaclic.es/redes/secuencias/p02_03_07_poe.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/LmzQeF-E7ys>`__
ca: `2.3.7. Poe i interferència externa. <https://www.aulaclic.es/redes/secuences/p02_03_07_poe.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/lmzqef-e7ys>`__

source: 2.4. Cables de Fibra Óptica.
ca: 2.4. Cables de fibra òptica.

source: `2.4.1. Cuestiones generales. <https://www.aulaclic.es/redes/secuencias/p02_04_01_fibra.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/9LEztxR3OKw>`__
ca: `2.4.1. Problemes generals. <https://www.aulaclic.es/redes/secuences/p02_04_01_fibra.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/9leztxr3okw>`__

source: `2.4.2. Fibra multimodo. <https://www.aulaclic.es/redes/secuencias/p02_04_02_multimodo.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/xEGowifxX-8>`__
ca: `2.4.2. Fibra multimode. <https://www.aulaclic.es/redes/secuences/p02_04_02_multimodo.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/xegowifxx-8>`__

source: `2.4.3. Fibra monomodo. <https://www.aulaclic.es/redes/secuencias/p02_04_03_monomodo.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/c5tCC5TGhVg>`__
ca: `2.4.3. Fibra monomodo. <https://www.aulaclic.es/redes/secuences/p02_04_03_monomodo.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/c5tcc5tghvg>`__

source: `2.4.4. Algunos ejemplos. <https://www.aulaclic.es/redes/secuencias/p02_04_04_ejemplos.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/TawYYIpoQB0>`__
ca: `2.4.4. Alguns exemples. <https://www.aulaclic.es/redes/seciones/p02_04_04_ejempos.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/tawyyipoqb0>`__

source: `2.4.5. Atenuación, ventanas y bandas. <https://www.aulaclic.es/redes/secuencias/p02_04_05_atenuacion.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/pMIdlMfevRs>`__
ca: `2.4.5. Atenuació, finestres i bandes. <https://www.aulaclic.es/redes/secuences/p02_04_05_atenuacion.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/pmidlmfevrs>`__

source: `2.4.6. Amplificadores y repetidores. <https://www.aulaclic.es/redes/secuencias/p02_04_06_amplificadores.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/ovXDajvixD0>`__
ca: `2.4.6. Amplificadors i repetidors. <https://www.aulaclic.es/redes/secuences/p02_04_06_amplifiers.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/ovxdajvixd0>`__

source: `2.4.7. Emisores de luz. <https://www.aulaclic.es/redes/secuencias/p02_04_07_emisores.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/-5d8A_T01D4>`__
ca: `2.4.7. Emissors de llum. <https://www.aulaclic.es/redes/secuences/p02_04_07_emisores.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/-5d8a_t01d4>`__

source: `2.4.8. Dispersión en fibras multimodo. Tipos de fibras. <https://www.aulaclic.es/redes/secuencias/p02_04_08_dispersion.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/q8-nrc9MvgQ>`__
ca: `2.4.8. Dispersió de fibra multimode. Tipus de fibres. <https://www.aulaclic.es/redes/secuences/p02_04_08_dispersion.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/q8-nrc9mvgq>`__

source: `2.4.9. Dispersión en fibras monomodo. Tipos de fibras. <https://www.aulaclic.es/redes/secuencias/p02_04_09_monomodo.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/jd5H_rLUzr4>`__
ca: `2.4.9. Dispersió de fibra monomodada. Tipus de fibres. <https://www.aulaclic.es/redes/secuences/p02_04_09_monomodo.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/jd5h_rluzr4>`__

source: `2.4.10. Aspectos prácticos. <https://www.aulaclic.es/redes/secuencias/p02_04_10_aspectos.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/gvfSVQ9oHVI>`__
ca: `2.4.10. Aspectes pràctics <https://www.aulaclic.es/redes/secuences/p02_04_10_aspectes.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/gvfsvq9ohvi>`__

source: `2.4.11. Tipos de pulido. <https://www.aulaclic.es/redes/secuencias/p02_04_11_pulido.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/Cba8BYpe_c4>`__
ca: `2.4.11. Tipus de polit. <https://www.aulaclic.es/redes/secuences/p02_04_11_pulido.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/cba8bype_c4>`__

source: `2.4.12. Transceptores ópticos. <https://www.aulaclic.es/redes/secuencias/p02_04_12_transceptores.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/xWvuIGPZy7M>`__
ca: `2.4.12. Transcepcions òptiques. <https://www.aulaclic.es/redes/seciones/p02_04_12_transceptores.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/xwvuigpzy7m>`__

source: `2.4.13. Fibra oscura, envejecimiento y comparación con el cobre. <https://www.aulaclic.es/redes/secuencias/p02_04_13_oscura.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/_eYwFHQMA3E>`__
ca: `2.4.13. Fibra fosca, envelliment i comparació amb el coure. <https://www.aulaclic.es/redes/secuences/p02_04_13_oscura.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/_eywfhqma3e>`__

source: 2.5. Wavelength Division Multiplexing (WDM).
ca: 2.5. Divisió de multiplexació de longitud d’ona (WDM).

source: `2.5.1. Aspectos generales. <https://www.aulaclic.es/redes/secuencias/p02_05_01_wdm.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/TUiNZM4KYSE>`__
ca: `2.5.1. Aspectes generals. <https://www.aulaclic.es/redes/secuences/p02_05_01_wdm.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/tuinzm4kyse>`__

source: `2.5.2. Amplificadores EDFA, Fibras DSF y NZDSF. <https://www.aulaclic.es/redes/secuencias/p02_05_02_wdm_amplificadores.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/jyMIaS4gicY>`__
ca: `2.5.2. Amplificadors EDFA, fibres DSF i NZDSF. <https://www.aulaclic.es/redes/secuences/p02_05_02_wdm_amplifiers.htm>`__ `(YouTube). <https://www.youtube-nocoakie.com/embed/jymias4Gye>`__

source: `2.5.3. Redes ópticas. <https://www.aulaclic.es/redes/secuencias/p02_05_03_opticas.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/Jxm1JxtDO6M>`__
ca: `2.5.3. Xarxes òptiques <https://www.aulaclic.es/redes/secuences/p02_05_03_opticas.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/jxm1jxtdo6m>`__

source: `2.5.4. Coarse WDM y Short WDM. <https://www.aulaclic.es/redes/secuencias/p02_05_04_coarse.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/Apsh2AoEoiM>`__
ca: `2.5.4. WDM gruixut i WDM curt. <https://www.aulaclic.es/redes/secuences/p02_05_04_coarse.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/apsh2aooim>`__

source: 2.6. Medios inalámbricos.
ca: 2.6. Mitjans de comunicació sense fils.

source: `2.6.1. Bandas y tipos de transmisión. <https://www.aulaclic.es/redes/secuencias/p02_06_01_inalambricos.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/2QPqo9uwsjo>`__
ca: `2.6.1. Bandes i tipus de transmissió. <https://www.aulaclic.es/redes/secuences/p02_06_01_ininaricos.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/2qpqo9uwsjo>`__

source: `2.6.2. Interferencia multitrayectoria. <https://www.aulaclic.es/redes/secuencias/p02_06_02_interferencia.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/FPBEnht0LM4>`__
ca: `2.6.2. Interferència multittrajectòria. <https://www.aulaclic.es/redes/secuences/p02_06_02_interference.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/fpbenht0lm4>`__

source: `2.6.3. Bandas, canales y estándares. <https://www.aulaclic.es/redes/secuencias/p02_06_03_bandas.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/CSodixdrKM0>`__
ca: `2.6.3. Bandes, canals i estàndards. <https://www.aulaclic.es/redes/secuences/p02_06_03_bandas.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/csodixdrkm0>`__

source: `2.6.4. Negociación de velocidad. <https://www.aulaclic.es/redes/secuencias/p02_06_04_velocidad.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/fAHtbF8CCgc>`__
ca: `2.6.4. Negociació de velocitat. <https://www.aulaclic.es/redes/secuences/p02_06_04_velocity.htm>`__ `(YouTube). <https://www.youtube-nocoakie.com/embed/fahtbf8ccgc>`__

source: `2.6.5. Intensidad de la señal. <https://www.aulaclic.es/redes/secuencias/p02_06_05_intensidad.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/dPvTRRPu9LM>`__
ca: `2.6.5. Intensitat del senyal. <https://www.aulaclic.es/redes/secuences/p02_06_05_intensity.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/dpvtrrpu9lm>`__

source: `2.6.6. Interferencias. <https://www.aulaclic.es/redes/secuencias/p02_06_06_interferencias.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/wTzhOfQvtqs>`__
ca: `2.6.6. Interferència. <https://www.aulaclic.es/redes/secuences/p02_06_06_interferences.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/wtzhofqvtqs>`__

source: `2.6.7. Aspectos prácticos en la instalación de APs. <https://www.aulaclic.es/redes/secuencias/p02_06_07_practicos.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/8mIEnf3RRRM>`__
ca: `2.6.7. Aspectes pràctics a la instal·lació APS. <https://www.aulaclic.es/redes/secuences/p02_06_07_practicos.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/8mienf3rrrm>`__

source: `2.6.8. Antenas y ganancias. <https://www.aulaclic.es/redes/secuencias/p02_06_08_antenas.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/ji4yGQ29CRQ>`__
ca: `2.6.8. Antenes i beneficis. <https://www.aulaclic.es/redes/secuences/p02_06_08_antennas.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/ji4ygq29crq>`__

source: `2.6.9. Puentes inalámbricos. <https://www.aulaclic.es/redes/secuencias/p02_06_09_puentes.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/y6hNf9BnOkQ>`__
ca: `2.6.9. Ponts sense fils. <https://www.aulaclic.es/redes/secuences/p02_06_09_puentes.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/y6hnf9bnokq>`__

source: `2.6.10. MIMO. <https://www.aulaclic.es/redes/secuencias/p02_06_10_mimo.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/jB1ZG9-LVsw>`__
ca: `2.6.10. Mim. <https://www.aulaclic.es/redes/secuences/p02_06_10_mimo.htm> `__ `(YouTube). <https://www.youtube-nocookie.com/embed/jb1zg9-lvsw>`__

source: `2.6.11. Nuevos desarrollos. <https://www.aulaclic.es/redes/secuencias/p02_06_11_desarrollos.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/rTwpCeBQFfI>`__
ca: `2.6.11. Nous desenvolupaments. <https://www.aulaclic.es/redes/seciones/p02_06_11_developments.htm>`__ `(YouTube). <https://www.youtube-nocoakie.com/embed/rtwpcebqffi>`__

source: `2.7. Modulación, codificación, señales. <https://www.aulaclic.es/redes/secuencias/p02_07_modulacion.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/BmAxn8BligE>`__
ca: `2.7. Modulació, codificació, senyals. <https://www.aulaclic.es/redes/secuences/p02_07_modulation.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/bmaxn8blige>`__

source: 2.8. Transmisión Digital. Códigos.
ca: 2.8. Transmissió digital. Codis.

source: `2.8.1. Códigos de línea. <https://www.aulaclic.es/redes/secuencias/p02_08_01_linea.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/NuvmuCaI3hM>`__
ca: `2.8.1. Codis de línia. <https://www.aulaclic.es/redes/secuences/p02_08_01_linea.htm>`__ `(YouTube). <https://www.youtube-nocoakie.com/embed/nuvmucai3hm>`__

source: `2.8.2. Códigos de bloque. <https://www.aulaclic.es/redes/secuencias/p02_08_02_bloque.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/Ffv2wbo1Hbs>`__
ca: `2.8.2. Codis de bloqueig. <https://www.aulaclic.es/redes/secuences/p02_08_02_bloque.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/ffv2wbo1hbs>`__

source: `2.8.3. Códigos de multinivel. <https://www.aulaclic.es/redes/secuencias/p02_08_03_multinivel.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/PMAwifK-y-4>`__
ca: `2.8.3. Codis multinivell. <https://www.aulaclic.es/redes/secuences/p02_08_03_multinivel.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/pmawifk-y-4>`__

source: 2.9. Transmisión Digital. Modulación y ADSL
ca: 2.9. Transmissió digital. Modulació i ADSL

source: `2.9.1. Modulación, constelaciones. <https://www.aulaclic.es/redes/secuencias/p02_09_01_analogica_modulacion.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/e2ZRg0jnnZc>`__
ca: `2.9.1. Modulació, constel·lacions. <https://www.aulaclic.es/redes/secuences/p02_09_01_analogica_modulation.htm> `__ `(YouTube). <https://www.youtube-nocoakie.com/embed/e2zrg0jnnzc>`__ __

source: `2.9.2. Ley de Shannon. <https://www.aulaclic.es/redes/secuencias/p02_09_02_analogica_shannon.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/C-bOwlef9hA>`__
ca: `2.9.2. Dret de Shannon. <https://www.aulaclic.es/redes/secuences/p02_09_02_analogica_shannon.htm> `__ `(YouTube). <https://www.youtube-nocookie.com/embed/c-bowlef9ha>`__

source: `2.9.3. ADSL. <https://www.aulaclic.es/redes/secuencias/p02_09_03_analogica_adsl.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/DztiAAy2SeM>`__
ca: `2.9.3. ADSL. <https://www.aulaclic.es/redes/secuences/p02_09_03_analogica_adsl.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/dztiaay2sem>`__

source: `2.9.4. ADSL, ejemplo práctico. <https://www.aulaclic.es/redes/secuencias/p02_09_04_analogica_adsl_ejem.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/vdBPLgKj2FM>`__
ca: `2.9.4. ADSL, exemple pràctic. <https://www.aulaclic.es/redes/secuences/p02_09_04_analogica_adsl_ejem.htm> `__ `(YouTube). <https://www.youtube-nocoakie.com/embed/vdbplkj2fm>`__

source: Capa de enlace
ca: Capa d'enllaç

source: `3.1. Funciones de la capa de enlace. <https://www.aulaclic.es/redes/secuencias/p03_01_capa_enlace.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/y3A9QBJBbCM>`__
ca: `3.1. Funcions de capa d’enllaç. <https://www.aulaclic.es/redes/secuences/p03_01_capa_enlace.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/y3a9qbjbbcm>`__

source: `3.2. Delimitación de tramas. <https://www.aulaclic.es/redes/secuencias/p03_02_tramas.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/7L4GjIp_5j8>`__
ca: `3.2. Delimitació de la trama. <https://www.aulaclic.es/redes/secuences/p03_02_tramas.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/7l4gjip_5j8>`__
