Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/comm-curso-redes.po
Languages: ca

source: 3.3. Control de errores.
ca: 3.3. Control d'errors.

source: `3.3.1. Cómo se miden. <https://www.aulaclic.es/redes/secuencias/p03_03_01_errores_miden.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/za7A6oAp9E8>`__
ca: `3.3.1. Com es mesuren. <https://www.aulaclic.es/redes/secuences/p03_03_01_erores_miden.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/za7aap9e8>`__

source: `3.3.2. Códigos detectores. <https://www.aulaclic.es/redes/secuencias/p03_03_02_errores_detectores.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/7G1p2-VQEKQ>`__
ca: `3.3.2. Codis de detector. <https://www.aulaclic.es/redes/secuences/p03_03_02_erores_detertores.htm> `__ `(YouTube). <https://www.youtube-nocookie.com/embed/7g1p2-vqekq>`__ __

source: `3.3.3. Códigos correctores. <https://www.aulaclic.es/redes/secuencias/p03_03_03_errores_correctores.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/WSmmNvHPaKc>`__
ca: `3.3.3. Codis correctius. <https://www.aulaclic.es/redes/secuences/p03_03_03_erores_correctors.htm> `__ `(YouTube). <https://www.youtube-nocokie.com/embed/wsmmnvhpakc>`__

source: `3.3.4. Interleaving. <https://www.aulaclic.es/redes/secuencias/p03_03_04_errores_interleaving.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/l5YdadYnx2E>`__
ca: `3.3.4. Entrellaços. <https://www.aulaclic.es/redes/secuences/p03_03_04_erores_interleaving.htm> `__ `(YouTube). <https://www.youtube-nocoakie.com/embed/l5ydadynx2e>`__

source: `3.4. Definición de tiempos. <https://www.aulaclic.es/redes/secuencias/p03_04_tiempos.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/sOvNObL4VRU>`__
ca: `3.4. Definició de vegades. <https://www.aulaclic.es/redes/secuences/p03_04_tiempos.htm>`__ `(YouTube). <https://www.youtube-nocoakie.com/embed/sovnobl4vru>`__

source: `3.5. Modos de conmutación. <https://www.aulaclic.es/redes/secuencias/p03_05_conmutacion.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/r4PejLabNlo>`__
ca: `3.5. Modes de commutació. <https://www.aulaclic.es/redes/secuences/p03_05_conmutacion.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/r4pejlabnlo>`__

source: `3.6. Protocolos de nivel de enlace. <https://www.aulaclic.es/redes/secuencias/p03_06_protocolo_enlace.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/qHX1lKlwZ1o>`__
ca: `3.6. Protocols de nivell d’enllaç. <https://www.aulaclic.es/redes/secuences/p03_06_procol_enlace.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/qhx1lklwz1o>`__

source: `3.7. Protocolo PPP y redes SONET/SDH. <https://www.aulaclic.es/redes/secuencias/p03_07_protocolo_ppp.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/3dNzA1ssnEY>`__
ca: `3.7. Protocol PPP i xarxes SONT/SDH. <https://www.aulaclic.es/redes/seciones/p03_07_procol_pp.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/3dnza1ssney>`__

source: `4.1. Antecedentes. Red Aloha. <https://www.aulaclic.es/redes/secuencias/p04_01_aloha.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/KrZtNn6l2O0>`__
ca: `4.1. Fons. Red Aloha. <https://www.aulaclic.es/redes/secuences/p04_01_aloha.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/krztnn6l2o0>`__

source: `4.2. Origen de Ethernet. <https://www.aulaclic.es/redes/secuencias/p04_02_origen_ethernet.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/lbQD6FWkjNw>`__
ca: `4.2. Origen Ethernet. <https://www.aulaclic.es/redes/seciones/p04_02_origen_ethernet.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/lbqd6fwkjnw>`__

source: `4.3. El nivel de enlace en Ethernet. Formato de trama. <https://www.aulaclic.es/redes/secuencias/p04_03_01_trama_ethernet.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/FH5M4fCRNrE>`__
ca: `4.3. El nivell d’enllaç a Ethernet. Format de la trama. <https://www.aulaclic.es/redes/secuences/p04_03_01_trama_ethernet.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/fh5m4fcrnre>`__

source: `4.4. El nivel de enlace en Ethernet. Protocolo CSMA/CD. <https://www.aulaclic.es/redes/secuencias/p04_03_02_ethernet_csma.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/FH5M4fCRNrE>`__
ca: `4.4. El nivell d’enllaç a Ethernet. Protocol CSMA/CD. <https://www.aulaclic.es/redes/secuences/p04_03_02_ethernet_csma.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/fh5m4fcrnre>`__

source: `4.5. Estandarización. Diferencias Ethernet-IEEE 802.3. <https://www.aulaclic.es/redes/secuencias/p04_04_01_estandarizacion.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/jmumS3Mbc74>`__
ca: `4.5. Estandardització. Diferències Ethernet-IEEE 802.3. <https://www.aulaclic.es/redes/secuences/p04_04_01_estandarizacion.htm>`__` (YouTube). <https://www.youtube-nocokie.com/embed/jmums3mbc74>`__

source: `4.6. Estandarización. Desarrollos recientes. <https://www.aulaclic.es/redes/secuencias/p04_04_02_estandarizacion_recientes.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/CddpeDCStII>`__
ca: `4.6. Estandardització. Desenvolupaments recents. <https://www.aulaclic.es/redes/secuences/p04_04_02_estandarizacion_recientes.htm> `__ `(YouTube). <https://www.youtube-nocokie.com/embed/cddedcstii>`__

source: Puentes y Conmutadores
ca: Ponts i interruptors

source: 5.1. Puentes transparentes.
ca: 5.1. Ponts transparents.

source: `5.1.1. Puentes transparentes. Cómo funcionan. <https://www.aulaclic.es/redes/secuencias/p05_01_01_puentes_transparentes.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/XXGDw_Q-bbY>`__
ca: `5.1.1. Ponts transparents. Com funcionen. <https://www.aulaclic.es/redes/secuences/p05_01_01_puentes_transparentes.htm> `__ `(YouTube). <https://www.youtube-nocokie.com/embed/xxgdw_q-bby>`__

source: `5.1.2. Puentes transparentes. Aparición de los conmutadores. <https://www.aulaclic.es/redes/secuencias/p05_01_02_conmutadores.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/cM3Uxqzt1vk>`__
ca: `5.1.2. Ponts transparents. Aparició de commutadors. <https://www.aulaclic.es/redes/secuences/p05_01_02_conmutadores.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/cm3uxqzt1vk> `` ``

source: `5.2. Microsegmentación. Full Duplex. <https://www.aulaclic.es/redes/secuencias/p05_02_microsegmentacion.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/n9dL1cSGYFg>`__
ca: `5.2. MicroseMation. Dúplex complet. <https://www.aulaclic.es/redes/secuences/p05_02_microsementcion.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/n9dl1csgyfg>`__

source: `5.3. Ataques en conmutadores. <https://www.aulaclic.es/redes/secuencias/p05_03_ataques_conmutadores.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/Dm1qm-GWKFY>`__
ca: `5.3. Atacs en interruptors. <https://www.aulaclic.es/redes/secuences/p05_03_ataques_conmutadores.htm> `__ `(YouTube). <https://www.youtube-nocokie.com/embed/dm1qm-gwkfy>`__ __

source: 5.4. Bucles entre Puentes.
ca: 5.4. Bucles entre ponts.

source: `5.4.1. Spanning tree. Planteamiento del problema. <https://www.aulaclic.es/redes/secuencias/p05_04_01_spanningtree.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/WlRc7qVN4p4>`__
ca: `5.4.1. Arbre que abasta. Aproximació al problema. <https://www.aulaclic.es/redes/secuences/p05_04_01_spanningtree.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/wlrc7qvn4p4>`__

source: `5.4.2. Spanning tree. Solución. <https://www.aulaclic.es/redes/secuencias/p05_04_02_spanningtree_solucion.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/lcdY4DSDRC8>`__
ca: `5.4.2. Arbre que abasta. Solució. <https://www.aulaclic.es/redes/secuences/p05_04_02_spanningtree_solucion.htm> `__ `(YouTube). <https://www.youtube-nocokie.com/embed/lcdy4dsdrc8>`__

source: `5.4.3. Spanning tree. Protocolo. <https://www.aulaclic.es/redes/secuencias/p05_04_03_spanningtree_protocolo.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/t-6NDSwvh5E>`__
ca: `5.4.3. Arbre que abasta. Protocol. <https://www.aulaclic.es/redes/secuences/p05_04_03_spanningtree_protocol.htm> `__ `(YouTube). <https://www.youtube-nocokie.com/embed/t-6ndswvh5e>`__

source: `5.4.4. Spanning tree. Ataques. <https://www.aulaclic.es/redes/secuencias/p05_04_04_spanningtree_ataques.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/3K1MWQ1ZoeU>`__
ca: `5.4.4. Arbre que abasta. Atacs. <https://www.aulaclic.es/redes/secuences/p05_04_04_spanningtree_ataques.htm> `__ `(YouTube). <https://www.youtube-nocookie.com/embed/3k1mwq1zoeu>`__

source: `5.4.5. Demo Wireshark. <https://www.aulaclic.es/redes/secuencias/p05_04_05_demo_wireshark.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/nS13o7zcHBg>`__
ca: `5.4.5. Demo Wireshark. <https://www.aulaclic.es/redes/secuences/p05_04_05_demo_wireshark.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/ns13o7zchbg>`__

source: 5.5. Redes locales Virtuales (VLANs).
ca: 5.5. Xarxes locals virtuals (VLAN).

source: `5.5.1. Planteamiento del problema. <https://www.aulaclic.es/redes/secuencias/p05_05_01_vlan_planteamiento.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/EID4JyA9ewc>`__
ca: `5.5.1. Aproximació al problema. <https://www.aulaclic.es/redes/seciones/p05_01_vlan_plantation.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/eid4jya9ewc>`__

source: `5.5.2. Enlaces 'trunk'. <https://www.aulaclic.es/redes/secuencias/p05_05_02_vlan_trunk.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/QjT5MEC0f84>`__
ca: `5.5.2. Enllaços "Trunk". <https://www.aulaclic.es/redes/secuences/p05_05_02_vlan_trunk.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/qjt5mec0f84>`__

source: `5.5.3. Spanning tree. <https://www.aulaclic.es/redes/secuencias/p05_05_03_vlan_spanning_tree.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/ixmoiqjAxfg>`__
ca: `5.5.3. Spanning tree. <https://www.aulaclic.es/redes/secuences/p05_03_vlan_spanning_tree.htm>`__` (YouTube). <https://www.youtube-nocokie.com/embed/ixmoiqjaxfg>`__

source: `5.6. Conmutadores configurables y gestionables. <https://www.aulaclic.es/redes/secuencias/p05_04_conmutadores_configurables.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/wsr1iYbhXOs>`__
ca: `5.6. Interruptors configurables i manejables. <https://www.aulaclic.es/redes/secuences/p05_04_conmutadores_configurable.htm> `__ `(YouTube). <https://www.youtube-nocokie.com/embed/wsr1iybhxos>`__

source: Redes inalámbricas 802.11
ca: 802.11 Xarxes sense fils

source: `6.1. Redes 802.11. Topología y organización. Arquitectura. <https://www.aulaclic.es/redes/secuencias/p06_01_01_redes802_11_topologia.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/Y218eOMghEA>`__
ca: `6.1. 802.11 xarxes. Topologia i organització. Arquitectura. <https://www.aulaclic.es/redes/secuences/p06_01_01_redes802_11_topologia.htm> `__ `(YouTube). <https://www.youtube-nocokie.com/embed/y218eomghea>`__

source: `6.2. Redes 802.11. Topología y organización. Identificación. <https://www.aulaclic.es/redes/secuencias/p06_01_02_redes802_11_identificacion.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/B_ZlZ9L6p0o>`__
ca: `6.2. 802.11 xarxes. Topologia i organització. Id. <https://www.aulaclic.es/redes/secuences/p06_01_02_redes802_11_identificacion.htm> `__ `(YouTube). <https://www.youtube-nocokie.com/embed/b_zlz9l6p0o>`__ __

source: `6.3. Redes 802.11. Conectividad e itinerancia. <https://www.aulaclic.es/redes/secuencias/p06_02_redes802_11_conectividad.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/qRIjbA0Z5Ow>`__
ca: `6.3. 802.11 xarxes. Connectivitat i itinerància. <https://www.aulaclic.es/redes/secuences/p06_02_redes802_11_conectivity.htm> `__ `(YouTube). <https://www.youtube-nocoakie.com/embed/qrijba0z5ow>`__

source: `6.4. Redes 802.11. Formato de trama. <https://www.aulaclic.es/redes/secuencias/p06_03_redes802_11_trama.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/fjdhAOC7e4Q>`__
ca: `6.4. 802.11 xarxes. Format de la trama. <https://www.aulaclic.es/redes/secuences/p06_03_redes802_11_trama.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/fjdhaoc7e4q>`__

source: `6.5. Redes 802.11. Protocolo MAC. <https://www.aulaclic.es/redes/secuencias/p06_04_redes802_11_mac.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/l_hD7PtsUEA>`__
ca: `6.5. 802.11 xarxes. Protocol MAC. <https://www.aulaclic.es/redes/secuences/p06_04_redes802_11_mac.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/l_hd7ptsuea>`__

source: `6.6. Redes 802.11. Tipos de envíos. <https://www.aulaclic.es/redes/secuencias/p06_05_1_redes802_11_tipos.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/KXnhOOMMVl0>`__
ca: `6.6. 802.11 xarxes. Tipus d’enviaments. <https://www.aulaclic.es/redes/secuences/p06_05_1_redes802_11_tipos.htm> `__ `(YouTube). <https://www.youtube-nocokie.com/embed/kxnhoommvl0>`__

source: `6.7. Redes 802.11. Problema de la estación oculta. <https://www.aulaclic.es/redes/secuencias/p06_05_2_redes802_11_estacion.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/tEE_q_m0law>`__
ca: `6.7. 802.11 xarxes. Problema de l'estació amagada. <https://www.aulaclic.es/redes/secuences/p06_05_2_redes802_11_estacion.htm> `__ `(YouTube). <https://www.youtube-nocookie.com/embed/tee_q_m0law>`__

source: `6.8. Redes 802.11. Fragmentación/Agrupación. <https://www.aulaclic.es/redes/secuencias/p06_05_3_redes802_11_fragmentacion.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/4LTokFLSXTY>`__
ca: `6.8. 802.11 xarxes. Fragmentació/agrupació. <https://www.aulaclic.es/redes/secuences/p06_05_3_redes802_11_fragmentacion.htm> `__ `(YouTube). <https://www.youtube-nocokie.com/embed/4ltakflsxty>`__ __

source: `6.9. Redes 802.11. Rendimiento y compatibilidad. <https://www.aulaclic.es/redes/secuencias/p06_06_redes802_11.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/fFvvIWO3JcA>`__
ca: `6.9. 802.11 xarxes. Rendiment i compatibilitat. <https://www.aulaclic.es/redes/secuences/p06_06_redes802_11.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/ffvviwo3jca>`__

source: Routing
ca: Encaminador

source: `7.1. Perspectiva general de la segunda parte del curso. <https://www.aulaclic.es/redes/secuencias/p07_01_perspectiva.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/5FJ4u2m9w1g>`__
ca: `7.1. Perspectiva general de la segona part del curs. <https://www.aulaclic.es/redes/secuences/p07_01_perspectiva.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/5fj4u2m9w1g>`__

source: `7.2. Aspectos generales del nivel de red. <https://www.aulaclic.es/redes/secuencias/p07_02_nivel_red.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/Wj3aXjq1oaI>`__
ca: `7.2. Aspectes generals del nivell de xarxa. <https://www.aulaclic.es/redes/secuences/p07_02_nivel_red.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/wj3axq1oai>`__

source: `7.3 Tiempo de servicio. <https://www.aulaclic.es/redes/secuencias/p07_03_tiempo_servicio.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/Qr69MsqGdhM>`__
ca: `7.3 Hora del servei. <https://www.aulaclic.es/redes/secuences/p07_03_tiempo_servicio.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/qr69msqgdhm> `` `

source: `7.4. Algoritmos de routing. <https://www.aulaclic.es/redes/secuencias/p07_04_routing.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/19iCHRX5Fbs>`__
ca: `7.4. Algoritmes d’encaminament. <https://www.aulaclic.es/redes/secuences/p07_04_routing.htm>`__ `(YouTube). <https://www.youtube-nocoakie.com/embed/19ichrx5fbs>`__

source: `7.5. Routing estático basado en el flujo. <https://www.aulaclic.es/redes/secuencias/p07_05_routing_flujo.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/D3v4Q4RUMpU>`__
ca: `7.5. Enrutament estàtic basat en el flux. <https://www.aulaclic.es/redes/secuences/p07_05_routing_flux.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/d3v4q4rumpu>`__

source: `7.6. Routing dinámico basado en vector distancia. <https://www.aulaclic.es/redes/secuencias/p07_06_routing_distancia.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/gMyEB9_eKwg>`__
ca: `7.6. Enrutament dinàmic basat en el vector de distància. <https://www.aulaclic.es/redes/secuences/p07_06_routing_distance.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/gmyeb9_ekwg>`__

source: Protocolo de Internet (IP)
ca: Protocol d'Internet (IP)

source: `8.1. Introducción a Internet. <https://www.aulaclic.es/redes/secuencias/p08_01_introduccion_internet.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/pib6cwFl8SY>`__
ca: `8.1. Introducció a Internet. <https://www.aulaclic.es/redes/seciones/p08_01_introduction_internet.htm> `__ `(YouTube). <https://www.youtube-nocookie.com/embed/pib6cwfl8sy>`__

source: `8.2. La cabecera IP. <https://www.aulaclic.es/redes/secuencias/p08_02_cabecera_ip.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/twfTrXFCQYc>`__
ca: `8.2. L’encapçalament IP. <https://www.aulaclic.es/redes/seciones/p08_02_cabecera_ip.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/twftrxfcqyc>`__

source: `8.3. La cabecera (II) y sus opciones. <https://www.aulaclic.es/redes/secuencias/p08_03_cabecera_ip_opciones.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/y1TIIOv5Tc0>`__
ca: `8.3. La capçalera (II) i les seves opcions. <https://www.aulaclic.es/redes/secuences/p08_03_cabecera_ip_options.htm> `__ `(YouTube). <https://www.youtube-nocokie.com/embed/y1tiiov5tc0>`__

source: `8.4. Direcciones IP y enrutamiento en un host. <https://www.aulaclic.es/redes/secuencias/p08_04_direcciones_ip.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/ywJprEn_c0U>`__
ca: `8.4. Adreces IP i encaminament en un amfitrió. <https://www.aulaclic.es/redes/secuences/p08_04_direcciones_ip.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/ywjpren_c0u>`__

source: `8.5. Organización de las direcciones en Internet. <https://www.aulaclic.es/redes/secuencias/p08_05_organizacion_direcciones_ip.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/OzzHkGPVuSc>`__
ca: `8.5. Organització d’adreces d’Internet. <https://www.aulaclic.es/redes/secuences/p08_05_organization_direcciones_ip.htm> `__ `(YouTube). <https://www.youtube-nocokie.com/embed/ozzhkgpvusc>`__ __

source: `8.6. Enrutamiento básico. <https://www.aulaclic.es/redes/secuencias/p08_06_enrutamiento_basico.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/b5KvxuMBNxM>`__
ca: `8.6. Enrutament bàsic. <https://www.aulaclic.es/redes/secuences/p08_06_enrutamiento_basico.htm> `__ `(YouTube). <https://www.youtube-nocokie.com/embed/b5kvxumbnxm>`__ __

source: `8.7. Tabla de rutas. <https://www.aulaclic.es/redes/secuencias/p08_07_tabla_rutas.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/1p96ivgDM5c>`__
ca: `8.7. Taula de ruta. <https://www.aulaclic.es/redes/secuences/p08_07_tabla_rutas.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/1p96ivgdm5c>`__

source: `8.8. Hosts multihomed y líneas serie. <https://www.aulaclic.es/redes/secuencias/p08_08_host_multihomed.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/kSJ6CgVaG50>`__
ca: `8.8. Amfitrions multihomes i línies de sèrie. <https://www.aulaclic.es/redes/secuences/p08_08_host_multihhomed.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/ksj6cgvag50>`__

source: `8.9. Direcciones especiales. <https://www.aulaclic.es/redes/secuencias/p08_09_direcciones_especiales.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/BHZ8AAKuKE0>`__
ca: `8.9. Adreces especials. <https://www.aulaclic.es/redes/secuences/p08_09_direcciones_especial.htm> `__ `(YouTube). <https://www.youtube-nocokie.com/embed/bhz8aakuke0>`__ __

source: `8.10. Subredes y máscaras. <https://www.aulaclic.es/redes/secuencias/p08_10_subredes_mascaras.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/nRjIwd9YAL8>`__
ca: `8.10. Subxarxes i màscares. <https://www.aulaclic.es/redes/secuences/p08_10_subes_mases.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/nrjiwd9yal8>`__

source: `8.11. Ruta por defecto, rutas host. <https://www.aulaclic.es/redes/secuencias/p08_11_rutas_host.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/NE5dSS04SIA>`__
ca: `8.11. Ruta predeterminada, rutes d'amfitrió. <https://www.aulaclic.es/redes/secuences/p08_11_rutas_host.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/ne5dss04Sia>`__

source: `8.12. Orden de enrutamiento, tabla de rutas. <https://www.aulaclic.es/redes/secuencias/p08_12_orden_enrutamiento.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/DCu6Wv_n8HQ>`__
ca: `8.12. Ordre d’encaminament, taula de ruta. <https://www.aulaclic.es/redes/secuences/p08_12_orden_enrutamiento.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/dcu6wv_n8hq>`__

source: `8.13. Enrutamiento jerárquico. <https://www.aulaclic.es/redes/secuencias/p08_13_enrutamiento_jeraquico.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/nhi3aPmMeBA>`__
ca: `8.13. Enrutament jeràrquic. <https://www.aulaclic.es/redes/seciones/p08_13_enrutación_jeraquico.htm> `__ `(YouTube). <https://www.youtube-nocookie.com/embed/nhi3apmmeba>`__

source: `8.14. Envíos broadcast. <https://www.aulaclic.es/redes/secuencias/p08_14_envios_broadcast.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/IPk_8WD-bRM>`__
ca: `8.14. Enviaments emesos. <https://www.aulaclic.es/redes/secuences/p08_14_envios_broadcast.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/ipk_8wd-brm>`__

source: `8.15. Ejercicios. <https://www.aulaclic.es/redes/secuencias/p08_15_ejercicios.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/ENWMLDZpI5I>`__
ca: `8.15. Exercicis. <https://www.aulaclic.es/redes/secuences/p08_15_ejercicios.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/enwmldzpi5i>`__

source: `8.16. Direcciones. <https://www.aulaclic.es/redes/secuencias/p08_16_direcciones.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/8TlL4JlJdDA>`__
ca: `8.16. Adreces <https://www.aulaclic.es/redes/secuences/p08_16_direcciones.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/8tll4jljdda>`__

source: `8.17. ICMP. <https://www.aulaclic.es/redes/secuencias/p08_17_icmp.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/VRUq1OwqjQ4>`__
ca: `8.17. Icmp <https://www.aulaclic.es/redes/secuences/p08_17_icmp.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/vruq1owqjq4>`__

source: `8.18. ARP básico. <https://www.aulaclic.es/redes/secuencias/p08_18_arp.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/98Igov-JmVI>`__
ca: `8.18. ARP bàsic. <https://www.aulaclic.es/redes/secuences/p08_18_arp.htm> `__ `(YouTube). <https://www.youtube-nocokie.com/embed/98igov-jmvi>`__

source: `8.19. ARP avanzado. <https://www.aulaclic.es/redes/secuencias/p08_19_arp_avanzado.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/lNfb-S9Qndo>`__
ca: `8.19. ARP avançat. <https://www.aulaclic.es/redes/secuences/p08_19_arp_avanzado.htm>`__ `(YouTube). <https://www.youtube-nocokie.com/embed/lnfb-s9qondo>`__

source: `8.20. La lógica de encaminamiento de un paquete. <https://www.aulaclic.es/redes/secuencias/p08_20_encaminamiento.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/ha_VqXy4_KM>`__
ca: `8.20. La lògica d’un paquet d’un paquet. <https://www.aulaclic.es/redes/seciones/p08_20_encamination.htm>`__ `(YouTube). <https://www.youtube-nocoakie.com/embed/ha_vqxy4_km>`__

source: `8.21. Alimento para la mente. Ejercicios. <https://www.aulaclic.es/redes/secuencias/p08_21_alimento.htm>`__ `(YouTube). <https://www.youtube-nocookie.com/embed/6umpYumltCk>`__
ca: `8.21. Menjar per a la ment. Exercicis. <https://www.aulaclic.es/redes/secuences/p08_21_alimento.htm>`__ `(YouTube). <https://www.youtube-nocoakie.com/embed/6umpyumltck>`__
