Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/control-recursos.po
Languages: ca

source: Recursos para control y robótica
ca: Recursos per al control i la robòtica

source: Robótica con Microbit
ca: Robòtica amb microbit

source: Curso de robótica para 1ºESO de la Junta de Andalucía con la placa micro:bit en 7 sencillas lecciones y con licencia CC BY-NC-SA 4.0.
ca: Curs de robòtica per a la 1a Junta de Andalucía amb la Micro Plate: Bit en 7 lliçons simples i amb llicència CC BY-C-SA 4.0.

source: Curso `Nuestra placa robótica se comunica con el mundo <https://edea.juntadeandalucia.es/bancorecursos/file/0d1266b3-f173-4ae8-aada-2fbffea186de/1/nuestra_placa_robotica_se_comunica_con_el_mundo.zip/index.html>`__
ca: `` La nostra placa robòtica es comunica amb el món <https: /eedea.junteandalucia.es/bancorecities/file/0d1266b3-f173-4ae8-aada-2fbffea186de/1/nuestra_plapla_botica_se_comunica_con_el_mundo.zip/index.html> `` __

source: Recursos relacionados
ca: Recursos relacionats

source: `Placa micro:bit <https://es.wikipedia.org/wiki/Micro_Bit>`__
ca: `Micro Plate: Bit <https://es.wikipedia.org/wiki/micro_bit>`__

source: `Microsoft Makecode for micro:bit <https://makecode.microbit.org/>`__
ca: `Microsoft Makecode per a micro: bit <https://makecode.microbit.org/>`__

source: Encuentro sobre educación en robótica
ca: Reunió sobre l'educació de la robòtica

source: V Encuentro EDUCACIÓN 3.0 'Robótica y programación en el aula: todas las claves'. Con la participación de editorial Edelvives, BQ Educación, y profesores de la materia.
ca: V Educació 3.0 'Robòtica i programació a l'aula: totes les claus'. Amb la participació de l’editorial d’Edvisvés, l’educació BQ i els professors del tema.

source: Vídeo: `V Encuentro EDUCACIÓN 3.0 <https://www.youtube-nocookie.com/embed/fnMC1I7tCqA>`__
ca: Vídeo: `V Educació Educació 3.0 <https://www.youtube-nocoakie.com/embed/fnmc1i7tcqa>`__
