Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/control-sensor-ultrasonic.po
Languages: ca

source: Sensor de distancia por ultrasonidos
ca: Sensor de distància d’ecografia

source: Objetivos
ca: Els pendents

source: Comprender el funcionamiento del sensor de distancia por ultrasonidos.
ca: Comprendre el funcionament del sensor de distància d’ecografia.

source: Medir distancias con un sensor de distancia por ultrasonidos.
ca: Mesureu les distàncies amb un sensor de distància d’ecografia.

source: El sensor de ultrasonidos
ca: El sensor d’ecografia

source: Este sensor tiene un pequeño altavoz que emite un pitido y un micrófono sensor que detecta el pitido emitido. El dispositivo calcula el tiempo que el sonido tarda en ir hasta un objeto y volver reflejado. La distancia desde el sensor hasta el objeto se calcula a partir de la velocidad del sonido en el aire y del tiempo que tarda el sonido en recorrer esa distancia.
ca: Aquest sensor té un altaveu petit que emet un pit i un micròfon del sensor que detecta el pit emès. El dispositiu calcula el temps que el so triga a anar a un objecte i tornar reflectit. La distància del sensor a l’objecte es calcula a partir de la velocitat del so a l’aire i el temps que triga a recórrer aquesta distància.

source: El pitido emitido tiene una frecuencia de 40kHz. Esta frecuencia se encuentra muy por encima de 20kHz, que es la máxima frecuencia que los humanos pueden percibir. Por esta razón a este sonido de elevada frecuencia se le denomina ultrasonido.
ca: El biscat emès té una freqüència de 40 kHz. Aquesta freqüència està molt per sobre dels 20 kHz, que és la freqüència màxima que els humans poden percebre. Per aquest motiu, aquest so d’alta freqüència s’anomena ultrasons.

source: Existen varios modelos de sensor en el mercado, los más conocidos y asequibles son el modelo SR04 y la versión más avanzada SRF05. En este tutorial se explica el modelo SR04. La explicación es válida para modelos más avanzados, teniendo en cuenta que estos tienen mayor capacidad o características añadidas.
ca: Hi ha diversos models de sensors al mercat, els més coneguts i assequibles són el model SR04 i la versió més avançada SRF05. Aquest tutorial explica el model SR04. L’explicació és vàlida per a models més avançats, tenint en compte que tenen una capacitat més gran o característiques afegides.

source: Características del sensor SR04
ca: Característiques del sensor SR04

source: Este sensor de ultrasonidos tiene las siguientes características:
ca: Aquest sensor d’ecografia té les següents característiques:

source: Distancia de detección: 2cm - 400cm
ca: Distància de detecció: 2cm - 400cm

source: Resolución: 0,3cm
ca: Resolució: 0,3cm

source: Frecuencia de sonido: 40kHz
ca: Freqüència de so: 40kHz

source: Ángulo eficaz: 15º
ca: Angle efectiu: 15º

source: Tensión de alimentación: 5V
ca: Tensió alimentària: 5V

source: Consumo de corriente: 15mA
ca: Consum actual: 15

source: Librería para sensores de ultrasonidos
ca: Biblioteca per a sensors d’ecografia

source: Para manejar los sensores de ultrasonidos existen varias librerías de trabajo. La librería estándar más precisa que se puede utilizar es `NewPing <https://playground.arduino.cc/Code/NewPing>`__. Para instalar la librería hay que seguir los siguientes pasos:
ca: Per gestionar els sensors d’ecografia, hi ha diverses biblioteques de treball. La llibreria estàndard més precisa que es pot utilitzar és `newping <https://playground.arduino.cc/code/newping>`__. Per instal·lar la llibreria, heu de seguir els passos següents:

source: Descargar la librería
ca: Descarregueu la llibreria

source: Guardar el fichero NewPing_v1.9.4.zip en el ordenador
ca: Deseu el fitxer newPing_v1.9.4.zip a l'ordinador

source: Abrir el entorno gráfico de Arduino
ca: Obrir l’entorn gràfic d’Arduino

source: En la pestaña Sketch.. Importar librería.. pinchar 'Add Library...'
ca: A la pestanya Sketch .. Importa la llibreria .. Feu clic a "Afegeix la biblioteca ..."

source: Buscar el fichero descargado y después de seleccionarle, pulsar 'Abrir'
ca: Cerqueu el fitxer descarregat i després de seleccionar -lo, premeu "Obriu"

source: Comprobar que en la pestaña Sketch.. Importar librería.. aparece una nueva librería llamada NewPing
ca: Comproveu -ho a la pestanya Sketch .. Importa biblioteca .. apareix una nova llibreria anomenada Newping

source: Con estos pasos la librería estará correctamente instalada.
ca: Amb aquests passos, la llibreria s’instal·larà correctament.

source: Medición de distancias
ca: Mesura de distàncies

source: Para medir distancias con el sensor SR04 se seguirán los siguientes pasos:
ca: Per mesurar les distàncies amb el sensor SR04, es seguiran els passos següents:

source: Conectar el sensor SR04 a la placa Arduino según el siguiente esquema:
ca: Connecteu el sensor SR04 a la placa Arduino segons el següent esquema:

source: Copiar el siguiente programa, compilarlo y descargarlo en la placa Arduino.
ca: Copieu el programa següent, compileu -lo i descarregueu -lo a la placa Arduino.

source: Abrir el monitor serie (Monitor Serial) pulsando el icono que aparece arriba a la derecha en el entorno gráfico de Arduino.
ca: Obriu el monitor de la sèrie (monitor en sèrie) prement la icona que apareix a la dreta a l’entorn gràfic d’Arduino.

source: En la nueva ventana que aparece, escoger la velocidad de transmisión en el recuadro que aparece abajo a la derecha. En este caso, la velocidad programada es de 115200 baudios.
ca: A la nova finestra que apareix, trieu la velocitat de transmissió del quadre que apareix a la dreta. En aquest cas, la velocitat programada és de 115200 Baud.

source: El cuadro debe mostrar continuamente la información de tiempo y distancia.
ca: La imatge ha de mostrar contínuament informació de temps i distància.

source: En este momento, si todo ha ido bien, Arduino estará midiendo continuamente la distancia entre el sensor y los objetos que se coloquen delante de él. Esta distancia se envía al ordenador mediante el puerto serie (por el cable USB) para visualizarlo en pantalla.
ca: En aquest moment, si tot ha anat bé, Arduino mesurarà contínuament la distància entre el sensor i els objectes que es col·loquen davant seu. Aquesta distància s’envia a l’ordinador mitjançant el port sèrie (pel cable USB) per mostrar -lo a la pantalla.

source: Ajuste del sensor
ca: Ajust del sensor

source: El ajuste del sensor permite que las mediciones sean más exactas. Para conseguir ajustar el sensor es necesario corregir múltiples parámetros que pueden influir en la medida. La velocidad del sonido en el aire, la presión atmosférica, la velocidad del cronómetro interno del sensor, etc. Para evitar la complejidad de ajustar uno por uno todos estos parámetros, se va a realizar un ajuste denominado ajuste de dos puntos.
ca: L’ajustament del sensor permet que les mesures siguin més exactes. Per ajustar el sensor és necessari corregir diversos paràmetres que puguin influir en l'extensió. La velocitat del so a l’aire, la pressió atmosfèrica, la velocitat del cronòmetre intern del sensor, etc. Per evitar la complexitat d’ajustar -ne un per un tots aquests paràmetres, es farà un ajust anomenat dos punts.

source: Primero se debe realizar una medida a una distancia conocida, cercana al sensor. Después se debe realizar otra medición a una distancia conocida, más lejana al sensor.
ca: En primer lloc, s’ha de fer una mesura a una distància coneguda, a prop del sensor. Aleshores s’ha de fer una altra mesura a una distància coneguda, més lluny del sensor.

source: La primera medición puede corregir lo que se denomina ajuste de cero. La segunda medida sirve para realizar el ajuste de rampa. Las medidas se deben introducir en una tabla como la siguiente:
ca: La primera mesura pot corregir el que s’anomena ajust zero. La segona mesura serveix per ajustar la rampa. Les mesures s’han d’introduir en una taula com les següents:

source: Tabla 1.
ca: Taula 1.

source: Medida
ca: Extensió

source: Tiempo
ca: Temps

source: Distancia
ca: Distància

source: Medida 1
ca: Mesureu 1

source: Medida 2
ca: Mesura 2

source: 1123 us
ca: 1123 EUA

source: A partir de esta tabla, se puede realizar un mejor ajuste de la medida con la orden `map() <https://www.arduino.cc/reference/en/language/functions/math/map/>`__ de Arduino:
ca: Des d'aquesta taula, podeu fer un millor ajustament de la mesura amb l'ordre `map () <https://www.arduino.cc/reference/en/language/funcals/math/map/>` `` d'Arduino:

source: distance = map(microseconds, 247, 1123, 50, 200);
ca: Distància = mapa (microsegons, 247, 1123, 50, 200);

source: El primer argumento es la medición de tiempo realizada por el sensor. Los dos siguientes argumentos son los tiempos de rebote al objeto cercano y lejano. Los dos siguientes argumentos son las distancias del objeto cercano y lejano.
ca: El primer argument és la mesura del temps del sensor. Els dos següents arguments són els temps de rebot a l'objecte proper i llunyà. Els dos següents arguments són les distàncies de l'objecte proper i llunyà.

source: El programa modificado es el siguiente.
ca: El programa modificat és el següent.

source: Ejercicios
ca: Exercicis

source: Realizar las mediciones para ajuste de dos puntos con un sensor concreto. Modificar el :ref:`programa anterior <ultrasonic-prog2>` para conseguir que el sensor devuelva medidas exactas con mediciones propias.
ca: Realitzeu mesures per a l’ajust de dos punts amb un sensor específic. Modifiqueu: Ref: `Programa anterior <Plentífer-Prog2>` Per aconseguir que el sensor torni mesures exactes amb mesures pròpies.

source: Cada sensor dará unos valores diferentes para los 4 números de la tabla 1, dependiendo de la altitud a la que nos encontremos, la temperatura y otros parámetros del sensor.
ca: Cada sensor donarà diferents valors per als 4 números de la taula 1, depenent de l’altitud a la qual ens trobem, la temperatura i altres paràmetres del sensor.

source: Mostrar la distancia medida en el display de 7 segmentos con el siguiente programa.
ca: Mostra la distància mesurada a la pantalla 7 -segment amb el programa següent.

source: Encender una barra de ledes que represente la distancia de un objeto al sensor de ultrasonidos. Completar el programa para que la barra ocupe 6 ledes.
ca: Enceneu una barra LEDES que representa la distància d’un objecte al sensor d’ultrasons. Completeu el programa per a la barra ocupada 6 LED.
