Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/control-pid-digital.po
Languages: ca

source: El ruido de cuantificación afecta negativamente a la respuesta del regulador, produciendo saltos en la señal de control que empeoran el comportamiento de la planta.
ca: El soroll de quantificació afecta negativament la resposta del regulador, produint salts en el senyal de control que empitjora el comportament de les plantes.

source: Este ruido también afecta a la máxima precisión que puede conseguir el controlador. En el ejemplo anterior, el controlador no podrá conseguir controlar la temperatura con una precisión mejor de 0,49 grados centígrados.
ca: Aquest soroll també afecta la precisió màxima que pot obtenir el controlador. En l'exemple anterior, el controlador no podrà controlar la temperatura amb una millor precisió de 0,49 graus centígrads.

source: Referencias
ca: Referències

source: [1] Ogata, Katsuhiko. Sistemas de control en tiempo discreto. Segunda edición. Editorial Prentice Hall.
ca: [1] Ogata, Katsuhiko. Sistemes de control de temps discrets. Segona edició. Saló de Prentice Editorial.
