Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/contacto.po
Languages: ca

source: Contacto
ca: Contacte

source: Mi nombre es Carlos Pardo y soy profesor de Tecnología en Educación Secundaria de Madrid.
ca: Em dic Carlos Pardo i sóc professor de tecnologia en educació secundària de Madrid.

source: Correo de contacto:
ca: Correu electrònic de contacte:

source: Grupo de Telegram:
ca: Grup de telegrama:

source: Puedes utilizar los medios de contacto anteriores para comunicar conmigo y:
ca: Podeu utilitzar els mitjans de contacte anteriors per comunicar -me amb mi i:

source: Preguntar dudas sobre la página web.
ca: Pregunteu dubtes sobre el lloc web.

source: Agradecer el contenido.
ca: Gràcies al contingut.

source: Informar de errores.
ca: Informar els errors.

source: Proponer cambios o mejoras.
ca: Proposar canvis o millores.

source: Colaborar con traducciones.
ca: Col·labora amb traduccions.
