Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/control-sensor-dht11.po
Languages: ca

source: Sensor de temperatura y humedad DHT11
ca: Sensor de temperatura i humitat DHT11

source: El sensor DHT11 es un sensor digital de temperatura y humedad relativa del aire. Utiliza una comunicación digital con Arduino, de forma que no es necesaria la conexión a un pin analógico para realizar las lecturas.
ca: El sensor DHT11 és un sensor de temperatura digital i una humitat relativa de l’aire. Utilitzeu la comunicació digital amb Arduino, de manera que no és necessària aquesta connexió a un passador analògic per fer les lectures.

source: Especificaciones técnicas
ca: Especificacions tècniques

source: Tensión de alimentación de 3 a 5 voltios
ca: Tensió d'alimentació de 3 a 5 volts

source: Corriente máxima de alimentación 2,5 mA
ca: Corrent màxim d’alimentació 2,5 mA

source: Rango de humedad relativa 20% a 80% con 5% de exactitud
ca: La humitat relativa oscil·la entre un 20% i un 80% amb un 5% de precisió

source: Rango de temperatura de 0 a 50ºC con +-2ºC de exactitud
ca: La temperatura oscil·la entre 0 i 50 ºC amb una precisió de +2 ºC

source: Velocidad de 1 medida por segundo
ca: 1 mesura per segon

source: Tamaño 15,5mm x 12mm x 5,5mm
ca: Mida 15,5 mm x 12mm x 5,5 mm

source: Conexión de 4 pines
ca: Connexió de 4 -Pin

source: `DHT11. Hoja de características. D-Robotics. <../_static/document/DHT11-drobotics.pdf>`__
ca: `DHT11. Full de característiques. D-Robletics. <../_ static/document/dht11-drobotics.pdf>`__

source: Librería Arduino
ca: Biblioteca Arduino

source: `Librería Arduino para el sensor DHT11. Versión 0.4.1 <../_static/downloads/dht11-041.zip>`__
ca: `Biblioteca Arduino per al sensor DHT11. Versió 0.4.1 <../_ static/descàrregues/dht11-041.zip>`__

source: Esquema de conexión
ca: Esquema de connexió

source: Ejercicios
ca: Exercicis

source: El siguiente programa envía por el puerto serie la humedad relativa y la temperatura medida por el sensor DHT11.
ca: El programa següent envia la humitat relativa i la temperatura mesurada pel sensor DHT11.

source: Carga el programa en Arduino y muestra los valores por el monitor serie.
ca: Carregueu el programa a Arduino i mostra els valors del monitor de la sèrie.

source: Modifica el programa anterior para que muestre en el display la medición de temperatura.
ca: Modifiqueu el programa anterior per mostrar la mesura de la temperatura a la pantalla.

source: Modifica el programa anterior para que se encienda un led rojo en caso de superar la temperatura ambiental en 2 grados centígrados.
ca: Modifiqueu el programa anterior per activar un LED vermell en cas de superar la temperatura ambient en 2 graus centígrads.

source: Comprueba el funcionamiento correcto calentando el sensor. El led rojo debe mantenerse encendido aunque la temperatura vuelva a bajar.
ca: Comproveu el funcionament correcte escalfant el sensor. El LED vermell s’ha de mantenir en marxa fins i tot si la temperatura baixa de nou.

source: Modifica el programa anterior para que suene un zumbador cuando la temperatura sea alta. El zumbador sonará durante unas décimas de segundo cada segundo. Las instrucciones a utilizar son las siguientes:
ca: Modifiqueu el programa anterior per sonar un sonor quan la temperatura és alta. El timbre sonarà durant unes dècimes cada segon. Les instruccions que s'han d'utilitzar són les següents:

source: El zumbador dejará de sonar cuando la temperatura vuelva a bajar. Comprueba el funcionamiento correcto calentando el sensor.
ca: El timbre deixarà de sonar quan la temperatura caigui de nou. Comproveu el funcionament correcte escalfant el sensor.

source: Modifica el programa anterior para que se encienda un led azul mientras la medida de temperatura se mantenga baja.
ca: Modifiqueu el programa anterior per a un LED blau que s’encengui mentre la mesura de la temperatura es manté baixa.

source: El led azul se apagará en caso de que la temperatura medida supere la temperatura ambiental actual más un grado.
ca: El LED blau s’apagarà en cas que la temperatura mesurada superi la temperatura ambient actual més un grau.
