Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/control-actuator-dcmotor.po
Languages: ca

source: Motor de corriente continua
ca: Motor de corrent continu

source: Este tipo de motor es muy popular por ser barato y fácil de controlar.
ca: Aquest tipus de motor és molt popular per ser barat i fàcil de controlar.

source: Estator
ca: Estador

source: Colector
ca: Col·lectiu

source: Modelo del motor de corriente continua
ca: Model de motor de corrent continu

source: Modelo equivalente simplificado
ca: Model equivalent simplificat

source: El modelo eléctrico de un motor de corriente continua R + V
ca: El model elèctric d’un motor de corrent directe R + V

source: Modelo equivalente con rozamiento
ca: Equivalent a la fricció

source: Modelo equivalente en régimen transitorio
ca: Model equivalent en règim de transició

source: Modelo completo
ca: Model complet

source: Ensayos del motor de corriente continua
ca: Proves de motor de corrent continu

source: Resistencia interna
ca: Resistència interna

source: Conversión tensión/velocidad angular
ca: Conversió de velocitat de tensió/angular

source: Rozamiento estático
ca: Fricció estàtica

source: Rozamiento dinámico
ca: Fricció dinàmica

source: Inductancia eléctrica
ca: Inductància elèctrica

source: Inercia
ca: Inèrcia
