Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/css-padding-border.po
Languages: ca

source: Padding y border
ca: Rado i frontera

source: La caja donde se encuentra el contenido (texto o imágenes) puede tener un borde, un margen hasta el borde llamado padding y un margen con los demás elementos llamado margin.
ca: El quadre on es troba el contingut (text o imatges) pot tenir un avantatge, un marge fins a la vora anomenat encoixinat i un marge amb els altres elements anomenats marge.

source: En la siguiente figura se puede ver cada uno de estos parámetros.
ca: A la figura següent podeu veure cadascun d’aquests paràmetres.

source: En este ejercicio se modificarán los parámetros de padding y border de diferentes párrafos.
ca: En aquest exercici, es modificaran els paràmetres de rellotge i frontera de diferents paràgrafs.

source: Referencias.
ca: Referències

source: `CSS Box model <https://www.w3schools.com/css/css_boxmodel.asp>`__
ca: `Model CSS Box <https://www.w3schools.com/css/css_boxmodel.asp>`__

source: `CSS Padding <https://www.w3schools.com/css/css_padding.asp>`__
ca: `Padding CSS <https://www.w3schools.com/css/css_padding.asp>`__

source: `CSS Border Width <https://www.w3schools.com/css/css_border_width.asp>`__
ca: `CSS Amplada de la frontera <https://www.w3schools.com/css/css_border_width.asp>`__

source: `CSS Rounded Borders <https://www.w3schools.com/css/css_border_rounded.asp>`__
ca: `CSS Bordes arrodonides <https://www.w3schools.com/css/css_border_roused.asp>`__

source: Ejercicio
ca: Exercir

source: Fichero **css-padding-border.html**
ca: Fitxer ** CSS-Padding-Border.html **

source: Fichero **css-padding-border.css**
ca: Fitxer ** CSS-Padding-Border.CSS **

source: Resultado
ca: Resultat
