Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/css-file.po
Languages: ca

source: Ficheros CSS
ca: Fitxers CSS

source: La mayoría de las páginas web utilizan un fichero separado para los estilos. Esto permite que varios documentos HTML puedan tener la misma hoja de estilo CSS. De esta manera las diferentes páginas tendrán una presentación semejante. Además, en el momento que se quiera cambiar un estilo, solo será necesario hacerlo en un fichero CSS y todos los documentos HTML que dependen de este fichero cambiarán a la vez.
ca: La majoria de les pàgines web utilitzen un fitxer separat per a estils. Això permet que diversos documents HTML tinguin el mateix full d’estil CSS. D’aquesta manera, les diferents pàgines tindran una presentació similar. A més, en el moment en què voleu canviar un estil, només caldrà fer -ho en un fitxer CSS i tots els documents HTML que depenen d’aquest fitxer canviaran alhora.

source: En este ejercicio se separará la hoja de estilo CSS del fichero HTML. Para vincular las dos hojas se utiliza la etiqueta <link>.
ca: En aquest exercici es separarà el full d’estil CSS del fitxer HTML. Per enllaçar les dues fulles s’utilitza l’etiqueta <link>.

source: Etiquetas utilizadas
ca: Etiquetes utilitzades

source: Link a hoja de estilo css:
ca: Enllaç de fulla d'estil CSS:

source: Hay que sustituir file.css por la hoja de estilo que se quiera utilizar.
ca: Heu de substituir FILE.CSS pel full d’estil que voleu utilitzar.

source: Ejercicio
ca: Exercir

source: Fichero **css-file.html**
ca: Fitxer ** CSS-File.html **

source: Fichero **css-file.css**
ca: Fitxer ** CSS-File.CSS **

source: Resultado
ca: Resultat
