Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/css-recursos.po
Languages: ca

source: Recursos para CSS
ca: Recursos per a CSS

source: Página web con estilo práctico y directo. Tiene muchos ejemplos.
ca: Lloc web amb estil pràctic i directe. Té molts exemples.

source: `Tutorial de CSS en w3schools <https://www.w3schools.com/css/default.asp>`__
ca: `Tutorial CSS a W3Schools <https://www.w3schools.com/css/default.asp>`__

source: `Referencia de CSS <https://www.w3schools.com/cssref/default.asp>`__
ca: `CSS Referència <https://www.w3schools.com/cssref/default.asp>`__

source: `Ejemplos de CSS <https://www.w3schools.com/css/css_examples.asp>`__
ca: "Exemples de CSS <https://www.w3schools.com/css/css_examples.asp>`__

source: Web Style Guide
ca: Guia d'estil web

source: Guía muy completa para el diseño de páginas web. Abarca todos los temas importantes desde la estructura del sitio web, el diseño del interfaz o la tipografía hasta el estilo editorial.
ca: Guia molt completa per al disseny de pàgines web. Cobreix tots els problemes importants des de l'estructura del lloc web, el disseny de la interfície o la tipografia fins a l'estil editorial.

source: La última versión se distribuye con licencia CC BY.
ca: La versió més recent es distribueix amb la llicència CC per.

source: `Web Style Guide 3rd edition <https://webstyleguide.com/wsg3/index.html>`__
ca: `Guia d'estil 3a edició <https://webstyleguide.com/wsg3/index.html>` `` `

source: `Web Style Guide (libre) <https://webstyleguide.com/>`__
ca: `Lloc web de Guia d'estil (gratuït) <https://webstyleguide.com/>`__

source: Desarrollo Web
ca: Desenvolupament web

source: `CSS a fondo <https://desarrolloweb.com/css/>`__
ca: `CSS exhaustiu

source: `Las mejores herramientas para generar CSS <https://desarrolloweb.com/de_interes/mejores-herramientas-css-3126.html>`__
ca: `Les millors eines per generar CSS <https://development.com/de_interes/mejores-her eines-css-3126.html>`__ __
