Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/css-style.po
Languages: ca

source: Etiqueta de Estilo
ca: Etiqueta d'estil

source: La etiqueta <style> dentro del código HTML permite añadir estilos al contenido del documento HTML. Un ejemplo de estilo es el color de un texto, su tamaño, la separación entre líneas, etc.
ca: L’etiqueta <SHLE> dins del codi HTML permet afegir estils al contingut del document HTML. Un exemple d’estil és el color d’un text, la seva mida, la separació entre línies, etc.

source: Etiquetas utilizadas
ca: Etiquetes utilitzades

source: Etiqueta que permite incluir estilos en el documento HTML.
ca: Etiqueta que permet incloure estils al document HTML.

source: Esta etiqueta debe insertarse en la sección <head> del documento HTML.
ca: Aquesta etiqueta s'ha d'inserir a la secció <now> del document HTML.

source: ``/* Comentario */``
ca: ``/ * Comentari */`

source: Este es el formato que tienen los comentarios dentro de la sección <style> o dentro de un fichero CSS de hoja de estilos.
ca: Aquest és el format que tenen els comentaris dins de la secció <stile> o dins d’un fitxer CSS de Leaf Style.

source: Ejercicio
ca: Exercir

source: En la `página de colores CSS de w3schools <https://www.w3schools.com/cssref/css_colors.asp>`__ se pueden ver los 140 colores con nombre propio disponibles en todos los navegadores
ca: A la `pàgina de colors css de w3schools <https://www.w3schools.com/cssref/css_colors.asp>`__ Podeu veure els 140 colors amb el seu propi nom disponible a tots els navegadors

source: Realiza un documento HTML igual que el siguiente, con los colores cambiados.
ca: Feu un document HTML igual que els següents, amb els colors canviats.

source: Resultado
ca: Resultat
