Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/css-background.po
Languages: ca

source: Color de fondo
ca: Color de fons

source: En este ejercicio se estudia cómo dar color al fondo de pantalla.
ca: Aquest exercici estudia com donar color al fons de pantalla.

source: Referencias.
ca: Referències

source: `Colores CSS <https://www.w3schools.com/cssref/css_colors.asp>`__
ca: `Colors CSS <https://www.w3schools.com/cssref/css_colors.asp>`__

source: `HTML Color Picker <https://www.w3schools.com/colors/colors_picker.asp>`__
ca: `Html Picker de colors <https://www.w3schools.com/colors/colors_picker.asp>` __

source: `HTML Color Mixer <https://www.w3schools.com/colors/colors_mixer.asp>`__
ca: `HTML Color de la batedora <https://www.w3schools.com/colors/colors_mixer.asp>`__

source: Ejercicio
ca: Exercir

source: Fichero **css-background.html**
ca: Fitxer ** CSS-Background.html **

source: Fichero **css-background.css**
ca: Fitxer ** CSS-Background.css **

source: Resultado
ca: Resultat
