Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/dibujo-acotacion.po
Languages: ca

source: Acotación
ca: Dimensionament

source: Acotar es añadir al dibujo el tamaño que tiene el objeto real. Si un objeto tiene un tamaño de 20 milímetros, se representará esa cantidad en su dibujo.
ca: Limitar és afegir al dibuix de la mida de l’objecte real. Si un objecte té una mida de 20 mil·límetres, aquesta quantitat es representarà en el seu dibuix.

source: La cota está compuesta de varios elementos:
ca: El nivell està compost per diversos elements:

source: **Líneas auxiliares de cota**: 2 segmentos perpendiculares a lo que se está midiendo, que determinan el comienzo y el final de la medida.
ca: ** Línies auxiliars **: 2 segments perpendiculars al que es mesura, que determinen el començament i el final de la mesura.

source: **Línea de cota y flechas**: línea paralela a la dimensión a acotar, que mide lo mismo y comienza y termina en dos flechas de cota.
ca: ** Línia i fletxes COTA **: pararalment a la dimensió que es pot limitar, que mesura el mateix i comença i acaba en fletxes de dues dimensions.

source: **Cifra de cota**: número que indica el tamaño de la dimensión, en milímetros si no se especifica otra unidad.
ca: ** COTA Figura **: nombre que indica la mida de la dimensió, en mil·límetres si no s’especifica una altra unitat.

source: Si el dibujo es más grande que el objeto (ampliación) o más pequeño (reducción), la acotación siempre tiene el mismo valor porque no depende del tamaño del dibujo. La acotación representa el tamaño del objeto real, no el tamaño del dibujo.
ca: Si el dibuix és més gran que l'objecte (extensió) o menor (reducció), la dimensió sempre té el mateix valor perquè no depèn de la mida del dibuix. La dimensió representa la mida de l’objecte real, no la mida del dibuix.

source: Ejercicios de acotación
ca: Exercicis moribunds

source: A continuación se presenta una lámina con ejercicios de acotación de piezas. En la cara trasera de la lámina aparecen los ejercicios resueltos.
ca: A continuació, es mostra un full amb trossos de trossos. Els exercicis resolts apareixen a la cara posterior.

source: :download:`Ejercicios de acotación. Formato PDF. <dibujo/dibujo-acotacion-01.pdf>`
ca: : Descarregueu: `Exercicis moribunds. Format PDF. <Drawing/Drawing-01.pdf>`

source: :download:`Ejercicios de acotación. Formato Libre Office Draw. <dibujo/dibujo-acotacion-01.odg>`
ca: : Descarregueu: `Exercicis moribunds. Dibuix d’oficina de format gratuït. <dibuix/dibuix-01.odg>`

source: :download:`Imágenes recortadas. Formato PNG. <dibujo/dibujo-acotacion-01.zip>`
ca: : Descarregueu: `Imatges tallades. Format PNG. <dibuix/dibuix-01.zip>`
