Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/dibujo-recursos.po
Languages: ca

source: Recursos de dibujo técnico
ca: Recursos tècnics de dibuix

source: Página web educacionplastica.net
ca: Lloc web EducationPlasticA.net

source: `Ejercicios de vistas. Nivel básico. <http://www.educacionplastica.net/3dcube_model/vistas_3d_2x2.html>`__
ca: `Veure exercicis. Nivell bàsic. <http://www.educpionplàstica.net/3dcube_model/vistas_3d_2x2.html>

source: `Ejercicios de vistas. Nivel medio. <http://www.educacionplastica.net/3dcube_model/vistas_3d_3x3.html>`__
ca: `Veure exercicis. Nivell mitjà. <http://www.educpionplàstica.net/3dcube_model/vistas_3d_3x3.html>

source: `Ejercicios de modelado en 3D <http://www.educacionplastica.net/model3d.htm>`__
ca: `Exercicis de modelatge 3D <http://www.eductionplastica.net/model3d.htm>`__ __

source: `Perspectiva Isométrica <http://www.educacionplastica.net/MenuIso.htm>`__
ca: `Perspectiva isomètrica <http://www.educacionplàstica.net/menuiso.htm>`__

source: `Generador de piezas en 3D <http://www.educacionplastica.net/3dcube_model/3d_gen_eje.htm>`__
ca: `Generador de peces 3D <http://www.educacionplàstica.net/3dcube_model/3d_gen_eje.htm>`__

source: `Normalización (acotación) <http://www.educacionplastica.net/menunorma.htm>`__
ca: `Estandardització (Dimensioning) <http://www.educacionplàstica.net/menunorma.htm>`__

source: Página web Mongge.com
ca: Lloc web de Mongge.com

source: `Mongge.com <https://www.mongge.com/>`__ para animar tu Dibujo Técnico.
ca: `Mongge.com <https://www.mongge.com/>`__ per animar el vostre dibuix tècnic.

source: Más de 60 000 ejercicios de dibujo técnico compartidos por una comunidad activa de miles de personas.
ca: Més de 60.000 exercicis tècnics de dibuix compartits per una comunitat activa de milers de persones.

source: `Trazados básicos <https://www.mongge.com/ejercicios/?category=46>`__
ca: `Ruta bàsiques <https://www.mongge.com/ejercicios/?category=46>`__

source: `Sistema axonométrico <https://www.mongge.com/ejercicios/?category=43>`__
ca: `Sistema Axonomètric <https://www.mongge.com/ejercicios/?category=43>` `` ``

source: `Vistas <https://www.mongge.com/ejercicios/?category=11>`__
ca: `Vistes <https://www.mongge.com/ejercicios/?category=11>`__

source: `Normalización <https://www.mongge.com/ejercicios/?category=166>`__
ca: `Normalització <https://www.mongge.com/ejercicios/?category=166>`__

source: `Editor de animaciones <https://www.mongge.com/editor>`__
ca: `Editor d'animació <https://www.mongge.com/editor>`__

source: Plantillas de dibujo
ca: Plantilles de dibuix

source: :download:`Plantilla cuadriculada. Formato PDF. <dibujo/dibujo-plantilla-cuadriculada.pdf>`
ca: : Descarregueu: `plantilla grisped. Format PDF. <Drawing/Drawing-Plantilla-Cuadriculated.pdf>`

source: :download:`Plantilla cuadriculada. Formato editable SVG. <dibujo/dibujo-plantilla-cuadriculada.svg>`
ca: : Descarregueu: `plantilla grisped. Format editable SVG. <Dibuix/Dibuix-Plantilla-Cuadriculated.svg>`

source: :download:`Plantilla isométrica. Formato PDF. <dibujo/dibujo-plantilla-isometrica.pdf>`
ca: : Descàrrega: `Plantilla isomètrica. Format PDF. <Drawing/Drawing-Plantilla-Isometric.pdf>`

source: :download:`Plantilla isométrica. Formato editable SVG. <dibujo/dibujo-plantilla-isometrica.svg>`
ca: : Descàrrega: `Plantilla isomètrica. Format editable SVG. <Drawing/Drawing-Plantilla-Isometric.svg>`

source: :download:`Imágenes de las plantillas. Formato PNG. <dibujo/dibujo-plantillas-images.zip>`
ca: : Descarregueu: `Imatges de les plantilles. Format PNG. <Dibuix/dibuix-planillas-images.zip>`
