Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/dibujo-intro.po
Languages: ca

source: Introducción al Dibujo Técnico
ca: Introducció al dibuix tècnic

source: El dibujo técnico es una forma de representar información mecánica de los objetos. Permite describir formas, tamaños, grosores, posiciones y muchos otros detalles de éstos objetos. Con el dibujo técnico se puede representar desde el pequeño tornillo de un reloj de pulsera hasta todo un rascacielos.
ca: El dibuix tècnic és una manera de representar la informació mecànica dels objectes. Permet descriure formes, mides, gruixos, posicions i molts altres detalls d’aquests objectes. Amb el dibuix tècnic es pot representar des del petit cargol d’un rellotge de polsera fins a un rascat.

source: Los primeros dibujos técnicos conocidos tienen más de cuatro mil años de antigüedad y se utilizaron para ayudar en la construcción de edificios. Hoy en día se pueden encontrar dibujos técnicos en cualquier parte, como en los planos para montar los muebles de Ikea o en las señalizaciones de salida de emergencia.
ca: Els primers dibuixos tècnics coneguts tenen més de quatre mil anys i s’utilitzen per ajudar en la construcció d’edificis. Avui en dia podeu trobar dibuixos tècnics en qualsevol lloc, com en els plans per muntar els mobles IKEA o en la senyalització de sortida d’emergència.

source: Dibujo Técnico como lenguaje
ca: Dibuix tècnic com a idioma

source: Otra forma de ver el dibujo técnico es como un lenguaje con el que podemos guardar y transmitir información. La escritura nos permite representar las ideas de las que hablamos, siendo esta más exigente porque al escribir es necesario pensar mejor lo que queremos decir. Al releer posteriormente lo que hemos escrito es frecuente que se nos ocurra una forma mejor de expresarnos o algún detalle que no reflejamos. Es decir, que también nos ayuda a seguir pensando y mejorando.
ca: Una altra manera de veure el dibuix tècnic és com un llenguatge amb el qual podem desar i transmetre informació. L’Escriptura ens permet representar les idees de què parlem, ser més exigents perquè quan escriviu és necessari pensar millor el que volem dir. Posteriorment rellegint el que hem escrit, és habitual que pensem en una manera millor d’expressar -nos o algun detall que no reflectim. És a dir, també ens ajuda a continuar pensant i millorant.

source: El dibujo técnico tiene características parecidas a la escritura. Dibujar un objeto nos obliga a pensar en los detalles de lo que estamos representando. Posteriormente, al volver a mirar el dibujo, podemos recordar ideas que olvidamos representar o fallos que mejorar. Esto permite que el diseño sea un proceso acumulativo, en el que se van añadiendo detalles poco a poco hasta que alcanzamos el diseño final. Realizar esto de memoria sería algo tan complejo que muy pocas personas podrían realizarlo.
ca: El dibuix tècnic té escrivint característiques similars. Dibuixar un objecte ens obliga a pensar en els detalls del que estem representant. Posteriorment, quan torneu a mirar el dibuix, podem recordar idees que oblidem representar o fallar per millorar. Això permet que el disseny sigui un procés acumulat, en el qual s’afegeixen els detalls fins que arribem al disseny final. A la memòria seria una cosa tan complexa que poques persones ho podrien fer.

source: El dibujo técnico como lenguaje escrito nos ayuda a:
ca: El dibuix tècnic com a llenguatge escrit ens ajuda:

source: Pensar con mayor precisión y exactitud
ca: Penseu amb més precisió i precisió

source: Registrar las ideas para recordarlas posteriormente
ca: Registra’t idees per recordar -les més tard

source: Comunicar nuestras ideas a los demás
ca: Comunicar les nostres idees als altres

source: Perfeccionar los diseños añadiendo mejoras
ca: Dissenys perfectes afegint millores

source: Tipos de dibujos
ca: Tipus de dibuixos

source: Boceto
ca: Esbossar

source: Es el dibujo de una idea realizado a mano alzada. Es esquemático, por lo que no tiene detalles ni medidas.
ca: És el dibuix d’una idea realitzada a mà. És esquemàtic, de manera que no té detalls ni mesures.

source: La ventaja del boceto es que se puede dibujar algo aunque la idea sea solo esquemática y no esté clara.
ca: L’avantatge de l’esbós és que es pot treure alguna cosa, fins i tot si la idea només és esquemàtica i no està clara.

source: Croquis
ca: Esbossar

source: Es un dibujo realizado a mano alzada de un objeto. Tiene todas las medidas y detalles necesarios para describirlo y está dibujado con las proporciones correctas. Se dibuja con más precisión y claridad que el boceto.
ca: És un dibuix d’un objecte. Té totes les mesures i detalls necessaris per descriure -ho i es dibuixa amb les proporcions correctes. Es dibuixa amb més precisió i claredat que l’esbós.

source: El croquis sirve para fabricar el objeto que representa.
ca: L’esbós serveix per fabricar l’objecte que representa.

source: Plano
ca: Plana

source: Un plano es un dibujo realizado con instrumentos de dibujo o por ordenador. Es parecido a un croquis, pero pasado a limpio. El plano está dibujado a una escala exacta.
ca: Un avió és un dibuix elaborat amb instruments de dibuix o ordinador. És similar a un esbós, però passat net. L’avió es dibuixa a escala exacta.

source: Definiciones
ca: Definicions

source: Acotación
ca: Dimensionament

source: Acotar es añadir al dibujo el tamaño que tiene el objeto real. Si un objeto tiene un tamaño de 20 milímetros, se representará esa cantidad en su dibujo.
ca: Limitar és afegir al dibuix de la mida de l’objecte real. Si un objecte té una mida de 20 mil·límetres, aquesta quantitat es representarà en el seu dibuix.

source: Si el dibujo es más grande que el objeto (ampliación) o más pequeño (reducción), la acotación siempre tiene el mismo valor porque no depende del tamaño del dibujo. La acotación representa el tamaño del objeto real, no el tamaño del dibujo.
ca: Si el dibuix és més gran que l'objecte (extensió) o menor (reducció), la dimensió sempre té el mateix valor perquè no depèn de la mida del dibuix. La dimensió representa la mida de l’objecte real, no la mida del dibuix.

source: Un dibujo a escala es un dibujo más grande o más pequeño que el objeto que representa. Por ejemplo, un mapa representa un país a un tamaño mucho más pequeño, está dibujado a una escala reducida. El dibujo de una célula es mucho más grande que una célula, se representa con escala de ampliación.
ca: Un dibuix d’escala és un dibuix més gran o més petit que l’objecte que representa. Per exemple, un mapa representa un país amb una mida molt menor, que es troba a una petita escala. El dibuix d’una cèl·lula és molt més gran que una cel·la, es representa amb escala d’extensió.

source: Vistas
ca: Visualitzacions

source: Las vistas de un objeto son dibujos del objeto visto desde diferentes puntos. El alzado representa el objeto cuando lo vemos de frente. El perfil representa lo que vemos del objeto desde un lado. La planta representa lo que se vé desde arriba.
ca: Les vistes d’un objecte són dibuixos de l’objecte vist des de diferents punts. L’elevació representa l’objecte quan el veiem al davant. El perfil representa el que veiem des de l'objecte des del costat. La planta representa el que es veu des de dalt.

source: Un dibujo en perspectiva es un dibujo en tres dimensiones. Permite ver varias vistas del objeto a la vez.
ca: Un dibuix de perspectiva és un dibuix tridimensional. Permet veure diverses vistes de l'objecte alhora.

source: Ejercicios
ca: Exercicis

source: Explica las diferencias entre boceto y croquis
ca: Expliqueu les diferències entre esbós i esbós

source: Explica las diferencias entre croquis y plano
ca: Expliqueu les diferències entre esbós i avió

source: Explica los parecidos entre boceto y croquis
ca: Expliqueu les similituds entre esbós i esbós

source: Dibuja un boceto de un objeto cotidiano (por ejemplo, un lápiz, una cuchara, una silla, una llave, etc.)
ca: Dibuixa un esbós d’un objecte diari (per exemple, un llapis, una cullera, una cadira, una clau, etc.)

source: Dibuja un croquis del objeto anterior
ca: Dibuixa un esbós de l'objecte anterior
