Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/dibujo-boceto-croquis.po
Languages: ca

source: Bocetos y Croquis
ca: Esbossos i esbossos

source: Bocetos en perspectiva
ca: Esbossos en perspectiva

source: :download:`Boceto 1 en perspectiva <dibujo/_images/dibujo-boceto-01.png>`
ca: : Descarregueu: `Sketch 1 en perspectiva <dibuix/_images/dibuix-01.png>`

source: :download:`Boceto 2 en perspectiva <dibujo/_images/dibujo-boceto-02.png>`
ca: : Descarregueu: `Sketch 2 en perspectiva <dibuix/_images/dibuix-02.png>` `

source: :download:`Boceto 3 en perspectiva <dibujo/_images/dibujo-boceto-03.png>`
ca: : Descarregueu: `Sketch 3 en perspectiva <dibuix/_images/dibuix-03.png>` `

source: :download:`Boceto 4 en perspectiva <dibujo/_images/dibujo-boceto-04.png>`
ca: : Descarregueu: `Sketch 4 en perspectiva <dibuix/_images/dibuix-04.png>` `

source: :download:`Boceto 5 en perspectiva <dibujo/_images/dibujo-boceto-05.png>`
ca: : Descarregueu: `Sketch 5 en perspectiva <dibuix/_images/dibuix-05.png>`

source: :download:`Boceto 6 en perspectiva <dibujo/_images/dibujo-boceto-06.png>`
ca: : Descarregueu: `Sketch 6 en perspectiva <dibuix/_images/dibuix-06.png>`

source: :download:`Todos los bocetos en perspectiva. Formato PDF. <dibujo/dibujo-bocetos-isometrica.pdf>`
ca: : Descarregueu: `Tots els esbossos en perspectiva. Format PDF. <Dibuix/bocetos-isometric.pdf> '

source: :download:`Todos los bocetos en perspectiva. Formato editable ODT. <dibujo/dibujo-bocetos-isometrica.odt>`
ca: : Descarregueu: `Tots els esbossos en perspectiva. Format editable ODT. <Dibuix/bocetos-isometric.odt> '

source: Plantilla isométrica
ca: Plantilla isomètrica

source: Plantilla para realizar dibujos y croquis en perspectiva isométrica.
ca: Plantilla per a dibuixos i esbossos en perspectiva isomètrica.

source: :download:`Plantilla isométrica. Formato PDF. <dibujo/dibujo-plantilla-isometrica.pdf>`
ca: : Descàrrega: `Plantilla isomètrica. Format PDF. <Drawing/Drawing-Plantilla-Isometric.pdf> '

source: :download:`Plantilla isométrica. Formato editable SVG. <dibujo/dibujo-plantilla-isometrica.svg>`
ca: : Descàrrega: `Plantilla isomètrica. Format editable SVG. <Drawing/Drawing-Plantilla-Isometric.svg> '
