Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/dibujo-mesilla.po
Languages: ca

source: Diseño de una mesilla de noche
ca: Disseny d'una taula nocturna

source: En los siguientes documentos se presenta el diseño de una mesilla de noche con dimensiones de 400 x 400 x 600 mm, utilizando madera de 20 milímetros de grosor.
ca: En els documents següents, el disseny d’una taula nocturna amb dimensions de 400 x 400 x 600 mm, amb 20 mil·límetres.

source: La escala de dibujo es de 1:5 lo que significa que cada uno de los cuadrados de la pauta en el dibujo representa 20 milímetros en la realidad.
ca: L’escala de dibuix és d’1: 5, cosa que significa que cadascun dels quadrats de la guia del dibuix representa 20 mil·límetres en realitat.

source: :download:`Plano de conjunto de la mesilla de noche en perspectiva. Formato PDF. <dibujo/dibujo-design/dibujo-design-conjunto-mesilla.pdf>`
ca: : Descarregueu: `Muntatge de la taula de nit en perspectiva. Format PDF. <Dibuix/Dibuix/Dibuix-Design-Conjunt-Memesilla.pdf> '

source: :download:`Plano de despiece de la mesilla de noche. Formato PDF. <dibujo/dibujo-design/dibujo-design-despiece-mesilla.pdf>`
ca: : Descarregueu: `Rinse Plane de la taula de nit. Format PDF. <Dibuix/dibuix-disseny/dibuix-disseny-demostrat-memesilla.pdf> '

source: Plantillas de dibujo
ca: Plantilles de dibuix

source: Plantillas de dibujo para realizar tanto planos en perspectiva como planos de vistas.
ca: Plantilles de dibuix per realitzar els dos avions en perspectiva i les visions de les visualitzacions.

source: :download:`Plantilla para realizar planos de conjunto en perspectiva isométrica. Formato PDF. <dibujo/dibujo-design/dibujo-design-conjunto-plantilla.pdf>`
ca: : Descàrrega: `Plantilla per a avions conjunts en perspectiva isomètrica. Format PDF. <Dibuix/dibuix-disseny/dibuix-disseny-conjunt-plantilla.pdf> `

source: :download:`Plantilla para realizar planos de conjunto en perspectiva isométrica. Formato SVG. <dibujo/dibujo-design/dibujo-design-conjunto-plantilla.svg>`
ca: : Descàrrega: `Plantilla per a avions conjunts en perspectiva isomètrica. Format SVG. <Dibuix/dibuix-dibuix/dibuix-disseny-conjunt-plantilla.svg> `

source: :download:`Plantilla para realizar planos de despiece. Formato PDF. <dibujo/dibujo-design/dibujo-design-despiece-plantilla.pdf>`
ca: : Descarregueu: `Plantilla per a plans de visualització. Format PDF. <Dibuix/Dibuix/Dibuix-Disign-Desepiece-Plantilla.pdf> '

source: :download:`Plantilla para realizar planos de despiece. Formato SVG. <dibujo/dibujo-design/dibujo-design-despiece-plantilla.svg>`
ca: : Descarregueu: `Plantilla per a plans de visualització. Format SVG. <Dibuix/dibuix/dibuix/design-no-plantatilla.svg> '
