Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/dibujo-escalas.po
Languages: ca

source: Escalas
ca: Escales

source: Representación de objetos a distintos tamaños.
ca: Representació d'objectes a diferents mides.

source: Cuando hay que representar un objeto grande en un plano, por ejemplo un camión, no es práctico dibujarlo con su tamaño real. En estos casos lo conveniente es dibujar el objeto a tamaño reducido. Si los objetos son demasiado pequeños, por ejemplo, un componente electrónico, es conveniente realizar el dibujo con un tamaño ampliado.
ca: Quan heu de representar un objecte gran en un avió, per exemple un camió, no és pràctic dibuixar -lo amb la seva mida real. En aquests casos, és convenient dibuixar l'objecte a mida reduïda. Si els objectes són massa petits, per exemple, un component electrònic, és convenient dibuixar amb una mida ampliada.

source: Es la relación de ampliación o de reducción con la que se dibuja un objeto en papel.
ca: És la proporció d'extensió o reducció amb la qual es dibuixa un objecte de paper.

source: Si la escala comienza por un número mayor que uno es una escala de ampliación (por ejemplo, una escala 10:1). Si la escala comienza por uno seguido de un número mayor que uno, es una escala de reducción (por ejemplo, una escala 1:10)
ca: Si l'escala comença amb un nombre més gran que un és una escala d'extensió (per exemple, una escala de 10: 1). Si l'escala comença un seguit d'un nombre superior a un, és una escala de reducció (per exemple, una escala 1:10)

source: Se utiliza para representar los objetos con un dibujo del mismo tamaño que la realidad. La escala natural se representa también como escala 1:1
ca: S'utilitza per representar objectes amb un dibuix de la mateixa mida que la realitat. L’escala natural també es representa com a escala 1: 1

source: **Escala de reducción**
ca: ** Escala de reducció **

source: Se utiliza cuando el tamaño del objeto es mayor que el tamaño de la hoja de papel. Una escala 1:10 significa que el dibujo tendrá un tamaño diez veces menor que el objeto real. Por ejemplo, un armario de 200cm dibujado a escala 1:10 tendrá un tamaño de 20cm en la hoja de papel.
ca: S'utilitza quan la mida de l'objecte és superior a la mida del full de paper. Una escala 1:10 significa que el dibuix serà de mida deu vegades menys que l'objecte real. Per exemple, un armari de 200cm dibuixat a escala 1:10 tindrà una mida de 20cm a la fitxa de paper.

source: **Escala de ampliación**
ca: ** Escala d'extensió **

source: Se utiliza para representar objetos pequeños. Una escala de ampliación 10:1 servirá para representar un engranaje de reloj de 5 milímetros, con un tamaño de 50 milímetros en el papel.
ca: S'utilitza per representar objectes petits. Una escala d’extensió 10: 1 servirà per representar un engranatge de rellotge de 5 mm, amb una mida de 50 mil·límetres en paper.

source: Escalas normalizadas
ca: Escales estandarditzades

source: Aunque se puede utilizar cualquier valor de escala, en la práctica se recomienda utilizar ciertos valores normalizados en los planos técnicos para facilitar la lectura de las dimensiones. Estas son algunas de las escalas normalizadas:
ca: Tot i que es pot utilitzar qualsevol valor d’escala, a la pràctica es recomana utilitzar determinats valors normalitzats en els avions tècnics per facilitar la lectura de les dimensions. Aquestes són algunes de les escales normalitzades:

source: Reducción
ca: Reducció

source: Ampliación
ca: Extensió

source: En casos especiales, como en la construcción de edificios, se utilizan escalas intermedias como la escala 1:40 o la escala 1:25.
ca: En casos especials, com en la construcció d’edificis, s’utilitzen escales intermèdies com l’escala 1:40 o l’escala 1:25.

source: En la siguiente tabla aparecen algunos ejemplos de escalas y el tamaño de los objetos que se pueden representar en esa escala sobre una hoja de papel de tamaño folio o A4.
ca: A la taula següent apareixen alguns exemples d’escales i la mida dels objectes que es poden representar en aquesta escala en un full de mida de foli o paper A4.

source: Tamaño que se puede representar en un folio
ca: Mida que es pot representar en un foli

source: Ejemplo de objetos
ca: Exemple d'objectes

source: Hasta 25 x 15 metros en un folio
ca: Fins a 25 x 15 metres en un foli

source: Casa, camión, salón grande
ca: Casa, camió, gran saló

source: Hasta 5 x 3 metros en un folio
ca: Fins a 5 x 3 metres en un foli

source: Estantería, armario, automóvil, habitación
ca: Prestatgeria, armari, cotxe, habitació

source: Hasta 250 x 150 centímetros en un folio
ca: Fins a 250 x 150 centímetres en un foli

source: Bicicleta, televisor, silla
ca: Bicicleta, televisió, cadira

source: Hasta 50 x 30 centímetros en un folio
ca: Fins a 50 x 30 centímetres en un foli

source: Consola de videojuegos, botella, sierra
ca: Consola de videojocs, ampolla, Sierra

source: Hasta 25 x 15 centímetros en un folio
ca: Fins a 25 x 15 centímetres en un foli

source: Destornillador, tablet
ca: Tornavís, tauleta

source: Hasta 12 x 7 centímetros en un folio
ca: Fins a 12 x 7 centímetres en un foli

source: Smartphone, tornillo
ca: Smartphone, cargol

source: Hasta 25 x 15 milímetros en un folio
ca: Fins a 25 x 15 mil·límetres en un foli

source: Piezas de reloj, memoria micro SD
ca: Peces de rellotge, memòria micro sd

source: Ejercicios de escalas
ca: Exercicis d’escales

source: Este ejercicio consiste en copiar las figuras en un papel cuadriculado con el mismo tamaño que aparece en la lámina impresa. A continuación la figura se copiará con una escala de ampliación 2:1, al doble de su tamaño. Por último la figura se debe copiar con una escala de reducción 1:2, a la mitad de su tamaño.
ca: Aquest exercici consisteix a copiar les figures en un paper quadriculat amb la mateixa mida que apareix al full imprès. La xifra es copiarà amb una escala d'extensió 2: 1, el doble de la seva mida. Finalment, s’ha de copiar la xifra amb una escala de reducció 1: 2, a la meitat de la seva mida.

source: La primera lámina contiene figuras sencillas, formadas solo con líneas verticales y líneas horizontales. La segunda lámina contiene figuras con líneas verticales y horizontales, figuras con líneas inclinadas y figuras con círculos.
ca: El primer full conté figures senzilles, formades només amb línies verticals i línies horitzontals. El segon full conté figures amb línies verticals i horitzontals, figures amb línies inclinades i figures amb cercles.

source: Láminas con figuras para dibujar a escala.
ca: Plaques amb figures per dibuixar a l'escala.

source: :download:`Dibujo a escala. Lámina 01. Formato PDF. <dibujo/dibujo-escalas-01.pdf>`
ca: : Descàrrega: `Dibuix a escala. Placa 01. Format PDF. <Dibuix/dibuix-scalas-01.pdf> '

source: :download:`Dibujo a escala. Lámina 02. Formato PDF. <dibujo/dibujo-escalas-02.pdf>`
ca: : Descàrrega: `Dibuix a escala. Placa 02. Format PDF. <dibuix/dibuix-scalas-02.pdf> '

source: :download:`Dibujo a escala. Lámina 01. Formato Libre Office Draw. <dibujo/dibujo-escalas-01.odg>`
ca: : Descàrrega: `Dibuix a escala. Placa 01. Dibuix d’oficina de format gratuït. <dibuix/dibuix-scalas-01.odg> '

source: :download:`Dibujo a escala. Lámina 02. Formato Libre Office Draw. <dibujo/dibujo-escalas-02.odg>`
ca: : Descàrrega: `Dibuix a escala. Placa 02. Dibuix d’oficina de format gratuït. <dibuix/dibuix-scalas-02.odg> '

source: :download:`Plantilla cuadriculada 4mm. Formato PDF. <dibujo/dibujo-plantilla-4mm.pdf>`
ca: : Descarregueu: `4mm plantilla quadrada. Format PDF. <dibuix/dibuix-4mm.pdf> '

source: :download:`Plantilla cuadriculada 4mm. Formato Libre Office Draw. <dibujo/dibujo-plantilla-4mm.odg>`
ca: : Descarregueu: `4mm plantilla quadrada. Dibuix d’oficina de format gratuït. <dibuix/dibuix-4mm.odg> '
