Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/dibujo-vistas.po
Languages: ca

source: Vistas
ca: Visualitzacions

source: Las vistas son dibujos de una figura desde distintas perspectivas. Las vistas son el alzado (vista de frente), el perfil (vista de lado) y la planta (vista desde arriba). En concreto vamos a utilizar el sistema europeo, que ordena la posición de las tres vistas de manera diferente al sistema americano.
ca: Les vistes són dibuixos d’una figura des de diferents perspectives. Les vistes són l’elevació (vista frontal), el perfil (vista lateral) i la planta (vista des de dalt). Concretament, utilitzarem el sistema europeu, que ordena la posició de les tres opinions de manera diferent del sistema nord -americà.

source: Este método de representar una figura tridimensional en varios dibujos se denomina `sistema diédrico <https://es.wikipedia.org/wiki/Sistema_di%C3%A9drico>`__.
ca: Aquest mètode per representar una figura tridimensional en diversos dibuixos s’anomena `sistema diedral <https://es.wikipedia.org/wiki/system_di%C3%A9Drico>` `__.

source: A continuación aparecen ejercicios de obtención de vistas de una figura, graduados en dificultad desde el nivel básico hasta el nivel más complejo con objetos curvos.
ca: A continuació, es mostren exercicis per obtenir vistes d’una xifra, graduats en dificultat des del nivell bàsic fins al nivell més complex amb objectes corbats.

source: Todos los ejercicios tienen una versión con el sistema de vistas europeo (alzado a la derecha) y otra versión no convencional en la que el alzado se ha escogido a la izquierda de la figura y el perfil a la derecha.
ca: Tots els exercicis tenen una versió amb el Sistema Europeu de View (alçat a la dreta) i una altra versió poc convencional en la qual s’ha escollit l’elevació a l’esquerra de la figura i al perfil de la dreta.

source: Índice de contenidos:
ca: Índex de contingut:

source: Ejercicios simples
ca: Exercicis senzills

source: :download:`Alzado derecho. Formato PDF. <dibujo/dibujo-vistas-der-01.pdf>`
ca: : Descarregueu: `Right Raised. Format PDF. <Dibuix/dibuix-vers-der-01.pdf>`

source: :download:`Alzado derecho. Imágenes en formato PNG. <dibujo/dibujo-vistas-der-01-images.zip>`
ca: : Descarregueu: `Right Raised. Imatges en format PNG. <Dibuix/dibuix-versos-der-01-images.zip>`

source: :download:`Alzado derecho. Formato editable SVG. <dibujo/dibujo-vistas-der-01.svg>`
ca: : Descarregueu: `Right Raised. Format editable SVG. <Drawing/Drawing-Vista-der-01.svg>`

source: :download:`Alzado izquierdo. Formato PDF. <dibujo/dibujo-vistas-izq-01.pdf>`
ca: : Descarregueu: `Left Lifting. Format PDF. <Drawing/Drawing-Verses-IZQ-01.pdf>`

source: :download:`Alzado izquierdo. Imágenes en formato PNG. <dibujo/dibujo-vistas-izq-01-images.zip>`
ca: : Descarregueu: `Left Lifting. Imatges en format PNG. <Dibuix/Dibuix-Verses-IZQ-01-Imatges.zip> `

source: :download:`Alzado izquierdo. Formato editable SVG. <dibujo/dibujo-vistas-izq-01.svg>`
ca: : Descarregueu: `Left Lifting. Format editable SVG. <Drawing/Drawing-Verses-IZQ-01.svg>`

source: Ejercicios con vistas ocultas
ca: Exercicis amb vistes ocultes

source: :download:`Alzado derecho. Formato PDF. <dibujo/dibujo-vistas-der-02.pdf>`
ca: : Descarregueu: `Right Raised. Format PDF. <Drawing/Drawing-Duer-02.pdf>`

source: :download:`Alzado derecho. Imágenes en formato PNG. <dibujo/dibujo-vistas-der-02-images.zip>`
ca: : Descarregueu: `Right Raised. Imatges en format PNG. <Dibuix/dibuix-versos-der-02-images.zip>`

source: :download:`Alzado derecho. Formato editable SVG. <dibujo/dibujo-vistas-der-02.svg>`
ca: : Descarregueu: `Right Raised. Format editable SVG. <Drawing/Drawing-Vista-der-02.svg>`

source: :download:`Alzado izquierdo. Formato PDF. <dibujo/dibujo-vistas-izq-02.pdf>`
ca: : Descarregueu: `Left Lifting. Format PDF. <Dibuix/Dibuix-Verses-IZQ-02.pdf>`

source: :download:`Alzado izquierdo. Imágenes en formato PNG. <dibujo/dibujo-vistas-izq-02-images.zip>`
ca: : Descarregueu: `Left Lifting. Imatges en format PNG. <Dibuix/Dibuix-Verses-IZQ-02-IMages.zip>`

source: :download:`Alzado izquierdo. Formato editable SVG. <dibujo/dibujo-vistas-izq-02.svg>`
ca: : Descarregueu: `Left Lifting. Format editable SVG. <Dibuix/Dibuix-Verses-IZQ-02.svg>`

source: Ejercicios con rampas
ca: Exercicis amb rampes

source: :download:`Alzado derecho. Formato PDF. <dibujo/dibujo-vistas-der-03.pdf>`
ca: : Descarregueu: `Right Raised. Format PDF. <Drawing/Drawing-Vista-der-03.pdf>`

source: :download:`Alzado derecho. Imágenes en formato PNG. <dibujo/dibujo-vistas-der-03-images.zip>`
ca: : Descarregueu: `Right Raised. Imatges en format PNG. <Drawing/Drawing-Vista-der-03-images.zip>`

source: :download:`Alzado derecho. Formato editable SVG. <dibujo/dibujo-vistas-der-03.svg>`
ca: : Descarregueu: `Right Raised. Format editable SVG. <Dibuix/dibuix-vers-der-03.svg>`

source: :download:`Alzado izquierdo. Formato PDF. <dibujo/dibujo-vistas-izq-03.pdf>`
ca: : Descarregueu: `Left Lifting. Format PDF. <Drawing/Drawing-Verses-IZQ-03.pdf>`

source: :download:`Alzado izquierdo. Imágenes en formato PNG. <dibujo/dibujo-vistas-izq-03-images.zip>`
ca: : Descarregueu: `Left Lifting. Imatges en format PNG. <Dibuix/Dibuix-Verses-IZQ-03-Images.zip>`

source: :download:`Alzado izquierdo. Formato editable SVG. <dibujo/dibujo-vistas-izq-03.svg>`
ca: : Descarregueu: `Left Lifting. Format editable SVG. <Dibuix/Dibuix-Verses-IZQ-03.svg>`

source: Ejercicios con vistas ocultas y rampas
ca: Exercicis amb vistes i rampes ocultes

source: :download:`Alzado derecho. Formato PDF. <dibujo/dibujo-vistas-der-04.pdf>`
ca: : Descarregueu: `Right Raised. Format PDF. <Dibuix/dibuix-vers-der-04.pdf>`

source: :download:`Alzado derecho. Imágenes en formato PNG. <dibujo/dibujo-vistas-der-04-images.zip>`
ca: : Descarregueu: `Right Raised. Imatges en format PNG. <Dibuix/dibuix-versos-der-04-images.zip>`

source: :download:`Alzado derecho. Formato editable SVG. <dibujo/dibujo-vistas-der-04.svg>`
ca: : Descarregueu: `Right Raised. Format editable SVG. <Dibuix/dibuix-deu a-04.svg>`

source: :download:`Alzado izquierdo. Formato PDF. <dibujo/dibujo-vistas-izq-04.pdf>`
ca: : Descarregueu: `Left Lifting. Format PDF. <Dibuix/Dibuix-Verses-IZQ-04.pdf>`

source: :download:`Alzado izquierdo. Imágenes en formato PNG. <dibujo/dibujo-vistas-izq-04-images.zip>`
ca: : Descarregueu: `Left Lifting. Imatges en format PNG. <Dibuix/Dibuix-Verses-IZQ-04-IMages.zip>`

source: :download:`Alzado izquierdo. Formato editable SVG. <dibujo/dibujo-vistas-izq-04.svg>`
ca: : Descarregueu: `Left Lifting. Format editable SVG. <Dibuix/Dibuix-Verses-IZQ-04.svg>`

source: Ejercicios con curvas
ca: Exercicis amb corbes

source: :download:`Alzado derecho. Formato PDF. <dibujo/dibujo-vistas-der-05.pdf>`
ca: : Descarregueu: `Right Raised. Format PDF. <Dibuix/dibuix-versos-der-05.pdf>`

source: :download:`Alzado derecho. Imágenes en formato PNG. <dibujo/dibujo-vistas-der-05-images.zip>`
ca: : Descarregueu: `Right Raised. Imatges en format PNG. <Dibuix/dibuix-deu a-05-images.zip>`

source: :download:`Alzado derecho. Formato editable SVG. <dibujo/dibujo-vistas-der-05.svg>`
ca: : Descarregueu: `Right Raised. Format editable SVG. <Drawing/Drawing-Vista-der-05.svg>`

source: :download:`Alzado izquierdo. Formato PDF. <dibujo/dibujo-vistas-izq-05.pdf>`
ca: : Descarregueu: `Left Lifting. Format PDF. <Dibuix/Dibuix-Verses-IZQ-05.pdf>`

source: :download:`Alzado izquierdo. Imágenes en formato PNG. <dibujo/dibujo-vistas-izq-05-images.zip>`
ca: : Descarregueu: `Left Lifting. Imatges en format PNG. <Dibuix/Dibuix-Verses-IZQ-05-Imatges.Zip> `

source: :download:`Alzado izquierdo. Formato editable SVG. <dibujo/dibujo-vistas-izq-05.svg>`
ca: : Descarregueu: `Left Lifting. Format editable SVG. <Dibuix/Dibuix-Verses-IZQ-05.svg>`

source: Plantillas de dibujo
ca: Plantilles de dibuix

source: :download:`Alzado derecho. Formato PDF. <dibujo/dibujo-plantilla-isometric-4-der.pdf>`
ca: : Descarregueu: `Right Raised. Format PDF. <Drawing/Drawing-Plantilla-Isometric-4-Der.pdf>`

source: :download:`Alzado derecho. Formato editable SVG. <dibujo/dibujo-plantilla-isometric-4-der.svg>`
ca: : Descarregueu: `Right Raised. Format editable SVG. <Dibuix/Dibuix-Plantilla-Isomètric-4-Der.svg>`

source: :download:`Alzado izquierdo. Formato PDF. <dibujo/dibujo-plantilla-isometric-4-izq.pdf>`
ca: : Descarregueu: `Left Lifting. Format PDF. <Drawing/Drawing-Plantilla-Isometric-4-IZQ.PDF>`

source: :download:`Alzado izquierdo. Formato editable SVG. <dibujo/dibujo-plantilla-isometric-4-izq.svg>`
ca: : Descarregueu: `Left Lifting. Format editable SVG. <Drawing/Drawing-Plantilla-Isometric-4-IZQ.SVG>`

source: Piezas de papel en tres dimensiones
ca: Tres de paper dimensional

source: Ejercicios para construir piezas en tres dimensiones con papel recortado (papercraft) en el taller de Tecnología:
ca: Exercicis per construir tres dimensions amb paper retallat (Papercraft) al taller de tecnologia:

source: :ref:`taller-papercraft`
ca: : Ref: `Workshop-Papercraft`
