Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/electric-simulador-paralelo.po
Languages: ca

source: :index:`Conexión en paralelo`
ca: :index:`Connexió en paral·lel`

source: Dos componentes están conectados en paralelo si sus dos terminales están conectados entre sí, formando dos ramas.
ca: Dos components es connecten en paral·lel si els seus dos terminals estan connectats entre si, formant dues branques.

source: La conexión en paralelo tiene la propiedad de mantener la misma tensión en todos sus componentes. Estos, además, son independientes. Si retiramos uno de los componentes en paralelo, los demás componentes seguirán funcionando igual que antes.
ca: La connexió paral·lela té la propietat de mantenir la mateixa tensió en tots els seus components. Aquests també són independents. Si retirem un dels components en paral·lel, els altres components continuaran funcionant igual que abans.

source: Generadores en paralelo
ca: Generadors paral·lels

source: Los generadores en paralelo suman sus corrientes para poder entregar más corriente que uno solo.
ca: Els generadors paral·lels afegeixen els seus corrents per poder lliurar -los més comuns que un.

source: Las pilas y baterías no se suelen conectar en paralelo porque apenas aporta ventajas y sí que puede presentar problemas si las tensiones de las pilas no son exactamente idénticas, al descargarse unas sobre otras. Para conseguir más corriente se utilizan pilas o baterías más grandes, en vez de utilizar pilas en paralelo.
ca: Les bateries i les bateries no solen estar connectades en paral·lel perquè amb prou feines proporciona avantatges i poden presentar problemes si les bateries no són exactament idèntiques, quan es descarreguen les unes de les altres. Per aconseguir més corrent, s’utilitzen bateries o bateries més grans, en lloc d’utilitzar bateries paral·leles.

source: Los generadores de las centrales eléctricas sí que se conectan en paralelo para poder generar mucha más corriente eléctrica de la que podría entregar un solo generador. Esta conexión es bastante delicada porque todos los generadores tienen que tener la misma tensión y funcionar al unísono. En caso contrario se producirán variaciones en la red eléctrica que podrían acabar en un apagón eléctrico.
ca: Els generadors de les plantes elèctriques es connecten en paral·lel per poder generar molt més corrent elèctric del que podria lliurar un sol generador. Aquesta connexió és força delicada perquè tots els generadors han de tenir la mateixa tensió i treballar a l’uníson. En cas contrari, hi haurà variacions en la xarxa elèctrica que podria acabar en una apagada elèctrica.

source: Receptores en paralelo
ca: Receptors paral·lels

source: Los receptores suelen conectarse en paralelo para que funcionen de manera independiente unos de otros. Así, las diferentes bombillas de una lámpara se conectarán en paralelo de manera que si una de ellas se funde o se retira, las demás bombillas seguirán funcionando igualmente.
ca: Els receptors solen connectar -se en paral·lel per treballar independentment els uns dels altres. Així, les diferents bombetes d’una làmpada es connectaran en paral·lel de manera que si un d’ells es fon o s’elimina, les altres bombetes continuaran funcionant per igual.

source: Simula en el simulador online los siguientes circuitos con lámparas en paralelo para ver cómo afecta a la tensión de cada lámpara:
ca: Simula al simulador en línia els circuits següents amb làmpades paral·leles per veure com afecta la tensió de cada làmpada:

source: Los cables en una conexión en paralelo deben dibujarse poco a poco uniendo entre sí cada uno de los puntos de conexión:
ca: Els cables en una connexió paral·lela s’han de dibuixar a poc a poc unint a cadascun dels punts de connexió:

source: Si ahora desconectamos una de las lámparas en paralelo, podemos comprobar cómo todo el resto del circuito sigue funcionando:
ca: Si ara desconnectem una de les làmpades en paral·lel, podem comprovar com continua la resta del circuit:

source: Ejercicios
ca: Exercicis

source: ¿Qué propiedades tiene la conexión en paralelo?
ca: Quines propietats té la connexió en paral·lel?

source: ¿Es común conectar las pilas en paralelo? Explica la respuesta.
ca: És comú connectar les bateries en paral·lel? Expliqueu la resposta.

source: ¿Por qué se conectan los generadores de las centrales eléctricas en paralelo?
ca: Per què es connecten els generadors de centrals paral·leles?

source: Dibuja tres bombillas conectadas en paralelo a una pila.
ca: Dibuixa tres bombetes connectades en paral·lel a una bateria.

source: ¿Qué ocurre si se funde una lámpara que está conectada en paralelo con otras lámparas?
ca: Què passa si una làmpada es fon en paral·lel amb altres làmpades?
