Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/electronic-bjt-current.po
Languages: ca

source: La fuente de corriente
ca: La font actual

source: Este circuito sirve para generar una corriente que se mantendrá constante, independientemente de la tensión que haya a su salida. Es un circuito muy utilizado para polarizar otras etapas de transistores, como el par diferencial, para alimentar diodos led de corriente constante, enviar información inmune al ruido eléctrico, etc.
ca: Aquest circuit serveix per generar un corrent que es mantindrà constant, independentment de la tensió de la seva sortida. És un circuit àmpliament utilitzat per polaritzar altres etapes dels transistors, com ara la PAR diferencial, per alimentar diodes LED de corrent constant, enviar informació immune al soroll elèctric, etc.

source: Esquema de una fuente de corriente constante basada en transistores NPN.
ca: Esquema d’una font de corrent constant basada en transistors NPN.

source: Símbolo de una fuente de corriente constante.
ca: Símbol d’una font de corrent constant.

source: Funcionamiento y cálculos
ca: Funcionament i càlculs

source: La función de cada componente es la siguiente:
ca: La funció de cada component és la següent:

source: La resistencia R1 polariza la base del transistor Q2, que comienza a conducir corriente.
ca: La resistència R1 polaritza la base del transistor Q2, que comença a conduir el corrent.

source: Al conducir corriente el transistor Q2, la tensión de la resistencia R2 comienza a subir, hasta que llega aproximadamente a 0.6 voltios, que es el momento en el que comienza a conducir corriente el transistor Q1.
ca: Quan condueix el transistor Q2, la tensió de la resistència R2 comença a augmentar, fins a aproximadament 0,6 volts, que és el moment en què el transistor Q1 comença a conduir.

source: Al conducir corriente el transistor Q1, la corriente de la resistencia R1 se escapa por el colector del transistor Q1 y deja de alimentar a la base de Q2.
ca: Quan condueix el transistor Q1, el corrent de la resistència R1 s’escapa pel col·lector Q1 del transistor i deixa d’alimentar -se a la base de Q2.

source: El resultado final es que se mantiene una tensión prácticamente constante en la base de Q1 y, por lo tanto, en la resistencia R2. Esa tensión constante se traduce en que circulará una corriente prácticamente constante por el emisor de Q2 y, despreciando la corriente de base, por el colector de Q2.
ca: El resultat final és que es manté una tensió pràcticament constant a la base de Q1 i, per tant, en resistència R2. Aquesta tensió constant es tradueix en un corrent de corrent circularà per l’emissor Q2 i, menyspreant el corrent base, pel col·lector Q2.

source: Aplicando la ley de Ohm:
ca: Aplicant la llei d'Ohm:

source: I_{R2} = \frac{V_{be}}{R_2}
ca: I_ {r2} = \ frau {v_ {be}} {r_2}

source: Siendo:
ca: Ser:

source: I_R2 = Corriente que circula por la resistencia R2 en amperios [A]
ca: I_r2 = corrent que circula per la resistència R2 en amplificadors [a]

source: V_be = Tensión entre la base y el emisor del transistor Q1 en voltios [V]
ca: V_BE = Tensió entre la base i l'emissor del transistor Q1 en volts [V]

source: R_2 = Resistencia R2 en ohmios [Ω]
ca: R_2 = R2 Resistència en ohms [ω]

source: Simulación
ca: Simulació

source: A continuación puede verse la simulación de una fuente de corriente constante basada en transistores NPN.
ca: A continuació, es pot veure la simulació d'una font de corrent constant basada en transistors NPN.

source: Ejercicios
ca: Exercicis

source: Dibuja un esquema simplificado de una fuente de corriente constante basada en transistores NPN.
ca: Dibuixa un esquema simplificat d’una font de corrent constant basada en transistors NPN.

source: Dibuja al lado el símbolo de la fuente de corriente constante.
ca: Dibuixa al costat del símbol de la font de corrent constant.

source: Dibuja un esquema realista de una fuente de corriente constante basada en transistores NPN, que alimenta a una resistencia.
ca: Dibuixa un esquema realista d’una font de corrent constant basada en transistors NPN, que s’alimenta de resistència.

source: ¿Cuál es la función principal de una fuente de corriente? ¿Qué aplicaciones tiene?
ca: Quina és la funció principal d’una font actual? Quines aplicacions teniu?

source: En la simulación de la fuente de corriente constante podemos comprobar cómo le afectan los cambios externos.
ca: En la simulació de la font de corrent constant podem verificar com afecten els canvis externs.

source: Cambia la tensión de alimentación desde 9 voltios hasta 18 voltios en pasos de 3 en 3 voltios y anota en una tabla cómo va variando la corriente por el colector del transistor con el cambio de tensión de alimentación.
ca: Canvieu la tensió d’alimentació de 9 volts a 18 volts en passos de 3 en 3 volts i notes en una taula com varia el corrent pel col·lector del transistor amb el canvi de tensió d’alimentació.

source: Con una tensión de alimentación de 9 voltios, cambia la resistencia R3 por los valores 2000Ω, 1000Ω, 100Ω, 10Ω. Anota en una tabla cuánto vale la corriente de colector para cada uno de los valores de resistencia.
ca: Amb una tensió d’alimentació de 9 volts, la resistència R3 canvia per als 2000Ω, 1000Ω, 100Ω, 10Ω. Escriviu en una taula quant val el corrent del col·leccionista per a cadascun dels valors de resistència.

source: Diseña una fuente de corriente constante que funcione con una tensión de alimentación de 12 voltios y con una corriente de colector de 10 miliamperios.
ca: Dissenyeu una font de corrent constant que funcioni amb un voltatge d’alimentació de 12 volts i amb un flux de col·leccionistes de 10 mil·límetres.

source: Para conseguirlo, cambia la tensión de alimentación a 12 voltios y calcula la resistencia R2 necesaria con la fórmula:
ca: Per aconseguir -ho, canvieu la tensió d’alimentació a 12 volts i calculeu la resistència R2 necessària amb la fórmula:

source: R_2 = \frac{V_e}{I_e}
ca: R_2 = \ frau {v_e} {i_e}

source: Sin utilizar decimales para el valor de la resistencia.
ca: Sense utilitzar decimals per al valor de resistència.

source: Diseña en el `simulador de circuitos <../circuits/?startCircuit=empty.txt>`__ una fuente de corriente negativa constante. La forma del circuito será igual que la fuente simulada anterior, pero utilizando transistores PNP y conectando el circuito en espejo horizontal. Es decir, la resistencia R1 irá conectada al negativo de la pila y la resistencia R2 irá conectada al positivo de la pila.
ca: Disseny al `Circuit Simulator <../ Circuit/? StartCircuit = buits.txt>`__ Una font de corrent negativa constant. La forma del circuit serà la mateixa que la font simulada anterior, però utilitzant transistors PNP i connectant el circuit de miralls horitzontals. És a dir, la resistència R1 estarà connectada al negatiu de la bateria i la resistència R2 es connectarà al positiu de la bateria.
