Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/electric-resolver-circuitos.po
Languages: ca

source: Resolución de circuitos
ca: Resolució del circuit

source: En esta unidad vamos a estudiar cómo resolver circuitos con resistencias para hallar las corrientes y tensiones que circulan por ellas.
ca: En aquesta unitat estudiarem com resoldre circuits amb resistències per trobar els corrents i les tensions que circulen per ells.

source: Índice de contenidos:
ca: Índex de contingut:

source: Leyes y fórmulas utilizadas
ca: Lleis i fórmules utilitzades

source: Las ecuaciones que vamos a utilizar para conseguir resolver los circuitos son la ley de Ohm y las leyes de los circuitos en paralelo y en serie.
ca: Les equacions que utilitzarem per resoldre els circuits són la llei d'Ohm i les lleis dels circuits en paral·lel i en sèrie.

source: También podemos utilizar las fórmulas, que ya hemos estudiado, de las resistencias equivalentes a un circuito en serie y a un circuito en paralelo.
ca: També podem utilitzar les fórmules, que ja hem estudiat, a partir de les resistències equivalents a un circuit en sèrie i a un circuit paral·lel.

source: Fórmulas de la ley de Ohm
ca: Fórmules de llei d'Ohm

source: Leyes del circuito en serie
ca: Lleis de circuits en sèrie

source: La corriente que circula por varias resistencias en serie es la misma para todas ellas.
ca: El corrent que circula per diverses resistències de sèries és el mateix per a tots ells.

source: La tensión total de un circuito en serie es igual a la suma de las tensiones de cada una de sus resistencias.
ca: La tensió total d’un circuit de sèrie és igual a la suma de les tensions de cadascuna de les seves resistències.

source: Leyes del circuito en paralelo
ca: Lleis de circuits paral·lels

source: La corriente total que circula por varias resistencias en paralelo es igual a la suma de las corrientes que circulan por las resistencias.
ca: El corrent total que circula per diverses resistències paral·leles és igual a la suma dels corrents que circulen per les resistències.

source: La tensión de cada una de las resistencias que están en paralelo es la misma para todas ellas.
ca: La tensió de cadascuna de les resistències que són paral·leles és la mateixa per a totes elles.

source: Resistencia equivalente a un circuito en serie
ca: Resistència equivalent a un circuit de sèrie

source: Resistencia equivalente a un circuito en paralelo
ca: Resistència equivalent a un circuit paral·lel

source: Cada uno de los circuitos que vamos a analizar tendrá asociada una cuadrícula con la tensión, la intensidad de corriente y la resistencia de cada componente. Esa cuadrícula habrá que rellenarla con las soluciones que vamos obteniendo al aplicar las fórmulas anteriores, hasta que toda la cuadrícula esté completa y conozcamos todos los valores del circuito.
ca: Cadascun dels circuits que analitzarem tindrà una xarxa amb la tensió, la intensitat de corrent i la resistència de cada component. Aquesta graella haurà d’omplir -se de les solucions que estem obtenint quan apliquem les fórmules anteriors, fins que la xarxa sencera no estigui completa i coneixem tots els valors del circuit.

source: Divisor de tensión con dos resistencias
ca: Divisor de tensió amb dues resistències

source: Este circuito es muy usado en electrónica para conseguir tensiones más bajas que la tensión de alimentación. Consiste en dos resistencias conectadas en serie entre sí y a los dos terminales de la alimentación.
ca: Aquest circuit s'utilitza àmpliament en l'electrònica per obtenir tensions inferiors a la tensió d'alimentació. Consta de dues resistències connectades en sèrie entre elles i els dos terminals alimentaris.

source: Si tenemos un circuito con una tensión de alimentación de 5 voltios y necesitamos una tensión de 3 voltios, el divisor de tensión es la forma más sencilla de conseguirlo.
ca: Si tenim un circuit amb una tensió d’alimentació de 5 volts i necessitem una tensió de 3 volts, el divisor de tensió és la manera més fàcil d’aconseguir -la.

source: En la siguiente imagen podemos ver el circuito divisor de tensión.
ca: A la imatge següent podem veure el circuit de divisor de tensió.

source: Para resolver el circuito comenzamos escribiendo en la tabla los valores de las resistencias que conocemos, R1 y R2.
ca: Per resoldre el circuit comencem escrivint a la taula els valors de les resistències que coneixem, R1 i R2.

source: A continuación escribimos en la tabla los valores de tensión que conocemos, que en este caso será la tensión total de las dos resistencias R1 y R2 en serie, que coincide con la tensión de la pila.
ca: A continuació, escrivim a la taula els valors de tensió que coneixem, que en aquest cas serà la tensió total de les dues resistències R1 i R2 en sèrie, que coincideix amb la tensió de la pila.

source: Ahora debemos buscar si se puede solucionar alguna cuadrícula con las fórmulas que conocemos. La resistencia total R12 se puede calcular con la fórmula de las resistencias en serie, es decir, sumando las dos resistencias.
ca: Ara hem de mirar si podeu resoldre qualsevol graella amb les fórmules que coneixem. La resistència total R12 es pot calcular amb la fórmula de les resistències de la sèrie, és a dir, afegint les dues resistències.

source: Para continuar, en la última fila tenemos la tensión y la resistencia por lo que podemos hallar la intensidad con la ley de Ohm. Dividiendo la tensión entre la resistencia obtenemos 20 mili amperios de corriente.
ca: Per continuar, a la darrera fila tenim tensió i resistència per tal de trobar la intensitat amb la llei d’Ohm. Dividint la tensió entre la resistència, obtenim 20 amplificadors de corrent.

source: Ahora podemos aplicar la ley de los circuitos en serie que dice que la corriente será la misma por todos los componentes del circuito.
ca: Ara podem aplicar la llei dels circuits de la sèrie que diu que el corrent serà el mateix per a tots els components del circuit.

source: Para terminar, con la ley de Ohm podemos hallar las tensiones en cada una de las resistencias multiplicando la corriente por la resistencia.
ca: Finalment, amb la llei d'Ohm, podem trobar les tensions en cadascuna de les resistències multiplicant el corrent per resistència.

source: Y el circuito está resuelto por completo.
ca: I el circuit es resol completament.

source: La tensión de la resistencia R2 será igual a 2 voltios, una tensión menor que la tensión de alimentación porque este circuito ha **dividido** la tensión de alimentación entre 6.
ca: La tensió de resistència R2 serà igual a 2 volts, una tensió inferior a la tensió d’alimentació perquè aquest circuit ha dividit ** la tensió d’alimentació entre 6.

source: Divisor de tensión con dos resistencias desconocidas
ca: Divisor de tensió amb dues resistència desconeguda

source: En este apartado vamos a resolver un circuito en serie en el que no conocemos el valor de las resistencias, solo conocemos la corriente que circula por el circuito (10mA) y la tensión que queremos obtener en R2 (9V).
ca: En aquesta secció solucionarem un circuit en sèrie en el qual no coneixem el valor de les resistències, només coneixem el corrent que circula pel circuit (10m) i la tensió que volem obtenir en R2 (9V).

source: Comenzamos por rellenar la tabla con los valores que conocemos del circuito.
ca: Comencem omplint la taula amb els valors que coneixem del circuit.

source: A continuación podemos calcular la resistencia total R12 aplicando la ley de Ohm.
ca: A continuació, podem calcular la resistència total R12 aplicant la llei d'Ohm.

source: Para poder continuar, aplicamos la ley de los componentes en serie que dice que la corriente por todos los elementos del circuito es la misma.
ca: Per continuar, apliquem la llei dels components de la sèrie que diu que el corrent per tots els elements del circuit és el mateix.

source: Ahora podemos aplicar de nuevo la ley de Ohm a la segunda resistencia para hallar su valor.
ca: Ara podem tornar a aplicar la llei d’Ohm a la segona resistència per trobar el seu valor.

source: En este punto podemos continuar aplicando la ley de los circuitos en serie que dice que la tensión total de las resistencias es igual a la suma de las tensiones en cada resistencia.
ca: En aquest moment podem continuar aplicant la llei dels circuits de la sèrie que diu que la tensió total de les resistències és igual a la suma de les tensions de cada resistència.

source: Es decir: V_R1 + V_R2 = 12v -> V_R1 = 12v - 9v = 3v
ca: És a dir: v_r1 + v_r2 = 12v -> v_r1 = 12v - 9v = 3V

source: Para terminar, aplicamos la ley de Ohm a la primera resistencia y hallamos su valor.
ca: Finalment, apliquem la llei d’Ohm a la primera resistència i trobem el seu valor.

source: En esta última casilla también podríamos haber aplicado la fórmula del equivalente de las resistencias en serie. Sabiendo que R1 + R2 = R12, se puede calcular fácilmente que R1 debe valer 300 Ohmios.
ca: En aquesta darrera caixa també podríem haver aplicat la fórmula de l’equivalent a les resistències de la sèrie. Sabent que R1 + R2 = R12, es pot calcular fàcilment que R1 ha de valer 300 ohms.

source: Circuito mixto serie-paralelo
ca: Circuit paral·lel de sèries mixtes

source: En este apartado vamos a resolver un circuito mixto, con conexiones serie y paralelo, en el que conocemos el valor de todas las resistencias.
ca: En aquesta secció solucionarem un circuit mixt, amb connexions en sèrie i paral·leles, en què coneixem el valor de tota resistència.

source: Comenzamos por copiar en la tabla los valores de resistencia y tensión que ya conocemos.
ca: Comencem copiant a la taula els valors de resistència i tensió que ja coneixem.

source: A partir de aquí no tenemos datos para resolver ninguna de las tres primeras filas. La primera tarea será calcular la resistencia equivalente de las tres resistencias del circuito.
ca: A partir d’aquí no tenim dades per resoldre cap de les tres primeres files. La primera tasca serà calcular la resistència equivalent de les tres resistències del circuit.

source: Primero hallamos el paralelo de 100 Ohmios y de 400 Ohmios que nos da un resultado de 80 Ohmios.
ca: Primer trobem el paral·lel de 100 ohms i 400 ohms que ens proporciona el resultat de 80 ohms.

source: A continuación calculamos el equivalente en serie de la resistencia R1, con 120 Ohmios, y del resultado anterior, 80 Ohmios. Sumando ambos nos da un resultado total de 200 Ohmios, que podemos escribir en el hueco correspondiente a la resistencia R123.
ca: A continuació, calculem l’equivalent en la resistència a la sèrie R1, amb 120 ohms, i el resultat anterior, 80 ohms. Afegir tots dos ens dóna un resultat total de 200 ohms, que podem escriure al forat corresponent a la resistència R123.

source: Ahora podemos aplicar la ley de Ohm a la cuarta fila para hallar la intensidad total que circula por el circuito, 60 miliamperios.
ca: Ara podem aplicar la llei d’Ohm a la quarta fila per trobar la intensitat total que circula pel circuit, 60 mil·límetres.

source: Toda la corriente que circula por el circuito circulará por R1 al estar en serie. Con este dato podemos rellenar la corriente de R1 copiando la corriente total.
ca: Tot el corrent que circula pel circuit circularà per R1 per ser sèries. Amb aquestes dades, podem omplir el corrent R1 copiant el corrent total.

source: En este punto podemos aplicar la ley de Ohm a la primera fila para calcular la tensión en la resistencia R1.
ca: En aquest moment podem aplicar la llei d’Ohm a la primera fila per calcular la tensió en resistència R1.

source: La tensión total de la pila, 12v, será igual a la suma de las tensiones de las dos ramas en serie del circuito, R1 y R23.
ca: La tensió total de la pila, de 12V, serà igual a la suma de les tensions de les dues sèries de circuits, R1 i R23.

source: Despejando tenemos que la tensión en las resistencias R2 y R3 es de 12v - 7.2v = 4.8v, que podemos escribir en las casillas correspondientes.
ca: Esborrant hem de tensió en resistències R2 i R3 és de 12V - 7.2V = 4.8V, que podem escriure a les caixes corresponents.

source: Ahora podemos aplicar la ley de Ohm a la segunda y tercera filas para terminar de calcular los valores de intensidad que aún no conocemos.
ca: Ara podem aplicar la llei d’Ohm a la segona i tercera files per acabar de calcular els valors d’intensitat que encara no sabem.

source: Para terminar comprobaremos que la suma de las corrientes en R2 y en R3 es igual a la corriente total que circula por el circuito.
ca: Finalment, comprovarem que la suma dels corrents en R2 i en R3 és igual al corrent total que circula pel circuit.

source: 60 mA = 48 mA + 12 mA.
ca: 60 mA = 48 mA + 12 m.

source: Ejercicios
ca: Exercicis

source: Ejercicios para resolver circuitos.
ca: Exercicis per resoldre circuits.

source: :download:`Ejercicios para resolver circuitos. Formato PDF <electric/electric-resolver-circuitos.pdf>`
ca: : Descarregueu: `Exercicis per resoldre circuits. PDF <Electric-Elèctric-Resolver-Circuito Format.pdf> `

source: :download:`Ejercicios para resolver circuitos. Formato KiCad <electric/electric-resolver-circuitos.zip>`
ca: : Descarregueu: `Exercicis per resoldre circuits. KICAD <Electric-Elèctric-Resolve-Circuito. Zip> '

source: Cuestionarios
ca: Qüestionaris

source: Cuestionarios sobre resolución de circuitos.
ca: Qüestionaris sobre resolució de circuits.

source: `Cuestionario. Resolver circuitos I. <../test/es-electric-resolver-circuitos-1.html>`__
ca: `Qüestionari. Resol Circuits I. <../test/Es-Elèctric-Resolve-Circuitos-1.html>`__

source: `Cuestionario. Resolver circuitos II. <../test/es-electric-resolver-circuitos-2.html>`__
ca: `Qüestionari. Resoldre circuits II. <../test/es-elèctric-resolucions-circuitos-2.html>`__
