Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/electric-simulador-corriente.po
Languages: ca

source: :index:`Corriente eléctrica`
ca: : Índex: `Corrent elèctric '

source: La **intensidad de corriente** eléctrica es la cantidad de electrones que circulan por un conductor cada segundo.
ca: La intensitat de potència ** ** és la quantitat d’electrons que circulen per un conductor cada segon.

source: En el simulador eléctrico la intensidad de corriente se representa con **puntos amarillos** que se mueven a través del conductor con más o menos velocidad. Cuanto más rápido se mueven los puntos, más intensidad de corriente representan.
ca: Al simulador elèctric, la intensitat actual es representa amb ** punts grocs ** que es mouen pel conductor amb més o menys velocitat. Com més ràpid es mouen els punts, més intensitat actual representen.

source: La intensidad de corriente está relacionada con la tensión del generador. En la siguiente simulación podemos ver tres pilas de diferente tensión conectadas a tres lámparas iguales:
ca: La intensitat actual està relacionada amb la tensió del generador. A la següent simulació podem veure tres bateries de tensió diferents connectades a tres làmpades iguals:

source: La pila de mayor tensión impulsa los electrones con mayor energía, por lo que tiene más intensidad de corriente.
ca: La bateria de major tensió condueix electrons amb major energia, de manera que té més intensitat de corrent.

source: Por el contrario, la pila de menor tensión impulsa los electrones con menor energía, por lo que tiene menos intensidad de corriente.
ca: Per contra, la bateria de tensió més baixa condueix electrons amb menys energia, de manera que té menys intensitat de corrent.

source: :index:`Amperios`
ca: : Índex: `Ampperios '

source: La corriente eléctrica se mide en **amperios**, abreviado con la letra [A]. Como esta unidad es relativamente grande, en ocasiones se utiliza un submúltiplo mil veces menor, el **miliamperio**, acortado como [mA]. En la siguiente tabla aparecen las corrientes típicas de varios componentes comunes de nuestro entorno:
ca: El corrent elèctric es mesura en ** amplificadors **, abreviada amb la lletra [a]. Com que aquesta unitat és relativament gran, de vegades s’utilitza un submultipli mil vegades més baix, el ** Miliamperio **, escurçat com a [ma]. A la taula següent apareixen els corrents típics de diversos components comuns del nostre entorn:

source: Componente
ca: Component

source: Corriente [A]
ca: Actual [a]

source: Led indicador de encendido.
ca: Indicador d’encesa LED.

source: 10 miliamperios
ca: 10 mil·límetres

source: Linterna led.
ca: Llanterna Lant.

source: 100 miliamperios
ca: 100 mil·límetres

source: Teléfono inteligente funcionando.
ca: Funcionament per a telèfons intel·ligents.

source: Calentador eléctrico de aire.
ca: Escalfador elèctric d’aire.

source: 10 amperios
ca: 10 amperis

source: :index:`Amperímetro`
ca: : Índex: `amperímetre '

source: Un **amperímetro** es un aparato eléctrico que permite medir la intensidad de corriente que circula por un circuito. El amperímetro se conecta siempre en serie con el elemento que se desea medir, por lo que es necesario cortar el circuito para poder insertarlo.
ca: A ** Amperímetre ** és un aparell elèctric que permet mesurar la intensitat de corrent que circula per un circuit. L’amperímetre sempre està connectat en sèrie amb l’element que voleu mesurar, de manera que cal tallar el circuit per poder -lo inserir.

source: Para simular un amperímetro debemos escogerlo desde el menú ``Dibujar``... ``Medidores y Etiquetas``... ``Añadir Amperímetro``.
ca: Per simular un amperímetre l’hem de triar entre el `` dibuixar `` ...

source: En el siguiente circuito simulado, añade **tres amperímetros** que midan la corriente que circula por cada una de las tres lámparas del circuito:
ca: Al circuit simulat següent, afegiu ** tres amperimeters ** que mesura el corrent que circula per cadascuna de les tres làmpades del circuit:

source: Ejercicios
ca: Exercicis

source: ¿Qué es la intensidad de corriente eléctrica?
ca: Quina és la intensitat del corrent elèctric?

source: ¿Cómo se relaciona la intensidad de corriente con la tensión eléctrica?
ca: Com es relaciona la intensitat del corrent amb la tensió elèctrica?

source: ¿Qué corriente en amperios consumen circuitos típicos de nuestro entorno? Nombra al menos tres.
ca: Quin corrent en els amplificadors consumeix circuits típics del nostre entorn? Poseu un nom a tres.

source: ¿Qué es un amperímetro? ¿Cómo se debe conectar para medir corriente?
ca: Què és un amperímetre? Com us heu de connectar per mesurar el corrent?
