Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/electric-rele.po
Languages: ca

source: Los relés
ca: Els relés

source: Los relés son los primeros aparatos eléctricos utilizados en la automatización eléctrica.
ca: Els relés són els primers dispositius elèctrics utilitzats en l’automatització elèctrica.

source: En esta unidad estudiaremos la historia del relé, su funcionamiento, los esquemas eléctricos más usuales y diversos tipos de relés.
ca: En aquesta unitat estudiarem la història del relé, la seva operació, els esquemes elèctrics més habituals i diversos tipus de relés.

source: :download:`El relé. Formato PDF <electric/componentes-rele/electric-reles.pdf>`
ca: : Descarregueu: `El relé. Format PDF <Electric/Components-Rele/Electric-Reles.pdf> `

source: :download:`El relé. Formato editable DOC <electric/componentes-rele/electric-reles.doc>`
ca: : Descarregueu: `El relé. Format editable Doc <Electric/Components-Rele/Electric-Reles.Doc> `

source: Qué es un relé
ca: Què és un relé

source: Es un aparato electromecánico con dos componentes: la bobina y los contactos. La bobina recibe una pequeña corriente eléctrica a baja tensión en el circuito de mando y mueve los contactos que hacen de interruptores de mayor corriente y tensión en el circuito de potencia.
ca: És un dispositiu electromecànic amb dos components: la bobina i els contactes. La bobina rep un petit corrent elèctric de baixa tensió al circuit de control i mou els contactes que fan interruptors de corrent i tensió més grans al circuit de potència.

source: Esquema de un relé
ca: Esquema d’un relé

source: `Digigalos <https://commons.wikimedia.org/wiki/File:Relay_principle_horizontal_new.gif>`__, `CC BY-SA 3.0 <https://creativecommons.org/licenses/by/3.0/deed.en>`__, via Wikimedia Commons.
ca: `Digig-los <https://commons.wikimedia.org/wiki/file:Relay_principice_horizontal_new.gif>` __, `cc bya 3.0 <https://creativecommons.org/licenses/by/3.0/deed.en>` `` `` `` `` `` `` `` `` `` `` `` `` ` `` `` `` `` `` `` `` `` ``

source: De esta forma conseguimos que una pequeña corriente eléctrica sea capaz de mover circuitos de mucha potencia.
ca: D’aquesta manera aconseguim un petit corrent elèctric per poder moure circuits d’alta potència.

source: Funcionamiento del relé
ca: Funcionament del relé

source: En el siguiente esquema podemos ver el circuito de un relé en funcionamiento.
ca: En el següent esquema podem veure el circuit d’un relé en funcionament.

source: El **circuito de mando** se encuentra a la izquierda y se compone de una pila de 12 voltios, un pulsador y la bobina del relé. Cuando se presiona el pulsador, la corriente llega a la bobina y esta activa el contacto (interruptor) de potencia.
ca: El circuit de control ** ** es deixa i està compost per una pila de 12 volts, un botó i la bobina del relé. Quan es prem el botó, el corrent arriba a la bobina i s’activa l’alimentació (commutador).

source: El **circuito de potencia** se compone de un contacto del relé, un generador de corriente alterna de 230 voltios y un motor. Cuando el contacto se cierra, llega la tensión al motor y se pone en marcha.
ca: El circuit de potència ** ** consisteix en un contacte de relé, un generador de corrent altern de 230 volts i un motor. Quan el contacte es tanca, el motor arriba al motor i comença.

source: Circuito de un relé alimentado a 12 voltios que acciona un motor de 230 voltios.
ca: Circuit d’un relé alimentat a 12 volts que actua amb un motor de 230 volts.

source: Una ventaja de este diseño consiste en que el pulsador tiene una tensión segura para las personas, separada de la alta tensión del motor que es más apropiada para suministrar grandes potencias.
ca: Un avantatge d’aquest disseny és que el botó té una tensió segura per a les persones, separada de l’alta tensió del motor més adequada per subministrar grans potències.

source: Relé realimentado
ca: Relé gravat

source: Un relé tiene varios contactos, algunos normalmente abiertos y otros normalmente cerrados. Estos contactos se pueden utilizar para realimentar el circuito de mando de manera que permanezca funcionando una vez que se ha activado el relé.
ca: Un relé té diversos contactes, alguns normalment oberts i d’altres normalment tancats. Aquests contactes es poden utilitzar per alimentar el circuit de control de manera que es mantingui funcionant un cop activat el relé.

source: En el siguiente esquema podemos ver un relé con funcionamiento de marcha y parada. El pulsador de marcha activa la bobina y una vez activada, los dos contactos K1 asociados al relé mantienen a la bobina con tensión y al motor en marcha aunque se deje de presionar el pulsador de marcha.
ca: En el següent esquema podem veure un relé amb progrés i funcionament de parada. El botó de marxa activa la bobina i un cop activat, els dos contactes K1 associats al relé mantenen la bobina amb tensió i el motor en funcionament, fins i tot si s’atura el botó de març.

source: Esquema de un relé con pulsadores de marcha y de parada que acciona un motor de 230 voltios.
ca: Esquema d’un relé amb botons de març i parada que actua amb un motor de 230 volts.

source: Para que el circuito pare, habrá que presionar el pulsador de parada. La bobina dejará de tener corriente y los dos contactos K1 se abren parando el circuito.
ca: Perquè el circuit s’aturi, haureu de prémer el botó STOP. La bobina deixarà de tenir corrent i els dos contactes K1 s’obren aturant el circuit.

source: Relé oscilador
ca: Relé oscil·lador

source: En este caso la realimentación se hará con un contacto normalmente cerrado del relé K1. Cuando se presione el pulsador S1, la corriente circulará por la bobina. La bobina actuará moviendo los contactos y el contacto K1 normalmente cerrado se abrirá. Al abrirse este contacto, dejará de circular corriente por la bobina. La bobina dejará de actuar, con lo que el contacto K1 volverá a cerrarse permitiendo otra vez que circule la corriente por la bobina.
ca: En aquest cas, la retroalimentació es farà amb un contacte normalment tancat del relé K1. Quan es prem el botó S1, el corrent circularà per la bobina. La bobina actuarà movent els contactes i s’obrirà el contacte K1 normalment tancat. Quan s’obri aquest contacte, deixarà de circular el corrent per la bobina. La bobina deixarà d’actuar, de manera que el contacte K1 es tancarà de nou permetent que el corrent circuli de nou.

source: Relé oscilador con un contacto normalmente cerrado.
ca: Relé oscil·lador amb contacte normalment tancat.

source: El resultado será una oscilación en la que el relé vibrará una y otra vez abriendo y cerrando sus contactos a toda la velocidad que le permita su diseño.
ca: El resultat serà una oscil·lació en què el relé vibrarà una i altra vegada obrint i tancant els seus contactes a tota la velocitat que permet el seu disseny.

source: Historia del relé
ca: Història del relé

source: El relé se inventó en 1835 y comenzó a utilizarse en telegrafía para amplificar las señales de larga distancia. Como el relé es capaz de controlar una potencia de salida mayor que la de entrada puede considerarse un amplificador que permitía aumentar la calidad de las señales telegráficas.
ca: El relé es va inventar el 1835 i es va començar a utilitzar en telegrafia per amplificar els senyals de llarga distància. Com que el relé és capaç de controlar una potència de sortida més gran que la de l’entrada, es pot considerar un amplificador que permeti augmentar la qualitat dels senyals telegràfics.

source: En 1941 Konrad Zuse construyo la primera computadora a base de relés. Los relés se sustituyeron posteriormente por válvulas de vacío, mucho más rápidas. A partir del año 1954 se comenzaron a usar los transistores, más rápidos aún y mucho más fiables. Actualmente se siguen utilizando los transistores en los ordenadores y en multitud de aparatos electrónicos.
ca: El 1941, Konrad Zuse va construir el primer ordinador basat en relé. Els relés van ser substituïts posteriorment per vàlvules de buit, molt més ràpidament. A partir de l'any 1954, els transistors van començar a utilitzar -se, més ràpid i molt més fiable. Actualment, els transistors encara s’utilitzen en ordinadors i en molts dispositius electrònics.

source: Si bien los relés ya no se utilizan como base de los ordenadores, todavía hoy en día se usan con frecuencia en automatismos para controlar motores y otros elementos de gran potencia. Ejemplos se pueden encontrar en las casas para mover los ascensores, las bombas de agua o el temporizador de luz de la escalera.
ca: Tot i que els relés ja no s’utilitzen com a base dels ordinadors, encara avui s’utilitzen sovint en automatisme per controlar motors i altres elements de gran potència. Podeu trobar exemples a les cases per moure els ascensors, les bombes d’aigua o el temporitzador de la llum de l’escala.

source: Contactores
ca: Contactors

source: Los contactores son relés especiales de gran potencia que sirven para mover motores trifásicos, es decir, que tienen tres líneas de alimentación de corriente.
ca: Els contactors són relés especials d’alta potència que serveixen per moure motors de tres fases, és a dir, tenen tres línies elèctriques actuals.

source: En el siguiente dibujo se puede ver el esquema de un contactor alimentando un motor trifásico. En este circuito se puede apreciar el valor de los relés para manejar grandes potencias y conmutar muchos circuitos con una pequeña señal de baja tensión.
ca: Al dibuix següent podeu veure l’esquema d’un contactor que alimenta un motor de tres fases. En aquest circuit podeu veure el valor dels relés per gestionar grans potències i commutar molts circuits amb un petit senyal de baixa tensió.

source: Ejercicios
ca: Exercicis

source: ¿Qué es un relé y para qué sirve?
ca: Per a què serveix un relé i per a què serveix?

source: Dibuja el esquema de un relé que encienda una bombilla de 125 Voltios desde un pulsador alimentado a 24V.
ca: Dibuixa l’esquema d’un relé que s’encén una bombeta de 125 volts d’una pols alimentada a 24V.

source: Dibuja el esquema de un relé que encienda una resistencia de 23 Ohmios alimentada a 220V con dos pulsadores, uno de marcha y otro de parada. Explica cómo funciona el circuito.
ca: Dibuixa l’esquema d’un relé que s’encén una resistència de 23 ohms a 220V amb dos botons, un març i una parada. Expliqueu com funciona el circuit.

source: Dibuja los dos estados de un relé oscilador mientras se presiona el pulsador.
ca: Dibuixeu els dos estats d’un relé oscil·lador mentre premeu el botó.

source: ¿Qué usos ha tenido el relé a lo largo de la historia? ¿Para qué se utiliza en la actualidad?
ca: Quins usos ha tingut el relé al llarg de la història? Per què s’utilitza avui?

source: ¿Qué componentes electrónicos sustituyeron al relé?
ca: Quins components electrònics van substituir el relé?

source: ¿Qué es un contactor y por qué se utiliza?
ca: Què és un contactor i per què s’utilitza?

source: Dibuja el esquema de un contactor que haga funcionar siempre un motor hasta que se pulse un contacto normalmente cerrado.
ca: Dibuixa l’esquema d’un contactor que sempre funciona un motor fins que es pressioni un contacte normalment tancat.
