Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/electronic-bjt-common-b.po
Languages: ca

source: El transistor en base común
ca: Transistor a la base comuna

source: En esta configuración el transistor tiene la base conectada a una tensión fija. La señal de entrada llega por el emisor del transistor y la señal amplificada sale por el colector del transistor.
ca: En aquesta configuració, el transistor té la base connectada a una tensió fixa. El senyal d’entrada arriba per l’emissor del transistor i el senyal amplificat surt a través del col·leccionista del transistor.

source: Esquema simplificado de un transistor NPN en base común.
ca: Esquema simplificat d’un transistor NPN de forma comuna.

source: Esta configuración permite amplificar la tensión de entrada manteniendo la corriente igual. Este funcionamiento es útil en etapas de entrada de señal desde un componente que genere poca tensión, pero con corrientes relativamente altas.
ca: Aquesta configuració permet amplificar la tensió d’entrada mantenint el corrent igual. Aquesta operació és útil en etapes d’entrada de senyal d’un component que genera poca tensió, però amb corrents relativament alts.

source: Un ejemplo de aplicación práctica es amplificar la señal inducida en una bobina. Por ejemplo, amplificar el sonido captado por un altavoz, convirtiendo el altavoz en un micrófono.
ca: Un exemple d’aplicació pràctica és amplificar el senyal induït en una bobina. Per exemple, amplifiqueu el so capturat per un altaveu, convertint l'altaveu en un micròfon.

source: A continuación puede verse una simulación de un transistor NPN en configuración de base común. El transistor amplifica una señal que entra por el emisor generando una señal con mucha mayor tensión que sale por el colector.
ca: A continuació es pot veure una simulació d’un transistor NPN en la configuració de base comuna. El transistor amplifica un senyal que entra a través de l’emissor generant un senyal amb tensió molt més gran que surt del col·leccionista.

source: La función de cada uno de los componentes es la siguiente:
ca: La funció de cadascun dels components és la següent:

source: El **generador de señal alterna** genera una pequeña señal de entrada de 0.050 voltios de pico.
ca: El generador de senyal alternatiu ** ** genera un petit senyal d’entrada de 0,050 volts de pic.

source: Las **resistencias R1 y R2** mantienen una tensión fija en la base que **polariza al transistor** para que funcione siempre con corrientes positivas, a pesar de que la tensión de entrada sea tanto positiva como negativa.
ca: Les resistències ** R1 i R2 ** mantenen una tensió fixa a la base que ** polaritza el transistor ** per treballar sempre amb corrents positius, malgrat que la tensió d’entrada és positiva i negativa.

source: El **transistor NPN** recibe una señal de pequeña tensión por el emisor, que produce una corriente en el emisor. El transistor transfiere esa corriente del emisor al colector, donde la resistencia R3 convierte la corriente en una tensión mayor que la tensión de entrada.
ca: El transistor ** NPN ** rep un senyal de tensió petita per l'emissor, que produeix un corrent a l'emissor. Les transferències del transistor que emeten corrent al col·lector, on la resistència R3 converteix el corrent en una tensió superior a la tensió d’entrada.

source: En esta etapa no hay amplificación de corriente, solo de tensión.
ca: En aquesta fase no hi ha cap amplificació de corrent, només tensió.

source: La **resistencia R3** recibe la corriente del colector y la convierte en tensión de salida. Cuanto mayor sea esta resistencia, mayor será la tensión de salida y, por lo tanto, la amplificación de tensión de la etapa.
ca: La resistència ** R3 ** rep el corrent del col·lector i el converteix en tensió de sortida. Com més alta sigui aquesta resistència, més gran és la tensió de sortida i, per tant, l’amplificació de la tensió de l’etapa.

source: Ejercicios
ca: Exercicis

source: Dibuja un esquema simplificado de un transistor NPN trabajando en configuración de base común, mostrando por dónde llega la señal de entrada y por dónde sale la señal amplificada.
ca: Dibuixa un esquema simplificat d’un transistor NPN que funciona en la configuració de base comuna, mostrant on arriba el senyal d’entrada i on surt el senyal amplificat.

source: Dibuja un esquema realista de un transistor NPN trabajando en configuración de base común.
ca: Dibuixa un esquema realista d’un transistor NPN que treballa en la configuració de base comuna.

source: ¿Cuál es la función principal de un transistor funcionando en configuración de base común?
ca: Quina és la funció principal d’un transistor que funciona en la configuració de base comuna?

source: ¿Para qué sirven las resistencias R1 y R2?
ca: Per a què serveixen les resistències R1 i R2?

source: ¿Para qué sirve la resistencia R3?
ca: Per a què serveix la resistència R3?

source: ¿Qué ganancia de tensión tiene la etapa simulada?
ca: Quin guany de tensió té l’etapa simulada?

source: Para calcular la ganancia de tensión es necesario dividir la variación de tensión en la salida entre la variación de la tensión en la entrada.
ca: Per calcular el guany de tensió, cal dividir la variació de tensió en la sortida entre la variació de la tensió a l’entrada.

source: Ganancia\_V = \cfrac{V_{out\_max} - V_{out\_min}}{ V_{in\_max} - V_{in\_min}}
ca: Profit\_V = \cfrac{V_{out\_max} - V_{out\_min}}{ V_{in\_max} - V_{in\_min}}

source: Puedes obtener los valores de tensión necesarios de los osciloscopios que se encuentran en la parte inferior del simulador.
ca: Podeu obtenir els valors de tensió necessaris dels oscil·loscopis que es troben a la part inferior del simulador.

source: Si modificamos R3 con un valor de 500 Ohm y R1 con un valor de 8 kOhm, ¿Qué le ocurre a la señal de salida del circuito? ¿Por qué crees que ocurre esto?
ca: Si modifiquem R3 amb un valor de 500 ohm i R1 amb un valor de 8 kohm, què passa amb el senyal de sortida del circuit? Per què creus que passa això?
