Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/electronic-operational-peakdetector.po
Languages: ca

source: El detector de pico
ca: El Detector de Peak

source: El detector de pico es un circuito que mantiene en su salida el valor de pico de tensión que se encuentra en la entrada. Está compuesto por un rectificador de precisión de media onda y por un filtro RC a la salida, que memoriza el mayor nivel de tensión de la salida del rectificador.
ca: El detector de pic és un circuit que manté el valor màxim de tensió a l’entrada. Està compost per un rectificador de precisió de mitja onada i un filtre RC a la sortida, que memoritza el nivell de tensió més alt de la sortida del rectificador.

source: Esquema del detector de pico.
ca: Esquema de detector màxim.

source: Funcionamiento
ca: Operació

source: El diodo a la salida del amplificador operacional impide que este pueda entregar corriente negativa. Como el operacional solo podrá entregar tensión y corriente positivas, el condensador de salida subirá de tensión hasta igualar la máxima tensión de entrada y mantendrá esta tensión.
ca: El díode a la sortida de l'amplificador operatiu impedeix que es faci un corrent negatiu. Com que l’operació només pot aportar tensió i corrent positius, el condensador de sortida pujarà a la tensió fins que la tensió màxima d’entrada sigui igualada i mantindrà aquesta tensió.

source: La resistencia de 10k hará que el condensador se descargue poco a poco y que su tensión tienda a valer cero voltios.
ca: La resistència de 10k farà que el condensador es descarregui a poc a poc i que la seva tensió valgui zero volts.

source: De esta manera la tensión máxima de entrada, o valor de pico, se almacenará por un tiempo en el condensador, que poco a poco va a perder esa tensión máxima para adaptarse a otros picos de menor tensión que lleguen más tarde.
ca: D’aquesta manera, la tensió d’entrada màxima o el valor màxim, s’emmagatzemarà durant un temps al condensador, que perdrà gradualment aquesta tensió màxima per adaptar -se a altres cims més petits que arriben més endavant.

source: Simulación
ca: Simulació

source: En la siguiente simulación podemos ver un **detector de pico** al que le llega una tensión alterna de amplitud modulada. La tensión máxima de entrada se refleja en el valor de salida del circuito.
ca: A la simulació següent podem veure un detector de pic ** ** al qual arriba una tensió alternativa d’amplitud modulada. La tensió d’entrada màxima es reflecteix en el valor de sortida del circuit.

source: Ejercicios
ca: Exercicis

source: Dibuja el esquema de un detector de pico.
ca: Dibuixa l’esquema d’un detector de pic.

source: ¿Qué tipo de realimentación tiene el detector de pico y por qué?
ca: Quin tipus de comentaris té el detector de bec i per què?

source: ¿Qué función realiza un circuito detector de pico?
ca: Quina funció fa un circuit de detector pic?

source: ¿Qué ganancia de tensión tendrá un detector de pico y por qué?
ca: Quin guany de tensió tindrà un detector de pic i per què?

source: Modifica la simulación anterior del detector de pico para hacer un circuito demodulador:
ca: Modifiqueu la simulació anterior del detector de bec per fer un circuit demodulador:

source: Aumenta la frecuencia de la señal portadora de Amplitud Modulada hasta 1000 Hz.
ca: Augmenta la freqüència del senyal del portador d’amplitud fins a 1000 Hz.

source: Disminuye el valor del condensador hasta que la señal de salida sea igual a la envolvente de la señal de entrada.
ca: Disminuir el valor del condensador fins que el senyal de sortida sigui igual al sobre del senyal d’entrada.

source: Dibuja un gráfico de la tensión de entrada y otro gráfico con la tensión de salida.
ca: Dibuixeu un gràfic de la tensió d’entrada i un altre gràfic amb la tensió de sortida.

source: ¿Qué ocurre si cambiamos el sentido del diodo? Simula el cambio para comprobar el nuevo funcionamiento.
ca: Què passa si canviem el significat del díode? Simula el canvi per comprovar la nova operació.

source: ¿Cómo podríamos denominar a este nuevo circuito?
ca: Com podríem anomenar aquest nou circuit?
