Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/electric-energia.po
Languages: ca

source: :index:`Energía`
ca: :index:`Energia`

source: La energía es muy importante en nuestra sociedad porque nos permite satisfacer necesidades básicas diarias, como disponer de luz, cocinar nuestros alimentos, calentar nuestras casas y transportarnos a diferentes lugares.
ca: L’energia és molt important a la nostra societat perquè ens permet satisfer les necessitats bàsiques diàries, com tenir llum, cuinar el nostre menjar, escalfar les nostres cases i transportar -nos a diferents llocs.

source: El uso excesivo de las energías fósiles (petróleo, gas natural y carbón) está generando una crisis climática que nos obliga a cambiar nuestras fuentes tradicionales de energía por otras menos contaminantes y más sostenibles, como pueden ser la energía solar o la eólica.
ca: L’ús excessiu d’energies fòssils (petroli, gas natural i carbó) està generant una crisi climàtica que ens obliga a canviar les nostres fonts d’energia tradicionals per a altres menys contaminants i més sostenibles, com l’energia solar o eòlica.

source: Comenzaremos estudiando las diferentes formas o manifestaciones de la energía y cuáles son las fuentes de energía primaria que utilizamos, para terminar estudiando en detalle la energía eléctrica.
ca: Començarem a estudiar les diferents formes o manifestacions d’energia i quines són les fonts d’energia primàries que utilitzem, per acabar estudiant amb detall l’electricitat.

source: Índice de contenidos:
ca: Índex de contingut:

source: Formas de energía
ca: Formes d’energia

source: La energía es la capacidad de realizar trabajo o de producir cambios.
ca: L’energia és la capacitat de fer feina o produir canvis.

source: Existen muchas formas o manifestaciones de la energía. Cada una tiene características diferentes, pero todas ellas pueden convertirse en trabajo o movimiento, luz, calor, sonido u otros efectos útiles para nosotros.
ca: Hi ha moltes formes o manifestacions d’energia. Cadascun té característiques diferents, però totes poden convertir -nos en treball o moviment, llum, calor, so o altres efectes útils per a nosaltres.

source: A continuación veremos las formas más comunes de la energía y las que más se utilizan usualmente.
ca: A continuació, veurem les formes d’energia més comunes i les que s’utilitzen més.

source: Energía potencial
ca: Energia potencial

source: Es la energía que tiene un objeto debido a su **posición** en un campo gravitatorio [#f1]_.
ca: És l’energia que té un objecte degut a la seva posició ** ** en un camp gravitatori [#f1] _.

source: Por ejemplo, un objeto que se encuentre en una posición elevada tiene energía potencial gracias a la gravedad de la Tierra. Si dejamos caer el objeto, esa energía potencial se transforma en energía cinética, con la que podría arrastrar otro objeto y realizar trabajo.
ca: Per exemple, un objecte que es troba en una posició elevada té energia potencial gràcies a la gravetat de la Terra. Si deixem l'objecte, aquesta energia potencial es transforma en energia cinètica, amb la qual un altre objecte podria arrossegar i realitzar treballs.

source: Las presas hidráulicas acumulan energía potencial en el agua cuando esta se almacena en una posición elevada. Al caer desde la presa, el agua transforma su energía potencial en cinética, que mueve una turbina. Finalmente la turbina mueve un alternador que produce energía eléctrica.
ca: Les preses hidràuliques acumulen energia potencial a l’aigua quan s’emmagatzema en una posició elevada. Quan cau de la presa, l’aigua transforma la seva energia potencial en cinètica, que mou una turbina. Finalment, la turbina mou un alternador que produeix electricitat.

source: Presa de arco de Aldeadávila desembalsando debido a una crecida del río.
ca: La presa de l'arc d'Aldeadávila bruta a causa d'una inundació del riu.

source: Energía cinética
ca: Energia cinètica

source: Es la energía que tiene un objeto debido a su **velocidad**.
ca: És l’energia que té un objecte a causa de la seva ** velocitat **.

source: Por ejemplo, una pelota lanzada a gran velocidad tendrá energía cinética y podrá desplazar otros objetos. La energía eólica es la energía cinética del aire en movimiento. Cuando un automóvil acelera, se transforma la energía química de la gasolina en energía cinética.
ca: Per exemple, una bola llançada a gran velocitat tindrà energia cinètica i pot moure altres objectes. L’energia eòlica és l’energia cinètica de l’aire en moviment. Quan un cotxe s’accelera, l’energia química de la gasolina en energia cinètica es transforma.

source: La Luna tiene energía cinética al orbitar alrededor de la Tierra. En las mareas de los océanos podemos observar cómo la energía cinética de la Luna se transfiere a la Tierra.
ca: La lluna té energia cinètica quan orbita al voltant de la terra. A les marees dels oceans podem veure com es transfereix l’energia cinètica de la lluna a la terra.

source: Aerogeneradores en Thornton Bank a 28km de la costa (off shore), en la parte belga del mar del norte.
ca: Els escalfadors a Thornton Bank a 28 km de la costa (fora de la costa), a la part belga del mar del Nord.

source: Energía mecánica
ca: Energia mecànica

source: Es la energía que se transmite mediante el **desplazamiento lineal** o el **giro** de una pieza mecánica de una máquina.
ca: És l’energia que es transmet per ** desplaçament lineal ** o ** gir ** d’una peça mecànica d’una màquina.

source: Por ejemplo, el eje de una batidora transmite la energía mecánica del motor a las cuchillas. La biela de un motor, que sube y baja, transmite energía mecánica desde el pistón hasta el cigüeñal para que este gire y mueva el automóvil.
ca: Per exemple, l’eix d’una batedora transmet l’energia mecànica del motor a les fulles. La barra de connexió, que puja i avança, transmet energia mecànica des del pistó al cigonyal de manera que gira i mou el cotxe.

source: Junta de cardan giratoria, utilizada para transmitir energía.
ca: Ringan Cardan Board, que s’utilitza per transmetre energia.

source: Energía térmica
ca: Energia tèrmica

source: Es una forma de energía asociada a la **temperatura** de un objeto. Se basa en el movimiento interno de los átomos y moléculas del objeto. Cuanto mayor es la temperatura de un objeto, más rápido se mueven sus partículas.
ca: És una forma d’energia associada a ** temperatura ** d’un objecte. Es basa en el moviment intern dels àtoms i molècules de l'objecte. Com més gran sigui la temperatura d’un objecte, més ràpid es mouen les seves partícules.

source: Es la forma de energía más degradada y más difícil de transformar, sobre todo si se encuentra a bajas temperaturas.
ca: És la forma d’energia més degradada i més difícil transformar, sobretot si es troba a temperatures baixes.

source: En todas las transformaciones de energía se producen pérdidas que se terminan convirtiendo en energía térmica.
ca: En totes les transformacions d’energia, hi ha pèrdues que acaben convertint -se en energia tèrmica.

source: Un ejemplo de energía térmica es la transformación que se produce en una caldera de calefacción. La energía química del gas natural se transforma en calor a alta temperatura durante la combustión, lo que sirve para calentar los edificios.
ca: Un exemple d’energia tèrmica és la transformació que es produeix en una caldera de calefacció. L’energia química del gas natural es transforma en alta temperatura durant la combustió, que serveix per escalfar els edificis.

source: Fuego de cocina a gas.
ca: Incendi de cuina de gas.

source: Energía química
ca: Energia química

source: Es la energía que se encuentra en los **enlaces químicos** de los combustibles, de los alimentos o de las baterías.
ca: És l’energia que es troba en els enllaços químics ** de combustibles, aliments o bateries.

source: Para liberar esta energía es necesario provocar reacciones químicas, que en la mayoría de los casos consisten en combinar combustibles con oxígeno. Eso es lo que hacemos los animales cuando convertimos la grasa y los carbohidratos de los alimentos en movimiento y calor para seguir con vida. Los combustibles fósiles son sustancias que producen energía al combinarse con el oxígeno del aire. Por ejemplo, al quemar carbón o gasolina se produce energía térmica.
ca: Per alliberar aquesta energia és necessari provocar reaccions químiques, que en la majoria dels casos consisteixen a combinar combustibles amb oxigen. Això és el que fan els animals quan convertim hidrats de carboni de greixos i aliments en moviment i calor per mantenir -nos vius. Els combustibles fòssils són substàncies que produeixen energia quan es combinen amb l’oxigen de l’aire. Per exemple, l’energia tèrmica es produeix a l’hora de cremar carbó o gasolina.

source: También encontramos este tipo de energía química en las baterías recargables y en las de un solo uso. En este caso, en las reacciones no interviene el oxígeno.
ca: També trobem aquest tipus d’energia química en bateries recarregables i en un sol ús. En aquest cas, l’oxigen no intervé en les reaccions.

source: Surtidor de gasolina cargando el depósito de un automóvil.
ca: El proveïdor de gasolina que porta el dipòsit d’un cotxe.

source: Energía nuclear
ca: Energia nuclear

source: Es la energía interna de los átomos que se libera en las reacciones de **fusión** y de **fisión** nuclear.
ca: És l’energia interna dels àtoms que s’allibera a les reaccions ** de fusió ** i ** fissió ** nuclear.

source: Ejemplos de esta energía son la energía del Sol, que se produce por la fusión de sus átomos de hidrógeno, y la energía de una central nuclear, que fisiona los átomos de uranio. La energía geotérmica de la Tierra también proviene de la energía nuclear del uranio que se encuentra en su interior.
ca: Exemples d’aquesta energia són l’energia del Sol, que es produeix per la fusió dels seus àtoms d’hidrogen i l’energia d’una central nuclear, que fixeix els àtoms d’urani. L’energia geotèrmica de la Terra també prové de l’energia nuclear de l’urani que es troba dins.

source: Central nuclear de José Cabrera en Guadalajara.
ca: Planta d'energia nuclear de José Cabrera a Guadalajara.

source: Energía radiante
ca: Energia radiant

source: Es la energía que está presente en la **luz** o en las **microondas** de radio.
ca: És l’energia que hi ha present a la llum ** ** o a la ràdio ** **.

source: Es fundamental, porque es la mayor parte de la energía que llega a la Tierra gracias al Sol y que podemos aprovechar con paneles solares.
ca: És fonamental, perquè és la major part de l’energia que arriba a la terra gràcies al sol i que podem aprofitar amb les plaques solars.

source: Los microondas de las cocinas convierten la energía eléctrica en microondas de radio que calientan el agua de los alimentos.
ca: Kitchem Microones converteix l’energia elèctrica en microones de ràdio que escalfen els aliments dels aliments.

source: Paneles solares en el tejado de una casa.
ca: Panells solars al terrat d’una casa.

source: Energía eléctrica
ca: Energia elèctrica

source: Es la energía asociada al movimiento de los **electrones** a través de los cables conductores. Es muy sencillo convertir otros tipos de energía en energía eléctrica y viceversa. Por esa razón la energía eléctrica se utiliza mucho para transportar otras formas de energía de un lugar a otro.
ca: És l’energia associada al moviment d’electrons ** ** a través de cables conductors. És molt fàcil convertir altres tipus d’energia en energia elèctrica i viceversa. Per això, l’electricitat s’utilitza àmpliament per transportar altres formes d’energia d’un lloc a un altre.

source: Por ejemplo, la energía mecánica de un aerogenerador moviéndose con el viento puede transportarse fácilmente y de forma casi instantánea en forma de energía eléctrica a una casa que se encuentre a cientos de kilómetros. Esa energía eléctrica puede transformarse de nuevo en la energía mecánica, por ejemplo, en la de batidora o en cualquier otra forma aprovechable.
ca: Per exemple, l’energia mecànica d’un aerogenerador que es mou amb el vent es pot transportar fàcilment i gairebé instantàniament en forma d’energia elèctrica a una casa situada a centenars de quilòmetres. Aquesta energia elèctrica es pot transformar de nou en energia mecànica, per exemple, a la batedora o de qualsevol altra manera útil.

source: Los rayos de las tormentas y las descargas eléctricas que experimentamos al quitarnos un jersey son manifestaciones naturales de la energía eléctrica, pero no podemos aprovecharlas de forma útil.
ca: Els raigs de tempestes i descàrregues elèctriques que experimentem quan ens endurem un jersei són manifestacions naturals d’electricitat, però no podem aprofitar -les d’una manera útil.

source: Rayo cayendo en Toronto.
ca: Rayo caient a Toronto.

source: Una desventaja de la energía eléctrica consiste en que **no se puede almacenar con facilidad**, por lo que hay que consumirla en el momento en el que se genera. Para poder almacenar energía eléctrica, esta debe transformarse en energía química mediante baterías o en energía potencial mediante centrales hidroeléctricas reversibles [#f2]_.
ca: Un desavantatge de l’energia elèctrica és que ** no es pot emmagatzemar fàcilment **, de manera que s’ha de consumir en el moment en què es genera. Per tal d’emmagatzemar l’electricitat, s’ha de transformar en energia química per bateries o energia potencial per plantes hidroelèctriques reversibles [#F2] _.

source: Transformación de la energía
ca: Transformació energètica

source: Según el primer principio de la termodinámica, la energía `no se crea ni se destruye <https://es.wikipedia.org/wiki/Primer_principio_de_la_termodin%C3%A1mica>`__, solo se transforma de una forma a otra.
ca: Segons el primer principi de la termodinàmica, l’energia `no es crea ni es destrueix <https://es.wikipedia.org/wiki/primer_principio_de_la_termodin%C3%A1mica>` __, només transforma un camí cap a un altre.

source: En estos procesos, a menudo se necesitan varios pasos intermedios para llegar a producir la forma de energía deseada.
ca: En aquests processos, sovint es necessiten diversos passos intermedis per produir la forma energètica desitjada.

source: Estos son algunos ejemplos de conversiones comunes entre formas de energía:
ca: Aquests són alguns exemples de conversions comunes entre formes energètiques:

source: Energía potencial del agua de una presa en energía eléctrica.
ca: Energia potencial de l’aigua d’una presa en l’energia elèctrica.

source: La **energía potencial** del agua de una presa se transforma en energía cinética cuando se deja caer el agua. A continuación, una turbina convierte esta energía cinética en giro de un eje. El giro del eje mueve un alternador, que convierte la energía mecánica transmitida por el eje en **energía eléctrica**.
ca: L’energia potencial ** de l’aigua d’una presa es transforma en energia cinètica quan es deixa caure l’aigua. A continuació, una turbina converteix aquesta energia cinètica en rotació d’un eix. El gir de l'eix mou un alternador, que converteix l'energia mecànica transmesa per l'eix en ** energia elèctrica **.

source: Energía química del gas natural en energía eléctrica.
ca: Energia química del gas natural en energia elèctrica.

source: La **energía química** del gas natural se convierte en energía térmica dentro del quemador de una turbina, que a su vez la convierte en giro de la turbina. Un alternador convierte la energía mecánica del eje giratorio en **energía eléctrica**.
ca: L’energia química ** del gas natural es converteix en energia tèrmica dins del cremador d’una turbina, que al seu torn la converteix en la conversa de la turbina. Un alternador converteix l’energia mecànica de l’eix giratori en ** energia elèctrica **.

source: Energía nuclear del uranio en energía eléctrica.
ca: Energia nuclear d’urani en energia elèctrica.

source: La **energía nuclear** del uranio se convierte en energía térmica dentro del reactor nuclear, que a su vez se convierte en vapor de agua sobrecalentado. Una turbina de vapor convierte la energía térmica del vapor de agua en energía mecánica de giro de un eje, que un alternador convierte en **energía eléctrica**.
ca: L’energia nuclear ** ** de l’urani es converteix en energia tèrmica dins del reactor nuclear, que al seu torn es converteix en sobreescalfada. Una turbina de vapor converteix l’energia tèrmica del vapor d’aigua en energia mecànica d’un eix, que un alternador es converteix en ** energia elèctrica **.

source: Energía química de la gasolina en energía cinética de un automóvil.
ca: Energia química de la gasolina en energia cinètica d’un cotxe.

source: La **energía química** de la gasolina se convierte en energía térmica dentro de la cámara de combustión, lo que aumenta la presión del gas y mueve un pistón, produciendo energía mecánica. Esta energía mecánica se transmite a las ruedas, que giran y mueven el automóvil, aportando **energía cinética**.
ca: L’energia química ** ** de la gasolina es converteix en energia tèrmica dins de la cambra de combustió, cosa que augmenta la pressió de gas i mou un pistó, produint energia mecànica. Aquesta energia mecànica es transmet a les rodes, que giren i mouen el cotxe, proporcionant ** energia cinètica **.

source: Energía eólica en calor para cocinar.
ca: Escalfar energia a la cuina.

source: La **energía cinética** del viento mueve las palas de un aerogenerador y produce energía mecánica de giro que se aplica a un alternador para convertirla en energía eléctrica. La energía eléctrica se transporta hasta nuestras casas donde, al pasar por la resistencia de la vitrocerámica, se convierte en **energía térmica** para cocinar.
ca: L’energia cinètica ** del vent mou les fulles d’un aerogenerador i produeix energia de rotació mecànica que s’aplica a un alternador per convertir -lo en energia elèctrica. L’energia elèctrica es transporta a les nostres cases on, quan passa per la resistència de l’HOP, es converteix en ** energia tèrmica ** per cuinar.

source: Fuentes de energía
ca: Fonts d’energia

source: Una fuente de energía es un recurso natural del que se puede obtener energía. Según su disponibilidad, podemos distinguir entre fuentes de energía renovables y fuentes de energía no renovables.
ca: Una font d’energia és un recurs natural del qual es pot obtenir energia. Segons la seva disponibilitat, podem distingir entre fonts d’energia renovables i fonts d’energia no renovables.

source: Fuentes de energía no renovables
ca: Fonts d’energia no renovables

source: Estas fuentes de energía se agotan a medida que las consumimos porque solo existen unas reservas limitadas.
ca: Aquestes fonts d’energia s’esgoten ja que les consumim perquè només hi ha reserves limitades.

source: La mayoría de estas fuentes de energía se basan en la **energía química** que las plantas y los animales captaron del Sol hace millones de años.
ca: La majoria d’aquestes fonts d’energia es basen en l’energia química ** ** que les plantes i els animals capturats del sol fa milions d’anys.

source: Un problema importante que genera este tipo de fuentes de energía es la contaminación, el calentamiento global y la crisis climática.
ca: Un problema important que genera aquest tipus de fonts d’energia és la contaminació, l’escalfament global i la crisi climàtica.

source: **Carbón**. Es la fuente de energía que produce mayor contaminación medioambiental y emisiones de gases de efecto invernadero.
ca: ** carbó **. És la font d’energia que produeix una major contaminació ambiental i emissions de gasos d’efecte hivernacle.

source: **Petróleo**. Es la más utilizada en la actualidad para todo tipo de usos, desde el transporte hasta la calefacción de viviendas. También es muy contaminante.
ca: ** Oil **. És el més utilitzat avui per a tot tipus d’usos, des del transport fins a la calefacció d’habitatges. També és molt contaminant.

source: **Gas natural**. Es el menos contaminante de los tres tipos de fuentes de energía fósiles cuando se quema, pero también emite CO2 de efecto invernadero. Está compuesto de metano y, cuando se pierde en la atmósfera, produce un efecto invernadero mucho mayor que el del CO2.
ca: ** Gas ​​natural **. És el menys contaminant dels tres tipus de fonts d’energia fòssil quan es crema, però també emet CO2 d’hivernacle. Està format per metà i, quan es perd a l’atmosfera, produeix un efecte hivernacle molt més gran que el del CO2.

source: **Nuclear**. Esta energía produce pocos gases de efecto invernadero, pero sí genera importantes cantidades de residuos radioactivos contaminantes.
ca: ** Nuclear **. Aquesta energia produeix pocs gasos d’efecte hivernacle, però genera quantitats importants de residus radioactius contaminants.

source: Fuentes de energía renovables
ca: Fonts d’energia renovables

source: Estas fuentes de energía se las considera inagotables y, con las técnicas adecuadas, se pueden aprovechar sin límite.
ca: Aquestes fonts d’energia es consideren inesgotables i, amb tècniques adequades, es poden utilitzar sense límit.

source: El problema de la mayoría de las energías renovables consiste en que son intermitentes, por lo que es necesario almacenar los excedentes de energía para poder utilizarlos más adelante.
ca: El problema de la majoria de les energies renovables és que són intermitents, per la qual cosa cal emmagatzemar excedents energètics per poder utilitzar -los més endavant.

source: **Solar**. Es energía radiante que proviene de las reacciones nucleares de fusión que tienen lugar en el interior del Sol.
ca: ** Solar **. És una energia radiant que prové de les reaccions de fusió nuclear que tenen lloc dins del sol.

source: **Eólica**. La energía del viento proviene del calentamiento por parte del Sol de las masas de aire en la atmósfera.
ca: ** Vent **. L’energia eòlica prové de la calefacció pel sol de les masses d’aire a l’atmosfera.

source: **Hidráulica**. Proviene de la energía potencial del agua de los ríos acumulada en las presas. Tiene la ventaja de que se puede almacenar con facilidad.
ca: ** Hidràulica **. Prové de l’energia potencial dels rius acumulats a les preses. Té l’avantatge que es pot emmagatzemar fàcilment.

source: **Geotérmica**. Proviene del calor interno de la Tierra producido por las reacciones nucleares de su interior. Tiene la ventaja de estar siempre disponible, aunque solo se puede aprovechar en algunas zonas volcánicas la Tierra.
ca: *Geotèrmica **. Prové de la calor interna de la terra produïda per les reaccions nuclears que hi ha al seu interior. Té l’avantatge de sempre estar disponible, tot i que només la Terra es pot utilitzar en algunes zones volcàniques.

source: **Biomasa**. Es la energía química que podemos obtener de los árboles o de los residuos biológicos que se pueden convertir en biogás.
ca: ** Biomassa **. És l’energia química que podem obtenir d’arbres o residus biològics que poden convertir -se en biogàs.

source: **Mareomotriz**. Es la energía que se puede extraer del agua del mar gracias al movimiento que producen las mareas.
ca: ** Mareomotriz **. És l’energia que es pot extreure de l’aigua de mar gràcies al moviment produït per marees.

source: La energía eléctrica no es una fuente de energía primaria, sino que se debe generar a partir de fuentes de energía primarias. La razón por la que se genera energía eléctrica es que se trata de una energía muy fácil de transportar, fácil de controlar y de convertir en otras formas de energía de manera eficiente.
ca: L’energia elèctrica no és una font d’energia primària, sinó que s’ha de generar a partir de fonts d’energia primària. El motiu pel qual es genera electricitat és que és una energia molt fàcil de transportar, fàcil de controlar i convertir -se en altres formes d’energia de manera eficient.

source: Arco eléctrico de 3000 voltios.
ca: Arc elèctric de 3000 volts.

source: Ventajas de la energía eléctrica
ca: Avantatges de l’electricitat
