Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/electronic-bjt-darlington.po
Languages: ca

source: El esquema Darlington
ca: L’esquema de Darlington

source: El `esquema Darlington <https://es.wikipedia.org/wiki/Transistor_Darlington>`__ es un dispositivo que combina dos transistores conectados de tal manera que la corriente de emisor del primero alimenta la corriente de base del segundo tal y como se puede ver en la siguiente imagen:
ca: L’esquema de Darlington <https://es.wikipedia.org/wiki/transistor_darlington>`__ és un dispositiu que combina dos transistors connectats de manera que el corrent emissor del primer alimenta el corrent base del segon que es pot veure a la imatge següent:

source: Esquema de dos transistores NPN en montaje Darlington.
ca: Esquema de dos transistors NPN a l'assemblea de Darlington.

source: El esquema Darlington se comporta como un transistor ordinario, con un colector, una base y un emisor.
ca: L’esquema de Darlington es comporta com a transistor ordinari, amb un col·leccionista, una base i un emissor.

source: Ventajas:
ca: Avantatges:

source: La principal ventaja de este esquema consiste en que la ganancia de los dos transistores se multiplica, consiguiendo con facilidad **ganancias muy altas**, de varios miles. Esto permite controlar corrientes elevadas con corrientes de base muy pequeñas.
ca: L’avantatge principal d’aquest esquema és que el guany dels dos transistors es multiplica, aconseguint fàcilment ** beneficis molt alts **, de diversos milers. Això permet controlar corrents elevats amb corrents de base molt petits.

source: Este esquema se puede implementar con dos transistores discretos conectados o también existen **pares Darlington integrados** en un único encapsulado, lo que reduce el espacio.
ca: Aquest esquema es pot implementar amb dos transistors discrets connectats o també hi ha ** parelles integrades de Darlington ** en un únic encapsulat, que redueix l’espai.

source: Inconvenientes:
ca: Desavantatges:

source: El esquema Darlington tiene una respuesta más lenta que un único transistor. Esto limita su funcionamiento como interruptor a dispositivos lentos. Para acelerar el apagado del segundo transistor se suele colocar una resistencia entre su base y su emisor.
ca: L’esquema de Darlington té una resposta més lenta que un sol transistor. Això limita el seu funcionament com a interruptor a dispositius lents. Per accelerar el segon transistor, se sol situar una resistència entre la seva base i el seu emissor.

source: La mínima tensión entre colector y emisor es mayor que con un solo transistor. Esto produce mayor calentamiento del dispositivo cuando controla el encendido y el apagado de dispositivos con mucha corriente y produce una pérdida de tensión apreciable.
ca: La tensió mínima entre col·leccionista i emissor és més gran que amb un sol transistor. Això produeix una escalfament més gran del dispositiu quan controla l’encesa i la desactivació dels dispositius amb molta corrent i produeix una pèrdua de tensió apreciable.

source: La tensión entre base y emisor es mayor, típicamente superior a 1.2 voltios al sumar dos caídas de tensión de dos transistores.
ca: La tensió entre la base i l'emissor és més gran, normalment superior a 1,2 volts afegint dues caigudes de tensió de dos transistors.

source: Simulación I
ca: Simulació I

source: A continuación podemos ver la simulación de un esquema Darlington en configuración de emisor común. Esta etapa necesita muy poca corriente de base para encender una lámpara de 50 vatios y 12 voltios.
ca: A continuació, podem veure la simulació d’un esquema de Darlington en la configuració comuna de l’emissor. Aquesta etapa necessita molt poc corrent base per encendre una làmpada de 50 i 12 volts.

source: Este esquema se puede utilizar para accionar cargas elevadas con bajas corrientes que provengan de circuitos de control digital, como un microcontrolador.
ca: Aquest esquema es pot utilitzar per actuar càrregues elevades amb corrents baixos que provenen de circuits de control digitals, com ara un microcontrolador.

source: Simulación II
ca: Simulació II

source: A continuación podemos ver la simulación de la etapa de salida de un circuito oscilador muy popular, el **NE555**. Esta etapa de salida utiliza dos configuraciones Darlington para amplificar las señales internas del circuito y conseguir una corriente elevada que active cargas externas.
ca: A continuació, podem veure la simulació de l’etapa de sortida d’un circuit oscil·lador molt popular, el ** NE555 **. Aquesta etapa de sortida utilitza dues configuracions de Darlington per amplificar els senyals interns del circuit i aconseguir un corrent alt que activa les càrregues externes.

source: En el recuadro superior podemos identificar un esquema Darlington en **colector común** (colector conectado a positivo de la alimentación). Este esquema sirve para alimentar con tensión positiva la salida.
ca: A la caixa superior podem identificar un esquema de Darlington a ** Collector Common ** (Col·leccionista connectat a menjar positiu). Aquest esquema serveix per alimentar la sortida amb tensió positiva.

source: En el recuadro inferior podemos identificar un esquema Darlington en **emisor común** (emisor conectado a negativo de la alimentación). Este esquema sirve para alimentar con tensión negativa la salida.
ca: A la caixa inferior podem identificar un esquema de Darlington a ** emissor comú ** (emissor connectat amb els aliments negatius). Aquest esquema serveix per alimentar la sortida amb tensió negativa.

source: Este segundo recuadro inferior tiene algún cambio respecto a la configuración estándar, al añadir una resistencia de 200 ohmios entre el primer transistor Q1 y el segundo transistor Q2. Además hay instalado un diodo entre los colectores de Q1 y Q2. Estos cambios permiten obtener una tensión más baja en la salida que con el esquema estándar.
ca: Aquesta segona caixa inferior té algun canvi respecte a la configuració estàndard, afegint una resistència de 200 ohms entre el primer transistor Q1 i el segon transistor Q2. A més, hi ha un díode entre els col·leccionistes de Q1 i Q2. Aquests canvis permeten obtenir una tensió inferior a la sortida que amb l’esquema estàndard.

source: Las resistencias de 200 ohmios a la derecha no pertenecen al circuito NE555, son resistencias de carga externas.
ca: Les resistències de 200 ohms a la dreta no pertanyen al circuit NE555, són resistències de càrrega externa.

source: Ejercicios
ca: Exercicis

source: Dibuja un esquema simplificado de dos transistores NPN trabajando en configuración Darlington.
ca: Dibuixa un esquema simplificat de dos transistors NPN que treballen en la configuració de Darlington.

source: Dibuja un esquema realista de dos transistores NPN trabajando en configuración Darlington de emisor común.
ca: Dibuixa un esquema realista de dos transistors NPN que treballen a la configuració de Darlington de l’emissor comú.

source: Dibuja un esquema realista de dos transistores NPN trabajando en configuración Darlington de colector común.
ca: Dibuixa un esquema realista de dos transistors NPN que treballen a la configuració de Darlington del col·leccionista comú.

source: ¿Qué ventajas tiene un esquema Darlington frente a un transistor individual?
ca: Quins avantatges té un esquema de Darlington contra un transistor individual?

source: ¿Qué inconvenientes tiene un esquema Darlington frente a un transistor individual? ¿Cómo se puede reducir el efecto de alguno de estos inconvenientes?
ca: Quins inconvenients té un esquema de Darlington davant d’un transistor individual? Com es pot reduir l'efecte d'aquests inconvenients?

source: En la etapa de salida del circuito NE555:
ca: En l’etapa de sortida del circuit NE55:

source: ¿Cuántos esquemas Darlington puedes identificar?
ca: Quants esquemes de Darlington podeu identificar?

source: ¿En que configuración está cada uno y por qué?
ca: Quina configuració és cadascú i per què?
