Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/electric-serie-paralelo.po
Languages: ca

source: Serie, paralelo y cortocircuito
ca: Sèrie, paral·lel i curtcircuit

source: Los circuitos eléctricos pueden conectarse de muchas maneras posibles. Las conexiones más simples son la conexión en serie y la conexión en paralelo. Combinando ambas se consigue una conexión mixta.
ca: Els circuits elèctrics poden connectar -se de moltes maneres possibles. Les connexions més simples són la connexió en sèrie i la connexió paral·lela. S'aconsegueix combinar una connexió mixta.

source: La conexión en **serie** se utiliza cuando queremos que unos componentes afecten el comportamiento de los demás componentes. Así, el interruptor de la luz se colocará en serie con la bombilla para que pueda encenderla o apagarla.
ca: La connexió a la sèrie ** ** s'utilitza quan volem que alguns components afectin el comportament d'altres components. Així, l’interruptor de llum es col·locarà en sèrie amb la bombeta de manera que pugui activar -lo o desactivar -lo.

source: La conexión en **paralelo** se utiliza cuando queremos que los componentes sean independientes. De esa manera, colocaremos las dos bombillas de una lámpara en paralelo para que al fundirse una de las bombillas la otra siga funcionando sin problema.
ca: La connexió a ** paral·lel ** s'utilitza quan volem que els components siguin independents. D’aquesta manera, col·locarem les dues bombetes d’una làmpada en paral·lel de manera que quan un dels bulbs es fongui l’altra continuarà funcionant sense problemes.

source: Por último, si las conexiones eléctricas están mal realizadas se puede producir un **cortocircuito** o un **circuito abierto**. Ambas impedirán que el circuito eléctrico funcione.
ca: Finalment, si les connexions elèctriques estan mal fetes, es pot produir un curtcircuit ** ** o un circuit obert **. Tots dos evitaran que el circuit elèctric funcioni.

source: A continuación estudiaremos con más detalle todos estos tipos de conexiones.
ca: A continuació, estudiarem amb més detall tots aquests tipus de connexions.

source: Índice de contenidos:
ca: Índex de contingut:

source: Circuito en serie
ca: Circuit de sèrie

source: En un circuito en serie los componentes están conectados en cadena, uno detrás de otro.
ca: En un circuit de sèries, els components es connecten a la cadena, un darrere de l'altre.

source: **Características de un circuito en serie:**
ca: ** Característiques d’un circuit de sèrie: **

source: La corriente eléctrica que pasa por todos los componentes es la misma.
ca: El corrent elèctric que passa per tots els components és el mateix.

source: Esto significa que si quitamos o abrimos un componente, los demás componentes tampoco tendrán corriente y no funcionarán.
ca: Això vol dir que si eliminem o obrim un component, els altres components no tindran corrents i no funcionaran.

source: La tensión de la pila se divide entre los componentes conectados en serie, que tendrán, por lo tanto, una tensión menor que la pila.
ca: La tensió de la pila es divideix entre els components connectats en sèries, que, per tant, tindran una tensió inferior a la bateria.

source: Esto significa que las bombillas se iluminan menos cuando están en serie.
ca: Això significa que les bombetes s’il·luminen menys quan estan en sèrie.

source: **Conexión de un circuito en serie:**
ca: ** Connexió d’un circuit de sèrie: **

source: La tensión positiva de la pila llega a la primera bombilla.
ca: La tensió positiva de la pila arriba a la primera bombeta.

source: A continuación hay una sola conexión entre la primera bombilla y la segunda.
ca: A continuació, només hi ha una connexió entre la primera bombeta i la segona.

source: Por último hay una conexión entre la segunda bombilla y la pila.
ca: Finalment, hi ha una connexió entre la segona bombeta i la bateria.

source: **Fallo de un componente en serie:**
ca: ** Falla d'un component de sèrie: **

source: En un circuito en serie, si quitamos una de las bombillas, la otra deja de funcionar y se apaga.
ca: En un circuit de sèrie, si eliminem una de les bombetes, l’altra deixa de funcionar i s’apaga.

source: Los sensores de las alarmas y otros sistemas de seguridad están conectados en serie. Si un componente falla o se rompe, todo el circuito dejará de funcionar y la alarma dará un aviso o la máquina peligrosa se parará.
ca: Els sensors d’alarma i altres sistemes de seguretat estan connectats en sèrie. Si un component falla o es trenca, tot el circuit deixarà de funcionar i l’alarma donarà un avís o la màquina perillosa s’aturarà.

source: Circuito en paralelo
ca: Circuit paral·lel

source: En un circuito en paralelo los componentes están conectados entre sí por ambos lados.
ca: En un circuit paral·lel, els components estan connectats entre ells a banda i banda.

source: **Características de un circuito en paralelo:**
ca: ** Característiques d’un circuit paral·lel: **

source: La tensión eléctrica que llega a todos los componentes es la misma.
ca: La tensió elèctrica que arriba a tots els components és la mateixa.

source: Esto significa que las bombillas tienen toda la tensión de la pila y se iluminan al máximo.
ca: Això significa que les bombetes tenen tota la tensió de la pila i s’il·luminen.

source: La corriente de la pila se divide entre los componentes conectados en paralelo. Por lo tanto, por las bombillas circulará una corriente menor que por la pila.
ca: El corrent de la bateria es divideix entre els components connectats en paral·lel. Per tant, un corrent menor circularà per les bombetes que la bateria.

source: **Conexión de un circuito en paralelo:**
ca: ** Connexió d’un circuit paral·lel: **

source: Los dos terminales de las bombillas están conectados entre sí.
ca: Els dos terminals de bombetes estan connectats entre si.

source: La tensión positiva de la pila llega por igual a todas las bombillas.
ca: La tensió positiva de la pila arriba a totes les bombetes per igual.

source: La tensión negativa de la pila llega por igual a todas las bombillas.
ca: La tensió negativa de la pila arriba a totes les bombetes per igual.

source: **Fallo de un componente en paralelo:**
ca: ** Falla d'un component paral·lel: **

source: Si quitamos una de las bombillas de un circuito conectado en paralelo, o si ésta falla, las demás bombillas seguirán funcionando.
ca: Si eliminem una de les bombetes d’un circuit connectat en paral·lel o si falla, els altres bombetes continuaran funcionant.

source: Las bombillas y otros componentes comunes de una casa están conectados en paralelo. De esta forma, el fallo de un componente no impide funcionar a los demás. Si quitamos una bombilla de casa, las demás bombillas seguirán funcionando.
ca: Les bombetes i altres components comuns d’una casa estan connectats en paral·lel. De Esta Forma, El Fallo de Un Componente No Impide Funcionar a Los Demás. Si eliminem una bombeta de casa, els altres bombetes continuaran funcionant.

source: Cortocircuito
ca: Curtcircuit

source: Un cortocircuito es la unión de los dos terminales de un mismo componente con un cable. Cuando un componente está en cortocircuito, no puede funcionar porque toda la corriente se desviará por el cable. Si una pila o generador está en cortocircuito, toda la corriente que genera pasará por el cable y el generador o el cable se quemarán.
ca: Un curtcircuit és la unió dels dos terminals del mateix component amb un cable. Quan un component és en breu, no pot funcionar perquè tot el corrent es desviarà pel cable. Si en breu una pila o un generador, tot el corrent que genera passarà pel cable i el generador o el cable es cremarà.

source: **Cortocircuito en un componente:**
ca: ** curtcircuit en un component: **

source: En el siguiente esquema hay un cortocircuito en la primera bombilla. El cable llevará toda la corriente de manera que la bombilla de arriba L1 dejará de funcionar y la bombilla de abajo L2 se iluminará mucho más que si estuviera en serie.
ca: En el següent esquema hi ha un curtcircuit a la primera bombeta. El cable portarà tot el corrent de manera que la bombeta deixi de funcionar i la bombeta per sota de L2 s’enfonsarà molt més que si fos en sèrie.

source: En la siguiente imagen se puede ver el camino de la electricidad. Vemos cómo el cable es el camino preferido, de menor resistencia, de la corriente electrica. Por lo tanto toda la corriente eléctrica que antes pasaba por la bombilla L1 ahora pasa a través del cortocircuito.
ca: A la imatge següent podeu veure el camí de l’electricitat. Veiem com el cable és el camí preferit, de menys resistència, del corrent elèctric. Per tant, tot el corrent elèctric que anteriorment passava per la bombeta L1 passa ara pel curtcircuit.

source: **Cortocircuito en la pila:**
ca: ** curtcircuit a la pila: **

source: En este esquema hay un cortocircuito entre los terminales de la pila. Esto significa que toda la corriente de la pila pasará por el cable y uno de los dos se quemará.
ca: En aquest esquema hi ha un curtcircuit entre els terminals de pila. Això significa que tot el corrent de la bateria passarà pel cable i un dels dos es cremarà.

source: Las bombillas no se encienden porque no les llega corriente eléctrica.
ca: Les bombetes no s’encenen perquè no arriben al corrent elèctric.

source: Esquema del cortocircuito de pila y camino de la corriente.
ca: Esquema de curtcircuit de tempestes i corrent al corrent.

source: No repitas este experimento bajo ninguna circunstancia, es muy peligroso.
ca: No repetiu aquest experiment en cap circumstància, és molt perillós.

source: Vídeo: `batería de litio explota debido a un cortocircuito provocado <https://www.youtube-nocookie.com/embed/WpvTHSF9xNY>`__.
ca: Vídeo: `La bateria de liti explota a causa d'un curtcircuit causat <https://www.youtube-nocoakie.com/embed/wpvthsf9xny>`__.

source: Circuito abierto
ca: Circuit obert

source: Un circuito abierto es un circuito que no tiene camino para que circule la corriente eléctrica. Un circuito abierto se puede dar si falta algún cable para cerrar el circuito, si hay un interruptor abierto o si algún componente en serie está fundido.
ca: Un circuit obert és un circuit que no té manera de circular el corrent elèctric. Es pot donar un circuit obert si falta un cable per tancar el circuit, si hi ha un interruptor obert o si algun component serial és fos.

source: Un circuito puede estar abierto si falta camino para que llegue la tensión positiva de la pila o si falta camino para que llegue la tensión negativa de la pila.
ca: Es pot obrir un circuit si falta la ruta per arribar a la tensió positiva de la pila o si falta la ruta per arribar a la tensió negativa de la pila.

source: Es lo primero que hay que comprobar cuando un aparato eléctrico no funciona ¿Está conectado?
ca: És el primer que es comprova quan un aparell elèctric no funciona, està connectat?

source: Ejercicios
ca: Exercicis

source: Ejercicios para identificar circuitos en serie, en paralelo, con cortocircuito en una bombilla o con cortocircuito en la pila.
ca: Exercicis per identificar circuits en sèrie, en paral·lel, amb curtcircuit en una bombeta o amb curtcircuit a la bateria.

source: :download:`Identificar circuitos en serie, paralelo y cortocircuito. Formato PDF. <electric/electric-serie-paralelo.pdf>`
ca: : Descarregueu: `Identifiqueu els circuits en sèrie, paral·lel i curtcircuit. Format PDF. <Electric/Electric-Serie-Palelo.pdf>`

source: :download:`Imágenes de los circuitos. Formato PNG. <electric/electric-serie-paralelo-images.zip>`
ca: : Descarregueu: `Imatges dels circuits. Format PNG. <Electric/Electric-Serie-Palelo-Images.zip>`

source: :download:`Proyecto editable. Formato KiCad. <electric/electric-serie-paralelo.zip>`
ca: : Descàrrega: `Projecte Editable. Format KICAD. <Electric/Electric-Serie-Paralelo.Zip>`

source: Cuestionarios
ca: Qüestionaris

source: Cuestionario de tipo test para identificar circuitos en serie, en paralelo, con cortocircuito en la pila o con cortocircuito en la bombilla.
ca: Tipus de prova del qüestionari per identificar circuits en sèrie, en paral·lel, amb curtcircuit a la bateria o amb curtcircuit a la bombeta.

source: `Cuestionario. Identificar serie y paralelo <../test/es-electric-series-parallel-identify.html>`__
ca: `Qüestionari. Identifiqueu sèries i paral·leles <../test/es-elèctric-sèrie-parallel-identify.html>`__
