Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/electric-circuito.po
Languages: ca

source: El circuito eléctrico
ca: El circuit elèctric

source: Un circuito eléctrico es un conjunto de componentes que generan y controlan el paso de la electricidad para producir efectos útiles.
ca: Un circuit elèctric és un conjunt de components que generen i controlen el pas de l’electricitat per produir efectes útils.

source: Un ejemplo sencillo de circuito eléctrico es el que todos utilizamos al encender la luz de una habitación.
ca: Un exemple senzill de circuit elèctric és el que tots utilitzem per encendre la llum d’una habitació.

source: Los circuitos están formados por cuatro tipos de componentes: los generadores, conductores, receptores y elementos de control. A continuación se estudiarán con más detalle.
ca: Els circuits estan formats per quatre tipus de components: generadors, conductors, receptors i elements de control. A continuació, seran estudiats amb més detall.

source: Índice de contenidos:
ca: Índex de contingut:

source: Generadores
ca: Generadors

source: Estos componentes son los encargados de generar corriente eléctrica. Para conseguirlo impulsan a los electrones para que circulen por el circuito.
ca: Aquests components són els responsables de generar corrent elèctric. Per aconseguir -ho, condueixen electrons per circular pel circuit.

source: Ejemplos de generadores son las pilas y baterías, las dinamos de las bicicletas, los alternadores de los automóviles o las placas solares fotovoltaicas.
ca: Els exemples de generadors són les bateries i les bateries, les dinamos de bicicletes, alternadors de cotxes o panells solars fotovoltaics.

source: Pilas eléctricas.
ca: Bateries elèctriques.

source: `Lead Holder <https://commons.wikimedia.org/wiki/File:AA_AAA_AAAA_A23_battery_comparison-1.jpg>`__, `CC BY-SA 3.0 <https://creativecommons.org/licenses/by-sa/3.0/deed.en>`__, via Wikimedia Commons.
ca: `Holder de plom <https://commons.wikimedia.org/wiki/file:aa_aaaaaaa_a23_battery_comparison-1.jpg>` __, `cc by-sa 3.0 <https://creativecommns.org/licenses/by-sa/3.0/deed.en>` `` `` `` `` `` `` `` `` `` `` `` `` `Via Wikimedia Commons.

source: Alternador eléctrico de un automóvil.
ca: Alternador elèctric d’un cotxe.

source: Panel fotovoltaico de generación eléctrica solar.
ca: Panell fotovoltaic de generació d’electricitat solar.

source: `Saintfevrier <https://commons.wikimedia.org/wiki/File:Solar_tracker_in_Lixouri.jpg>`__, Public domain, via Wikimedia Commons.
ca: `Saintfevrier <https://commons.wikimedia.org/wiki/file:solar_tracker_in_lixouri.jpg>`__, domini públic, a través de Wikimedia Commons.

source: Conductores
ca: Conductors

source: Los conductores transportan la electricidad entre los componentes del circuito. Suelen ser cables eléctricos.
ca: Els conductors transporten electricitat entre els components del circuit. Solen ser cables elèctrics.

source: Los materiales más comunes utilizados para conducir electricidad son:
ca: Els materials més comuns que s’utilitzen per conduir electricitat són:

source: Cobre:
ca: Coure:

source: Es el más utilizado en el interior de los edificios, en los cables flexibles de los aparatos y para la fabricación de motores eléctricos.
ca: És el més utilitzat dins dels edificis, als cables flexibles dels dispositius i per a la fabricació de motors elèctrics.

source: Cable de cobre con 3 hilos de 2.5mm2 de sección cada uno.
ca: Cable de coure amb 3 fils de secció de 2,5 mm2 cadascun.

source: `Petar Milošević <https://commons.wikimedia.org/wiki/File:Electric_guide_3%C3%972.5_mm.jpg>`__, `CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0/deed.en>`__, via Wikimedia Commons.
ca: `Petar Milošević <https://commons.wikimedia.org/wiki/file:elèctric_guide_3%C3%972.5_mm.jpg>` __, `cc by-sa 4.0 <https://creativecommons.org/licenses/by-sa/4.0/deed.en> `__, via Wikimedia Commons.

source: Aluminio y acero:
ca: Alumini i acer:

source: Son los materiales más utilizados en los cables de alta tensión. Tienen buena resistencia mecánica, resisten bien a la oxidación y son más baratos que el cobre.
ca: Són els materials més utilitzats en cables d’alta tensió. Tenen una bona resistència mecànica, resisteixen bé l’oxidació i són més barats que el coure.

source: Cable de alta tensión, de aluminio y acero.
ca: Cable d’alta tensió, alumini i acer.

source: `Albarubescens <https://commons.wikimedia.org/wiki/File:High_voltage_cables_with_glass_insulators.jpg>`__, `CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0/deed.en>`__, via Wikimedia Commons.
ca: `Albarubescens <https://commons.wikimedia.org/wiki/file:hight_voltage_cables_with_glass_insulatores.jpg>` __, `cc by-sa 4.0 <https://creativecommons.org/licenses/by-sa/4.0/deed.en> __, __, via via via via a via a via a via Wikimedia Commons.

source: Oro, níquel y cromo:
ca: Or, níquel i crom:

source: Se utilizan en el recubrimiento de los contactos eléctricos para evitar la oxidación y mejorar la conducción. Se pueden ver en las clavijas de audio y los conectores USB.
ca: S’utilitzen en el recobriment de contactes elèctrics per evitar l’oxidació i millorar la conducció. Es poden veure als connectors d’àudio i als connectors USB.

source: Disco SSD con conectores bañados en oro.
ca: Disc SSD amb connectors banyats d'or.

source: `Phiarc <https://commons.wikimedia.org/wiki/File:M.2_2230_M-key_SSD_in_comparison_with_Micro-SD_card.jpg>`__, `CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0/deed.en>`__, via Wikimedia Commons.
ca: `Phiarc <https://commons.wikimedia.org/wiki/file:m.2_2230_m-key_ssd_in_comparison_with_micro-sd_card.jpg>` `` `` cc per SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0/deed.en>`__, a través de Wikimedia Commons.

source: Estaño, plomo y plata:
ca: Estany, plom i plata:

source: Por su baja temperatura de fusión (menor de 300ºC) se utilizan en la soldadura de componentes electrónicos. La plata, a pesar de ser más cara, se utiliza cada vez más porque no produce los efectos tóxicos del plomo.
ca: A causa de la seva baixa temperatura de fusió (menys de 300 ºC), s'utilitzen en la soldadura de components electrònics. La plata, tot i ser més cara, s’utilitza cada cop més perquè no produeix els efectes tòxics del plom.

source: Componentes SMD unidos a la PCB con soldaduras de estaño-plomo.
ca: Components SMD units al PCB amb soldadures de llauna.

source: `Phiarc <https://commons.wikimedia.org/wiki/File:Many_different_SMD_capacitors.jpg>`__, `CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0/deed.en>`__, via Wikimedia Commons.
ca: `Phiarc <https://commons.wikimedia.org/wiki/file:Many_different_smd_capacitors.jpg>` __, `cc by-sa 4.0 <https://creatcommons.org/licenses/by-sa/4.0/deed.en>` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` ` Wikimedia Commons.

source: Receptores
ca: Receptors

source: Los componentes receptores transforman la electricidad en efectos útiles como luz, calor, movimiento, sonido, etc.
ca: Els components del receptor transformen l’electricitat en efectes útils com la llum, la calor, el moviment, el so, etc.

source: Algunos ejemplos de receptores son las bombillas, ventiladores, horno microondas, frigorífico, televisor, etc.
ca: Alguns exemples de receptors són bulbs, ventiladors, forn de microones, nevera, televisió, etc.

source: Lámpara led. Produce luz a partir de la electricidad.
ca: Làmpada LED produeix llum a partir de l’electricitat.

source: `Mcapdevila <https://commons.wikimedia.org/wiki/File:60_LED_3W_Spot_Light_eq_25W.jpg>`__, `CC BY-SA 3.0 <https://creativecommons.org/licenses/by-sa/3.0/deed.en>`__, via Wikimedia Commons.
ca: `McApdevila <https://commons.wikimedia.org/wiki/file:60_led_3w_spot_ight_eq_25w.jpg>` __, `cc by-sa 3.0 <https://creativecommons.org/licenses/by-sa/3.0/deed.en>` __, via via via a través de Wikimedia Commons.

source: Resistencia eléctrica de una vitrocerámica, produciendo calor.
ca: Resistència elèctrica d’un hob, produint calor.

source: `A.Savin <https://commons.wikimedia.org/wiki/File:Electric_stove_coil_with_glass_ceramic_cooktop.jpg>`__, `CC BY-SA 3.0 <https://creativecommons.org/licenses/by-sa/3.0/deed.en>`__, via Wikimedia Commons.
ca: `A.savin <https://commons.wikimedia.org/wiki/file:elèctric_stove_coil_with_glass_ceramic_cooktop.jpg>` __, `cc by-sa 3.0 <https://creativecommons.org/licenses/by-sa/3.0/deed.en>` __, via, via, via, via, via, via, via `__,` __, via, via `__,` __, `__,` __, `__,` __, `__,` __, `__, Wikimedia Commons.

source: Elementos de control
ca: Elements de control

source: Estos elementos permiten controlar el paso de la electricidad según convenga. El ejemplo más sencillo es un interruptor que enciende o apaga la luz dejando pasar la electricidad cuando nos conviene.
ca: Aquests elements permeten controlar el pas de l’electricitat segons s’acordi. L’exemple més senzill és un interruptor que s’encén o s’apaga de la llum deixant que l’electricitat passi quan ens convingui.

source: Dependiendo de cómo se accionen hay varios tipos de elementos de control.
ca: Segons com hi ha diversos tipus d’elements de control.

source: Accionamiento manual:
ca: Unitat manual:

source: Interruptores, pulsadores, mandos giratorios, etc. Permiten a las personas controlar los aparatos eléctricos.
ca: Interruptors, botons, controls rotatius, etc. Permeten que les persones controlin els dispositius elèctrics.

source: Cada elemento de control manual tiene su aplicación práctica. A la hora de controlar un timbre no se puede utilizar un interruptor porque después de pulsarle, el timbre funcionará sin parar. En esta aplicación usaremos mejor un pulsador, que solo acciona el timbre mientras lo estemos pulsando.
ca: Cada element de control manual té la seva aplicació pràctica. Quan es controla una campana, no es pot utilitzar un interruptor perquè després de prémer -la, la campana funcionarà sense aturar -se. En aquesta aplicació utilitzarem un botó millor, que només activa la campana mentre fem clic.

source: Interruptor de encendido/apagado.
ca: Interruptor d'encesa/desactivació.

source: `Jszack <https://en.wikipedia.org/wiki/File:On-Off_Switch.jpg>`__, `CC BY-SA 2.5 <https://creativecommons.org/licenses/by-sa/2.5/deed.en>`__, via Wikimedia Commons.
ca: `Jszack <https://en.wikipedia.org/wiki/file:on-off_switch.jpg>`__, `cc by-sa 2.5 <https://creativecommons.org/licens/by-sa/2.5/deed.en>`__, via wikimedia commons.

source: Protección eléctrica:
ca: Protecció elèctrica:

source: Fusibles, interruptores automáticos, diferenciales, etc.
ca: Fusibles, interruptors automàtics, diferencials, etc.

source: Los fusibles y los interruptores automáticos cortan la electricidad para proteger la instalación eléctrica y evitar que se quemen los cables si hay un cortocircuito o una sobrecarga.
ca: Els fusibles i els interruptors automàtics tallen electricitat per protegir la instal·lació elèctrica i evitar que els cables es cremin si hi ha un curtcircuit o una sobrecàrrega.

source: El diferencial nos protege la vida cortando la corriente antes de que una derivación eléctrica pueda electrocutarnos.
ca: El diferencial protegeix la vida nord -americana tallant el corrent abans que una derivació elèctrica ens pugui electrocutar.

source: Interruptor diferencial. Protege a las personas de descargas eléctricas.
ca: Interruptor diferencial. Protegeix la gent de les descàrregues elèctriques.

source: `Raimond Spekking <https://commons.wikimedia.org/wiki/File:Moeller_Xpole_PXF-40-4-003-A-2289.jpg>`__, `CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0/deed.en>`__, via Wikimedia Commons.
ca: `Raimond Spekking <https://commons.wikimedia.org/wiki/file:moeller_xpole_pxf-40-4-003-A-2289.jpg>` __, `cc by-sa 4.0 <https://creativecommons.org/licenses/by-sa/4.0/deed.en> `__, a través de Wikimedia Commons.

source: Accionamiento automático:
ca: Unitat automàtica:

source: Algunos elementos de control se accionan a partir de señales eléctricas. Esto permite un control automático, ahorrando la intervención de una persona.
ca: Alguns elements de control s’activen a partir de senyals elèctrics. Això permet el control automàtic, estalviant la intervenció d’una persona.

source: Ejemplos de accionamientos automáticos son: la luz de una escalera que se apaga sola al cabo de un tiempo, una puerta eléctrica que se abre sola al detectar presencia, un ascensor que se detiene en el piso correcto gracias a un final de carrera, un edificio inteligente que controla mediante ordenador la temperatura, humedad, apertura de persianas, riego, etc.
ca: Exemples de discos automàtics són: la llum d’una escala que surt sola al cap d’un temps, una porta elèctrica que s’obre sola quan detecta una presència, un ascensor que s’atura al pis dret gràcies a un extrem de la cursa, un edifici intel·ligent que controla la temperatura, la humitat, l’obertura de persianes, el reg, etc.

source: Puerta automática de un ascensor.
ca: Porta automàtica d’un ascensor.

source: `MMFE <https://commons.wikimedia.org/wiki/File:Lift_Luxembourg_Ville-Haute_-_Grund_01.jpg>`__, `CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0/deed.en>`__, via Wikimedia Commons.
ca: `Mmfe <https://commons.wikimedia.org/wiki/file:lift_luxemburg_ville-haute_-_grund_01.jpg>`__, `cc by-sa 4.0 <https://creativecommons.org/licenses/by-sa/4.0/deed.en>`__, via, via, via, via, via, via, via, via, via, via `__, via, via` __, `__, via` __, `__,` __, `__,` __, _ Wikimedia Commons.

source: Cuestionarios
ca: Qüestionaris

source: `Cuestionario. El circuito eléctrico. <../test/es-electric-circuits.html>`__
ca: `Qüestionari. El circuit elèctric. <../test/es-elèctric-circuits.html>`__
