Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/electronic-mosfet.po
Languages: ca

source: El transistor mosfet es un tipo de transistor que permite el paso de más o menos corriente eléctrica entre sus terminales Drenador y Fuente, dependiendo de la tensión en su terminal de Puerta.
ca: El transistor MOSFET és un tipus de transistor que permet el pas de corrent més o menys elèctric entre els seus terminals de desguàs i font, depenent de la tensió del terminal de la porta.

source: Símbolo del transistor mosfet de canal N.
ca: MOSFET Transistor símbol del canal N.

source: Los tres terminales de un transistor mosfet son:
ca: Els tres terminals d’un transistor MOSFET són:

source: **Drenador** (Drain, letra D): terminal por el que entra la corriente.
ca: ** drenatge ** (desguàs, lletra D): terminal a través del qual entra el corrent.

source: **Fuente** (Source, letra S): terminal por el que sale la corriente.
ca: ** Font ** (Font, lletra S): Terminal a través del qual surt el corrent.

source: **Puerta** (Gate, letra G): terminal de control por tensión.
ca: ** Porta ** (porta, lletra G): Terminal de control de tensió.

source: Existen dos tipos de mosfet, los de canal Negativo y los de canal Positivo. Los más frecuentes son los de canal N (Negativo) porque conducen mucho mejor la electricidad que sus versiones de canal P (Positivo).
ca: Hi ha dos tipus de MOSFET, els del canal negatiu i el canal positiu. Els més freqüents són el canal N (negatiu) perquè condueixen electricitat molt millor que les seves versions del canal P (positiu).

source: Ventajas
ca: Avantatges

source: El mosfet es un transistor que no necesita un aporte de corriente constante en su terminal de control para poder funcionar, funciona a una velocidad mucho mayor que el transistor bipolar y es capaz de conducir grandes corrientes con caídas de tensión muy bajas entre sus terminales.
ca: MOSFET és un transistor que no necessita una contribució de corrent constant al seu terminal de control per funcionar, funciona a una velocitat molt superior al transistor bipolar i que és capaç de realitzar grans corrents amb caigudes de baixa tensió entre els seus terminals.

source: Todas estas ventajas de los mosfet han favorecido que poco a poco hayan sustituido a los transistores bipolares en todo tipo de circuitos analógicos y digitales.
ca: Tots aquests avantatges del MOSFET han afavorit que els transistors bipolars han substituït gradualment tot tipus de circuits analògics i digitals.

source: Los transistores bipolares por su parte tienen una gran resistencia a las descargas electrostáticas y son baratos, lo que les hace preferibles todavía en ciertas aplicaciones.
ca: Els transistors bipolars, d’altra banda, tenen una gran resistència a les descàrregues electrostàtiques i són barats, cosa que els fa encara preferibles en determinades aplicacions.

source: Simulación
ca: Simulació

source: En la siguiente simulación se han sustituido dos transistores bipolares Darlington por un transistor mosfet de canal N con ventaja.
ca: En la següent simulació, dos transistors bipolars de Darlington han estat substituïts per un transistor MOSFET del canal N per avantatge.

source: Ejercicios
ca: Exercicis

source: Dibuja un esquema simplificado de un transistor mosfet de canal N, con la letra de todos sus terminales. ¿Qué significa cada letra?
ca: Dibuixa un esquema simplificat d’un transistor MOSFET del canal N, amb la lletra de tots els seus terminals. Què significa cada lletra?

source: Dibuja un esquema realista de un transistor mosfet trabajando como un interruptor controlado por tensión que enciende y apaga una lámpara.
ca: Dibuixa un esquema realista d’un transistor MOSFET que funciona com a interruptor de control de tensió que s’encén i s’apaga una làmpada.

source: ¿Qué función realiza un transistor mosfet?
ca: Quina funció fa un transistor MOSFET?

source: Enumera tres ventajas de los transistores mosfet respecto a los transistores bipolares.
ca: Enumereu tres avantatges dels transistors MOSFET en comparació amb els transistors bipolars.

source: En la simulación anterior, mide la tensión entre los terminales de drenador y fuente del mosfet cuando la lámpara está encendida. ¿Qué tensión tienen?
ca: En la simulació anterior, mesura la tensió entre els terminals de drenatge i MOSFET quan la làmpada està encesa. Quina tensió tenen?

source: Añade a la simulación anterior un circuito semejante que utilice dos transistores Darlington en vez de un mosfet. ¿Qué tensión tienen entre colector y emisor cuando la lámpara está encendida?
ca: Afegiu a la simulació anterior un circuit similar que utilitza dos transistors de Darlington en lloc d’un MOSFET. Quina tensió tenen entre el col·leccionista i l’emissor quan està encesa la làmpada?
