Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/electronic-operational-inverting.po
Languages: ca

source: El amplificador inversor
ca: L'amplificador d'inversions

source: En este circuito el amplificador operacional invierte y amplifica la señal de entrada.
ca: En aquest circuit, l'amplificador operatiu inverteix i amplifica el senyal d'entrada.

source: El amplificador inversor tiene realimentación negativa porque la tensión de salida produce una corriente que llega al terminal de entrada negativo a través de la resistencia R2.
ca: L’amplificador d’inversions té una retroalimentació negativa perquè la tensió de sortida produeix un corrent que arriba al terminal d’entrada negativa mitjançant la resistència R2.

source: Esquema del amplificador operacional inversor.
ca: Esquema d'amplificadors operatius d'inversor.

source: Cálculo de ganancia
ca: Guanyar càlcul

source: La fórmula de la ganancia de este amplificador es la siguiente:
ca: La fórmula de guany d’aquest amplificador és la següent:

source: Ganancia = \cfrac{V_{out}}{V_{in}} = - \cfrac{R_2}{R_1}
ca: Profit = \cfrac{v_ {out}} {v_ {in}} = - \cfrac{r_2} {r_1}

source: Para calcular la ganancia de este esquema debemos tener en cuenta que con realimentación negativa las dos entradas ``-`` y ``+`` tendrán la misma tensión. Esto significa que la tensión de la entrada ``-`` será igual a cero, puesto que la entrada ``+`` está conectada a tierra.
ca: Per calcular el guany d’aquest esquema, hem de tenir en compte que, amb la retroalimentació negativa, les dues entrades `` `i '+` `tindran la mateixa tensió. Això significa que la tensió de l’entrada `` `serà igual a zero, ja que l’entrada` `+` `es basa.

source: A partir de esta premisa, la corriente de entrada será igual a Vin / R1. Esa misma corriente será la que circule por R2, puesto que por la entrada del amplificador operacional no circula corriente. En ese caso la tensión en R2 será igual a la corriente por la resistencia Vout = R2 · Vin / R1. Reordenando conseguimos la ecuación anterior de la ganancia.
ca: A partir d'aquesta premissa, el corrent d'entrada serà igual a VIN / R1. Aquest mateix corrent serà el que circula per R2, ja que l’entrada de l’amplificador operatiu no circula el corrent. En aquest cas, la tensió en R2 serà igual al corrent per la resistència VOUT = R2 · VIN / R1. Reordenació Obtenim l’equació anterior del guany.

source: Resistencia de entrada y de salida
ca: Resistència a l’entrada i a la sortida

source: La resistencia de entrada será igual a la resistencia R1.
ca: La resistència a l’entrada serà igual a la resistència R1.

source: La resistencia de salida será muy baja, idealmente cero, porque la salida está directamente conectada a la salida del amplificador operacional.
ca: La resistència a la sortida serà molt baixa, idealment zero, perquè la sortida està directament connectada a la sortida de l'amplificador operatiu.

source: Simulación
ca: Simulació

source: En la siguiente simulación podemos ver un amplificador inversor de ganancia 5 que amplifica una pequeña señal senoidal de entrada.
ca: A la següent simulació podem veure un amplificador d’inversor de guany 5 que amplifica un petit senyal sinusogràfic d’entrada.

source: Ejercicios
ca: Exercicis

source: Dibuja el esquema simplificado de un amplificador operacional inversor.
ca: Dibuixa l’esquema simplificat d’un amplificador operatiu invertit.

source: Escribe la fórmula de la ganancia del amplificador operacional inversor anterior.
ca: Escriviu la fórmula de guany de l'amplificador operatiu dels inversors anterior.

source: ¿Qué tipo de realimentación tiene este circuito? ¿Qué les ocurre a las tensiones de entrada con ese tipo de realimentación?
ca: Quin tipus de comentaris té aquest circuit? Què passa amb les tensions d’entrada amb aquest tipus de comentaris?

source: Dibuja dos gráficas que representen la tensión de entrada y la tensión de salida del amplificador inversor simulado.
ca: Dibuixa dos gràfics que representen la tensió d’entrada i la tensió de sortida de l’amplificador d’inversions simulades.

source: ¿Qué tensiones de pico tienen cada una de las dos gráficas representadas? Puedes parar la simulación y ampliar a pantalla completa para medir con más precisión.
ca: Quines tensions màximes tenen cadascun dels dos gràfics? Podeu aturar la simulació i ampliar la pantalla completa per mesurar més precisió.

source: Calcula las resistencias necesarias para hacer que un amplificador operacional inversor tenga una resistencia de entrada de 1000 Ohmios y una ganancia de tensión igual a -100.
ca: Calculeu les resistències necessàries per fer un amplificador operatiu invertit que tingui una resistència d’entrada de 1000 ohms i un guany de tensió igual a -100.

source: Dibuja un esquema realista de este amplificador, con una alimentación de +-6 voltios y una entrada de tensión senoidal de 0.1 voltios.
ca: Dibuixa un esquema realista d’aquest amplificador, amb un aliment de +-6 volts i un sinus de 0,1 volts.

source: Con ayuda del `simulador de circuitos <../circuits/?startCircuit=empty.txt>`__ dibuja el esquema de un amplificador operacional inversor basado en un amplificador operacional real (LM324) que amplifique la señal de un generador de tensión de onda cuadrada con una tensión de pico de 1 voltio. La ganancia de tensión debe valer 2.
ca: Amb l’ajuda del simulador de circuits <../ Circuits/? StartCircuit = buits.txt>`__ dibuixar l'esquema d'un amplificador operatiu invertidor basat en un amplificador operatiu real (LM324) que amplifica el senyal d'un generador de tensió d'ona quadrada amb una tensió màxima d'1 vol. El guany de tensió ha de valer 2.

source: Grafica en el mismo osciloscopio la señal de tensión del generador y la señal de tensión de salida del amplificador operacional.
ca: Gràfic al mateix oscil·loscopi El senyal de tensió del generador i el senyal de tensió de sortida de l'amplificador operatiu.
