Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/electronic-truth-table.po
Languages: ca

source: La tabla de verdad
ca: La taula de veritat

source: En temas pasados hemos visto qué es una tabla de verdad de una puerta lógica. En este tema vamos a ver, paso a paso, cómo crear la tabla de verdad de un circuito combinacional cualquiera.
ca: En qüestions passades hem vist què és una taula de veritat d’una porta lògica. Sobre aquest tema veurem, pas a pas, com crear la taula de veritat de qualsevol circuit combinatiu.

source: Los pasos para crear la tabla de verdad de un circuito son:
ca: Els passos per crear la taula de veritat d’un circuit són:

source: Nombrar cada una de las entradas del circuito con una letra mayúscula del abecedario, A, B, C, etc.
ca: Nomenar cadascuna de les entrades del circuit amb una lletra majúscula de l’alfabet, a, b, c, etc.

source: Nombrar cada una de las salidas del circuito con una O más un número, O1, O2, O3, etc.
ca: Poseu un nom a cadascuna de les sortides del circuit amb un o més un número, O1, O2, O3, etc.

source: Dibujar una tabla con tantas columnas como el número de entradas más el número de salidas tenga el circuito.
ca: Dibuixa una taula amb tantes columnes com el nombre de bitllets més el nombre de sortides té el circuit.

source: En la primera fila de la tabla colocaremos el nombre de las entradas A, B, C, etc. y el nombre de las salidas O1, O2, O3, etc.
ca: A la primera fila de la taula col·locarem el nom de les entrades A, B, C, etc. i el nom de les sortides O1, O2, O3, etc.

source: Terminar de dibujar en la tabla tantas filas como sean necesarias (2 elevado al número de entradas).
ca: Acabeu de dibuixar a la taula tantes files com sigui necessari (2 elevades al nombre d’entrades).

source: Para 2 entradas, 4 filas.
ca: Per a 2 entrades, 4 files.

source: Para 3 entradas, 8 filas.
ca: Per a 3 entrades, 8 files.

source: Para 4 entradas, 16 filas.
ca: Per a 4 entrades, 16 files.

source: Numerar en binario las filas correspondientes a las entradas.
ca: Número en binari Les files corresponents a les entrades.

source: Para cada combinación de entradas, calcular las salidas del circuito y dibujarlas en la tabla.
ca: Per a cada combinació d’entrades, calculeu els punts de sortida del circuit i dibuixeu -los a la taula.

source: Ejercicio resuelto
ca: Exercici resolt

source: Dibujar la tabla de verdad del siguiente circuito de 3 entradas y 1 salida.
ca: Dibuixa la taula de veritat del circuit següent de 3 entrades i 1 sortida.

source: Nombramos las entradas como A, B, C.
ca: Nomenem entrades com A, B, C.

source: Nombramos la salida como O1.
ca: Nomenem la sortida com a O1.

source: Dibujamos la tabla y en la primera fila colocamos el nombre de las entradas y salidas.
ca: Dibuixem la taula i a la primera fila col·loquem el nom de les entrades i sortides.

source: Terminamos de dibujar la tabla con 8 filas libres (2^3 = 8) para poder numerar todas las entradas posibles.
ca: Acabem de dibuixar la taula amb 8 files lliures (2^3 = 8) per poder numerar totes les entrades possibles.

source: Numeramos en binario las filas correspondientes a las entradas.
ca: Numerem les files corresponents a les entrades del binari.

source: Por último colocamos cada una de las 8 combinaciones de entradas en el circuito y escribimos su salida en la columna O1.
ca: Finalment, col·loquem cadascuna de les 8 combinacions d’entrades al circuit i escrivim la seva sortida a la columna O1.

source: Ejercicios
ca: Exercicis

source: Dibuja la tabla de verdad del siguiente circuito.
ca: Dibuixa la taula de veritat del següent circuit.
