Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/electric-simulador-alterna.po
Languages: ca

source: :index:`Tensión alterna`
ca: : Índex: `Tensió alternativa '

source: Una fuente de **tensión alterna** también llamada de **corriente alterna** es un generador que produce entre sus bornes tensiones positivas y tensiones negativas alternativamente, varias veces por segundo.
ca: Una font de ** tensió alternativa ** també anomenada ** corrent altern ** és un generador que produeix tensions positives i tensions negatives alternativament, diverses vegades per segon.

source: La forma de onda más común de la tensión es la **sinusoidal**, que puede verse en la siguiente imagen:
ca: La forma d'ona més comuna de la tensió és el ** sinusoïdal **, que es pot veure a la imatge següent:

source: Forma de onda de una tensión alterna y sus parámetros.
ca: Forma d'ona d'una tensió alternativa i els seus paràmetres.

source: La tensión no varía bruscamente, sino que va cambiando desde un valor cero hasta un pico de amplitud positivo, desciende de nuevo hasta valer cero, cambia a un valor de pico de amplitud negativo y vuelve a ascender hasta valer cero otra vez.
ca: La tensió no varia bruscament, però està canviant d’un valor zero a un pic d’amplitud positiu, descendeix de nou per valorar zero, canvia a un valor màxim d’amplitud negativa i torna a ascendir per valorar zero de nou.

source: En la siguiente simulación podemos ver un generador de tensión alterna que alimenta una resistencia. Los electrones se desplazan hacia adelante y hacia atrás alternativamente. La tensión superior del generador cambia de positivo (verde) a negativo (rojo) también alternativamente. Por último, en el osciloscopio inferior podemos ver la forma de onda **sinusoidal** de la tensión:
ca: A la següent simulació podem veure un generador de tensió alternatiu que alimenta una resistència. Els electrons avancen i enrere. La tensió superior del generador canvia de positiu (verd) a negatiu (vermell) també alternativament. Finalment, a l’oscil·loscopi inferior podem veure la forma d’ona ** sinusoïdal ** de tensió:

source: Amplitud de pico y :index:`amplitud eficaz`
ca: Amplitud Pico y: Índex: `Amplitud efectiva '

source: La amplitud de una tensión alterna es el valor de pico o valor máximo que llega a tener esa tensión.
ca: L’amplitud d’una tensió alternativa és el màxim valor o valor de valor que té aquesta tensió.

source: Pero normalmente no se define la amplitud de una señal alterna por su valor de pico, sino por su valor eficaz. El valor **eficaz** de una tensión alterna es aquel valor de tensión continua que produce el mismo efecto sobre una resistencia que la tensión alterna.
ca: Però normalment l’amplitud d’un senyal alternatiu no es defineix pel seu valor màxim, sinó pel seu valor efectiu. El valor ** efectiu ** d’una tensió alternativa és aquell valor de tensió contínua que produeix el mateix efecte sobre una resistència que la tensió alternativa.

source: Esto significa que la tensión de la red eléctrica de una casa, que es de 230 voltios eficaces, calienta una resistencia igual que lo haría una tensión continua de 230 voltios.
ca: Això significa que la tensió de la xarxa elèctrica, que és de 230 volts efectius, escalfa una resistència com una tensió contínua de 230 volts.

source: La relación entre el valor de pico y el valor eficaz es la siguiente:
ca: La relació entre el valor màxim i el valor efectiu és la següent:

source: De manera que decir que la tensión de casa tiene 230 voltios eficaces es igual que decir que tiene 230 * 1,4142 = 325,26 voltios de pico.
ca: Així que dir que la tensió de la casa té 230 volts efectius és el mateix que dir que té 230 * 1.4142 = 325,26 volts de pic.

source: En la siguiente simulación podemos ver un generador de tensión alterna de 7,071 voltios de pico que produce el mismo efecto sobre una lámpara que el generador de corriente continua de 5 voltios:
ca: A la simulació següent podem veure un generador de tensió alternatiu de 7.071 volts màxims que produeix el mateix efecte sobre una làmpada que el generador de corrent continu de 5 volts:

source: :index:`Período y frecuencia`
ca: : Índex: `període i freqüència '

source: El período es el tiempo que tarda la onda alterna en completar un ciclo completo. Este tiempo suele ser pequeño, del orden de milisegundos, por lo que se suele hablar normalmente de su valor inverso, que es la frecuencia.
ca: El període és el temps que triga a l’ona alternativa per completar un cicle complet. Aquest temps sol ser petit, de l’ordre dels mil·lisegons, de manera que normalment parla normalment del seu valor invers, que és la freqüència.

source: La frecuencia se define como el número de ciclos que completa la onda alterna en un segundo. La red eléctrica europea es de 50 hercios (ciclos por segundo). La red eléctrica de la mayoría de América es de 60 hercios.
ca: La freqüència es defineix com el nombre de cicles que completa l’ona alternativa en un segon. La xarxa elèctrica europea és de 50 eines (cicles per segon). La xarxa elèctrica de la majoria dels Estats Units és de 60 habitatges.

source: La fórmula que relaciona el período y la frecuencia es la siguiente:
ca: La fórmula que relaciona el període i la freqüència és la següent:

source: Siendo las magnitudes y unidades las siguientes:
ca: Les magnituds i les unitats són les següents:

source: F = Frecuencia en Hercios [Hz]
ca: F = Freqüència en Hercios [HZ]

source: P = Período en Segundos [s]
ca: P = període en segons [s]

source: Ejercicios
ca: Exercicis

source: ¿Qué es una fuente de tensión alterna? ¿Cómo se la denomina también?
ca: Què és una font de tensió alternativa? Com es diu també?

source: Dibuja una señal alterna de tensión y dibuja sobre ella sus principales parámetros.
ca: Dibuixeu un senyal de tensió alternativa i dibuixeu -hi els seus paràmetres principals.

source: Dibuja una fuente de tensión alterna conectada a una resistencia.
ca: Dibuixa una font de tensió alternativa connectada a una resistència.

source: ¿Qué es la tensión eficaz de un generador de tensión alterna y cómo se calcula a partir de la tensión de pico?
ca: Quina és la tensió efectiva d’un generador de tensió alternatiu i com es calcula a partir de la tensió màxima?

source: Completa la siguiente tabla con los valores de pico y los valores eficaces de tensión alterna que faltan.
ca: Completa la taula següent amb els valors màxims i els valors de tensió alternatius efectius que falten.

source: Tensión eficaz [V]
ca: Tensió efectiva [V]

source: Tensión de pico [V]
ca: Tensió màxima [V]

source: 230 voltios
ca: 230 volts

source: 17 voltios
ca: 17 volts

source: 125 voltios
ca: 125 volts

source: 29 voltios
ca: 29 volts

source: 5 voltios
ca: 5 volts

source: Completa la siguiente tabla con los valores de frecuencia y de período de tiempo que que faltan.
ca: Completa la taula següent amb la freqüència i el període de valors de temps que falten.

source: Frecuencia [Hz]
ca: Freqüència [HZ]

source: Período [s]
ca: Període [S]

source: 50 hercios
ca: 50 Herciose

source: 0,020 segundos
ca: 0,020 segons

source: 60 hercios
ca: 60 RTES

source: 400 hercios
ca: 400 HERCIOSE

source: 0,100 segundos
ca: 0,100 segons

source: 0,012 segundos
ca: 0,012 segons

source: 0,001 segundos
ca: 0,001 segons
