Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/electronic-diodo-limitador.po
Languages: ca

source: El diodo limitador
ca: El díode limitant

source: Los diodos rectificadores también se pueden utilizar para limitar la corriente o la tensión en los circuitos para prevenir que estos se quemen.
ca: Els díodes rectificadors també es poden utilitzar per limitar el corrent o la tensió als circuits per evitar que es cremin.

source: Diodo de rueda libre
ca: Díode de rodes lliures

source: Siempre que hacemos conducir corriente por una bobina (motor, relé, etc.) la **bobina almacena energía** en su interior. Al desactivar la bobina, la energía almacenada se transforma en un pico de tensión que intenta mantener la corriente de la bobina constante. Este pico de tensión puede quemar los componentes electrónicos del circuito, por lo que se debe colocar en paralelo a la bobina un diodo denominado '**de rueda libre**' o '**freewheel**' que conduzca la corriente de la bobina hasta que se reduzca a cero.
ca: Sempre que fem corrent mitjançant una bobina (motor, relé, etc.), la ** bobina emmagatzema energia ** a dins. En desactivar la bobina, l’energia emmagatzemada es transforma en un pic de tensió que intenta mantenir el corrent constant de la bobina. Aquest pic de tensió pot cremar els components electrònics del circuit, de manera que un díode anomenat '** de roda lliure **' o '** Freewheel **' que condueix el corrent de la bobina fins que es redueixi a zero s'ha de col·locar paral·lelament a la bobina.

source: En los siguientes circuitos podemos ver los diodos de rueda libre colocados en paralelo con la bobina de un relé y otro colocado en paralelo con un motor de corriente continua (tiene una gran bobina en su interior).
ca: En els circuits següents podem veure els díodes de la roda lliure col·locats en paral·lel amb la bobina d’un relé i un altre col·locat en paral·lel amb un motor de corrent directe (té una gran bobina a l’interior).

source: Diodo limitador de entrada
ca: Diode del limitador d'entrada

source: Este esquema recorta la tensión de entrada en torno a los 0.65 voltios, la tensión de umbral de conducción que tienen los diodos rectificadores.
ca: Aquest esquema talla la tensió d’entrada al voltant de 0,65 volts, la tensió del llindar de conducció que tenen els díodes rectificadors.

source: Es un circuito utilizado usualmente para proteger de las altas tensiones las entradas de los circuitos electrónicos más sensibles, evitando que una descarga electrostática (un chispazo) pueda quemar el circuito electrónico.
ca: És un circuit utilitzat per protegir els circuits electrònics més sensibles de les tensions elevades, evitant que una descàrrega electrostàtica (una espurna) cremi el circuit electrònic.

source: Ejercicios
ca: Exercicis

source: Dibuja el esquema de una bobina de 1 Henrio en serie con una resistencia de 100 ohmios, en serie con un interruptor y con una pila de 5 voltios.
ca: Dibuixa l’esquema d’una bobina d’una sèrie Henrio amb una resistència de 100 ohms, en sèrie amb un interruptor i una pila de 5 volts.

source: Coloca correctamente un diodo de protección de rueda libre en paralelo a la bobina.
ca: Col·loqueu correctament un díode de protecció de rodes lliures en paral·lel a la bobina.

source: Utiliza el `simulador de circuitos <../circuits/?startCircuit=empty.txt>`__ para comprobar que el circuito funciona correctamente.
ca: Utilitzeu el `Circuit Simulator <../ Circuits/? StartCircuit = buits.txt> `__ per comprovar que el circuit funciona correctament.

source: Añade en el circuito anterior un osciloscopio con la gráfica de la corriente a través de la bobina.
ca: Afegiu un oscil·loscopi al circuit anterior amb el gràfic actual a través de la bobina.

source: Dibuja una gráfica de la corriente con el tiempo. En el eje X representa el tiempo con marcas cada segundo. En el eje Y representa la corriente con marcas cada 10 miliamperios.
ca: Dibuixa un gràfic del corrent amb el pas del temps. A l'eix x, representa el temps amb les marques cada segon. A l’eix Y representa el corrent amb marques cada 10 mil·límetres.

source: Modifica el circuito anterior para que el diodo esté en paralelo con la bobina y la resistencia. ¿El funcionamiento mejora o empeora?
ca: Modifiqueu el circuit anterior de manera que el díode estigui en paral·lel amb la bobina i la resistència. L’operació millora o empitjora?

source: Dibuja de nuevo la gráfica de la corriente con el tiempo.
ca: Dibuixa el gràfic actual amb el temps.
