Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/electronic-operational-adder.po
Languages: ca

source: El amplificador sumador
ca: L’amplificador d’estiu

source: En este circuito el amplificador operacional invierte y amplifica las señales de entrada, que pueden ser dos o más señales.
ca: En aquest circuit, l'amplificador operatiu inverteix i amplifica els senyals d'entrada, que poden ser dos o més senyals.

source: El amplificador inversor tiene realimentación negativa porque la tensión de salida produce una corriente que llega al terminal de entrada negativo a través de la resistencia R3.
ca: L’amplificador d’inversions té una retroalimentació negativa perquè la tensió de sortida produeix un corrent que arriba al terminal d’entrada negativa mitjançant la resistència R3.

source: Esquema del amplificador operacional sumador inversor.
ca: Esquema d'amplificadors operatius Inverter Summeror.

source: Este circuito está basado en el amplificador inversor, con el que guarda una gran similitud.
ca: Aquest circuit es basa en l’amplificador d’inversions, amb el qual manté una gran similitud.

source: Al tener la tensión de la entrada negativa cero voltios en todo momento, las tensiones de entrada no se afectan entre sí una a la otra.
ca: Amb la tensió de tensió de vol zero en tot moment, les tensions d’entrada no s’afecten les unes a les altres.

source: Cálculo de ganancia
ca: Guanyar càlcul

source: La fórmula de la tensión de salida de este amplificador es la siguiente:
ca: La fórmula de la tensió de sortida d’aquest amplificador és la següent:

source: La ganancia de cada entrada depende de la resistencia de cada una de las entradas y no tiene por qué ser igual en ambas.
ca: El guany de cada entrada depèn de la resistència de cadascuna de les entrades i no ha de ser el mateix en ambdues.

source: La resistencia de entrada será igual a la resistencia R1 para la entrada 1 e igual a R2 para la entrada 2.
ca: La resistència a l’entrada serà igual a la resistència R1 per a l’entrada 1 i igual a R2 per a l’entrada 2.

source: La resistencia de salida será muy baja, idealmente cero, porque la salida está directamente conectada a la salida del amplificador operacional.
ca: La resistència a la sortida serà molt baixa, idealment zero, perquè la sortida està directament connectada a la sortida de l'amplificador operatiu.

source: Simulación
ca: Simulació

source: En la siguiente simulación podemos ver un amplificador sumador que sumará dos señales senoidales de diferente frecuencia y amplitud.
ca: A la següent simulació podem veure un amplificador estiu que afegirà dos senyals sinusogràfics de freqüència i amplitud diferents.

source: Ejercicios
ca: Exercicis

source: Dibuja el esquema simplificado de un amplificador operacional sumador.
ca: Dibuixa l’esquema simplificat d’un amplificador operatiu.

source: Escribe la fórmula de la tensión de salida del amplificador operacional sumador anterior.
ca: Escriviu la fórmula de tensió de sortida de l’estiu anterior.

source: ¿Qué tipo de realimentación tiene este circuito?
ca: Quin tipus de comentaris té aquest circuit?

source: ¿Qué les ocurre a las tensiones de entrada con ese tipo de realimentación?
ca: Què passa amb les tensions d’entrada amb aquest tipus de comentaris?

source: ¿La tensión de entrada V_in1 afecta a la tensión de entrada V_in2?
ca: La tensió d’entrada V_in1 afecta la tensió d’entrada V_in2?

source: Dibuja tres gráficas que representen la tensiones de entrada y la tensión de salida del amplificador inversor simulado.
ca: Dibuixa tres gràfics que representen les tensions d’entrada i la tensió de sortida de l’amplificador d’inversions simulades.

source: ¿Qué tensiones de pico tienen cada una de las tres gráficas representadas? Puedes parar la simulación y ampliar a pantalla completa para medir con más precisión.
ca: Quines tensions màximes tenen cadascun dels tres gràfics? Podeu aturar la simulació i ampliar la pantalla completa per mesurar més precisió.

source: Calcula las resistencias necesarias para hacer que un amplificador operacional sumador tenga una ganancia de tensión igual a -5 en la primera entrada y -10 en la segunda entrada.
ca: Calculeu les resistències necessàries per fer un amplificador operatiu un guany de tensió igual a -5 a la primera entrada i -10 a la segona entrada.

source: Dibuja un esquema realista de este amplificador, con una alimentación de +-15 voltios y dos entradas de tensión senoidal de 1 voltio.
ca: Dibuixa un esquema realista d’aquest amplificador, amb una alimentació de +-15 volts i dues entrades de tensió sinusoïda d’1 vol.

source: Con ayuda del `simulador de circuitos <../circuits/?startCircuit=empty.txt>`__ dibuja el esquema de un amplificador operacional sumador basado en un amplificador operacional ideal que amplifique:
ca: Amb l’ajuda del simulador de circuits <../ Circuits/? StartCircuit = buit.txt>`__ dibuixar l'esquema d'un amplificador d'amplificador operatiu basat en un amplificador operatiu ideal que amplifica:

source: La señal de un generador de tensión de **onda cuadrada** con una tensión de pico de 1 voltio y una frecuencia de 20Hz.
ca: El senyal d’un generador d’ones ** quadrat ** amb una tensió màxima d’1 vol i una freqüència de 20 Hz.

source: La señal de un generador de tensión de **onda triangular** con una tensión de pico de 1 voltio y una frecuencia de 40Hz.
ca: El senyal d’un generador de tensió ** ona triangular ** amb una tensió màxima d’1 vol i una freqüència de 40Hz.

source: Grafica en el mismo osciloscopio las señales de tensión de los generadores y, en otro osciloscopio diferente, grafica la señal de salida de tensión del amplificador sumador.
ca: Gràfic al mateix oscil·loscopi Els signes de tensió dels generadors i, en un oscil·loscopi diferent, gràfics el senyal de sortida de tensió de l'amplificador d'estiu.
