Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/electronic-codigo-colores.po
Languages: ca

source: Código de colores de las resistencias
ca: Codi de colors de resistències

source: El código de colores de las resistencias sirve para expresar el valor de una resistencia en ohmios (Ω) y su tolerancia, a través de varias bandas de colores impresas en el cuerpo de la resistencia, que se pueden ver desde cualquier posición.
ca: El codi de color de les resistències serveix per expressar el valor d’una resistència en ohms (ω) i la seva tolerància, a través de diverses bandes de colors impreses al cos de resistència, que es pot veure des de qualsevol posició.

source: La notación de la resistencia es semejante a la notación científica, con una mantisa de dos cifras y un exponente de una cifra.
ca: La notació de resistència és similar a la notació científica, amb una mantisa de dos digits i un exponent d’una figura.

source: El documento siguiente tiene ejercicios para traducir todos los códigos de colores de las resistencias de la serie comercial E6. La mitad de los ejercicios consiste en traducir bandas de colores a valor de ohmios y la otra mitad consiste en traducir el valor de la resistencia en ohmios a bandas de colores. En todos los ejercicios se ha utilizado la tolerancia del 5% por ser la más habitual.
ca: El document següent té exercicis per traduir tots els codis de colors de les resistències de la sèrie comercial E6. La meitat dels exercicis consisteix a traduir bandes de colors amb el valor dels ohms i l’altra meitat consisteix a traduir el valor de la resistència en ohms a bandes de colors. En tots els exercicis, el 5% de tolerància s’ha utilitzat per ser la més comuna.

source: :download:`Problemas de código de colores y ley de Ohm. Formato PDF. <electronic/resistencias-colores/electronic-codigo-colores.pdf>`
ca: : Descarregueu: `Problemes de codi de color i llei ohm. Format PDF. <electrònica/resistències-color/electronic-codigo-colors.pdf>`

source: :download:`Problemas de código de colores y ley de Ohm. Formato Word. <electronic/resistencias-colores/electronic-codigo-colores.doc>`
ca: : Descarregueu: `Problemes de codi de color i llei ohm. Format de paraules. <electrònica/resistències-color/electronic-codigo-colors.doc>`

source: Tabla del código de colores
ca: Taula de codi de colors

source: Prefijos del sistema internacional:
ca: Prefixos del sistema internacional:

source: k = kilo = 1 000
ca: k = quilo = 1 000

source: Traducir colores a valor numérico
ca: Traduir els colors al valor numèric

source: Para traducir código de colores a valor numérico seguiremos los siguientes pasos:
ca: Per traduir el codi de colors al valor numèric, seguirem els passos següents:

source: Colocar la resistencia en la posición correcta de manera que la banda de color de tolerancia quede a la derecha.
ca: Col·loqueu la resistència en la posició correcta de manera que la banda de colors de la tolerància estigui a la dreta.

source: La mayoría de las veces la tolerancia de la resistencia es de un 5% y la banda es de color oro, fácilmente distinguible.
ca: La majoria de les vegades la tolerància a la resistència és del 5% i la banda és daurada, fàcilment distingible.

source: La resistencia quedaría con las bandas
ca: La resistència es quedaria amb les bandes

source: Amarillo Violeta Naranja Oro
ca: Taronja violeta groc

source: Traducir las dos primeras bandas de color a números. En el caso de la resistencia de ejemplo los colores son amarillo y violeta.
ca: Traduïu les dues primeres bandes de colors als números. En el cas de la resistència d’exemple, els colors són grocs i violetes.

source: Amarillo = 4
ca: Groc = 4

source: De manera que el primer número es 47
ca: De manera que el primer número és de 47

source: Traducir la tercera banda de color a un multiplicador
ca: Traduïu la tercera banda de colors a un multiplicador

source: Banda naranja = 3 ceros = multiplicador x 1000
ca: Banda taronja = 3 zeros = multiplicador x 1000

source: Multiplicar el primer número por el multiplicador para calcular el valor final.
ca: Multipliqueu el primer número pel multiplicador per calcular el valor final.

source: 47 x 1000 = 47000 Ohmios
ca: 47 x 1000 = 47000 ohms

source: Utilizar los sufijos para simplificar los valores muy grandes.
ca: Utilitzeu els sufixos per simplificar valors molt grans.

source: 47000 Ohmios = 47k Ohmios
ca: 47000 ohms = 47k ohms

source: Casos especiales
ca: Casos especials

source: Cuando la segunda banda es un cero, hay que tener en cuenta que se añade a los ceros del multiplicador.
ca: Quan la segona banda és zero, cal tenir en compte que s’afegeix als zeros del multiplicador.

source: Por ejemplo, una resistencia con los siguientes colores.
ca: Per exemple, una resistència amb els colors següents.

source: Marrón Negro Rojo Oro
ca: Or marró negre d'or d'or

source: Se traduce como 10 con multiplicador 100 que resulta ser 1000 Ohmios o 1k Ohmio.
ca: Es tradueix com a 10 amb 100 multiplicadors que resulta ser de 1000 ohms o 1K ohmio.

source: Cuando el multiplicador es de color Oro, en vez de multiplicar se debe dividir por 10.
ca: Quan el multiplicador és d'or, en lloc de multiplicar -lo s'ha de dividir per 10.

source: Verde Azul Oro Oro
ca: Or verd d'or

source: Se traduce como 56 con multiplicador 0,1 que resulta ser 5,6 Ohmios.
ca: Es tradueix com a 56 amb multiplicador 0,1 que resulta ser de 5,6 ohms.

source: Traducir valor numérico a colores
ca: Traduir el valor numèric en colors

source: Para traducir un valor de resistencia a bandas de colores seguiremos los siguientes pasos.
ca: Per traduir un valor de resistència a les bandes de colors, seguirem els passos següents.

source: Traducir el valor de la resistencia a ohmios sin ningún prefijo. Por ejemplo, para una resistencia de 3,9k Ohmios
ca: Traduïu el valor de la resistència a ohms sense cap prefix. Per exemple, per a una resistència de 3,9k ohmios

source: 3,9k Ohmios = 3900 Ohmios
ca: 3,9k ohms = 3900 ohms

source: Hallar las dos primeras bandas de color a partir del valor de la resistencia. Por ejemplo, para una resistencia de 3900 Ohmios
ca: Cerqueu les dues primeres bandes de colors del valor de resistència. Per exemple, per a una resistència de 3900 ohms

source: 3 = Naranja
ca: 3 = taronja

source: 9 = Blanco
ca: 9 = blanc

source: Calcular el multiplicador para añadir los ceros que faltan. En el caso de la resistencia de 3900 Ohmios.
ca: Calculeu el multiplicador per afegir els zeros que falten. En el cas de la resistència de 3900 ohms.

source: Multiplicador = 100 = color Rojo (2 ceros)
ca: Multiplicador = 100 = color vermell (2 zeros)

source: Añadir la banda de tolerancia de color Oro.
ca: Afegiu la banda de tolerància al color de l’or.

source: Naranja Blanco Rojo Oro
ca: Or taronja d'or blanc

source: Cuando la segunda banda es un cero, hay que tener en cuenta que se resta de los ceros del multiplicador.
ca: Quan la segona banda és zero, cal tenir en compte que es resti dels zeros del multiplicador.

source: Por ejemplo, una resistencia con el valor de 100 Ohmios.
ca: Per exemple, una resistència amb el valor de 100 ohms.

source: Marrón Negro = 10
ca: Black Brown = 10

source: Necesita un multiplicador x 10 de color Marrón
ca: Necessiteu un multiplicador marró x 10

source: El resultado es
ca: El resultat és

source: Marrón Negro Marrón Oro
ca: Marró negre marró

source: Cuestionarios
ca: Qüestionaris

source: Cuestionarios de tipo test para calcular el valor de las resistencias a partir del código de colores o para calcular los colores a partir del valor de la resistencia.
ca: Tipus de prova qüestionaris per calcular el valor de les resistències del codi de colors o per calcular els colors del valor de resistència.

source: `Cuestionario. Código de colores 1. Colores a valor. <../test/es-electric-color-code-1.html>`__
ca: `Qüestionari. Codi de color 1. Colors de valor. <../test/es-elèctric-color-code-1.html>`__

source: `Cuestionario. Código de colores 2. Valor a colores. <../test/es-electric-color-code-2.html>`__
ca: `Qüestionari. Codi de colors 2. Colors. <../test/es-elèctric-color-code-2.html>`__
