Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/electric-motor.po
Languages: ca

source: El motor eléctrico
ca: El motor elèctric

source: Un motor eléctrico es una **máquina** que transforma la energía eléctrica en energía mecánica de giro. Los motores eléctricos son ampliamente utilizados para producir movimientos en juguetes, electrodomésticos, vehículos de transporte, herramientas eléctricas, máquinas industriales, bombas de agua, etc.
ca: Un motor elèctric és una màquina ** ** que transforma l’electricitat en energia de rotació mecànica. Els motors elèctrics s’utilitzen àmpliament per produir moviments en joguines, electrodomèstics, vehicles de transport, eines elèctriques, màquines industrials, bombes d’aigua, etc.

source: El motor eléctrico también puede comportarse como un generador de energía eléctrica cuando se le fuerza a girar. Este generador de electricidad es mucho más barato y duradero que las pilas electroquímicas.
ca: El motor elèctric també es pot comportar com a generador d’energia elèctrica quan es veu obligat a girar -se. Aquest generador d’electricitat és molt més barat i durador que les bateries electroquímiques.

source: :download:`El motor eléctrico. Formato PDF <electric/componentes-motor/electric-motor.pdf>`
ca: : Descarregueu: `El motor elèctric. PDF <Electric/Electric-Motor.PDF> Format de components

source: :download:`El motor eléctrico. Formato editable DOC <electric/componentes-motor/electric-motor.doc>`
ca: : Descarregueu: `El motor elèctric. Format editable Doc <Electric/Components-Motor/Electric-Motor.Doc> ``

source: Historia del motor eléctrico
ca: Història del motor elèctric

source: En la década de **1820** H. C. Ørsted y Michael Faraday descubrieron los principios básicos del electromagnetismo, necesarios para construir motores.
ca: A la dècada de ** 1820 ** H. C. Ørsted i Michael Faraday van descobrir els principis bàsics de l'electromagnetisme, necessaris per construir motors.

source: Entre **1834** y **1838** se desarrolla el primer motor eléctrico práctico, que sirvió para impulsar un barco para doce personas en San Petersburgo.
ca: Entre ** 1834 ** i ** 1838 ** El primer motor elèctric pràctic es desenvolupa, que va servir per impulsar un vaixell per a dotze persones a Sant Petersburg.

source: En **1866** Werner von Siemens patentó la dinamo iniciando la producción de electricidad de forma industrial, con corriente continua.
ca: A ** 1866 ** Werner von Siemens va patentar la dinamo iniciant la producció d'electricitat de manera industrial, amb corrent directe.

source: A partir de **1880** comenzaron a construirse redes y centrales eléctricas de corriente continua en muchos países, entre ellos España.
ca: Des de ** 1880 ** van començar a construir xarxes i centrals elèctriques de corrent directe en molts països, inclosa Espanya.

source: En **1888** Nikola Tesla fabricó el primer motor de corriente alterna. Esta forma de corriente es la que terminó por utilizarse en las redes de distribución eléctrica gracias a sus ventajas sobre la corriente continua y gracias a las patentes cedidas gratuitamente por Tesla a Westinhouse.
ca: A ** 1888 ** Nikola Tesla va fabricar el primer motor de corrent altern. Aquesta forma de corrent és la que va acabar utilitzant -se a les xarxes de distribució elèctrica gràcies als seus avantatges sobre el corrent directe i gràcies a les patents assignades lliures de Tesla a Westinhouse.

source: Historia de la electrificación de España
ca: Història de l'electrificació d'Espanya

source: En España la primera empresa que produjo y comercializó electricidad (Sociedad Española de Electricidad) se creó en 1881 en Barcelona. Sin embargo no fue hasta muchos años después cuando la electricidad llegó de forma masiva a todos los hogares.
ca: A Espanya, la primera empresa que va produir i comercialitzar electricitat (Spanish Electricity Society) es va crear el 1881 a Barcelona. Tot i això, no va ser fins molts anys després quan l’electricitat va arribar massivament a totes les cases.

source: Año
ca: Any

source: Energía generada
ca: Energia generada

source: Hogares con electricidad
ca: Cases amb electricitat

source: Clasificación de los motores
ca: Classificació del motor

source: Motores con escobillas
ca: Motors d’escombra d’orella

source: Motores de corriente continua
ca: Motors de corrent continu

source: Motores universales de corriente alterna
ca: Motors actuals alternatius universals

source: Motores de inducción de corriente alterna con rotor bobinado
ca: Alternant motors d'inducció de corrent amb rotor enrotllat

source: Motores sin escobillas
ca: Motors sense pinzells

source: Motores síncronos de inducción
ca: Motors síncrons d’inducció

source: Motores brushless de imanes permanentes
ca: Motors sense escombrat d’imants permanents

source: Motores de reluctancia (motores paso a paso)
ca: Motors de reticència (motors de pas -Per)

source: **Motores lineales**
ca: ** Motors lineals **

source: Partes del motor
ca: Peces del motor

source: Un motor eléctrico está compuesto por dos grandes bloques. El estator, que permanece fijo, y el rotor, que gira cuando el motor está en funcionamiento.
ca: Un motor elèctric està format per dos grans blocs. L’estator, que es manté fix, i el rotor, que gira quan el motor està en funcionament.

source: Partes de un motor de inducción de corriente alterna, abierto para poder observar su interior.
ca: Parts d’un motor d’inducció de corrent altern per observar el seu interior.

source: `S. J. de Waard <https://commons.wikimedia.org/wiki/File:Rotterdam_Ahoy_Europort_2011_(14).JPG>`__, `CC BY-SA 3.0 <https://creativecommons.org/licenses/by-sa/3.0/>`__, via Wikimedia Commons.
ca: `S. J. de Waard <https://commons.wikimedia.org/wiki/file:Rotterdam_ahoy_europort_2011_ (14) .jpg>`__,` `cc by-sa 3.0 <https://creativecommons.org/licenses/by-sa/3.0/>` `` `` `` `` `` `` `` `` `` `` `` `` `` ` `` `` `` `` ``

source: Rotor de jaula de ardilla (inducido).
ca: Rotor de gàbia d'esquirol (induït).

source: y 3. Rodamientos que sujetan el eje del rotor.
ca: i 3. Els coixinets que subjecten l’eix del rotor.

source: Eje giratorio que transporta la energía mecánica.
ca: Eix rotatiu que transporta energia mecànica.

source: Carcasa con aletas de enfriamiento.
ca: Habitatge amb aletes de refrigeració.

source: Ventilador con aspas que enfría la carcasa.
ca: Ventilador amb fulles que refreda la carcassa.

source: Estator que genera un campo magnético giratorio.
ca: Estator que genera un camp magnètic giratori.

source: Bobinas del estator alimentadas con corriente alterna.
ca: Bobines d’estator alimentades amb corrent altern.

source: Pie de sujeción del estator para fijar al motor.
ca: Ester de fixació del peu per arreglar el motor.

source: Rotor de un motor de corriente continua.
ca: Rotor d’un motor de corrent directe.

source: `Sebastian Stabinger <https://commons.wikimedia.org/wiki/File:Kommutator_universalmotor_stab.jpg>`__, `CC BY-SA 3.0 <https://creativecommons.org/licenses/by-sa/3.0/>`__, via Wikimedia Commons.
ca: `Sebastian Astabinger <https://commons.wikimedia.org/wiki/file:Kommutator_universalmotor_stab.jpg>` __, `cc by-sa 3.0 <https://creativecommns.org/licenses/by-sa/3.0/>` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` ` `` `` `` `` `` ``

source: Colector con delgas de conexión.
ca: Col·leccionista amb connexió fina.

source: Devanado de hilo de cobre (bobinas del rotor).
ca: Enrotllament de fil de coure (bobines del rotor).

source: Polos magnéticos del rotor.
ca: Pals magnètics del rotor.

source: Eje de giro del rotor.
ca: Eix de gir del rotor.

source: Funcionamiento del motor eléctrico
ca: Funcionament del motor elèctric

source: El funcionamiento del motor eléctrico se basa en la fuerza que ejerce un campo magnético sobre una corriente eléctrica (fuerza de Lorentz).
ca: El funcionament del motor elèctric es basa en la força exercida per un camp magnètic sobre un corrent elèctric (força de Lorentz).

source: Los motores de corriente continua tienen devanados con muchos cables de cobre aislados (11) por los que pasa corriente proveniente del colector de delgas (10). El campo magnético del estator es fijo, producido por imanes permanentes o por un electroimán. El campo magnético genera una fuerza en la corriente que circula por los hilos de cobre que tiende a girar el rotor. Si invertimos el sentido de la corriente, la fuerza también cambia de sentido y el motor girará en sentido contrario.
ca: Els motors de corrent continu tenen bobinatges amb molts cables de coure aïllats (11) a través dels quals el corrent passa del col·leccionista de Delgas (10). El camp magnètic de l’estator està fixat, produït per imants permanents o per un electromagnet. El camp magnètic genera una força en el corrent que circula pels fils de coure que tendeix a girar el rotor. Si invertim el sentit del corrent, la força també canvia de sentit i el motor es convertirà en el sentit contrari.

source: Cuando el rotor gira, también gira el colector de delgas y alimenta con corriente nuevos cables del rotor. De esta forma siempre están alimentados los cables horizontales que producen fuerza de giro.
ca: Quan el rotor gira, el col·leccionista de Delgas també gira i alimenta nous cables de rotor amb corrent. D’aquesta manera, sempre s’alimenten cables horitzontals que produeixen força de gir.

source: Explicación del motor de corriente continua o de corriente directa (CD).
ca: Explicació del motor de corrent directe o de corrent directe (CD).

source: Vídeo: `¿Cómo funciona un motor eléctrico? Motor de CD Explicado. <https://www.youtube-nocookie.com/embed/A_VGpRxFzXQ>`__
ca: Vídeo: "Com funciona un motor elèctric? Motor de CD explicat. <https://www.youtube-nocokie.com/embed/a_vgprxfzxq>`__

source: En los **motores de inducción** los cables del rotor se sustituyen por barras conductoras. El campo magnético del estator es giratorio y arrastra consigo en su giro a las barras del rotor.
ca: Als motors d'inducció ** ** Els cables del rotor es substitueixen per barres conductives. El camp magnètic de l'estator gira i s'arrossega amb ell al seu torn cap a les barres del rotor.

source: Fabricación de un motor eléctrico
ca: Fabricació d’un motor elèctric

source: Experimento para construir un pequeño motor eléctrico de corriente continua.
ca: Experimenteu per construir un petit motor elèctric de corrent directe.

source: Vídeo: `experimento: Motor eléctrico. <https://www.youtube-nocookie.com/embed/q35IjXC54H8>`__
ca: Vídeo: `Experiment: motor elèctric. <https://www.youtube-nocokie.com/embed/q35ijxc54h8>`__

source: El variador de frecuencia
ca: La unitat de freqüència

source: Un variador de frecuencia es un dispositivo electrónico que controla la tensión y la corriente de alimentación del motor.
ca: Un variador de freqüència és un dispositiu electrònic que controla la tensió i el corrent d’alimentació del motor.

source: La corriente de alimentación del motor es proporcional a la fuerza de giro (par motor). La tensión de alimentación, y su frecuencia, es proporcional a la velocidad de giro del motor. Controlando la corriente y la tensión se controla con precisión el funcionamiento del motor.
ca: El corrent d’alimentació del motor és proporcional a la força de rotació (parell del motor). La tensió d’alimentació i la seva freqüència són proporcionals a la velocitat de rotació del motor. Controlar el corrent i la tensió es controla precisament el funcionament del motor.

source: Una aplicación del variador de frecuencia es mover de forma suave los motores de los vehículos para que tengan una aceleración constante. También pueden controlar la velocidad del medio de transporte. Cuando el variador está funcionando produce un zumbido audible que es característico de los motores de tren y de los automóviles eléctricos.
ca: Una aplicació del variador de freqüència és moure suaument els motors del vehicle de manera que tinguin una acceleració constant. També poden controlar la velocitat dels mitjans de transport. Quan la unitat funciona produeix un brunzit audible que és característic dels motors de tren i dels cotxes elèctrics.

source: Ejercicios
ca: Exercicis

source: ¿Qué es un motor eléctrico y para qué sirve?
ca: Per a què serveix un motor elèctric i per a què serveix?

source: ¿Qué es un generador eléctrico y qué relación tiene con los motores?
ca: Què és un generador elèctric i quina relació amb els motors?

source: Dibuja una línea de tiempo en la que aparezcan los principales hitos de la historia del motor eléctrico.
ca: Dibuixa una línia de temps en què apareixen les fites principals de la història del motor elèctric.

source: Dibuja un gráfico de la historia de la electrificación en España. Debe aparecer una línea con la potencia instalada con los valores en el eje vertical izquierdo en tramos de 15 TWh y otra línea con el porcentaje de hogares con electricidad con los valores en el eje vertical derecho en tramos de 10%.
ca: Dibuixa un gràfic en la història de l’electrificació a Espanya. Una línia amb la potència instal·lada hauria d’aparèixer amb els valors de l’eix vertical esquerre a la 15a –cuts i una altra línia amb el percentatge d’habitatges amb electricitat amb els valors de l’eix vertical dret en un 10%de seccions.

source: ¿Aproximadamente en qué año tuvieron instalada electricidad el 60% de los hogares en España?
ca: Aproximadament en quin any, el 60% de les llars a Espanya havien instal·lat electricitat?

source: Nombra 5 tipos diferentes de motores eléctricos.
ca: Nom 5 diferents tipus de motors elèctrics.

source: Dibuja un motor de inducción y nombra sus partes principales.
ca: Dibuixa un motor d’inducció i nomena les seves parts principals.

source: Dibuja el rotor de un motor de corriente continua y nombra sus partes principales.
ca: Dibuixeu el rotor d’un motor de corrent directe i nomeneu les seves parts principals.

source: Explica el funcionamiento de un motor de corriente continua.
ca: Expliqueu el funcionament d’un motor de corrent directe.

source: ¿Qué es y para qué sirve un variador de frecuencia para motor? Escribe un ejemplo de aplicación.
ca: Què és una unitat de freqüència per al motor? Escriviu un exemple d’aplicació.

source: ¿Cómo se puede controlar la velocidad de giro de un motor? ¿Y su par de giro?
ca: Com es pot controlar la velocitat de rotació d’un motor? I la teva parella?
