Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/electric-simulador-interruptor.po
Languages: ca

source: :index:`Interruptor y pulsador`
ca: :index:`Commutador i botó`

source: En esta práctica simularemos un circuito que enciende una lámpara con un **interruptor** y otro circuito que enciende una lámpara con un **pulsador**. Los interruptores mantienen todo el tiempo el circuito encendido o apagado una vez que se accionan. Sin embargo los pulsadores solo mantienen el circuito encendido mientras se accionan.
ca: En aquesta pràctica simularem un circuit que encengui una làmpada amb un ** commutador ** i un altre circuit que encengui una làmpada amb un botó ** **. Els interruptors mantenen el circuit encès o desactivat un cop activat. Tot i això, els botons només mantenen el circuit encès mentre s’activen.

source: Las aplicaciones típicas de los interruptores son encender una luz de una habitación, encender una regleta de conexión eléctrica o encender un equipo eléctrico.
ca: Les aplicacions dels interruptors típics són per encendre una llum de l'habitació, encendre una tira de connexió elèctrica o encendre un equip elèctric.

source: Las aplicaciones típicas de los pulsadores son accionar el timbre de una casa, el motor de una batidora eléctrica o accionar la apertura de una puerta de portal.
ca: Les aplicacions típiques dels botons són fer funcionar la campana d’una casa, el motor d’una batedora elèctrica o fer funcionar l’obertura d’una porta del portal.

source: Interruptor
ca: Canviar

source: Simula con el simulador online el siguiente circuito con interruptor:
ca: Simula amb el simulador en línia El següent circuit amb commutador:

source: Para obtener cada uno de los elementos del circuito se debe buscar en el menú ``Dibujar`` o pulsar la tecla correspondiente y clicar con el ratón en la pantalla arrastrando:
ca: Per obtenir cadascun dels elements del circuit, heu de mirar al `` dibuixar `` o premeu la tecla corresponent i feu clic amb el ratolí de la pantalla arrossegant:

source: Elemento
ca: Element

source: Tecla
ca: Clau

source: Pila
ca: Apilar

source: Dibujar... Fuentes... Añadir Fuente de Tensión (2 terminales)
ca: Dibuixar ... Fonts ... Afegiu font de tensió (2 terminals)

source: (Arrastra el ratón desde abajo hacia arriba)
ca: (Arrossegueu el ratolí des de baix a dalt)

source: Dibujar... Componentes de Control... Añadir Interruptor
ca: Dibuixa ... Components de control ... Afegeix un commutador

source: Lámpara
ca: Làmpada

source: Dibujar... Salidas... Añadir Lámpara
ca: Dibuixa ... sortides ... Afegeix la làmpada

source: Dibujar... Añadir Conexión Eléctrica
ca: Dibuixa ... Afegeix connexió elèctrica

source: Pulsador
ca: Botó

source: Simula con el simulador online el siguiente circuito con pulsador:
ca: Simula amb el simulador en línia El següent circuit amb un botó:

source: Dibujar... Componentes de Control... Añadir Pulsador
ca: Dibuixa ... Components de control ... Afegeix botó

source: Ejercicios
ca: Exercicis

source: ¿Cómo funciona un interruptor?
ca: Com funciona un interruptor?

source: ¿Cómo funciona un pulsador?
ca: Com funciona un botó?

source: Enumera dos aplicaciones típicas de un interruptor y dos aplicaciones típicas de un pulsador.
ca: Enumereu dues aplicacions típiques d’un commutador i dues aplicacions típiques d’un botó.

source: En los circuitos anteriores nombra los siguientes elementos utilizados:
ca: En els circuits anteriors, nomena els elements següents utilitzats:

source: Elemento generador de tensión:
ca: Element generador de tensió:

source: Elemento de control eléctrico:
ca: Element de control elèctric:

source: Elemento receptor eléctrico:
ca: Element de recepció elèctrica:

source: Elemento conductor eléctrico:
ca: Element de conducció elèctrica:
