Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/electric-simulador-serie.po
Languages: ca

source: :index:`Conexión en serie`
ca: : Índex: `connexió en sèrie '

source: Dos componentes están en serie si están conectados uno detrás de otro en la misma rama de un circuito.
ca: Dos components estan en sèrie si es connecten els uns als altres a la mateixa branca d’un circuit.

source: La conexión en serie tiene la propiedad de sumar la tensión de los generadores y de repartir la tensión entre los receptores. Cuando se retira (o se estropea) uno de los elementos de una conexión en serie, la corriente deja de circular y el circuito se apaga.
ca: La connexió en sèrie té la propietat d’afegir la tensió dels generadors i distribuir la tensió entre els receptors. Quan s’elimina (o es fa malbé) un dels elements d’una connexió en sèrie, el corrent s’atura a circular i el circuit s’apaga.

source: Generadores en serie
ca: Generadors de sèrie

source: Los generadores en serie suman sus tensiones para poder conseguir tensiones mayores. La mayoría de las pilas eléctricas tienen una tensión inferior a 4 voltios, de manera que se juntan en serie para conseguir tensiones mayores.
ca: Els generadors de sèries afegeixen les seves tensions per obtenir tensions més grans. La majoria de les bateries elèctriques tenen una tensió inferior a 4 volts, de manera que es reuneixen en sèrie per obtenir tensions més grans.

source: Por ejemplo la batería tradicional de un automóvil de gasolina tiene 6 pilas de plomo de 2 voltios cada una, consiguiendo así los 12 voltios totales típicos de estas baterías.
ca: Per exemple, la bateria tradicional d’un cotxe de gasolina té 6 bateries de plom de 2 volts cadascuna, aconseguint així els 12 volts totals típics d’aquestes bateries.

source: Las pilas que forman la batería de un automóvil eléctrico tienen 3,6 voltios cada una y se colocan en serie para conseguir cientos de voltios, necesarios para mover el motor eléctrico.
ca: Les bateries que formen la bateria d’un cotxe elèctric tenen 3,6 volts cadascuna i es col·loquen en sèrie per obtenir centenars de volts, necessaris per moure el motor elèctric.

source: Simula en el simulador online los siguientes circuitos con generadores en serie para ver cómo afecta la suma de tensiones a la lámpara:
ca: Simula els circuits següents amb generadors de sèries al simulador en línia per veure com afecta la suma de tensions a la làmpada:

source: Cuantas más pilas colocamos en serie, más tensión tiene el circuito y más se enciende la lámpara.
ca: Com més bateries col·loquem en sèrie, més tensió té el circuit i la làmpada LAR s’encén.

source: Para conseguir que las pilas tengan sólo 1.5 voltios (la tensión típica de una pila alcalina), es necesario clicar doble sobre la pila o clicar con el botón derecho del ratón sobre la pila y escoger ``Editar``:
ca: Per assegurar -se que les bateries només tinguin 1,5 volts (la tensió típica d’una bateria alcalina), cal fer clic a doble a la bateria o fer clic amb el botó dret del ratolí de la bateria i trieu `` edit '':

source: En el cuadro de diálogo Tensión cambiaremos el valor a 1.5 (con punto en vez de coma) y terminaremos clicando en el botón **OK**.
ca: Al quadre de diàleg Tensió canviarem el valor a 1.5 (amb un punt en lloc de coma) i acabarem fent clic al botó ** OK **.

source: Receptores en serie
ca: Receptors de sèries

source: Los receptores en serie se reparten la tensión total del generador de manera que cuantos más elementos se coloquen en serie, menos tensión tendrá cada uno.
ca: Els receptors de la sèrie distribueixen la tensió total del generador de manera que com més elements es col·loquin en sèrie, menys tensió tindrà cadascun.

source: Simula en el simulador online los siguientes circuitos con lámparas en serie para ver cómo afecta a la tensión de cada lámpara:
ca: Simula al simulador en línia els circuits següents amb làmpades de sèrie per veure com afecta la tensió de cada làmpada:

source: Cuando el circuito tiene solamente **una lámpara**, esta recibe toda la tensión del generador y por lo tanto luce al máximo.
ca: Quan el circuit només té ** una làmpada **, rep tota la tensió del generador i, per tant, mira al màxim.

source: Cuando el circuito tiene **dos lámparas** en serie, cada una recibe la mitad de la tensión del generador, por lo que se iluminan menos.
ca: Quan el circuit té ** dues làmpades ** en sèrie, cadascuna rep la meitat de la tensió del generador, de manera que s’il·luminen menys.

source: Por último cuando el circuito tiene **tres lámparas** en serie, cada una recibe una tercera parte de la tensión del generador, por lo que apenas se iluminan.
ca: Finalment, quan el circuit té ** tres làmpades ** en sèrie, cadascuna rep un terç de la tensió del generador, de manera que gairebé no s’il·luminen.

source: Si ahora **arrastramos una de las lámparas** en serie para quitarla del circuito, podemos comprobar cómo todo el circuito deja de funcionar. Para que un circuito en serie funcione, todos sus elementos deben permitir el paso de la corriente:
ca: Si ara ** Arrosseguem una de les làmpades ** en sèrie per treure -la del circuit, podem comprovar com tot el circuit deixa de funcionar. Perquè un circuit de sèrie funcioni, tots els seus elements han de permetre el pas del corrent:

source: Interruptores en serie
ca: Interruptors de sèries

source: Los interruptores sirven para controlar el paso de corriente a través de los receptores. Por esa razón, los interruptores se conectan siempre en serie con los receptores que se quiere controlar. Al estar en serie, cuando el interruptor esté abierto no pasará tampoco corriente por el receptor y cuando el interruptor esté cerrado también pasará corriente por el receptor.
ca: Els interruptors serveixen per controlar el passatge actual pels receptors. Per això, els interruptors sempre estan connectats en sèrie amb els receptors que voleu controlar. Sent sèries, quan l’interruptor estigui obert, no passarà el receptor ni pel receptor i, quan es tanqui l’interruptor, també passarà el receptor.

source: Cuando queremos controlar una lámpara desde dos puntos distintos, la conexión es un poco distinta a la serie y hay que utilizar el siguiente circuito.
ca: Quan volem controlar una làmpada de dos punts diferents, la connexió és una mica diferent de la sèrie i s’ha d’utilitzar el circuit següent.

source: Simula en el simulador online los siguientes circuitos con interruptores y con conmutador en serie (se debe pulsar **S** mayúscula para dibujar el conmutador):
ca: Simula els circuits següents amb commutadors al simulador en línia amb commutadors i amb un commutador de sèrie (ha de fer clic a ** s ** capital per dibuixar el commutador):

source: Al pulsar el interruptor en serie, la lámpara se iluminará.
ca: En prémer l’interruptor de la sèrie, la làmpada s’il·luminarà.

source: En el circuito de la derecha la lámpara se iluminará siempre que los dos conmutadores se coloquen en la misma dirección. Este es el circuito típico que se utiliza para encender la lámpara de un pasillo desde dos posiciones distintas.
ca: Al circuit dret s’il·luminarà la làmpada sempre que els dos interruptors es col·loquin en la mateixa direcció. Aquest és el circuit típic que s’utilitza per encendre la làmpada d’una sala des de dues posicions diferents.

source: Ejercicios
ca: Exercicis

source: ¿Qué es una conexión en serie y qué propiedades tiene?
ca: Què és una connexió en sèrie i quines propietats teniu?

source: Dibuja un circuito con generadores en serie. ¿Qué le ocurre al circuito cuando los generadores están en serie?
ca: Dibuixa un circuit amb generadors de sèries. Què passa amb el circuit quan els generadors estan en sèrie?

source: Dibuja un circuito con receptores en serie. ¿Qué le ocurre al circuito cuando los receptores están en serie?
ca: Dibuixa un circuit amb receptors en sèrie. Què passa amb el circuit quan els receptors estan en sèrie?

source: ¿Por qué los interruptores siempre se conectan en serie con los receptores que queremos controlar?
ca: Per què els interruptors sempre es connecten en sèrie amb els receptors que volem controlar?

source: ¿Qué pasaría si conectamos tres pilas de 6 voltios en serie con tres lámparas en serie? ¿Cuánto crees que se iluminarían?
ca: Què passaria si connectéssim tres bateries de 6 volts en sèrie amb tres làmpades en sèrie? Quant creieu que s’encendrien?

source: Simula el circuito en el `simulador de circuitos online <../circuits/?startCircuit=empty.txt>`__ para comprobarlo.
ca: Simula el circuit al `Circuit Simulator <../ Circuit/? StartCircuit = buits.txt>`__ per comprovar -ho.
