Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/electronic-semiconductores.po
Languages: ca

source: Los componentes semiconductores
ca: Els components semiconductors

source: Los semiconductores como los diodos o los transistores son los componentes basados en el silicio que han desarrollado la electrónica moderna hasta llegar a transformar toda nuestra sociedad.
ca: Semiconductors com els díodes o els transistors són components basats en silici que l'electrònica moderna s'ha desenvolupat fins que tota la nostra societat es transformi.

source: En esta unidad estudiaremos los fundamentos de los componentes electrónicos, su funcionamiento y esquemas eléctricos típicos.
ca: En aquesta unitat estudiarem els fonaments de components electrònics, el seu funcionament i els esquemes elèctrics típics.

source: :download:`Los componentes semiconductores. Formato PDF. <electronic/componentes-semiconductores/electronic-semiconductores.pdf>`
ca: : Descarregueu: `Els components de semiconductor. Format PDF. <Electronic/Components-semiconductors/electrònica-semiconductors.pdf>`

source: :download:`Los componentes semiconductores. Formato editable DOC. <electronic/componentes-semiconductores/electronic-semiconductores.doc>`
ca: : Descarregueu: `Els components de semiconductor. Doc de format editable. <Electrònica/components-semiconductors/electronic semiconductors.doc>`

source: Los semiconductores
ca: Els semiconductors

source: Los materiales **aislantes** como el plástico o la madera no permiten el paso de la corriente eléctrica. Los materiales **conductores** como el cobre o el aluminio permiten el paso de la corriente eléctrica con mucha facilidad. Por otro lado los materiales **semiconductores** como el **silicio** o el **germanio** pueden comportarse como aislantes o como conductores dependiendo de la tensión que reciban. Este comportamiento se puede aprovechar para fabricar circuitos que tengan interruptores semiconductores muy rápidos y controlados electrónicamente.
ca: Materials ** Els aïllants ** com el plàstic o la fusta no permeten el pas del corrent elèctric. Els materials ** conductors ** com el coure o l’alumini permeten el pas del corrent elèctric amb molta facilitat. D'altra banda, els materials ** semiconductors ** com ara ** silici ** o ** Germanio ** es poden comportar com a aïllants o com a conductors segons la tensió que rebin. Aquest comportament es pot utilitzar per fabricar circuits que tinguin interruptors semiconductors molt ràpids i controlats electrònicament.

source: Para que los semiconductores puedan conducir corriente es necesario alearles con trazas de elementos que aporten cargas positivas (Boro, Indio, etc.). o cargas negativas (Fósforo, Arsénico, etc.) De forma que un semiconductor ya aleado se puede denominar de **tipo P** (positivo) o de **tipo N** (negativo).
ca: Perquè els semiconductors puguin conduir, cal aliar -los amb traces d’elements que proporcionen càrregues positives (bor, indi, etc.). o Càrregues negatives (fòsfor, arsènic, etc.) de manera que es pot anomenar un semiconductor ja aliatge ** tipus P ** (positiu) o ** tipus N ** (negatiu).

source: El diodo
ca: El díode

source: Es el componente electrónico más sencillo que se puede fabricar con materiales semiconductores y tiene dos terminales. Internamente está formado por la unión de un bloque de silicio de **tipo P** con un bloque de silicio de **tipo N**. Esta unión permite que la corriente fluya en un sentido, pero no permite que fluya en el sentido contrario.
ca: És el component electrònic més senzill que es pot fabricar amb materials semiconductors i té dos terminals. Internament està format per la unió d’un bloc de silici de ** Type P ** amb un bloc de silici de ** Type N **. Aquesta unió permet que el corrent flueixi en cert sentit, però no li permet fluir en el sentit contrari.

source: En la imagen anterior puede verse el símbolo del diodo, una flecha en la dirección en la que permite el paso de la corriente y el nombre de sus dos terminales. El diodo solo conduce cuando el ánodo tiene tensión positiva y el cátodo tensión negativa.
ca: A la imatge anterior podeu veure el símbol del díode, una fletxa en la direcció en què permet el pas del corrent i el nom dels seus dos terminals. El díode només condueix quan l’ànode té tensió positiva i tensió negativa del càtode.

source: La siguiente imagen es una fotografía con varios tipos de diodos.
ca: La imatge següent és una fotografia amb diversos tipus de díodes.

source: Los diodos tienen múltiples aplicaciones. Por ejemplo, rectificar la corriente alterna, regular tensiones o emitir luz (diodos LED).
ca: Els díodes tenen múltiples aplicacions. Per exemple, rectifiqueu el corrent altern, reguleu les tensions o emeten llum (díodes LED).

source: Esquema de un diodo LED polarizado con una resistencia que reduce la corriente para que no se queme.
ca: Esquema d’un díode LED polaritzat amb una resistència que redueix el corrent perquè no es cremi.

source: Esquema de un diodo rectificador que convierte la tensión alterna de la red eléctrica en tensión continua.
ca: Esquema d’un díode rectificador que converteix la tensió alternativa de la xarxa elèctrica en tensió contínua.

source: El transistor es un componente electrónico de tres terminales que permite el paso de la corriente eléctrica entre dos terminales según la tensión que reciba el tercer terminal. Es como un interruptor controlado por tensión. El primer transistor de silicio se comercializó en 1954.
ca: El transistor és un component electrònic de tres terminals que permet el pas del corrent elèctric entre dos terminals segons la tensió rebuda pel tercer terminal. És com un interruptor de control de tensió. El primer transistor de silici es va comercialitzar el 1954.

source: Transistor de potencia
ca: Transistor de potència

source: Transistor de señal.
ca: Transistor de senyal.

source: Estados del transistor
ca: Estats transistors

source: Dependiendo de la tensión de control que recibe el transistor por la base o por la puerta, puede encontrarse en tres estados distintos.
ca: Depenent de la tensió de control que el transistor rep per la base o per la porta, es pot trobar en tres estats diferents.

source: **Corte:** el transistor no conduce corriente, se comporta como un interruptor abierto.
ca: ** TALL: ** El transistor no condueix el corrent, es comporta com un interruptor obert.

source: **Saturación:** el transistor conduce toda la corriente posible y se comporta como un interruptor cerrado.
ca: ** Saturació: ** El transistor realitza tot el corrent possible i es comporta com un interruptor tancat.

source: Los dos estados anteriores se utilizan en los circuitos digitales como un ordenador, TV, smartphone, etc.
ca: Els dos estats anteriors s’utilitzen en circuits digitals com un ordinador, TV, telèfon intel·ligent, etc.

source: **Zona lineal:** el transistor solo conduce parte de la corriente y se comporta como una resistencia.
ca: ** Zona lineal: ** El transistor només condueix part del corrent i es comporta com a resistència.

source: Este comportamiento se utiliza en los circuitos analógicos tales como los amplificadores de sonido.
ca: Aquest comportament s’utilitza en circuits analògics com ara amplificadors de so.

source: Circuitos típicos
ca: Circuits típics

source: Transistor amplificador. Este circuito funciona como un amplificador de luz. Cuando se ilumina a la resistencia LDR, aumenta la corriente que la atraviesa. Esa corriente llega a la base del transistor y el transistor la amplifica a través del colector, encendiendo la lámpara conectada. Este es un circuito analógico porque el transistor trabaja en zona lineal comportándose como una resistencia controlada por la corriente de base.
ca: Transistor amplificador. Aquest circuit funciona com a amplificador de llum. Quan s’il·lumina a la resistència a la LDR, augmenta el corrent que el creua. Aquest corrent arriba a la base del transistor i el transistor l’amplifica a través del col·lector, il·luminant la làmpada connectada. Es tracta d’un circuit analògic perquè el transistor funciona en una zona lineal que es comporta com a resistència controlada pel corrent base.

source: Transistor digital. Este circuito es una puerta lógica NOR formada a partir de transistores. Gracias al paralelo de los dos colectores, la salida solo tiene tensión alta cuando las dos entradas están a tensión baja. Estas puertas lógicas son la base de los circuitos digitales y de los ordenadores.
ca: Transistor digital. Aquest circuit és una porta ni lògica formada per transistors. Gràcies al paral·lel dels dos col·leccionistes, la sortida només té una gran tensió quan les dues entrades són a baixa tensió. Aquestes portes lògiques són la base de circuits i ordinadors digitals.

source: Las resistencias LDR
ca: Resistències de LDR

source: Las LDR (Resistencias Dependientes de la Luz) son, como su nombre indica, sensores que detectan luz. Su resistencia se reduce cuando la iluminación es mayor, aumentando la corriente que conducen cuanta más luz reciben.
ca: La LDR (resistències dependents de la llum) són, com el nom indica, els sensors que detecten llum. La seva resistència es redueix quan la il·luminació és més gran, augmentant el corrent que condueix la major llum que reben.

source: Símbolo y fotografía de una resistencia LDR.
ca: Símbol i fotografia d’una resistència a la LDR.

source: Los circuitos integrados
ca: Circuits integrats

source: Un circuito integrado es una pequeña pastilla de silicio, también llamada chip, que contiene multitud de componentes electrónicos en su interior.
ca: Un circuit integrat és una petita píndola de silici, també anomenada xip, que conté molts components electrònics al seu interior.

source: Circuito integrado LM555.
ca: Circuit integrat LM555.

source: Circuito integrado DAC08.
ca: Circuit integrat DAC08.

source: Con el desarrollo de la tecnología, cada año se reduce más el tamaño de los componentes, pudiendo agrupar cada vez más transistores en un solo circuito integrado. A comienzos de los años 1960 la industria aeroespacial comenzó a comprar circuitos que integraban hasta 100 transistores en una sola pastilla. Esto hizo que bajaran los precios de producción y fomentó el desarrollo de la tecnología. A comienzos de 1980 ya se podían comprar chips con 100 mil transistores, en 2000 100 millones de transistores y en 2020 100 mil millones de transistores en un solo chip. Este crecimiento exponencial del número de transistores integrados en un chip que se duplican cada año y medio se conoce como ley de Moore y ha permitido el desarrollo de la sociedad digital que todos conocemos, con multitud de dispositivos inteligentes, memorias, cámaras, drones, etc. basados en estos potentes circuitos integrados.
ca: Amb el desenvolupament de la tecnologia, la mida dels components es redueix cada any, podent agrupar cada cop més transist en un sol circuit integrat. A principis dels anys seixanta, la indústria aeroespacial va començar a comprar circuits que s’integraven fins a 100 transistors en una sola píndola. Això va fer que els preus de la producció baixessin i fomentessin el desenvolupament de la tecnologia. A principis de 1980 ja podríeu comprar xips amb 100.000 transistors, el 2000 100 milions de transistors i el 2020 100 mil milions de transistors en un sol xip. Aquest creixement exponencial del nombre de transistors integrats en un xip que es dobla cada any i mig es coneix com a llei de Moore i ha permès el desenvolupament de la societat digital que tots sabem, amb molts dispositius intel·ligents, records, càmeres, drons, etc. basats en aquests poderosos circuits integrats.

source: Ejercicios
ca: Exercicis

source: ¿Qué tipos de materiales hay dependiendo de cómo conducen la electricidad? Escribe dos ejemplos de cada uno.
ca: Quins tipus de materials depenen de la conducta de l’electricitat? Escriviu dos exemples de cadascun.

source: ¿Por qué son tan útiles los semiconductores?
ca: Per què els semiconductors són tan útils?

source: ¿Qué hace falta hacer para que un semiconductor conduzca corriente eléctrica?
ca: Què cal fer per a un semiconductor per conduir el corrent elèctric?

source: ¿Cómo está construido un diodo semiconductor?
ca: Com es construeix un díode semiconductor?

source: Dibuja el símbolo de un diodo semiconductor y nombra sus terminales.
ca: Dibuixeu el símbol d’un díode semiconductor i nomeneu els seus terminals.

source: ¿Cuándo conduce corriente un diodo?
ca: Quan un díode condueix actual?

source: Dibuja dos esquemas eléctricos con diodos.
ca: Dibuixa dos esquemes elèctrics amb díodes.

source: ¿Qué aplicaciones tienen los diodos?
ca: Quines aplicacions tenen els díodes?

source: ¿Qué es un transistor? ¿Cuántos terminales tiene?
ca: Què és un transistor? Quants terminals teniu?

source: ¿Qué estados puede tener un transistor?
ca: Quins estats pot tenir un transistor?

source: ¿Qué estados del transistor se utilizan en los circuitos analógicos? ¿Y en los digitales?
ca: Quins estats de transistor s’utilitzen en circuits analògics? I en els digitals?

source: Dibuja el símbolo de un transistor bipolar y de un MOSFET con el nombre de sus patillas.
ca: Dibuixa el símbol d’un transistor bipolar i d’un MOSFET amb el nom dels seus pins.

source: Dibuja un circuito con un transistor funcionando como amplificador de luz.
ca: Dibuixeu un circuit amb un transistor que funcioni com a amplificador de llum.

source: Dibuja una puerta lógica NOR con transistores.
ca: Dibuixa una porta ni lògica amb transistors.

source: ¿Qué es una LDR y qué significan esas siglas?
ca: Què és un LDR i què signifiquen aquestes sigles?

source: ¿Qué es un circuito integrado o chip?
ca: Què és un circuit o xip integrat?

source: ¿Cuándo comenzaron a fabricarse los circuitos integrados y cuántos transistores tenían?
ca: Quan van començar a fabricar els circuits integrats i quants transistors tenien?

source: Dibuja una gráfica con el número de transistores que contiene un chip. En el eje X coloca los años y en el eje Y el número de transistores en escala exponencial (10, 100, 1000, 10mil, etc.)
ca: Dibuixa un gràfic amb el nombre de transistors que conté un xip. A l’eix x situa els anys i l’eix i el nombre de transistors a escala exponencial (10, 100, 1000, 10mil, etc.)

source: ¿Qué es la ley de Moore?
ca: Què és la llei de Moore?
