Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/electronic-binary.po
Languages: ca

source: El sistema binario
ca: El sistema binari

source: La electrónica digital funciona con dos valores válidos, encendido y apagado. El `sistema binario <https://es.wikipedia.org/wiki/Sistema_binario>`__ es un sistema de numeración que solo utiliza dos cifras, el cero (0) y el uno (1), por lo que se adapta muy bien a representar los dos estados de la electrónica digital.
ca: Digital Electronics funciona amb dos valors vàlids, activat i desactivat. El `sistema binari <https://es.wikipedia.org/wiki/system_binario>`__ és un sistema de numeració que només utilitza dues figures, zero (0) i una (1), de manera que s’adapta molt bé per representar els dos estats d’electrònica digital.

source: Casi todas las computadoras modernas están basadas en electrónica digital y su sistema de numeración y de representación de la información es el sistema binario.
ca: Gairebé tots els ordinadors moderns es basen en l'electrònica digital i el seu sistema de numeració i representació de la informació és el sistema binari.

source: Contar en binario
ca: Compte en binari

source: En la siguiente tabla se presentan los 16 primeros números en decimal y en binario, comenzando por el cero y terminando en el valor quince:
ca: La taula següent mostra els primers 16 números en decimal i binari, començant per zero i acabant en el valor de quinze:

source: Como se puede observar, hay ciertas normas en los números binarios que nos pueden ayudar a construir la tabla con la cuenta en binario:
ca: Com es pot veure, hi ha algunes regles en números binaris que ens poden ajudar a construir la taula amb el compte binari:

source: En binario solo utilizan los dígitos cero y uno.
ca: Al binari només utilitzen zero i un dígit.

source: El cero decimal corresponde con todos los dígitos binarios a cero.
ca: El decimal zero correspon a tots els dígits binaris a zero.

source: El dígito binario más a la derecha, que es el de menos valor, cambia constantemente de cero a uno a medida que contamos un número más. 0 1 0 1 0 1 0 1 ...
ca: El dígit binari a la dreta, que és el menor valor, canvia constantment de zero a un, ja que comptem un número més. 0 1 0 1 0 1 0 1 ...

source: El segundo dígito binario comenzando a la derecha cambia cada **dos** números desde cero hasta uno. 0 0 1 1 0 0 1 1 ...
ca: El segon dígit binari que comença la dreta canvia cada ** dos ** números de zero a un. 0 0 1 1 0 0 1 1 ...

source: El tercer dígito binario comenzando a la derecha cambia cada **cuatro** números desde cero hasta uno. 0 0 0 0 1 1 1 1 ...
ca: El tercer dígit binari que comença a la dreta canvia cada ** quatre ** números de zero a un. 0 0 0 1 1 1 1 ...

source: El cuarto dígito binario comenzando a la derecha, que es el de más valor, cambia cada **ocho** números desde cero hasta uno. 0 0 0 0 0 0 0 0 1 1 1 1 1 1 1 1.
ca: El quart dígit binari que comença a la dreta, que és el més valor, canvia cada ** vuit ** números de zero a un. 0 0 0 0 0 0 0 0 1 1 1 1 1 1 1.

source: Conversión de decimal a binario
ca: Conversió decimal a binària

source: Los humanos estamos acostumbrados a contar y ver números en notación decimal, por lo que es conveniente saber convertir cualquier número decimal a notación binaria.
ca: Els humans estan acostumats a comptar i veure números en notació decimal, per la qual cosa és convenient saber convertir qualsevol nombre decimal en notació binària.

source: Para convertir un número decimal a binario dividiremos el número entre dos consecutivamente hasta que no quede ningún valor que dividir. El número binario saldrá de los restos de las divisiones consecutivas, de manera que el primer resto obtenido será el dígito binario de menos peso y el último resto obtenido será el dígito binario de mayor peso:
ca: Per convertir un nombre decimal al nombre binari, dividirem el nombre per dos consecutivament fins que no hi hagi cap valor a dividir. El nombre binari deixarà les restes de les divisions consecutives, de manera que el primer descans obtingut serà el dígit binari de menys pes i el darrer descans obtingut serà el dígit binari de major pes:

source: Proceso para convertir un número decimal a binario dividiendo consecutivamente por dos.
ca: Procés per convertir un nombre de decimals a binaris dividint consecutivament per dos.

source: Otro ejemplo de conversión del número decimal 146 a binario:
ca: Un altre exemple de conversió del número decimal 146 al binari:

source: Conversión de binario a decimal
ca: Conversió binària a decimal

source: Una forma sencilla de convertir un número binario en número decimal consiste en crear una tabla con el valor de cada dígito binario.
ca: Una manera senzilla de convertir un número binari en un nombre decimal és crear una taula amb el valor de cada dígit binari.

source: El primer dígito binario a la derecha, el de menor valor, tiene un valor de uno (1). El segundo dígito binario por la derecha tiene un valor de dos (2). Los valores van aumentando así, multiplicándose por dos. En la octava posición, el valor del dígito binario es de 128.
ca: El primer dígit binari a la dreta, el que té el valor més baix, té un valor d’un (1). El segon dígit binari de la dreta té un valor de dos (2). Els valors augmenten així, multiplicant -se per dos. A la vuitena posició, el valor del dígit binari és de 128.

source: Una vez construida la tabla de los valores de cada dígito binario, solo es necesario sumar aquellos valores que corresponden a un uno en el número binario:
ca: Un cop creada la taula dels valors de cada dígit binari, només cal afegir aquells valors que corresponguin a un del número binari:

source: Conversión de binario a decimal.
ca: Conversió binària a decimal.

source: Ejercicios
ca: Exercicis

source: Haz una tabla con los números binarios desde el cero hasta el 31 utilizando las normas que se han descrito en el apartado de 'Contar en binario'.
ca: Feu una taula amb números binaris de zero a 31 mitjançant els estàndards descrits a la secció "Compte in Binary".

source: Recuerda dejar espacio suficiente para 5 dígitos binarios.
ca: No oblideu deixar prou espai per a 5 dígits binaris.

source: Convierte los siguientes números de decimal a binario:
ca: Converteix el següent decimal en números binaris:

source: Convierte los siguientes números de binario a decimal:
ca: Converteix el següent binari en nombres decimals:
