Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/electronic-pcb-luces-led.po
Languages: ca

source: Circuito impreso con luces led
ca: Circuit imprès amb llums LED

source: Diseño y montaje de un sencillo circuito impreso con 6 luces led parpadeantes.
ca: Disseny i muntatge d’un circuit imprès senzill amb 6 llums LED intermitents.

source: :download:`Placa de circuito impreso ya montada. Formato JPG. <electronic/_images/electronic-pcb-luces-led-03.jpg>`
ca: : Descarregueu: `Placa de circuit imprès ja muntat. Format JPG. <Electronic/_Images/Electronic-PB-Luces-Led-03.jpg> `

source: Circuito eléctrico completo
ca: Circuit elèctric complet

source: :download:`Circuito eléctrico del circuito con luces led. Formato PDF. <electronic/electronic-pcb-luces-led.pdf>`
ca: : Descàrrega: `Circuit elèctric del circuit amb llums LED. Format PDF. <Electronic/Electronic-PB-Luces-led.pdf>`

source: Funcionamiento del circuito oscilador
ca: Funcionament del circuit oscil·lador

source: El circuito con luces que parpadean está basado en un oscilador que cambia su salida cada poco tiempo, encendiendo y apagando el led.
ca: El circuit amb llums que parpelleja es basa en un oscil·lador que canvia la seva sortida cada poc temps, encès i desactivat el LED.

source: Este circuito oscilador está formado por un inversor con trigger schmitt, un condensador C1 y una resistencia de realimentación R3.
ca: Aquest circuit oscil·lador està format per un inversor amb Trigger Schmitt, un condensador C1 i una resistència a la retroalimentació R3.

source: El circuito inversor con trigger schmitt cambia su salida a diferentes tensiones de entrada. Este comportamiento se denomina histéresis de entrada y es el que permite que el circuito funcione como oscilador. En la siguiente gráfica podemos ver como cambia la tensión de salida del inversor para diferentes tensiones de entrada. Esta figura rectangular con dos líneas horizontales es la que tiene el inversor en su interior e indica que trabaja con histéresis.
ca: El circuit d’inversors amb disparador Schmitt canvia la seva sortida a diferents tensions d’entrada. Aquest comportament s’anomena histèresi d’entrada i és el que permet que el circuit funcioni com a oscil·lador. Al gràfic següent podem veure com canvia la tensió de sortida del inversor per a diferents tensions d’entrada. Aquesta figura rectangular amb dues línies horitzontals és el que té l’inversor i indica que treballa amb histèresi.

source: Cuando se enciende el circuito por primera vez, el condensador está descargado y por lo tanto su tensión en el terminal positivo vale cero voltios. El inversor schmitt tiene por lo tanto en su entrada cero voltios (un cero lógico) y en su salida los 5 voltios de alimentación positiva (un uno lógico). En esta situación, la resistencia de realimentación R3 va cargando poco a poco la tensión del condensador hasta que alcanza los 3,33 voltios, tensión a partir de la cual el inversor schmitt considera que la entrada vale un uno lógico y por lo tanto cambia su salida a cero voltios (cero lógico).
ca: Quan el circuit està activat per primera vegada, el condensador es descarrega i, per tant, la seva tensió al terminal positiu val zero volts. L’inversor de Schmitt té, per tant, zero volts (un zero lògic) i a la seva sortida els 5 volts d’alimentació positiva (lògica). En aquesta situació, la resistència a la retroalimentació R3 porta gradualment la tensió del condensador fins que arribi a 3,33 volts, la tensió de la qual l’inversor de Schmitt considera que l’entrada val la pena lògica i, per tant, canvia la seva sortida a zero volts (lògic zero).

source: Ahora, la resistencia de realimentación R3 va descargando poco a poco la tensión del condensador hasta que alcanza 1,66 voltios, tensión a partir de la cual el inversor schmitt considera que la entrada vale un cero lógico y por lo tanto cambia su salida a cinco voltios (uno lógico) volviendo el ciclo a repetirse una y otra vez.
ca: Ara, la resistència a la retroalimentació de R3 està descarregant gradualment la tensió del condensador fins que arribi a 1,66 volts, la tensió de la qual l’inversor de Schmitt considera que l’entrada val la pena un zero lògic i, per tant, canvia la seva sortida a cinc volts (un lògic) retornant el cicle per repetir -se una i altra vegada.

source: La velocidad de oscilación dependerá de los valores del condensador y de la resistencia. Cuanto mayores sean, más tiempo tardará en oscilar el circuito. La fórmula aproximada del tiempo de oscilación es:
ca: La velocitat d’oscil·lació dependrà dels valors del condensador i de la resistència. Com més vells siguin, més llarg el circuit trigarà a abastar -se. La fórmula aproximada del temps d’oscil·lació és:

source: Tiempo de oscilación = 0,8·R3·C1 = 0,8 · 220000 · 0,000010 = 1,76 segundos
ca: Temps d’oscil·lació = 0,8 · R3 · C1 = 0,8 · 220000 · 0.000010 = 1,76 segons

source: El led D1 conectado a la salida del oscilador mediante una resistencia limitadora R1, se encenderá y apagará a la misma velocidad que el oscilador.
ca: El LED D1 connectat a la sortida oscil·ladora mitjançant una resistència limitant R1, s’encendrà i s’apagarà a la mateixa velocitat que l’oscil·lador.

source: El led D2 conectado a la salida de otro inversor schmitt mediante una resistencia limitadora R2, se encenderá cuando D1 esté apagado y se apagará cuando D1 esté encendido, produciendo un parpadeo alternativo.
ca: El LED D2 connectat a la sortida d’un altre inversor Schmitt mitjançant una resistència limitant R2, s’encendrà quan D1 s’apagui i s’apagarà quan D1 estigui activat, produint un parpelleig alternatiu.

source: Este comportamiento se repite en los tres osciladores que tiene el circuito completo, a diferentes frecuencias dado que R3, R6 y R9 tienen diferentes valores y, por lo tanto, diferentes velocidades de parpadeo.
ca: Aquest comportament es repeteix en els tres oscil·ladors que el circuit complet té, a diferents freqüències des de R3, R6 i R9, tenen valors diferents i, per tant, diferents velocitats de matràs.

source: Circuito impreso (PCB)
ca: Circuit imprès (PCB)

source: :download:`Diseño del circuito eléctrico y del circuito impreso. Formato KiCad. <electronic/electronic-pcb-luces-led.zip>`
ca: : Descàrrega: `Disseny del circuit elèctric i del circuit imprès. Format KICAD. <Electronic/Electronic-PB-Luces-led.zip>`

source: :download:`Archivos Gerber para la fabricación del circuito impreso. Formato ZIP. <electronic/electronic-pcb-luces-led-gerber.zip>`
ca: : Descarregueu: `Gerber Files per a la fabricació del circuit imprès. Format postal. <Electronic/Electronic-PB-Luces-Led-Gerber.Zip>`

source: Los archivos gerber sirven para solicitar la fabricación de la placa de circuito impreso a una empresa de fabricación de placas de circuito impreso como pueden ser `JLCPCB <https://jlcpcb.com/>`__ o `PCBWay <https://www.pcbway.com/>`__.
ca: Els fitxers Gerber serveixen per sol·licitar la fabricació de la placa de circuit imprès a una empresa de fabricació de plaques de circuit imprès com ara `jlcpcb <https://jlcpcb.com/>`__ o `pcbway <https://www.pcbway.com/>` __.

source: En total hay un conjunto de 7 archivos gerber diferentes, tres archivos para la parte frontal, 3 archivos para la capa trasera y uno para los bordes de la placa. Además hay un archivo que indica dónde se deben realizar los taladros (drill).
ca: En total, hi ha un conjunt de 7 fitxers Gerber diferents, tres fitxers per a la part frontal, 3 fitxers per a la capa posterior i un per a les vores de la placa. També hi ha un fitxer que indica on s’han de fer els exercicis (perfor).

source: Los archivos gerber y de taladrado se reparten como indica a continuación:
ca: Els fitxers Gerber i de perforació es distribueixen tal com s’indica a continuació:

source: Pistas de cobre de la capa frontal (F_Cu)
ca: Pistes de coure de la capa frontal (f_cu)

source: Pistas de cobre de la capa trasera (B_Cu)
ca: Pistes de coure de la capa posterior (B_CU)

source: Máscara de soldadura de la capa frontal (F_Mask)
ca: Màscara de soldadura de capa frontal (F_MASK)

source: Máscara de soldadura de la capa trasera (B_Mask)
ca: Màscara de soldadura de la capa posterior (b_mask)

source: Serigrafía de componentes de la parte frontal (F_SilkS)
ca: Impressió de components de la part frontal (f_silks)

source: Serigrafía de componentes de la parte trasera (B_SilkS)
ca: Fons dels components posteriors (b_silks)

source: Bordes para recortar la placa (Edge_Cuts)
ca: Vores per tallar la placa (edge_cuts)

source: Archivo de taladros (.drl)
ca: Arxius de perforació (.DRL)

source: **Pistas de cobre:**
ca: ** Pistes de coure: **

source: Son los conductores que conectan entre sí todos los componentes de la placa de circuito impreso. Aparecen en el dibujo con color amarillo (sin máscara de soldadura) o de color verde claro (ya cubiertos de máscara de soldadura).
ca: Són els conductors que connecten tots els components de la placa de circuit imprès. Apareixen al dibuix groc (sense màscara de soldadura) o de color verd clar (ja cobert amb màscara de soldadura).

source: **Máscara de soldadura:**
ca: ** Màscara de soldadura: **

source: Es una capa de pintura, normalmente de color verde aunque puede tener otros colores, que sirve para proteger las pistas de cobre de la corrosión y para evitar cortocircuitos a la hora de realizar el proceso de soldadura. La máscara de soldadura no se aplica encima de los pads de soldadura.
ca: És una capa de pintura, generalment verda, tot i que pot tenir altres colors, que serveix per protegir les pistes de coure de la corrosió i per evitar els curtmetratges quan es realitzen el procés de soldadura. La màscara de soldadura no s'aplica a sobre de les pastilles de soldadura.

source: **Serigrafía de componentes**:
ca: ** Serigrafia de components **:

source: Es una capa de pintura, generalmente de color blanco, que sirve para indicar el nombre de los componentes del circuito y para escribir indicaciones o dibujos. Esta capa de pintura se aplica con la técnica de la serigrafía y de ahí su nombre.
ca: És una capa de pintura, generalment blanca, que serveix per indicar el nom dels components del circuit i per escriure indicacions o dibuixos. Aquesta capa de pintura s’aplica amb la tècnica d’impressió de pantalla i, per tant, el seu nom.

source: Listado de componentes (BOM)
ca: Llista de components (BOM)

source: El listado de componentes (llamado también BOM o Bill Of Materials) es un listado donde aparecen todos los componentes del circuito impreso con su cantidad y su referencia para poder obtenerlos antes de realizar el montaje.
ca: La llista de components (també anomenat BOM o Bill of Materials) és una llista on tots els components del circuit imprès apareixen amb la seva quantitat i referència per poder -los obtenir abans de fer el muntatge.

source: La lista de componentes puede tener también la referencia de compra de un distribuidor de componentes electrónicos. En el siguiente documento se han añadido las referencias del distribuidor `TME <https://www.tme.eu/es/>`__.
ca: La llista de components també pot tenir la referència de compra d’un distribuïdor de components electrònics. Al document següent, s’han afegit les referències del `TME <https://www.tme.eu/es/>`__ distribuïdor.

source: :download:`Listado de componentes de la placa con luces led. Formato PDF. <electronic/pcb-luces-led/bom/electronic-pcb-luces-led-bom.pdf>`
ca: : Descarregueu: `Llista de components de la placa amb llums LED. Format PDF. <Electronic/PCB-Luces-Led/Bom/Electronic-PCB-Luces-Led-bom.pdf>`

source: :download:`Listado de componentes de la placa con luces led. Formato ODS. <electronic/pcb-luces-led/bom/electronic-pcb-luces-led-bom.ods>`
ca: : Descarregueu: `Llista de components de la placa amb llums LED. Format ODS. <Electronic/PCB-Luces-Led/Bom/Electronic-Pb-Luces-Led-Bom.ods>`

source: Orden y posición de montaje
ca: Ordre de muntatge i posició

source: A la hora de soldar los componentes conviene seguir un orden, de manera que se suelden primero los componentes más bajos y después los más altos. De esta forma, al dar la vuelta a la placa de circuito impreso, los componentes pueden apoyarse sobre la mesa y no quedarán despegados de la placa.
ca: Quan la soldadura, els components han de seguir un ordre, de manera que els components més baixos es solden primer i els més alts. D’aquesta manera, al voltant de la placa del circuit imprès, els components poden confiar en la taula i no es desprenen de la placa.

source: Además cada componente tiene una posición de soldadura. Si no respetamos esta posición corremos el riesgo de estropear el componente o hacer que no funcione el circuito.
ca: A més, cada component té una posició de soldadura. Si no respectem aquesta posició, correm el risc de fer malbé el component o fer que el circuit funcioni.

source: El orden y posición de montaje son las siguientes:
ca: L’ordre i la posició del muntatge són els següents:

source: **1. Resistencias**:
ca: ** 1. Resistències **:

source: No necesitan ningún orden en particular para funcionar correctamente, pero el código de colores resulta más elegante y más sencillo de leer cuando todas las bandas de oro están alineadas a la derecha (resistencias horizontales) o hacia arriba (resistencias verticales) como en la imagen del inicio de esta unidad.
ca: No necessiten cap ordre particular per funcionar correctament, però el codi de colors és més elegant i fàcil de llegir quan totes les bandes d'or estan alineades a la dreta (resistències horitzontals) o cap amunt (resistències verticals) com a la imatge de l'inici d'aquesta unitat.

source: **2. Interruptor de encendido SW1**:
ca: ** 2. Sw1 Switch Switch **:

source: Habrá que montarlo de forma que la palanca del interruptor se sitúe fuera del circuito impreso para que resulte sencillo accionar el interruptor.
ca: Caldrà muntar -lo de manera que la palanca de commutador estigui situada fora del circuit imprès de manera que sigui senzill conduir l’interruptor.

source: **3. Zócalo del circuito integrado**:
ca: ** 3. Circuit integrat Zócalo **:

source: El zócalo tiene una pequeña pestaña en la parte superior que hay que alinear con la pestaña de la serigrafía de componentes, también en la parte superior del zócalo.
ca: El Zocalo té una petita fitxa a la part superior que ha d’estar alineada amb la pestanya d’impressió de pantalla de components, també a la part superior del Zócalo.

source: Si insertamos el circuito integrado en sentido incorrecto (hacia abajo) corremos el riesgo de estropearlo cuando circule corriente.
ca: Si inserim el circuit integrat de manera incorrecta (cap avall), correm el risc de fer -lo malbé quan circula el corrent.

source: **4. Condensadores**:
ca: ** 4. CONDENTS **:

source: Los condensadores electrolíticos tienen una banda blanca en uno de sus dos pines que indica el polo negativo del componente y que hay que montar en la zona también blanca de la serigrafía del circuito impreso.
ca: Els condensadors electrolítics tenen una banda blanca en un dels seus dos pins que indica el pol negatiu del component i que també s’ha de muntar a la zona blanca de la impressió del circuit imprès.

source: Es muy importante que los condensadores estén correctamente montados porque si reciben tensión en sentido inverso se estropearán y también generan gas en su interior que puede llegar a hacer que exploten.
ca: És molt important que els condensadors estiguin muntats correctament perquè si reben tensió al revés, s’esfondraran i també generaran gas dins que poden fer -los explotar.

source: **5. Diodos led**:
ca: ** 5. Diodes LED **:

source: Los diodos solo conducen en un sentido y no funcionan en sentido contrario. En la serigrafía de la placa de circuito impreso la patilla negativa o cátodo de los led siempre está mirando hacia la izquierda. Se distingue porque el círculo tiene un chaflán y porque el pad de soldadura es cuadrado.
ca: Els díodes només condueixen en un sentit i no funcionen en sentit contrari. A la pantalla d’impressió de la placa del circuit imprès, el negatiu o el càtode del LED sempre mira cap a l’esquerra. Es distingeix perquè el cercle té un chaflán i perquè el coixinet de soldadura és quadrat.

source: A la hora de distinguir el cátodo en los diodos led, la manera más sencilla es mirar en su interior y buscar la zona metálica más grande, donde se apoya el led y que está conectada a la patilla negativa (cátodo).
ca: En distingir el càtode en díodes LED, la manera més fàcil és mirar cap a dins i buscar la zona metàl·lica més gran, on el LED es recolza i es connecta al passador negatiu (càtode).

source: **6. Cables de batería**:
ca: ** 6. Cables de bateria **:

source: Es muy importante respetar el orden de los cables de la batería para no quemar el circuito.
ca: És molt important respectar l’ordre dels cables de la bateria per no cremar el circuit.

source: El cable **rojo es positivo** y va conectado en el agujero superior (indicado con un símbolo `+` en la serigrafía).
ca: El cable vermell ** és positiu ** i està connectat al forat superior (indicat amb un símbol `+` a la serigrafia).

source: El cable **negro es negativo** y va conectado en el agujero inferior (indicado con un símbolo `-` en la serigrafía).
ca: El cable ** negre és negatiu ** i està connectat al forat inferior (indicat amb un símbol `-` a la serigrafia).

source: La soldadura se realiza aportando material que está compuesto de estaño y **plomo**, por lo que es necesario seguir algunos procedimientos de seguridad.
ca: La soldadura es fa proporcionant material compost per estany i ** plom **, per la qual cosa cal seguir alguns procediments de seguretat.

source: Es importante utilizar guantes o **lavarse las manos** correctamente después de manipular el hilo de estaño-plomo.
ca: És important utilitzar guants o ** rentar-vos les mans ** correctament després de manejar el fil de llauna.

source: Durante la soldadura se producen **gases tóxicos** provenientes del flux antioxidante. Estos gases no deben ser inhalados. Se debe soldar en un local bien ventilado con las ventanas abiertas.
ca: Durant la soldadura ** gasos tòxics ** es produeixen des del flux antioxidant. Aquests gasos no s’han d’inhalar. S'ha de soldar en un lloc ben ventilat amb finestres obertes.

source: La técnica de soldadura es relativamente sencilla, pero no viene mal tener antes de comenzar unos conceptos claros sobre cómo realizarla correctamente.
ca: La tècnica de soldadura és relativament senzilla, però no és dolent tenir conceptes clars sobre com fer -ho correctament.

source: En el siguiente vídeo se puede ver la técnica correcta para la soldadura de los componentes.
ca: Al següent vídeo podeu veure la tècnica correcta per a la soldadura dels components.

source: Vídeo: `solder Through-hole Components - Soldering Techniques #02. <https://www.youtube-nocookie.com/embed/vAx89WhpZ3k>`__
ca: VÍDEO: `Solder mitjançant components de forats - Tècniques de soldadura #02. <https://www.youtube-nocokie.com/embed/vax89whpz3k>`__

source: En el siguiente vídeo podemos observar la gran diferencia que hay entre un estaño de soldadura de buena calidad y otro de baja calidad. El estaño de buena calidad es mucho más sencillo de trabajar y deja una soldadura brillante, menos oxidada y más robusta.
ca: Al següent vídeo podem veure la gran diferència entre una bona qualitat i una estany de soldadura de baixa qualitat. La llauna de bona qualitat és molt més fàcil de treballar i deixar una soldadura brillant, menys oxidada i més robusta.

source: Vídeo: `solder wire - Low vs High Quality. <https://www.youtube-nocookie.com/embed/5Ku7I3hA3AA>`__
ca: Vídeo: `Wire Solder - baixa i alta qualitat. <https://www.youtube-nocokie.com/embed/5ku7i3ha3a> `` `

source: El siguiente vídeo nos muestra la utilidad del flux en soldadura. Al mantener caliente un punto de soldadura durante un tiempo excesivo, el flux se evapora y la soldadura se oxida y pierde brillo.
ca: El vídeo següent ens mostra la utilitat del flux en la soldadura. Si es manté un punt de soldadura calenta durant un temps excessiu, el flux s’evapora i la soldadura s’oxida i perd la brillantor.

source: Vídeo: `when to use Flux? <https://www.youtube-nocookie.com/embed/tfIwHuGzUEk>`__
ca: Vídeo: `Quan utilitzar FLX? <https://www.youtube-nocokie.com/embed/tfiwhugzuek>`__

source: Reparar una soldadura
ca: Repareu una soldadura

source: En el caso de que soldemos de manera incorrecta un componente, podemos desoldarle para volver a soldarle en la posición correcta. Para desoldar hay muchas técnicas, una de las más sencillas es absorber el estaño de soldadura con una malla de hilos finos de cobre.
ca: En cas que incorregim un component de manera incorrecta, podem desaprovar la soldadura en la posició adequada. Per decebre hi ha moltes tècniques, una de les més senzilles és absorbir la llauna de soldadura amb una malla de fils de coure fins.

source: En el siguiente vídeo se pueden observar algunas técnicas de desoldar.
ca: Al següent vídeo podeu veure algunes tècniques de Desold.

source: Vídeo: `desoldering | Soldering for Beginners. <https://www.youtube-nocookie.com/embed/bG7yW9FigJA>`__
ca: Vídeo: `Desoldering | Soldadura per a principiants. <https://www.youtube-nocokie.com/embed/bg7yw9figja>`__
