Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/electronic-operational-comparator.po
Languages: ca

source: El comparador es un circuito electrónico semejante al amplificador operacional, con la diferencia de estar especializado en dar una salida digital, que se conecta a la tensión positiva o a la tensión negativa de alimentación, sin entregar tensiones intermedias.
ca: El comparador és un circuit electrònic similar a l’amplificador operatiu, amb la diferència d’especialitzat en donar una sortida digital, que es connecta a la tensió positiva o a la tensió d’alimentació negativa, sense proporcionar tensions intermèdies.

source: Símbolo del comparador.
ca: Símbol del comparador.

source: Los terminales del comparador son los mismos terminales que tiene un amplificador operacional. La diferencia entre ambos consiste en su funcionamiento interno, mucho más rápido y especializado en dar salidas todo-nada.
ca: Els terminals comparadors són els mateixos terminals que un amplificador operatiu. La diferència entre tots dos consisteix en el seu funcionament intern, molt més ràpid i especialitzat en donar-li tot.

source: Terminales del comparador real:
ca: Terminals de comparació reial:

source: Terminal de entrada negativo.
ca: Terminal d’entrada negativa.

source: Terminal de entrada positivo.
ca: Terminal d’entrada positiu.

source: Terminal de salida.
ca: Terminal de sortida.

source: Terminal de alimentación positiva.
ca: Terminal d’alimentació positiva.

source: Terminal de alimentación negativa.
ca: Terminal d’alimentació negativa.

source: Funcionamiento
ca: Operació

source: Un comparador es un componente electrónico semejante al amplificador operacional. Tiene dos terminales de entrada de tensión que se comparan entre sí y un terminal de salida que entrega una tensión que depende de la tensión de entrada que sea mayor. Si la entrada positiva tiene una tensión mayor que la entrada negativa, la tensión de salida será positiva. Al revés, si la entrada negativa tiene una tensión mayor que la entrada positiva, la tensión de salida será negativa.
ca: Un comparador és un component electrònic similar a l'amplificador operatiu. Té dos terminals d’entrada de tensió que es comparen i un terminal de sortida que proporciona una tensió que depèn de la tensió d’entrada que sigui més gran. Si l’entrada positiva té una tensió superior a l’entrada negativa, la tensió de sortida serà positiva. Per contra, si l’entrada negativa té una tensió superior a l’entrada positiva, la tensió de sortida serà negativa.

source: La **diferencia** del comparador con respecto al amplificador operacional consiste en que su salida está preparada para entregar valores extremos. La salida se conectará a la tensión de alimentación positiva o a la tensión de alimentación negativa. Este circuito no está preparado para dar valores de tensión intermedios.
ca: La diferència ** ** del comparador respecte a l'amplificador operatiu és que la seva sortida està preparada per proporcionar valors extrems. La sortida es connectarà a la tensió d'alimentació positiva o al voltatge negatiu d'alimentació. Aquest circuit no està preparat per donar valors de tensió intermedis.

source: Una ventaja del comparador consiste en que su respuesta es mucho más rápida que la respuesta de un amplificador operacional equivalente.
ca: Un avantatge del comparador és que la vostra resposta és molt més ràpida que la resposta d’un amplificador operatiu equivalent.

source: Simulación
ca: Simulació

source: En el siguiente circuito podemos ver un comparador funcionando como detector de luminosidad. El circuito enciende una lámpara cuando el detector de luz detecta poca luminosidad en el exterior de la casa.
ca: Al circuit següent podem veure un comparador que funciona com a detector de lluminositat. El circuit il·lumina una làmpada quan el detector de llum detecta poca lluminositat fora de casa.

source: Este comparador tiene una salida que se denomina en "colector abierto" y eso significa que solo es capaz de conectar la salida a tensión negativa. Por lo tanto el circuito necesita que se añada la resistencia R4 para conseguir una tensión positiva a la salida.
ca: Aquest comparador té una sortida que es diu a \ "Open Collector " i això vol dir que només és capaç de connectar la sortida de tensió negativa. Per tant, el circuit necessita la resistència R4 per obtenir una tensió positiva a la sortida.

source: Esta resistencia R4 se denomina resistencia de `pull-up <https://en.wikipedia.org/wiki/Pull-up_resistor>`__ porque 'levanta' la tensión de salida hacia valores positivos.
ca: Aquesta resistència R4 s’anomena “resistència a l’enrotllament <https://en.wikipedia.org/wiki/pull-up_resistor>`__ perquè 'aixeca' la tensió de sortida cap a valors positius.

source: Ejercicios
ca: Exercicis

source: Dibuja el símbolo de un comparador.
ca: Dibuixeu el símbol d’un comparador.

source: Explica con tus palabras el funcionamiento de un comparador.
ca: Expliqueu amb les vostres paraules el funcionament d’un comparador.

source: ¿Cuántos terminales tiene un comparador real? ¿Para que sirve cada uno?
ca: Quants terminals té un comparador real? Per a què serveix cadascun?

source: ¿Qué diferencias tiene un comparador respecto a un amplificador operacional?
ca: Quines diferències té un comparador pel que fa a un amplificador operatiu?

source: ¿Qué es una resistencia de pull-up y para qué sirve?
ca: Per a què serveix una resistència a l’abast i per a què serveix?

source: ¿Por qué es necesaria una resistencia de pull-up en algunos comparadores?
ca: Per què és necessària la resistència a l’accés en alguns comparadors?

source: ¿Qué tipo de realimentación crees que tiene el circuito de la simulación? Razona tu respuesta.
ca: Quin tipus de comentaris creieu que té el circuit de simulació? Raona la teva resposta.

source: Dibuja un circuito que utilice un comparador para detectar la luminosidad ambiente y que encienda una lámpara cuando el ambiente sea oscuro.
ca: Dibuixa un circuit que utilitzi un comparador per detectar la lluminositat ambiental i encendre una làmpada quan l’entorn sigui fosc.

source: Modifica la simulación anterior para que la lámpara se encienda cuando haya mucha luz en el sensor y que se apague cuando haya poca luz.
ca: Modifiqueu la simulació anterior perquè la làmpada s’encengui quan hi ha molta llum al sensor i desactiveu -la quan hi ha poca llum.
