Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/electric-simulador-mixto.po
Languages: ca

source: :index:`Conexión en circuito mixto`
ca: : Índex: `connexió de circuit mixt '

source: Un circuito mixto combina conexiones en serie y conexiones en paralelo.
ca: Un circuit mixt combina connexions en sèrie i connexions paral·leles.

source: En el siguiente circuito hay un **interruptor general** que está en **serie** con el resto de los elementos. Esto significa que puede cortar el paso de corriente o dejar pasar corriente a todo el resto del circuito:
ca: Al circuit següent hi ha un commutador general ** ** que es troba a la sèrie ** ** amb la resta d'elements. Això vol dir que podeu tallar el passatge actual o deixar passar tota la resta del circuit:

source: Los interruptores S1, S2 y S3 están en serie cada uno de ellos con su lámpara correspondiente L1, L2 y L3. Eso significa que cada uno de los interruptores puede encender o apagar cada una de sus lámparas en serie.
ca: Els interruptors S1, S2 i S3 són en sèrie cadascun d’ells amb la seva làmpada L1, L2 i L3 corresponent. Això vol dir que cadascun dels interruptors pot activar o desactivar cadascuna de les seves làmpades de sèrie.

source: Como las tres ramas interruptor-lámpara están conectadas en paralelo, cada una funciona de manera independiente de las otras, por lo que se pueden encender o apagar sin afectar a las demás.
ca: Com que les tres branques commutadores lampara es connecten en paral·lel, cadascuna funciona independentment de les altres, de manera que es poden activar o desactivar sense afectar els altres.

source: Simula en el simulador online el circuito anterior para comprobar su funcionamiento:
ca: Simula el circuit anterior al simulador en línia per comprovar el seu funcionament:

source: Interruptor con lámparas en paralelo
ca: Interruptor de la làmpada de paralització

source: En el siguiente circuito mixto, un solo interruptor permite el encendido o apagado de múltiples lámparas en paralelo. Este circuito es muy usado para encender muchos puntos de luz de una habitación o pasillo desde un solo interruptor:
ca: Al següent circuit mixt, un sol interruptor permet l’encesa o desactivar diverses làmpades en paral·lel. Aquest circuit s’utilitza àmpliament per il·luminar molts punts de llum d’una habitació o passadís d’un sol interruptor:

source: Ejercicios
ca: Exercicis

source: ¿Qué es un circuito mixto?
ca: Què és un circuit mixt?

source: ¿Cuándo es conveniente utilizar una conexión en serie en un circuito mixto?
ca: Quan és convenient utilitzar una connexió en sèrie en un circuit mixt?

source: ¿Cuándo es conveniente utilizar una conexión en paralelo en un circuito mixto?
ca: Quan és convenient utilitzar una connexió paral·lela en un circuit mixt?

source: En el primer circuito ¿qué posiciones deben tener los interruptores para que se encienda solo la lámpara L2?
ca: Al primer circuit, quines posicions han de tenir els interruptors per il·luminar només la làmpada L2?

source: En el segundo circuito ¿qué ocurriría si se retira la lámpara L3?
ca: Al segon circuit, què passaria si s’elimina la làmpada L3?
