Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/electric-simulador-resistencia.po
Languages: ca

source: :index:`Resistencia eléctrica`
ca: :index:`Resistència elèctrica`

source: La resistencia eléctrica es la oposición que muestran ciertos componentes (las resistencias) al paso de la corriente eléctrica. Cuanto mayor es el valor de la resistencia de un componente, menos corriente pasará a través de él.
ca: La resistència elèctrica és l’oposició que mostra determinats components (resistències) al pas del corrent elèctric. Com més gran sigui el valor de la resistència d’un component, menys corrent passarà a través d’aquest.

source: Las resistencias tienen tres grandes aplicaciones:
ca: Les resistències tenen tres principals aplicacions:

source: **Generar calor.** Es una de las aplicaciones principales. Por ejemplo las resistencias de una tostadora producen calor hasta tostar el pan. Las resistencias de un horno, de una lavadora o de una manta eléctrica son otros ejemplos cotidianos.
ca: ** Generar calor. ** És una de les principals aplicacions. Per exemple, les resistències d’una torradora produeixen calor per torrar el pa. La resistència d’un forn, una rentadora o una manta elèctrica són altres exemples diaris.

source: Resistencia de calentamiento de una máquina de café.
ca: Resistència a la calefacció d’una màquina de cafè.

source: **Reducir la corriente.** Es el caso de las resistencias que se colocan en serie con los ledes para que estos no se quemen al conectarlos a la tensión directamente. Otro ejemplo se encuentra en las resistencias que se conectan en serie con las bornas de un motor eléctrico para que el arranque del motor se produzca suavemente, sin brusquedad.
ca: ** Reduir el corrent. Un altre exemple es troba en les resistències que es connecten en sèrie amb els terminals d’un motor elèctric de manera que l’inici del motor es produeix suaument, sense bruscitat.

source: **Conseguir tensiones intermedias.** En electrónica esta es una de las principales aplicaciones de las resistencias. A partir de una fuente de tensión de 5 voltios se pueden conseguir tensiones desde 0 voltios hasta 5 voltios pasando por todo el rango intermedio.
ca: ** Obteniu tensions intermèdies. ** En electrònica, aquesta és una de les principals aplicacions de resistències. Des d’una font de tensió de 5 volts, es poden obtenir tensions de 0 volts a 5 volts a través de tot el rang intermedi.

source: En el siguiente circuito simulado se han conectado dos resistencias en serie para conseguir una tensión menor que la tensión de la pila. Modifica el valor de las resistencias para poder conseguir una tensión de salida exacta de 3.5 voltios.
ca: Al següent circuit simulat, s’han connectat dues resistències de sèries per aconseguir una tensió inferior a la tensió de la pila. Modifiqueu el valor de les resistències per poder aconseguir una tensió de sortida exacta de 3,5 volts.

source: :index:`Ohmios`
ca: :index:`Ohms`

source: El valor de resistencia eléctrica se mide en **ohmios**, abreviado con la letra griega omega [Ω]. En la siguiente tabla aparecen valores típicos de varios componentes comunes en nuestro entorno basados en resistencias:
ca: El valor de resistència elèctrica es mesura en ** ohms **, abreujat amb la lletra grega omega [ω]. A la taula següent hi ha valors típics de diversos components comuns en les nostres resistències basades:

source: Componente
ca: Component

source: Resistencia [Ω]
ca: Resistència [ω]

source: Lámpara de automóvil de 15 vatios de potencia.
ca: 15 Watts of Power Car.

source: 10 ohmios
ca: 10 ohms

source: Calentador eléctrico de aire.
ca: Escalfador elèctric d’aire.

source: 22 ohmios
ca: 22 ohms

source: Resistencia de limitación de corriente de un led indicador.
ca: Resistència a la limitació actual d’un LED indicador.

source: 220 ohmios
ca: 220 ohms

source: Resistencia de entrada de un amplificador de audio.
ca: Resistència a l’entrada d’un amplificador d’àudio.

source: 10 000 ohmios
ca: 10.000 ohms

source: Resistencia de entrada de un polímetro.
ca: Resistència a l’entrada d’un canter.

source: 10 000 000 ohmios
ca: 10.000 000 ohms

source: :index:`Ohmímetro`
ca: :index:`Ohmimeter`

source: Un **ohmímetro** es un aparato que permite medir la resistencia de un circuito compuesto por resistencias. El ohmímetro inyecta en el circuito una cierta cantidad de corriente para poder hacer la medición. Por esta razón, hay que desconectar todas las pilas del circuito antes de medir la resistencia eléctrica con este aparato.
ca: Un ** Ohmimeter ** és un dispositiu que permet mesurar la resistència d’un circuit compost per resistències. L’Ohmimeter injecta una certa quantitat de corrent al circuit a poder mesurar. Per aquest motiu, totes les bateries del circuit s’han de desconnectar abans de mesurar la resistència elèctrica amb aquest dispositiu.

source: Para simular un ohmímetro debemos escogerlo desde el menú ``Dibujar``... ``Medidores y Etiquetas``... ``Añadir Ohmímetro``.
ca: Per simular un ohmímetre, l’hem de triar entre el `` dibuixar `` ...

source: En la siguiente simulación, añade los ohmímetros necesarios para medir el valor de resistencia de R1 en serie con R2 y el valor de resistencia de R1 en paralelo con R2.
ca: A la següent simulació, afegiu els ohmetters necessaris per mesurar el valor de resistència de R1 en sèrie amb R2 i el valor de resistència de R1 en paral·lel amb R2.

source: Ejercicios
ca: Exercicis

source: ¿Qué es la resistencia eléctrica?
ca: Què és la resistència elèctrica?

source: ¿Qué aplicaciones puede tener una resistencia eléctrica?
ca: Quines aplicacions poden tenir una resistència elèctrica?

source: ¿En qué unidades se mide la resistencia eléctrica? Nombra 3 elementos cotidianos y su resistencia eléctrica.
ca: En quines unitats es mesura la resistència elèctrica? Nom 3 elements diaris i la seva resistència elèctrica.

source: ¿Cómo se llama el aparato que mide la resistencia eléctrica? ¿Cómo se debe conectar a las resistencias?
ca: Quin és el nom del dispositiu que mesura la resistència elèctrica? Com us heu de connectar a les resistències?
