Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/electronic-bjt.po
Languages: ca

source: Los símbolos de los dos transistores bipolares son los siguientes:
ca: Els símbols dels dos transistors bipolars són els següents:

source: Símbolo del transistor bipolar NPN.
ca: Símbol transistor bipolar NPN.

source: Símbolo del transistor bipolar PNP.
ca: Símbol del transistor bipolar PNP.

source: El funcionamiento de ambos tipos de transistores es muy semejante con la diferencia de que el transistor PNP trabaja con corrientes negativas mientras que el transistor NPN trabaja con corrientes positivas.
ca: El funcionament dels dos tipus de transistors és molt similar amb la diferència que el transistor PNP funciona amb corrents negatius mentre que el transistor NPN funciona amb corrents positius.

source: En la práctica el transistor NPN es más utilizado porque es más eficiente a la hora de conducir la corriente eléctrica. Por esa razón se estudiará más en profundidad. El transistor PNP se verá más adelante en configuraciones que utilizan los dos tipos de transistores, como la salida analógica en push-pull o la salida digital en totem-pole.
ca: A la pràctica, el transistor NPN s’utilitza més perquè és més eficient a l’hora de conduir corrent elèctric. Per això, s’estudiarà més en profunditat. El transistor PNP es veurà més endavant en configuracions utilitzades pels dos tipus de transistors, com ara la sortida analògica en la sortida de push-pull o la sortida digital en totem-pol.

source: El transistor como amplificador
ca: El transistor com a amplificador

source: En el siguiente circuito podemos experimentar el funcionamiento de un amplificador típico basado en transistor.
ca: Al circuit següent podem experimentar el funcionament d’un amplificador típic basat en transistor.

source: En la barra lateral derecha hay una barra deslizante que permite cambiar el valor de la resistencia de polarización de base. Esta resistencia permite el paso de una pequeña corriente. El transistor amplifica la corriente que llega por la base y deja pasar desde el colector hasta el emisor una corriente mucho mayor, multiplicando la corriente de base por la ganancia.
ca: A la barra lateral dreta hi ha una barra corredissa que permet canviar el valor de la resistència a la polarització de la base. Aquesta resistència permet el pas d’un corrent petit. El transistor amplifica el corrent que ve per la base i permet un corrent molt més gran del col·leccionista a l’emissor, multiplicant el corrent base pel guany.

source: Ganancia del transistor
ca: Guany del transistor

source: La corriente de colector en un transistor típico es de 50 a 300 veces mayor que la corriente de base. Esta relación entre la corriente de colector y la corriente de base se denomina **ganancia** del transistor, también denominada como β o parámetro **hfe**.
ca: El corrent col·lector en un transistor típic és de 50 a 300 vegades més gran que el corrent base. Aquesta relació entre el corrent del col·leccionista i el corrent base s’anomena ** guany ** del transistor, també anomenat β o ** hfe ** paràmetre.

source: La fórmula de la ganancia del transistor por lo tanto será:
ca: Per tant, la fórmula de guany del transistor serà:

source: Donde las variables son:
ca: On són les variables:

source: β = hfe = ganancia del transistor (número adimensional)
ca: β = hfe = guany del transistor (nombre de dimensions)

source: I_colector = corriente del colector en amperios [A]
ca: I_colector = corrent del col·lector en amplificadors [a]

source: I_base = corriente de base en amperios [A]
ca: I_base = corrent base en amplificadors [a]

source: Los transistores de potencia son transistores capaces de conducir corrientes altas, mayores de un amperio. Estos transistores pueden tener una ganancia menor de 50 cuando trabajan con grandes corrientes.
ca: Els transistors de potència són transistors capaços de realitzar corrents elevats, més antics que un amperi. Aquests transistors poden tenir un guany inferior a 50 quan treballen amb grans corrents.

source: Lo mismo ocurre con los transistores de alta frecuencia, que a frecuencias de trabajo cercanas a su límite tienen una ganancia mucho menor que a bajas frecuencias.
ca: El mateix passa amb els transistors d’alta freqüència, que a les freqüències de treball properes al seu límit tenen un guany molt inferior al de freqüències baixes.

source: Ejercicios
ca: Exercicis

source: Dibuja el símbolo del transistor NPN y del transistor PNP y añade los nombres de cada uno de sus terminales.
ca: Dibuixa el símbol del transistor NPN i el transistor PNP i afegeix els noms de cadascun dels seus terminals.

source: ¿Qué función tiene un transistor bipolar?
ca: Quina funció té un transistor bipolar?

source: Dibuja un esquema eléctrico de un transistor bipolar funcionando. Añade las corrientes y las tensiones que podemos encontrar en cada uno de sus tres terminales.
ca: Dibuixa un esquema elèctric d’un transistor bipolar que funciona. Afegiu els corrents i les tensions que podem trobar a cadascun dels seus tres terminals.

source: Comprueba que la ganancia del transistor simulado vale 100 calculando la relación entre la corriente de colector dividida por la corriente de base.
ca: Comproveu que el guany del transistor simulat val 100 calculant la relació entre el corrent col·leccionista dividit pel corrent base.

source: Desliza la barra de la derecha llamada ``Resistencia`` y comprueba si la ganancia se mantiene para varias posiciones.
ca: Feu lliscar la barra dreta anomenada `` resistència '' i comproveu si es manté el guany per a diverses posicions.

source: Cuando la resistencia de base deja pasar mucha corriente, llega un momento que el transistor se **satura** y no puede conducir más corriente.
ca: Quan la resistència de la base deixa passar molt de corrent, arriba un moment que el transistor és ** saturA ** i no pot conduir més comú.

source: Este es un comportamiento típico de los circuitos digitales, pero se intenta evitar en los circuitos analógicos.
ca: Aquest és un comportament típic dels circuits digitals, però intenteu evitar circuits analògics.
