Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/electric-receptores.po
Languages: ca

source: Efectos de la electricidad
ca: Efectes de l’electricitat

source: Una de las grandes ventajas de la electricidad es que permite generar con facilidad multitud de efectos distintos. En una simple cocina se pueden encontrar muchos aparatos que aprovechan esta ventaja.
ca: Un dels grans avantatges de l’electricitat és que permet generar fàcilment multitud d’efectes diferents. En una cuina senzilla, podeu trobar molts dispositius que aprofitin aquest avantatge.

source: En la siguiente tabla se enumeran varios efectos que se pueden conseguir con la electricidad y los aparatos receptores que lo hacen realidad.
ca: A la taula següent, es mostren diversos efectes que es poden aconseguir amb electricitat i recepció de dispositius que la fan realitat.

source: EFECTO
ca: Efecte

source: Ejemplos de receptores
ca: Exemples de receptors

source: LUZ
ca: Llum

source: Bombilla incandescente
ca: Bombeta incandescent

source: Bombilla led
ca: Bombeta LED

source: Tubo fluorescente
ca: Tub fluorescent

source: Lámpara de arco eléctrico
ca: Làmpada d'arc elèctric

source: Resistencia de una tostadora
ca: Resistència

source: Resistencia de un horno
ca: Resistència al forn

source: Resistencia de un calentador de aire
ca: Resistència d’un escalfador d’aire

source: Placa de inducción
ca: Placa d’inducció

source: Horno de microondas
ca: Forn de microones

source: Soldadura de arco
ca: Soldadura d'arc

source: MOVIMIENTO
ca: Moviment

source: Motor de batidora o de exprimidor
ca: Blender o Polishing Motor

source: Motor piezoeléctrico de una cámara fotográfica
ca: Motor piezoelèctric d’una càmera

source: SONIDO
ca: Sa

source: Altavoces
ca: Parlants

source: Auriculares
ca: Auriculars

source: Zumbador de reloj o timbre de casa
ca: Rellotge o casa Timmer

source: Limpiador por ultrasonidos
ca: Netejador per ultrasons

source: MAGNÉTICO
ca: Magnètic

source: Grúa con electroimán
ca: Grua amb electromagnet

source: Cierre de puerta magnético
ca: Tancament de la porta magnètica

source: QUÍMICO
ca: Químic

source: Batería recargable
ca: Bateria recarregable

source: Aparato de recubrimiento electrolítico
ca: Aparell de recobriment electrolític

source: Estimulador muscular eléctrico
ca: Estimulador muscular elèctric
