Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/electronic-digital-signals.po
Languages: ca

source: Las señales digitales
ca: Senyals digitals

source: Hasta ahora se han estudiado las señales analógicas, que son señales de tensión o de corriente que pueden tomar cualquier valor dentro de un rango.
ca: Fins al moment s’han estudiat els senyals analògics, que són signes de tensió o corrent que poden prendre qualsevol valor dins d’un rang.

source: Este es el aspecto que puede tener una señal analógica:
ca: Aquest és l’aspecte que pot tenir un senyal analògic:

source: Ejemplo de señal analógica.
ca: Exemple de senyal analògic.

source: Las `señales digitales <https://es.wikipedia.org/wiki/Se%C3%B1al_digital>`__, por otro lado, son señales que solo toman valores discretos, por ejemplo 0 voltios y 5 voltios. Todos los demás valores de tensión son ignorados como no válidos.
ca: The `digital signals <https://es.wikipedia.org/wiki/se%C3%B1al_digital>`__, on the other hand, are signs that only take discrete values, for example 0 volts and 5 volts. Tots els altres valors de tensió s’ignoren com a no valids.

source: Este es el aspecto que puede tener una señal digital con algo de ruido añadido:
ca: Aquest és l’aspecte que pot tenir un senyal digital amb algun soroll afegit:

source: Ejemplo de señal digital con ruido añadido.
ca: Exemple de senyal digital amb soroll afegit.

source: Las señales digitales se pueden convertir a valores binarios y manejar esos números binarios matemáticamente gracias a los `circuitos digitales <https://es.wikipedia.org/wiki/Circuito_digital>`__. Esto proporciona muchas ventajas a las señales digitales.
ca: Els senyals digitals es poden convertir en valors binaris i gestionar aquests números binaris matemàticament gràcies als `circuits digitals <https://es.wikipedia.org/wiki/circuito_digital>`__. Això proporciona molts avantatges als senyals digitals.

source: Ventajas de la señal digital
ca: Avantatges del senyal digital

source: **Inmunidad al ruido.**
ca: ** Immunitat al soroll. **

source: El ruido de pequeño valor no produce errores en la información de la señal.
ca: El soroll de petit valor no produeix errors en la informació del senyal.

source: **Duplicación sin pérdidas.**
ca: ** Duplicació sense pèrdues **

source: Las señales digitales se pueden duplicar sin perder calidad, porque el ruido que se introduce en el sistema digital puede ser eliminado.
ca: Els senyals digitals es poden duplicar sense perdre la qualitat, perquè es pot eliminar el soroll que s’introdueix al sistema digital.

source: **Detección y corrección de errores.**
ca: ** Detecció i correcció d’errors. **

source: Se puede calcular si una señal digital se ha degradado por el ruido (detección de errores) y se pueden corregir los errores que se hayan producido mediante técnicas matemáticas.
ca: Es pot calcular si un senyal digital s’ha degradat pel soroll (detecció d’errors) i es poden corregir errors que s’han produït per tècniques matemàtiques.

source: **Facilidad de procesamiento de la señal.**
ca: ** Facilitat de processament del senyal. **

source: La señal digital se puede procesar fácilmente con software adecuado, que es capaz de lograr más efectos que el procesamiento analógico. Un ejemplo de este procesado digital es el conocido `Auto-Tune <https://es.wikipedia.org/wiki/Auto-Tune>`__.
ca: El senyal digital es pot processar fàcilment amb un programari adequat, que és capaç d’aconseguir més efectes que el processament analògic. Un exemple d’aquest processament digital és el conegut “auto-sindicat <https://es.wikipedia.org/wiki/auto-tenne>`__.

source: Cuantificación digital
ca: Quantificació digital

source: La cuantificación digital es el proceso mediante el cual una señal se convierte en valores binarios.
ca: La quantificació digital és el procés pel qual un senyal es converteix en valors binaris.

source: Definición de valores lógicos en una señal con ruido.
ca: Definició de valors lògics en un senyal de soroll.

source: Simulación
ca: Simulació

source: A continuación puede verse la simulación de una señal de datos digital con tensiones entre 0 y 5 voltios, que se deteriora al añadir ruido en la transmisión y que por último se vuelve a recuperar eliminando el ruido con un simple comparador con histéresis (Trigger Schmitt).
ca: A continuació, es pot veure la simulació d’un senyal de dades digital amb tensions entre 0 i 5 volts, que es deteriora quan s’afegeix soroll a la transmissió i finalment es recupera eliminant de nou el soroll amb un comparador senzill amb histèresi (Trigger Schmitt).

source: Ejercicios
ca: Exercicis

source: Dibuja una señal analógica y una señal digital.
ca: Dibuixeu un senyal analògic i un senyal digital.

source: ¿En qué se diferencian?
ca: Què són diferents?

source: ¿Qué ventajas presentan las señales digitales?
ca: Quins avantatges presenten els senyals digitals?

source: ¿Qué es la cuantificación digital?
ca: Què és la quantificació digital?

source: Explica con tus palabras qué ocurre en el circuito simulado.
ca: Expliqueu amb les vostres paraules què passa al circuit simulat.

source: Modifica en el simulador la señal de FM para que tenga 3 voltios de tensión máxima. ¿Qué le ocurre a la señal digital recuperada?
ca: Modifiqueu el senyal FM al simulador per tenir 3 tensió màxima. Què passa amb el senyal digital recuperat?

source: Dibuja la forma de la señal digital recuperada y señala en el gráfico el problema que presenta.
ca: Dibuixeu la forma del senyal digital recuperat i indiqueu al gràfic el problema que presenta.
