Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/electric-ley-ohm.po
Languages: ca

source: La ley de Ohm
ca: Ohm's Law

source: La ley de Ohm es una ley física que relaciona, en un circuito eléctrico, el valor de la intensidad de corriente, la tensión aplicada y la resistencia eléctrica del circuito.
ca: La llei d'Ohm és una llei física que relaciona, en un circuit elèctric, el valor de la intensitat de corrent, la tensió aplicada i la resistència elèctrica del circuit.

source: Índice de contenidos:
ca: Índex de contingut:

source: Magnitudes y unidades
ca: Magnituds i unitats

source: La ley de Ohm, por lo tanto, relaciona tres magnitudes eléctricas que están representadas en la siguiente tabla junto a sus tres unidades.
ca: La llei d'Ohm, per tant, relaciona tres magnituds elèctriques que es representen a la taula següent amb les seves tres unitats.

source: MAGNITUD Y LETRA
ca: Magnitud i lletres

source: UNIDAD Y LETRA
ca: Unitat i lletres

source: Tensión o Voltaje (V)
ca: Tensió o tensió (V)

source: Intensidad de Corriente (I)
ca: Intensitat actual (i)

source: Resistencia Eléctrica (R)
ca: Resistència elèctrica (R)

source: **Tensión o Voltaje:**
ca: ** Tensió o tensió: **

source: Es la energía con la que una pila impulsa a los electrones a través del circuito. Cuando el voltaje es más alto, la energía es mayor y por lo tanto los electrones circulan más deprisa, aumentando la corriente eléctrica.
ca: És l’energia amb la qual una bateria condueix electrons a través del circuit. Quan la tensió és més alta, l’energia és més gran i, per tant, els electrons circulen més ràpidament, augmentant el corrent elèctric.

source: La tensión o voltaje se mide en Voltios.
ca: La tensió o la tensió es mesura en volts.

source: **Resistencia Eléctrica:**
ca: ** Resistència elèctrica: **

source: Es la oposición que presenta un componente al paso de la corriente eléctrica. Cuanto mayor es la resistencia, más se opone al paso de la corriente eléctrica y por lo tanto menos corriente pasará a través del circuito.
ca: És l’oposició que presenta un component al pas del corrent elèctric. Com més gran sigui la resistència, més s’oposa al pas del corrent elèctric i, per tant, menys corrent passarà pel circuit.

source: La resistencia eléctrica se mide en Ohmios.
ca: La resistència elèctrica es mesura en ohms.

source: **Intensidad de Corriente:**
ca: ** Intensitat actual: **

source: Es la cantidad de electrones que circulan por un conductor cada segundo. Cuantos más electrones circulen por segundo, más corriente pasará por el conductor.
ca: És la quantitat d’electrons que circulen per un conductor cada segon. Com més electrons circulen per segon, més corrent passarà el conductor.

source: La intensidad de corriente se mide en Amperios.
ca: La intensitat actual es mesura en amplificadors.

source: Fórmula de la ley de Ohm
ca: Fórmula de llei ohm

source: Según la ley de Ohm la intensidad de corriente (I) que circula por una resistencia eléctrica (R) es proporcional a la tensión (V) aplicada a la resistencia e inversamente proporcional al valor de la resistencia eléctrica.
ca: Segons la llei d'Ohm, la intensitat de corrent (i) que circula per una resistència elèctrica (R) és proporcional a la tensió (V) aplicada a la resistència i inversament proporcional al valor de la resistència elèctrica.

source: La ley de Ohm escrita en notación matemática es la siguiente:
ca: La llei d'Ohm escrita en notació matemàtica és la següent:

source: Despejando la fórmula anterior se consiguen las otras dos formas de la ley de Ohm.
ca: Esborrant la fórmula anterior, s’aconsegueixen les altres dues formes de llei d’Ohm.

source: Una regla nemotécnica que se puede utilizar para recordar la ley de Ohm es el siguiente triángulo con las tres magnitudes:
ca: Una norma mnemònica que es pot utilitzar per recordar la llei d'Ohm és el següent triangle amb les tres magnituds:

source: Tapando la magnitud que queremos averiguar, aparece la fórmula correspondiente. Por ejemplo, si queremos saber cuánto vale la intensidad de corriente, tapamos la letra I y se puede ver la letra V encima de la letra R. Esto significa que I = V / R.
ca: Cobrint la magnitud que volem esbrinar, apareix la fórmula corresponent. Per exemple, si volem saber quant és la intensitat actual, presentem la lletra I i podeu veure la lletra V a la part superior de la lletra R. Això vol dir que i = V / R.

source: Ejercicios
ca: Exercicis

source: Ejercicios sencillos para calcular circuitos con la ley de Ohm.
ca: Exercicis senzills per calcular els circuits amb la llei d’Ohm.

source: :download:`Ejercicios de la ley de Ohm. Formato PDF <electric/electric-ley-ohm-inicio.pdf>`
ca: : Descarregueu: `Exercicis de la llei d'Ohm. PDF <Electric-we-ohm-inicio.pdf> `format

source: :download:`Ejercicios de la ley de Ohm. Formato KiCad <electric/electric-ley-ohm.zip>`
ca: : Descarregueu: `Exercicis de la llei d'Ohm. KICAD <electric-we-ohm.zip> `Format

source: Cuestionarios
ca: Qüestionaris

source: Cuestionarios de tipo test sobre la ley de Ohm.
ca: Test qüestionaris sobre la llei d'Ohm.

source: `Cuestionario. Ley de Ohm. Fundamentos. <../test/es-electric-ohms-law.html>`__
ca: `Qüestionari. Ohm Law. Fonaments <../ Test/ Es-Elèctric-Ohms-Law.html>`__

source: `Cuestionario. Ley de Ohm. Cálculos. <../test/es-electric-ohms-law-2.html>`__
ca: `Qüestionari. Ohm Law. Càlculs <../ Test/ Es-Elèctric-Ohms-Law-2.html>`__
