Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/electric-simulador-potencia.po
Languages: ca

source: :index:`Potencia eléctrica`
ca: : Índex: `Potència elèctrica '

source: La **potencia eléctrica** es la cantidad de energía que entrega o que consume un componente o circuito eléctrico cada segundo.
ca: La potència elèctrica ** ** és la quantitat d’energia que proporciona o consumeix un component o un circuit elèctric cada segon.

source: La potencia es directamente proporcional a la tensión y a la corriente de un circuito, de manera que cuanta más tensión tenga el circuito más potencia consumirá. Asimismo cuanta más corriente consuma un circuito más potencia consumirá.
ca: La potència és directament proporcional a la tensió i al corrent d’un circuit, de manera que com més tensió es consumeixi el circuit més la potència. Com més actual consumeixi un circuit d’energia més.

source: :index:`Vatios`
ca: : Índex: `watts '

source: La potencia eléctrica se mide en **vatios**, abreviado con la letra [W].
ca: La potència elèctrica es mesura en ** watts **, abreviada amb la lletra [w].

source: En la siguiente tabla aparecen las potencias típicas que consumen varios componentes comunes en nuestro entorno:
ca: La taula següent mostra els poders típics que consumeixen diversos components comuns al nostre entorn:

source: Componente
ca: Component

source: Potencia [W]
ca: Poder [w]

source: Led indicador de encendido.
ca: Indicador d’encesa LED.

source: 20 milivatios
ca: 20 Millivats

source: Bombilla led de techo.
ca: Bombeta LED del sostre.

source: 10 vatios
ca: 10 watts

source: Batidora de cocina.
ca: Blender de cuina.

source: 400 vatios
ca: 400 watts

source: Calentador eléctrico de aire.
ca: Escalfador elèctric d’aire.

source: 2000 vatios
ca: 2000 watts

source: :index:`Vatímetro`
ca: : Índex: `VATIMETER '

source: Un **vatímetro** es un aparato eléctrico que permite medir la potencia consumida por un componente o circuito eléctrico. El vatímetro se conecta siempre entre el generador y el elemento que se desea medir, por lo que es necesario cortar el circuito para poder insertarlo. Al tener cuatro cables, el vatímetro corta tanto el cable de ida como el cable de vuelta de la corriente:
ca: Un ** vatímetre ** és un aparell elèctric que permet mesurar la potència consumida per un component o circuit elèctric. El wattmeter sempre està connectat entre el generador i l’element que voleu mesurar, de manera que cal tallar el circuit per poder -lo inserir. En tenir quatre cables, els calçotets de cutímetre tant la primera cama com la part posterior del cable del corrent:

source: Para simular un vatímetro debemos escogerlo desde el menú ``Dibujar``... ``Medidores y Etiquetas``... ``Añadir Vatímetro``.
ca: Per simular un wattmeter, hem de triar -lo entre `` dibuixar `` ...

source: En el siguiente circuito simulado, añade un **vatímetro** que mida la potencia consumida por la lámpara del circuito.
ca: En el següent circuit simulat, afegiu un ** vatímetre ** que mesura la potència consumida per la làmpada del circuit.

source: A continuación dibuja otra fuente de tensión conectada a dos lámparas en paralelo e inserta otro vatímetro para comprobar que la potencia consumida es el doble que la anterior:
ca: A continuació, dibuixeu una altra font de tensió connectada a dues làmpades en paral·lel i inseriu un altre vatímetre per verificar que la potència consumida és el doble de l'anterior:

source: Ejercicios
ca: Exercicis

source: ¿Qué es la potencia eléctrica?
ca: Què és la potència elèctrica?

source: ¿Cómo se relaciona la potencia eléctrica con la tensión y con la corriente eléctrica?
ca: Com es relaciona l’energia elèctrica amb la tensió i el corrent elèctric?

source: ¿En qué unidades se mide la potencia eléctrica? Nombra al menos tres elementos comunes de nuestro entorno y escribe la potencia eléctrica que consumen.
ca: En quines unitats es mesura la potència elèctrica? Anomeneu almenys tres elements comuns del nostre entorn i escriviu el poder elèctric que consumeixen.

source: ¿Qué es un vatímetro? ¿Cómo se debe conectar para medir potencia?
ca: Què és un wattmeter? Com us heu de connectar per mesurar la potència?
