Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/electronic-gate-*.po
Languages: ca

source: La puerta lógica OR
ca: La porta lògica o

source: La puerta lógica OR tiene dos o más entradas y una salida.
ca: La porta lògica té dues o més entrades i una sortida.

source: La salida tiene un valor lógico alto (1) si alguna de sus entradas tiene un valor lógico alto (1).
ca: La sortida té un valor lògic elevat (1) Si alguna de les seves entrades té un valor lògic elevat (1).

source: Es decir, si la entrada A **o** la entrada B están a nivel alto, la salida estará a nivel alto. De ahí el nombre **OR** en inglés.
ca: És a dir, si l’entrada a ** o ** Entrada B està a un nivell alt, la sortida serà a un nivell alt. D’aquí el nom ** o ** en anglès.

source: El **símbolo de la puerta OR** es el siguiente:
ca: El símbol ** de la porta o ** és el següent:

source: Símbolo de la puerta lógica OR de dos entradas.
ca: Símbol de la porta lògica de dos entrades.

source: La **función lógica de la puerta OR** se representa mediante una suma, de manera que la salida de la puerta será la suma lógica de las entradas:
ca: La funció lògica de la porta o ** es representa mitjançant una suma, de manera que la sortida de la porta serà la suma lògica de les entrades:

source: Out = A + B
ca: Fora = a + b

source: La **tabla de verdad de la puerta OR** es la siguiente:
ca: La ** taula de veritat de la porta o ** és la següent:

source: Tabla de verdad de la puerta lógica OR de dos entradas.
ca: Veritat de la porta lògica o de dues entrades.

source: Si las dos entradas valen cero, la salida valdrá cero, pero si alguna entrada vale uno, la salida valdrá uno.
ca: Si les dues entrades valen zero, la sortida valdrà zero, però si alguna entrada val una, la sortida valdrà una.

source: La puerta lógica NOR
ca: La porta ni lògica

source: La puerta lógica NOR tiene dos o más entradas y una salida.
ca: La porta NOR LOGIC té dues o més entrades i una sortida.

source: La salida será la misma que la de una puerta OR, pero invertida. Es decir que la salida solo valdrá uno cuando todas las entradas valgan cero.
ca: La sortida serà la mateixa que la d’una porta o una porta, però invertida. És a dir que la sortida només valdrà una quan totes les entrades valguin zero.

source: El **símbolo de la puerta NOR** es el siguiente:
ca: El símbol ** de la porta NOR ** és el següent:

source: Símbolo de la puerta lógica NOR de dos entradas.
ca: El símbol de la porta de dos entrades ni la lògica.

source: La **función lógica de la puerta NOR** se representa mediante una suma negada, de manera que la salida de la puerta será la suma lógica de las entradas que finalmente se invierte:
ca: La funció lògica de la porta NOR ** es representa mitjançant una suma denegada, de manera que la sortida de la porta serà la suma lògica de les entrades que s’inverteixen finalment:

source: La **tabla de verdad de la puerta NOR** es la siguiente:
ca: La ** Taula de veritat de la porta Nor ** és la següent:

source: Tabla de verdad de la puerta lógica NOR de dos entradas.
ca: Taula de veritat de la porta lògica de dues entrades.

source: Simulación
ca: Simulació

source: En la siguiente simulación podemos ver el funcionamiento de la puerta lógica OR y, debajo, el funcionamiento de la puerta lógica NOR.
ca: A la següent simulació podem veure el funcionament de la porta lògica o, a continuació, el funcionament de la porta Norg.

source: Ejercicios
ca: Exercicis

source: Explica con tus palabras el funcionamiento de la puerta lógica OR.
ca: Expliqueu amb les vostres paraules el funcionament de la porta lògica o.

source: Dibuja el símbolo de la puerta lógica OR de dos entradas, su función lógica y su tabla de verdad.
ca: Dibuixa el símbol de la porta lògica de dues entrades, la seva funció lògica i la seva taula de veritat.

source: Explica con tus palabras el funcionamiento de la puerta lógica NOR.
ca: Expliqueu amb les vostres paraules el funcionament de la porta ni lògica.

source: Dibuja el símbolo de la puerta lógica NOR de dos entradas, su función lógica y su tabla de verdad.
ca: Dibuixa el símbol de la porta ni lògica de dues entrades, la seva funció lògica i la seva taula de veritat.

source: En el simulador añade una puerta inversora a la salida de la puerta OR y comprueba que su respuesta es igual a la de la puerta NOR.
ca: Al simulador afegeix una porta d’inversió a la sortida de la porta i verifica que la seva resposta és igual a la de la porta NOR.

source: Dibuja una puerta lógica OR de tres entradas, su función lógica y su tabla de verdad.
ca: Dibuixa una porta lògica de tres entrades, la seva funció lògica i la seva taula de veritat.
