Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/electronic-bjt-common-e.po
Languages: ca

source: El transistor en emisor común
ca: El transistor en comú emissor

source: En esta configuración el transistor tiene el emisor conectado a masa. La señal de entrada llega por la base del transistor y la señal amplificada sale por el colector del transistor.
ca: En aquesta configuració, el transistor té l'emissor connectat a la massa. El senyal d’entrada arriba per la base del transistor i el senyal amplificat deixa el col·leccionista del transistor.

source: Esquema simplificado de un transistor NPN en emisor común.
ca: Esquema simplificat d’un transistor NPN en un emissor comú.

source: Esta configuración permite amplificar tanto la tensión de entrada como la corriente de entrada. Esto es útil en etapas amplificadoras de entrada e intermedias, donde es necesario elevar tanto la tensión como la corriente de la señal de entrada.
ca: Aquesta configuració permet amplificar tant la tensió d’entrada com el corrent d’entrada. Això és útil per amplificar les etapes intermèdies, on és necessari elevar tant la tensió com el corrent del senyal d’entrada.

source: A continuación puede verse una simulación de un transistor NPN en configuración de emisor común. El transistor amplifica una pequeña señal que entra por la base generando una señal mucho mayor que sale por el colector.
ca: A continuació, es pot veure una simulació d’un transistor NPN en la configuració comuna de l’emissor. El transistor amplifica un petit senyal que entra a través de la base generant un senyal molt més gran que surt a través del col·lector.

source: La función de cada uno de los componentes es la siguiente:
ca: La funció de cadascun dels components és la següent:

source: El **generador de señal alterna** genera una pequeña señal de entrada de 0.25 voltios de pico.
ca: El generador de senyal alternatiu ** ** genera un petit senyal d’entrada de 0,25 volts de pic.

source: La **resistencia R1** tiene como función limitar la corriente de entrada a un valor pequeño, que en este caso varía entre 40 y 80 microamperios.
ca: La resistència ** R1 ** té la funció de limitar el corrent d’entrada a un valor reduït, que en aquest cas varia entre 40 i 80 microamperies.

source: La **resistencia R2** añade a la base una pequeña corriente continua para que el transistor pueda funcionar. Esta corriente positiva que se suma en la base se denomina **corriente de polarización**.
ca: La resistència ** R2 ** afegeix a la base un petit corrent directe perquè el transistor pugui funcionar. Aquest corrent positiu que s’afegeix a la base s’anomena ** corrent de polarització **.

source: Hay que tener en cuenta que el transistor solo puede amplificar corrientes positivas, por lo que es necesario sumar una pequeña corriente positiva a la corriente alterna de entrada (positiva y negativa) para que el transistor funcione correctamente.
ca: Tingueu en compte que el transistor només pot amplificar els corrents positius, de manera que cal afegir un petit corrent positiu al corrent d’entrada (positiu i negatiu) de manera que el transistor funcioni correctament.

source: El **transistor NPN** recibe una pequeña corriente por la base y amplifica esa corriente para que circule, multiplicada, por el colector.
ca: El transistor ** npn ** rep un petit corrent per la base i amplifica aquest corrent per circular, multiplicar -se, pel col·lector.

source: La **resistencia R3** recibe la corriente de colector y la convierte en tensión de salida.
ca: La resistència ** R3 ** rep el corrent del col·lector i el converteix en tensió de sortida.

source: Por esta resistencia circulará unas 100 veces la corriente que circula por la base del transistor.
ca: El corrent que circula per la base del transistor circularà per aquesta resistència.

source: Ejercicios
ca: Exercicis

source: Dibuja un esquema simplificado de un transistor NPN trabajando en configuración de emisor común, mostrando por dónde llega la señal de entrada y por dónde sale la señal amplificada.
ca: Dibuixa un esquema simplificat d’un transistor NPN que treballa en la configuració comuna d’emissor, mostrant on es fa el senyal d’entrada i on surt el senyal amplificat.

source: Dibuja un esquema realista de un transistor NPN trabajando en configuración de emisor común.
ca: Dibuixa un esquema realista d’un transistor NPN que treballa en la configuració comuna de l’emissor.

source: ¿Cuál es la función principal de un transistor funcionando en configuración de emisor común?
ca: Quina és la funció principal d’un transistor que opera en la configuració comuna d’emissor?

source: Modifica la resistencia de polarización R2 para que valga 40k. Dibuja la gráfica de la tensión de salida.
ca: Modifiqueu la resistència de polarització R2 per valer 40K. Dibuixeu el gràfic de la tensió de sortida.

source: ¿Qué le ocurre a la tensión de salida al reducir R2?
ca: Què passa amb la tensió de sortida reduint R2?

source: Modifica la resistencia de polarización R2 para que valga 80k. Dibuja la gráfica de la tensión de salida.
ca: Modifiqueu la resistència de polarització R2 per valer 80K. Dibuixeu el gràfic de la tensió de sortida.

source: ¿Qué le ocurre a la tensión de salida al aumentar R2?
ca: Què passa amb la tensió de sortida en augmentar R2?

source: Modifica el diseño del amplificador en emisor común en el simulador para que pueda amplificar una señal de entrada senoidal de 1 voltio hasta una señal de salida de, al menos, 4 voltios.
ca: Modifica el disseny de l'amplificador en l'emissor comú a l'amulador de manera que pugui amplificar un senyal sinusoïdal d'1 volt a un senyal de sortida d'almenys 4 volts.

source: Primero será necesario cambiar el generador de señal senoidal con el valor de un voltio.
ca: Primer caldrà canviar el generador de senyal sinusoïdor amb el valor d’un volt.

source: Después se debe modificar la resistencia de salida R3 por otra menor para que la señal de salida varíe solo 4 voltios.
ca: Aleshores, la resistència de sortida R3 ha de ser modificada per un altre menor de manera que el senyal de sortida només varia 4 volts.

source: Finalmente se debe modificar la resistencia de polarización R2 para que la señal de salida no esté recortada.
ca: Finalment, s’ha de modificar la resistència a la polarització R2 de manera que el senyal de sortida no es retalli.

source: Aprovecha las señales del osciloscopio derecho para guiarte a la hora de modificar los valores de las resistencias.
ca: Aprofiteu els senyals oscil·loscopis adequats per guiar -vos en modificar els valors de les resistències.

source: Explica para qué sirve la resistencia R3. ¿Qué ocurre si la resistencia aumenta? ¿Qué ocurre si la resistencia disminuye?
ca: Expliqueu per a què serveix la resistència R3. Què passa si augmenta la resistència? Què passa si la resistència disminueix?
