Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/electronic-gate-xor.po
Languages: ca

source: La puerta lógica XOR
ca: La porta lògica xor

source: La puerta lógica XOR tiene dos o más entradas y una salida.
ca: La porta de la lògica Xor té dues o més entrades i una sortida.

source: La salida tiene un valor lógico alto (1) si la suma de las entradas es un valor impar.
ca: La sortida té un valor lògic elevat (1) Si la suma de les entrades és un valor estrany.

source: Es decir, si la entrada A **o** la entrada B están a nivel alto, pero no las dos a la vez, la salida estará a nivel alto. De ahí el nombre de **eXclusive OR** en inglés.
ca: És a dir, si l’entrada a ** o ** Entrada B està a nivell alt, però no ambdues alhora, la sortida serà a un nivell alt. D’aquí el nom de ** exclusiu o ** en anglès.

source: El **símbolo de la puerta XOR** es el siguiente:
ca: El símbol de la porta ** xor ** és el següent:

source: Símbolo de la puerta lógica XOR de dos entradas.
ca: Símbol de la porta lògica de dos entrades.

source: La **función lógica de la puerta XOR** se representa mediante un símbolo de suma rodeado de un círculo, de manera que la salida de la puerta será la suma lógica exclusiva de las entradas:
ca: La funció lògica de la porta Xor ** està representada per un símbol de suma envoltat d’un cercle, de manera que la sortida de la porta serà la lògica exclusiva de les entrades:

source: La **tabla de verdad de la puerta XOR** es la siguiente:
ca: La ** Taula de veritat xor ** és la següent:

source: Tabla de verdad de la puerta lógica XOR de dos entradas.
ca: Taula de veritat de la porta lògica xor de dues entrades.

source: Si las dos entradas valen cero, la salida valdrá cero, si alguna entrada vale uno, la salida valdrá uno y si las dos entradas valen uno, la salida volverá a valer cero.
ca: Si les dues entrades valen zero, la sortida valdrà zero, si alguna entrada val una, la sortida valdrà una i si les dues entrades valen una, la sortida es tornarà a valorar.

source: Aplicaciones de la puerta XOR
ca: Aplicacions de portes XOR

source: La puerta XOR puede utilizarse para calcular el valor de paridad de todas sus entradas, de manera que las entradas junto a la salida siempre tendrán un valor par de unos.
ca: La porta XOR es pot utilitzar per calcular el valor de paritat de totes les seves entrades, de manera que les entrades al costat de la sortida sempre tindran un valor uniforme d'alguns.

source: Otra aplicación de la puerta XOR es hacer sumas aritméticas de bits. La puerta XOR calcula la suma aritmética de dos bits y la puerta AND calcula el acarreo de sumar dos bits.
ca: Una altra aplicació de portes XOR és fer sumes de bits aritmètics. La porta XOR calcula la suma aritmètica de dos bits i la porta i calcula el transport d’afegir dos bits.

source: Otra aplicación de la puerta XOR es invertir o no invertir el valor de la entrada B en función de la entrada A:
ca: Una altra aplicació de portes XOR és invertir o no invertir el valor de l’entrada B depenent de l’entrada a:

source: Si la entrada A vale cero, la entrada B se copia igual en la salida.
ca: Si l’entrada a l’exterior zero, l’entrada B es copia igual a la sortida.

source: Si la entrada A vale uno, la entrada B se copia **invertida** en la salida.
ca: Si l’entrada a Vale One, l’entrada B es copia ** invertida ** a la sortida.

source: Simulación
ca: Simulació

source: En la siguiente simulación podemos ver el funcionamiento de la puerta lógica XOR.
ca: A la simulació següent podem veure el funcionament de la porta lògica XOR.

source: Ejercicios
ca: Exercicis

source: Explica con tus palabras el funcionamiento de la puerta lógica XOR.
ca: Expliqueu amb les vostres paraules el funcionament de la porta lògica xor.

source: Dibuja el símbolo de la puerta lógica XOR de dos entradas, su función lógica y su tabla de verdad.
ca: Dibuixa el símbol de la porta lògica XOR de dues entrades, la seva funció lògica i la seva taula de veritat.

source: Explica brevemente tres aplicaciones de la puerta lógica XOR.
ca: Expliqueu breument tres aplicacions de la porta lògica xor.

source: En el simulador copia el circuito que aparece en la siguiente imagen para emular el funcionamiento de la puerta XOR mediante puertas NOT, OR y AND:
ca: Al simulador, copieu el circuit que apareix a la imatge següent per emular el funcionament de la porta xor a través de no, o i: i:

source: Comprueba que su funcionamiento es igual al de la puerta XOR.
ca: Comproveu que la seva operació sigui igual a la porta xor.

source: Dibuja una puerta lógica XOR de tres entradas, su función lógica y su tabla de verdad.
ca: Dibuixa una porta lògica de tres entrades, la seva funció lògica i la seva taula de veritat.

source: Para realizar la tabla de verdad de la puerta recuerda que la salida vale uno si los bits de entrada a uno son impares.
ca: Per realitzar la taula de veritat de la porta, recordeu que la sortida val una si els bits d’entrada són estranys.
