Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/electronic-gate-and.po
Languages: ca

source: La puerta lógica AND
ca: La lògica i

source: La puerta lógica AND tiene dos o más entradas y una salida.
ca: Les entrades i més o més i una porta de sortida.

source: La salida tiene un valor lógico alto (1) si todas sus entradas tiene un valor lógico alto (1).
ca: La sortida té un valor lògic elevat (1) si totes les seves entrades tenen un valor lògic elevat (1).

source: Es decir, si la entrada A **y** la entrada B están a nivel alto, la salida estará a nivel alto. De ahí el nombre **AND** en inglés.
ca: És a dir, si l’entrada a ** i ** Entrada B està a nivell alt, la sortida serà a un nivell alt. D’aquí el nom ** i ** en anglès.

source: El **símbolo de la puerta AND** es el siguiente:
ca: El símbol ** de la porta i ** és el següent:

source: Símbolo de la puerta lógica AND de dos entradas.
ca: Lògica i símbol de la porta d’entrada.

source: La **función lógica de la puerta AND** se representa mediante una multiplicación, de manera que la salida de la puerta será la multiplicación lógica de las entradas:
ca: La funció lògica de la porta i ** està representada per multiplicació, de manera que la sortida de la porta serà la multiplicació lògica de les entrades:

source: La **tabla de verdad de la puerta AND** es la siguiente:
ca: La ** Taula de veritat i ** és la següent:

source: Tabla de verdad de la puerta lógica AND de dos entradas.
ca: Taula de veritat de la lògica i dues entrades.

source: Si las dos entradas valen uno, la salida valdrá uno, pero si alguna entrada vale cero, la salida valdrá cero.
ca: Si les dues entrades valen una, la sortida valdrà una, però si alguna entrada val zero, la sortida valdrà zero.

source: La puerta lógica NAND
ca: La porta lògica nand

source: La puerta lógica NAND tiene dos o más entradas y una salida.
ca: La porta de la lògica NAND té dues o més entrades i una sortida.

source: La salida será la misma que la de una puerta AND, pero invertida. Es decir que la salida solo valdrá cero cuando todas las entradas valgan uno.
ca: La sortida serà la mateixa que la de la porta i, però invertida. És a dir, la sortida només valdrà zero quan totes les entrades en valen.

source: El **símbolo de la puerta NAND** es el siguiente:
ca: El símbol ** de la porta ** és el següent:

source: Símbolo de la puerta lógica NAND de dos entradas.
ca: Símbol lògic de dos entrades.

source: La **función lógica de la puerta NAND** se representa mediante una multiplicación negada, de manera que la salida de la puerta será la multiplicación lógica de las entradas que finalmente se invierte:
ca: La funció lògica de la porta NAND ** es representa mitjançant una multiplicació negada, de manera que la sortida de la porta serà la multiplicació lògica de les entrades que finalment s’inverteix:

source: La **tabla de verdad de la puerta NAND** es la siguiente:
ca: La ** Taula de veritat de la porta de Nand ** és la següent:

source: Tabla de verdad de la puerta lógica NAND de dos entradas.
ca: Taula de veritat de la lògica de dues entrades.

source: Simulación
ca: Simulació

source: En la siguiente simulación podemos ver el funcionamiento de la puerta lógica AND y, debajo, el funcionamiento de la puerta lógica NAND.
ca: A la simulació següent podem veure el funcionament de la porta lògica i, a continuació, el funcionament de la porta lògica NAND.

source: Ejercicios
ca: Exercicis

source: Explica con tus palabras el funcionamiento de la puerta lógica AND.
ca: Expliqueu amb les vostres paraules el funcionament de la porta lògica i.

source: Dibuja el símbolo de la puerta lógica AND de dos entradas, su función lógica y su tabla de verdad.
ca: Dibuixa el símbol de la lògica i dues entrades, la seva funció lògica i la seva taula de veritat.

source: Explica con tus palabras el funcionamiento de la puerta lógica NAND.
ca: Expliqueu amb les vostres paraules el funcionament de la lògica NAND.

source: Dibuja el símbolo de la puerta lógica NAND de dos entradas, su función lógica y su tabla de verdad.
ca: Dibuixa el símbol lògic NAND de dues entrades, la seva funció lògica i la seva taula de veritat.

source: En el simulador añade una puerta inversora a la salida de la puerta AND y comprueba que su respuesta es igual a la de la puerta NAND.
ca: Al simulador afegeix una porta d’inversió a la sortida de la i comprova que la vostra resposta és igual a la de la porta de Nand.

source: Dibuja una puerta lógica AND de tres entradas, su función lógica y su tabla de verdad.
ca: Dibuixa una lògica i tres entrades, la seva funció lògica i la seva taula de veritat.
