Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/electric-energia.po
Languages: ca

source: Puede obtenerse con facilidad a partir de otras formas de energía (mecánica, química, calorífica, radiante, etc.).
ca: Es pot obtenir fàcilment a partir d’altres formes d’energia (mecànica, química, calor, radiant, etc.).

source: Se puede transportar con facilidad a grandes distancias.
ca: Es pot transportar fàcilment a grans distàncies.

source: El transporte es eficiente y consume poca energía.
ca: El transport és eficient i consumeix poca energia.

source: Se puede convertir fácilmente en otras formas de energía.
ca: Es pot convertir fàcilment en altres formes d’energia.

source: Se puede controlar de forma muy sencilla.
ca: Es pot controlar molt senzill.

source: Es muy limpia y no contamina en el lugar donde se usa. Aunque sí puede producir contaminación en el lugar de generación.
ca: És molt net i no contamina al lloc on s’utilitza. Tot i que pot causar contaminació al lloc de generació.

source: Es más segura que otras formas de energía.
ca: És més segur que altres formes d’energia.

source: Desventajas de la energía eléctrica
ca: Desavantatges de l’electricitat

source: No existe una fuente primaria de energía eléctrica, hay que generarla a partir de otras fuentes primarias.
ca: No hi ha cap font principal d’electricitat, s’ha de generar a partir d’altres fonts primàries.

source: Un porcentaje alto de la electricidad que se genera en la actualidad procede de energías primarias no renovables y contaminantes, como las energías fósiles o la nuclear.
ca: Un alt percentatge d’electricitat que es genera actualment prové d’energia primària no renovable i contaminant, com ara energies fòssils o nuclears.

source: No se puede almacenar con facilidad. En la red eléctrica hay que generar en cada momento la misma cantidad de electricidad que la que se está consumiendo.
ca: No es pot emmagatzemar fàcilment. A la xarxa elèctrica, s’ha de generar la mateixa quantitat d’electricitat en cada moment que la consumida.

source: Para su transporte se necesitan cables, por lo que es difícil de utilizar en el transporte marítimo y aéreo.
ca: Per al transport, es necessiten cables, de manera que és difícil d’utilitzar en transport marítim i aeri.

source: Puede ser peligrosa y provocar incendios y descargas eléctricas si no se toman las medidas de precaución necesarias.
ca: Pot ser perillós i provocar incendis i descàrregues elèctriques si no es prenen les mesures de precaució necessàries.

source: Cálculos con energía eléctrica
ca: Càlculs d’energia elèctrica

source: La fórmula de la energía eléctrica es la siguiente:
ca: La fórmula d’energia elèctrica és la següent:

source: Siendo las magnitudes y unidades las siguientes:
ca: Les magnituds i les unitats són les següents:

source: E = Energía en kilovatios-hora [kWh]
ca: E = energia en quilowatts-hora [kWh]

source: P = Potencia en kilovatios [kW]
ca: P = potència en quilowatts [kw]

source: t = Tiempo en horas [h]
ca: t = temps en hores [h]

source: Despejando, tenemos las otras formas de la fórmula de la energía eléctrica:
ca: Clearing, tenim les altres formes de la fórmula d’energia elèctrica:

source: Esta fórmula nos permite realizar cálculos relativos a la factura eléctrica, que es uno de los gastos más importantes de los hogares.
ca: Aquesta fórmula ens permet realitzar càlculs relacionats amb la factura de l’electricitat, que és una de les despeses més importants de les llars.

source: Según esta fórmula, la energía que consumimos depende de la potencia del aparato que conectemos y del tiempo que el aparato esté en funcionamiento.
ca: Segons aquesta fórmula, l’energia que consumim depèn de la potència del dispositiu que connectem i del temps que el dispositiu està en funcionament.

source: Así, el frigorífico es uno de los electrodomésticos con menor potencia, ya que consume alrededor de 150 vatios. Sin embargo, es el electrodoméstico que más energía consume en el hogar, aproximadamente un tercio del total, ya que está en funcionamiento casi todo el día todos los días del año.
ca: Així, la nevera és un dels electrodomèstics amb menys potència, ja que consumeix al voltant de 150 watts. Tot i això, és l’aparell que consumeix més energia a casa, aproximadament un terç del total, ja que està en funcionament gairebé tot el dia de l’any.

source: Los electrodomésticos de mayor potencia suelen ser los que generan grandes cantidades de calor. En este grupo se encuentran el horno eléctrico, la vitrocerámica, el secador de pelo, el calefactor de aire, etc. La potencia de estos electrodomésticos oscila entre 1000 y 3000 vatios, por lo que gastan mucha energía eléctrica aunque estén poco tiempo encendidos.
ca: Els electrodomèstics més potents solen ser els que generen grans quantitats de calor. En aquest grup hi ha el forn elèctric, el hob, l’assecador, l’escalfador d’aire, etc. La potència d’aquests electrodomèstics oscil·la entre 1000 i 3000 watts, de manera que gasten molta electricitat encara que estiguin poc temps encesos.

source: Ejercicios
ca: Exercicis

source: Calefactor de aire
ca: Escalfador d'aire

source: ¿Qué energía consume al mes un calefactor de aire de 2000 vatios si funciona durante 5 horas al día?
ca: Quina energia consumeix un escalfador d’aire de 2000 watts al mes si funciona durant 5 hores al dia?

source: Comenzamos por recoger los datos del problema:
ca: Comencem a recopilar les dades del problema:

source: t = 5h/día · 30días = 150h
ca: t = 5h/dia · 30DIAS = 150h

source: Escribimos la fórmula de la energía y sustituimos los valores:
ca: Escrivim la fórmula d’energia i substituïm els valors:

source: Linterna a pilas
ca: Bateries

source: ¿Qué potencia tiene una linterna sabiendo que su pila almacena 4 vatios-hora de energía eléctrica y que dura 10 horas en funcionamiento?
ca: Quina potència té una llanterna sabent que la seva bateria emmagatzema 4 watts-Hara de potència elèctrica i que té una durada de 10 hores en funcionament?

source: Automóvil eléctrico
ca: Cotxe elèctric

source: Un automóvil eléctrico tiene una batería de 100 kilovatios-hora de capacidad. ¿Cuántas horas necesita para cargar la batería completa en un punto de carga de 25 kilovatios de potencia?
ca: Un cotxe elèctric té una bateria de 100 quilowatts-hora. Quantes hores necessiteu per carregar la bateria completa en un punt de càrrega de 25 quilowatts de potència?

source: t = 100kWh / 25kW = 4 horas
ca: t = 100kWh / 25kW = 4 hores

source: Unidad con preguntas
ca: Unitat amb preguntes

source: Unidad didáctica en formato imprimible, con preguntas simples de comprensión lectora.
ca: Unitat didàctica en format imprimible, amb preguntes senzilles de comprensió lectora.

source: :download:`Energía. Formato PDF. <electric/electric-energy/electric-energia.pdf>`
ca: : Descarregueu: `energia. Format PDF. <Electric/Electric -nergy/Electric -Energy.pdf> `

source: :download:`Energía. Formato editable DOC. <electric/electric-energy/electric-energia.doc>`
ca: : Descarregueu: `energia. Doc de format editable. <Electric/Electric -nergy/Electric -Energy.doc> `

source: Cuestionarios
ca: Qüestionaris

source: Cuestionarios sobre energía.
ca: Qüestionaris energètics.

source: `Cuestionario. Energía I. <../test/es-electric-energy-1.html>`__
ca: `Qüestionari. Energia I. <../test/Es-Elèctric-Energy-1.html>`__

source: `Cuestionario. Energía II. <../test/es-electric-energy-2.html>`__
ca: `Qüestionari. Energia II. <../test/es-elèctric-energy-2.html>`__

source: `Cuestionario. Energía III. <../test/es-electric-energy-3.html>`__
ca: `Qüestionari. Energia III. <../test/es-elèctric-energy-3.html>`__

source: `Cuestionario. Energía IV. <../test/es-electric-energy-4.html>`__
ca: `Qüestionari. Energia IV. <../test/es-elèctric-energy-4.html>`__

source: `Cuestionario. Energía V. <../test/es-electric-energy-5.html>`__
ca: `Qüestionari. Energia V. <../test/Es-Elèctrica-Energy-5.html>`__

source: `Cuestionario. Energía VI. <../test/es-electric-energy-6.html>`__
ca: `Qüestionari. Energia VI. <../test/Es-Elèctric-Energy-6.html>`__

source: `Cuestionario. Cálculos con energía eléctrica. <../test/es-electric-energy-calc.html>`__
ca: `Qüestionari. Càlculs amb energia elèctrica. <../test/es-elèctric-energy-calc.html>`__

source: Notas
ca: Notes

source: También existen otras formas de energía potencial, como la energía potencial eléctrica, que no se van a desarrollar en esta unidad.
ca: També hi ha altres formes d’energia potencial, com l’energia potencial elèctrica, que no es desenvoluparan en aquesta unitat.

source: Una `central hidroeléctrica reversible <https://es.wikipedia.org/wiki/Central_hidroel%C3%A9ctrica_reversible>`__ funciona como una batería gigante. Absorbe energía eléctrica de la red para bombear agua desde un embalse inferior hasta otro situado a mayor altura. Así se acumula energía en forma de agua elevada que se puede volver a convertir en electricidad cuando sea necesario.
ca: Una `planta hidroelèctrica reversible <https://es.wikipedia.org/wiki/Central_Hydroel%C3%A9Ctrica_reversible>`__ funciona com a bateria gegant. Absorbeix energia elèctrica de la xarxa per bombar aigua d’un dipòsit inferior a un altre situat a una alçada superior. Així, l’energia s’acumula en forma d’aigua elevada que es pot tornar a connectar en l’electricitat quan sigui necessari.
