Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/electric-sistema-electrico.po
Languages: ca

source: Sistema eléctrico español
ca: Sistema elèctric espanyol

source: Mural del sistema eléctrico español hasta el año 2024. El mural contiene gráficas de la potencia instalada y de la potencia generada en 2024 en formato tarta. También contiene gráficas de la evolución de la generación de energía eléctrica en los últimos años y de la evolución de la potencia instalada eólica y solar en formato de gráfico de barras.
ca: Mural of the Spanish electrical system until 2024. The mural contains graphs of the installed power and the power generated in 2024 in cake format. També conté gràfics de l'evolució de la generació d'electricitat en els darrers anys i l'evolució de la potència instal·lada per vent i solar en format gràfic de barres.

source: Este mural está pensado para que se represente en una cartulina grande, adaptando los gráficos en lo posible al tamaño de la cartulina para que no quede mucho hueco libre entre ellos.
ca: Aquest mural està dissenyat per estar representat en una targeta gran, adaptant els gràfics el màxim possible a la mida del cartró de manera que no hi hagi gaire buit lliure entre ells.

source: También se puede realizar el mural en formato de hoja de cálculo en el aula de informática a partir de la hoja de cálculo con los datos.
ca: També podeu realitzar el mural en format de full de càlcul a l’aula d’ordinador des del full de càlcul amb les dades.

source: :download:`Sistema eléctrico español 2024. Para el profesor. Formato XLS. <electric/sistema-electrico-espanol/electric-sistema-espanol-2024.xls>`
ca: : Descàrrega: `Sistema elèctric espanyol 2024. Per al professor. Format XLS. <Electric/Electric-Epanol/Electric-System-Espanol-2014.xls> '

source: :download:`Sistema eléctrico español 2024. Gráficos. Formato PDF. <electric/sistema-electrico-espanol/electric-sistema-espanol-2024-graph.pdf>`
ca: : Descàrrega: `Sistema elèctric espanyol 2024. Gràfics. Format PDF. <Electric/Electric-Epanol/Electric-System-Espanol-2010-Graph.pdf> `

source: :download:`Sistema eléctrico español 2024. Datos. Formato PDF. <electric/sistema-electrico-espanol/electric-sistema-espanol-2024-datos.pdf>`
ca: : Descàrrega: `Sistema elèctric espanyol 2024. Dades. Format PDF. <Electric/Electric-Espanol/Electric-System-Espanol-2010-Data.pdf> `

source: Se adjunta una plantilla para realizar los gráficos de tarta.
ca: S'adjunta una plantilla per fer els gràfics de la coca.

source: :download:`Diagrama circular de porcentajes. Formato PDF. <electric/sistema-electrico-espanol/diagrama-circular.pdf>`
ca: : Descàrrega: `Diagrama circular de percentatges. Format PDF. <Sistema elèctric/elèctric-espanyol/diagrama-circular.pdf> `

source: Ejercicios
ca: Exercicis

source: Ejercicios sobre el sistema eléctrico español.
ca: Exercicis sobre el sistema elèctric espanyol.

source: :download:`Ejercicios sobre el sistema eléctrico español. Formato PDF. <electric/sistema-electrico-espanol/electric-sistema-ejercicios.pdf>`
ca: : Descarregueu: `Exercicis sobre el sistema elèctric espanyol. Format PDF. <Electric/Electric-Espanol/Electric-System-Exercise.pdf> `Sistema

source: :download:`Ejercicios sobre el sistema eléctrico español. Formato DOC. <electric/sistema-electrico-espanol/electric-sistema-ejercicios.doc>`
ca: : Descarregueu: `Exercicis sobre el sistema elèctric espanyol. Format DOC. <Electric/System-Elèctric-Espanol/Electric-System-Exercises.doc> '

source: Créditos
ca: Crèdits

source: Los datos históricos provienen de Wikipedia y de Red Eléctrica de España, de los artículos:
ca: Les dades històriques provenen de la Viquipèdia i el vermell elèctric d’Espanya, d’articles:

source: `Red Eléctrica de España. Estructura de la generación. <https://www.ree.es/es/datos/generacion/estructura-generacion>`__
ca: `Red Electrica de España. Estructura de generació. <https://www.ree.es/datos/geneacion/estructure-Generació>`__

source: `Energía eólica en España. <https://es.wikipedia.org/wiki/Energ%C3%ADa_e%C3%B3lica_en_Espa%C3%B1a>`__
ca: `Energia eòlica a Espanya. <https://es.wikipedia.org/wiki/energ%C3%ADA_E%C3%B3lica_en_espa%C3%B1a>`__ __

source: `Energía solar en España. <https://es.wikipedia.org/wiki/Energ%C3%ADa_solar_en_Espa%C3%B1a>`__
ca: `Energia solar a Espanya. <https://es.wikipedia.org/wiki/energ%C3%ada_solar_en_espa%C3%B1a>`__
