Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/electronic-diodo-zener.po
Languages: ca

source: El diodo zener
ca: El díode zener

source: Los diodos rectificadores soportan una tensión negativa alta sin conducir. Sin embargo los `diodos zener <https://es.wikipedia.org/wiki/Diodo_Zener>`__ están diseñados para que puedan conducir corriente cuando la tensión negativa sea menor que la tensión de ruptura, con un valor que puede valer entre 2 y 6 voltios.
ca: Els díodes rectificadors admeten una alta tensió negativa sense unitat. Tanmateix, els `Zener Dodos <https://es.wikipedia.org/wiki/diod_zener>`__ estan dissenyats de manera que puguin conduir corrent quan la tensió negativa és inferior a la tensió de ruptura, amb un valor que pot valer entre 2 i 6 volts.

source: Símbolo del diodo zener y nombre de sus terminales.
ca: Símbol de díode Zener i nom dels seus terminals.

source: Existen diodos que conducen corriente con tensiones inversas mayores de 6 voltios. Este tipo de diodos se basan en el efecto **avalancha**, un efecto diferente al zener. Sin embargo nos podemos encontrar diodos de avalancha denominados como diodos zener o viceversa, porque ambos tienen la misma función de conducir corriente a una tensión inversa concreta.
ca: Hi ha díodes que condueixen el corrent amb tensions inverses superiors a 6 volts. Aquest tipus de díodes es basen en l'efecte ** allau **, un efecte diferent del zener. Tot i això, podem trobar díodes Avalanche anomenats díodes Zener o viceversa, perquè tots dos tenen la mateixa funció de conduir corrent a tensió inversa concreta.

source: Los diodos zener permiten construir circuitos limitadores que evitan que la tensión supere un valor, determinado por su tensión de ruptura. Con los diodos zener también se pueden fabricar referencias de tensión muy precisas, utilizadas en los aparatos de mayor precisión.
ca: Els díodes Zener permeten construir circuits limitants que impedeixen que la tensió superi un valor, determinada per la seva tensió de ruptura. Amb els díodes Zener també podeu fabricar referències de tensió molt precises, utilitzades en els dispositius de precisió.

source: En la siguiente simulación puede verse la curva característica de un diodo zener. El diodo conduce corriente cuando la tensión positiva supera los 0.65 voltios, como cualquier diodo rectificador. Pero también conduce corriente cuando la tensión es negativa y llega a un umbral denominado tensión de ruptura, que en este caso vale 5.6 voltios.
ca: En la simulació següent es pot veure la corba característica d’un díode zener. El díode realitza corrent quan la tensió positiva supera els 0,65 volts, com qualsevol díode rectificador. Però també condueix el corrent quan la tensió és negativa i arriba a un llindar anomenat tensió de ruptura, que en aquest cas val 5,6 volts.

source: Referencia de tensión
ca: Referència de tensió

source: En el circuito que aparece a continuación se puede ver una de las aplicaciones del diodo zener, reduciendo una tensión variable de entrada a una tensión relativamente fija de salida. Este es un esquema muy simple, pero funcional. En la práctica se utilizan circuitos más elaborados y mucho más precisos para construir las fuentes fijas de tensión.
ca: Al circuit que apareix a continuació, podeu veure una de les aplicacions del díode Zener, reduint una tensió d’entrada variable a una tensió de sortida relativament fixa. Aquest és un esquema molt senzill, però funcional. A la pràctica, s’utilitzen circuits més elaborats i molt més precisos per construir fonts de tensió fixa.

source: Ejercicios
ca: Exercicis

source: Dibuja el símbolo del diodo zener con el nombre de sus terminales.
ca: Dibuixa el símbol del díode Zener amb el nom dels seus terminals.

source: ¿Qué otros diodos están relacionados con los diodos zener porque realizan la misma función? ¿En qué se diferencian de los zener?
ca: Quins altres díodes estan relacionats amb els díodes Zener perquè realitzen la mateixa funció? Què difereixen del Zener?

source: Dibuja la gráfica de tensión (en el eje x) y de corriente (en el eje y) de el diodo zener de la primera simulación.
ca: Dibuixeu el gràfic de tensió (a l’eix x) i el corrent (a l’eix y) del díode zener de la primera simulació.

source: Dibuja en los ejes las marcas horizontales y verticales que correspondan a los valores de tensión y corriente utilizados.
ca: Dibuixa sobre els eixos les marques horitzontals i verticals que corresponen als valors de tensió i corrent utilitzats.

source: Dibuja un circuito con un diodo zener que limite la tensión a 5.6 voltios a partir de una tensión de alimentación de 12 voltios.
ca: Dibuixa un circuit amb un díode zener que limita la tensió a 5,6 volts des d’una tensió d’alimentació de 12 volts.

source: Con ayuda del `simulador de circuitos <../circuits/?startCircuit=empty.txt>`__ ajusta la resistencia de polarización del diodo zener para que conduzca aproximadamente 20 miliamperios.
ca: Amb l’ajuda del simulador de circuits <../ circuit/? StartCircuit = buuT.txt>`__ ajusta la resistència de polarització del díode zener per conduir aproximadament 20 mil·límetres.

source: ¿Cuánto vale la resistencia de polarización?
ca: Quant costa la resistència a la polarització?

source: Realiza el circuito de la siguiente imagen con el `simulador de circuitos <../circuits/?startCircuit=empty.txt>`__.
ca: Feu el circuit de la imatge següent amb el "Circuit Simulator <../ Circuit/? StartCircuit = buits.txt>`__.

source: Este circuito es una fuente de alimentación lineal regulada. Tiene un rectificador de onda completa con condensador de filtro y un regulador de tensión basado en un diodo zener y un transistor.
ca: Aquest circuit és una font d’alimentació lineal regulada. Té un rectificador d’ona complet amb un condensador de filtre i un regulador de tensió basat en un díode zener i un transistor.

source: Fuente de alimentación regulada con diodo zener y un transistor.
ca: Alimentació regulada amb díode Zener i un transistor.

source: Añade un osciloscopio con la tensión del condensador y añade a ese mismo osciloscopio la tensión en la resistencia R2.
ca: Afegiu un osciloscopi amb la tensió del condensador i afegiu la tensió a la resistència R2 al mateix oscil·loscopi.

source: ¿Qué tensiones tienen los dos componentes? Dibuja una gráfica aproximada de las formas de las dos tensiones en el mismo gráfico.
ca: Quines tensions tenen els dos components? Dibuixa un gràfic aproximat de les formes de les dues tensions al mateix gràfic.

source: Investiga ¿Qué función realiza el diodo zener en el circuito anterior? ¿Qué función realiza el transistor?
ca: Investigueu quina funció realitza el díode Zener al circuit anterior? Quina funció fa el transistor?
