Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/electronic-error-correction.po
Languages: ca

source: Corrección de de errores
ca: Correcció d'errors

source: Los bits extra de redundancia no solo pueden detectar errores de transmisión, también son capaces de corregir los errores detectados.
ca: Els bits de redundància addicionals no només poden detectar errors de transmissió, sinó que també són capaços de corregir els errors detectats.

source: Hay muchos sistemas que solo pueden transmitir la información una vez, no permiten volver a pedir los datos correctos al emisor (televisión digital terrestre, televisión por satélite, etc.). Los medios físicos tales como el CD-ROM, las memorias USB o los Discos SSD tienen el mismo problema, una vez que se corrompe la información no se puede volver a solicitar al emisor.
ca: Hi ha molts sistemes que només poden transmetre la informació una vegada, no permeten tornar a sol·licitar les dades adequades (televisió digital terrestre, televisió per satèl·lit, etc.). Els mitjans físics com el CD-ROM, els records USB o els discos SSD tenen el mateix problema, un cop corrompuda la informació, l’emissor no es pot tornar a sol·licitar.

source: En todos estos casos no es suficiente con detectar los errores, también es necesario poder corregirlos a partir de la información recibida.
ca: En tots aquests casos no n’hi ha prou amb detectar errors, també cal corregir -los a partir de la informació rebuda.

source: Corrección de errores con bits de paridad
ca: Correcció d'errors amb bits de paritat

source: El ejemplo más sencillo de un código que corrige errores es un sistema con doble paridad, horizontal y vertical. Este ejemplo no se utiliza en la práctica para corregir errores, pero es mucho más sencillo de visualizar que otros códigos más capaces y mucho más complejos.
ca: L’exemple més senzill d’un codi que corregeix els errors és un sistema amb doble paritat, horitzontal i vertical. Aquest exemple no s’utilitza a la pràctica per corregir els errors, però és molt més fàcil visualitzar que altres codis més capaços i molt més complexos.

source: Comenzamos por una tabla con 16 bits de información (4x4):
ca: Comencem amb una taula amb 16 bits d’informació (4x4):

source: 16 bits de datos.
ca: 16 bits de dades.

source: A esta tabla le añadimos 4 bits de paridad en horizontal y otros 4 bits de paridad en vertical:
ca: A aquesta taula afegim 4 bits de paritat horitzontalment i altres 4 bits de paritat vertical:

source: 16 bits de datos rodeados de 8 bits de paridad, sin errores.
ca: 16 bits de dades envoltats de 8 bits de paritat, sense errors.

source: Una vez formada la tabla la podemos transmitir y con la información redundante podremos detectar y corregir cualquier error de 1 solo bit.
ca: Un cop formada la taula, podem transmetre -la i amb la informació redundant podem detectar i corregir qualsevol error d’un sol bit.

source: Si se produce un error en un bit de los datos, la información de paridad no será correcta en un bit de paridad de fila y tampoco será correcta en un bit de paridad de columna:
ca: Si es produeix un error en un bit de dades, la informació de paritat no serà correcta sobre un bit de paritat de fila i no serà correcta en un bit de paritat de la columna:

source: 16 bits de datos con un error en un bit, rodeados de 8 bits de paridad de los cuales 2 no concuerdan con los datos.
ca: 16 bits de dades amb un error en una mica, envoltats de 8 bits de paritat dels quals 2 no estan d’acord amb les dades.

source: Eso indica que el bit correspondiente a esa fila y a esa columna ha cambiado:
ca: Això indica que el bit correspon a aquesta fila i aquesta columna ha canviat:

source: Bits de paridad indicando error en amarillo, bit erróneo en naranja.
ca: Bits de paritat que indiquen un error groc, una mica errònia en taronja.

source: Con esa información podemos corregir el bit erróneo para volver a la tabla original.
ca: Amb aquesta informació, podem corregir el bit erroni per tornar a la taula original.

source: Por otro lado, si lo que cambia por error es un bit de paridad, solo ese bit será el que no concuerda con la tabla. Todos los demás bits de paridad van a ser correctos, lo cual indica que es el bit solitario el que ha cambiado:
ca: D'altra banda, si el que canvia per error és una mica de paritat, només aquest bit serà el que no coincideix amb la taula. La resta de bits de paritat seran correctes, cosa que indica que és el bit solitari que ha canviat:

source: Bit de paridad erróneo en amarillo. Es el único bit que no concuerda con los demás.
ca: Paritat errònia bit de groc. És l’únic que no està d’acord amb els altres.

source: Con esa información podemos corregir el bit de paridad erróneo para volver a la tabla original:
ca: Amb aquesta informació, podem corregir el bit de paritat errònia per tornar a la taula original:

source: Códigos de corrección de errores
ca: Codis de correcció d'errors

source: Los `códigos de corrección de errores <https://es.wikipedia.org/wiki/FEC>`__ utilizados en la práctica son capaces de corregir ráfagas de varios bits erróneos en un mismo bloque de información.
ca: Els codis de correcció d’errors <https://es.wikipedia.org/wiki/fec>`__ utilitzats a la pràctica són capaços de corregir ràfegues de diversos bits equivocats al mateix bloc d’informació.

source: Los códigos correctores más populares son los siguientes:
ca: Els codis correctius més populars són els següents:

source: `Códigos Reed-Solomon. <https://es.wikipedia.org/wiki/Reed-Solomon>`__
ca: `Codis de Reed-Solomon. <https://es.wikipedia.org/wiki/reed-solomon>`__

source: Son los más sencillos de implementar y los más antiguos. Se han empleado en CD, DVD, TV digital, ADSL, etc.
ca: Són els més senzills d’implementar i els més antics. S'han utilitzat en CD, DVD, TV digital, ADSL, etc.

source: `Códigos Convolucionales. <https://es.wikipedia.org/wiki/C%C3%B3digo_convolucional>`__
ca: `Codis Convoluccionals. <https://es.wikipedia.org/wiki/c%C3%B3digo_convolucion

source: Empleados en redes de telefonía móvil GSM, redes WiFi antiguas o en sondas espaciales.
ca: Empleats en xarxes telefòniques mòbils GSM, xarxes antigues de WI -FI o en sondes espacials.

source: `Turbo Códigos. <https://es.wikipedia.org/wiki/Turbo_c%C3%B3digos>`__
ca: `Codis turbo. <https://es.wikipedia.org/wiki/urbo_c%C3%B3digos>`__

source: Empleados en comunicaciones por satélite y en redes de telefonía móvil 3G. Tienen la desventaja de estar patentados.
ca: Els empleats en comunicacions per satèl·lit i xarxes de telefonia mòbil 3G. Tenen el desavantatge de ser patentats.

source: `Códigos LDPC o Gallager. <https://es.wikipedia.org/wiki/LDPC>`__
ca: `LDPC o codis Gallager. <https://es.wikipedia.org/wiki/ldpc>`__

source: Son los más recientes. Se utilizan en las redes WiFi más modernas, en telefonía móvil 5G, en las redes Ethernet cableadas de mayor velocidad y en las últimas versiones de TV Digital.
ca: Són els més recents. S’utilitzen a les xarxes Wi -Fi més modernes, en telefonia mòbil 5G, a les xarxes Ethernet es cauen més ràpidament i en les darreres versions de la televisió digital.

source: Ejercicios
ca: Exercicis

source: Escribe tu nombre en una hoja de papel.
ca: Escriviu el vostre nom en un full de paper.

source: En la hoja, dibuja y rellena la siguiente tabla de 4x4 bits con datos binarios (cero o uno) aleatorios, dejando un hueco en uno de los cuadrados.
ca: Al full, dibuixa i empleneu la taula de bits 4x4 següents amb dades binàries (zero o un) aleatòries, deixant un forat en un dels quadrats.

source: Rellena a continuación los bits de paridad de cada fila y de cada columna teniendo en cuenta que en el hueco dejado libre debería haber un uno (1).
ca: Ompliu per sota dels bits de paritat de cada fila i cada columna tenint en compte que, a la bretxa lliure, hi hauria d’haver -ne un (1).

source: Escribe ahora un cero (0) en el hueco dejado antes. Este será el error de transmisión.
ca: Escriviu un zero (0) al forat que queda abans. Aquest serà l’error de transmissió.

source: Intercambia la tabla con un compañero de clase para que cada uno indique con un círculo dónde está el error en la tabla del otro.
ca: Intercanvi la taula amb un company de classe de manera que cadascú indica amb un cercle on es troba l'error a l'altra taula.

source: Dibuja y rellena la siguiente tabla de 4x4 bits con datos binarios aleatorios.
ca: Dibuixeu i empleneu la taula de bits 4x4 següents amb dades binàries aleatòries.

source: Rellena a continuación los bits de paridad de cada fila y de cada columna teniendo en cuenta que debes escribir uno al revés de lo que vale en realidad (error en un bit de paridad).
ca: Ompliu per sota dels bits de paritat de cada fila i cada columna tenint en compte que heu d’escriure un viceversa del que val la pena (error en un bit de paritat).

source: Los códigos de corrección de errores usados en aplicaciones reales ¿cuántos bits erróneos pueden corregir en cada bloque de datos? Investiga en Internet y explica la respuesta.
ca: Els codis de correcció d’errors utilitzats en aplicacions reals. Quants bits errònics poden corregir a cada bloc de dades? Investiga a Internet i explica la resposta.

source: Escribe el nombre de tres códigos de corrección de errores usados en sistemas reales y escribe dos aplicaciones de cada uno de ellos.
ca: Escriviu el nom de tres codis de correcció d’errors utilitzats en sistemes reals i escriviu dues aplicacions de cadascuna d’elles.
