Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/electronic-diodo.po
Languages: ca

source: El diodo
ca: El díode

source: Un `diodo <https://es.wikipedia.org/wiki/Diodo>`__ semiconductor es un dispositivo electrónico que permite el paso de corriente con facilidad en un sentido y no permite el paso de corriente en el sentido contrario.
ca: Un `díode <https://es.wikipedia.org/wiki/diodo>`__ semiconductor és un dispositiu electrònic que permet el pas del corrent fàcilment en un sentit i no permet el pas del corrent en el sentit contrari.

source: Fotografía de un diodo semiconductor.
ca: Fotografia d’un díode semiconductor.

source: `John Maushammer <https://es.wikipedia.org/wiki/Archivo:Diode-closeup.jpg>`__, `CC BY-SA 2.5 <https://creativecommons.org/licenses/by-sa/2.5/deed.es>`__, via Wikimedia Commons.
ca: `John Maushammer <https://es.wikipedia.org/wiki/archivo:diode-closeup.jpg>` __, `cc by-sa 2.5 <https://creativecommons.org/licenses/by-sa/2.5/deed.es>`

source: El diodo conduce corriente cuando se aplica tensión positiva en el ánodo y tensión negativa en el cátodo. Si se le aplica tensión al contrario, se dice que está polarizado en inverso y no conducirá corriente.
ca: El díode realitza corrent quan s’aplica la tensió positiva a l’ànode i la tensió negativa del càtode. Si s’aplica la tensió al contrari, es diu que està polaritzada al revés i no conduirà corrent.

source: Símbolo del diodo semiconductor.
ca: Símbol del díode semiconductor.

source: El diodo permite que la corriente circule desde el ánodo hasta el cátodo. La flecha del símbolo del diodo indica el sentido de la corriente desde el polo positivo hacia el polo negativo.
ca: El díode permet que el corrent circuli de l’ànode al càtode. La fletxa del símbol del díode indica el significat del corrent des del pol positiu fins al pol negatiu.

source: Tensión umbral de polarización directa
ca: Tensió del llindar de polarització directa

source: La tensión umbral es la tensión de polarización directa a partir de la cual la corriente comienza a aumentar rápidamente.
ca: La tensió llindar és la tensió de polarització directa a partir de la qual el corrent comença a augmentar ràpidament.

source: En los diodos rectificadores esta tensión es de unos 0.65 voltios. En diodos de tipo LED esta tensión aumenta hasta 1.8 voltios para ledes rojos y hasta 3 voltios para ledes blancos.
ca: En els díodes rectificadors, aquesta tensió és d’uns 0,65 volts. En els díodes LED, aquesta tensió augmenta fins a 1,8 volts per a leds vermells i fins a 3 volts per a LEDES blanques.

source: En diodos rectificadores especiales (`diodos Schottky <https://es.wikipedia.org/wiki/Diodo_Schottky>`__) esta tensión puede bajar hasta 0.2 voltios.
ca: En els rectificadors especials, els díodes (`Schottky Diodes <https://ca.wikipedia.org/wiki/D%C3%ADode_Schottky>`__) Aquesta tensió pot caure a 0,2 volts.

source: Simulación
ca: Simulació

source: En la siguiente simulación se puede observar un diodo sometido a tensión positiva y a tensión negativa de 1 voltio.
ca: A la següent simulació es pot veure un díode sotmès a tensió positiva i tensió negativa d’1 vol.

source: La gráfica de abajo a la izquierda representa la tensión y la corriente del diodo.
ca: El gràfic de la part inferior a l'esquerra representa la tensió i el corrent del díode.

source: La gráfica de abajo a la derecha representa la corriente que circula por el diodo (eje vertical Y) en función de la tensión que recibe el diodo (eje horizontal X). Es una curva con un codo que comienza a subir en los 0.65 voltios de la tensión umbral del diodo.
ca: El gràfic de la part inferior dreta representa el corrent que circula pel díode (eix vertical y) depenent de la tensió que rep el díode (eix horitzontal x). És una corba amb un colze que comença a augmentar en els 0,65 volts de la tensió llindar del díode.

source: Ejercicios
ca: Exercicis

source: Dibuja el símbolo de un diodo semiconductor con el nombre de sus terminales.
ca: Dibuixa el símbol d’un díode semiconductor amb el nom dels seus terminals.

source: ¿Qué función realiza un diodo? ¿Cuándo conduce corriente?
ca: Quina funció fa un díode? Quan condueixes corrent?

source: ¿Qué es la tensión umbral y cuánto vale para diferentes diodos?
ca: Quina és la tensió llindar i quant costa per a diferents díodes?

source: Dibuja una gráfica con la corriente que circula por un diodo (eje Y) en función de la tensión del diodo (eje X). Dibuja en la gráfica las marcas de voltaje cada 0.1 voltios y las marcas de corriente cada 0.1 amperios con separación suficiente entre ellas.
ca: Dibuixa un gràfic amb el corrent que circula per un díode (eix y) depenent de la tensió del díode (x -axis). Dibuixa les marques de tensió cada tensió de 0,1 i les marques de corrent cada 0,1 amperis amb una separació suficient entre elles.

source: Dibuja una línea en la tensión umbral de la curva.
ca: Dibuixa una línia en la tensió llindar de la corba.

source: Recuerda ampliar el simulador con la opción ``Archivo...`` ``Cambiar a Pantalla Completa`` para poder ver mejor la gráfica.
ca: No oblideu ampliar el simulador amb el `` fitxer ... `` `` Canvieu a la pantalla completa `` per veure millor el gràfic.

source: ¿Qué ocurre en el diodo cuando la tensión del ánodo es negativa?
ca: Què passa al díode quan la tensió de l’ànode és negativa?
