Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/electronic-operational.po
Languages: ca

source: El amplificador operacional
ca: L'amplificador operatiu

source: El amplificador operacional es un circuito electrónico compuesto internamente por múltiples etapas de transistores conectados para conseguir un circuito amplificador de tensión diferencial, de alta ganancia y lo más ideal posible.
ca: L’amplificador operatiu és un circuit electrònic compost internament per múltiples etapes de transistors connectats per aconseguir un circuit d’amplificador de tensió diferencial, un guany elevat i el més ideal possible.

source: Símbolo del amplificador operacional ideal.
ca: Símbol d'amplificador operatiu ideal.

source: Un amplificador operacional tiene **dos entradas** diferenciales señaladas con los símbolos ``+`` y ``-`` y **una salida** en la punta del triángulo.
ca: Un amplificador operatiu té ** dues entrades ** diferencials indicats amb el `` `` `` `` `` `` `` `` `` `` `` `` `` i ** una sortida ** a la punta del triangle.

source: Los **amplificadores operacionales reales**, además, tienen dos terminales de alimentación por los que les llega tensión positiva y tensión negativa, necesarias para que puedan funcionar el circuito interno.
ca: Els ** amplificadors operatius reals ** A més, tenen dos terminals d’alimentació per als quals assoleixen la tensió positiva i la tensió negativa, necessàries perquè el circuit intern funcioni.

source: Terminales del amplificador operacional real:
ca: Terminals d’amplificadors d’operació reial:

source: Terminal de entrada negativo.
ca: Terminal d’entrada negativa.

source: Terminal de entrada positivo.
ca: Terminal d’entrada positiu.

source: Terminal de salida.
ca: Terminal de sortida.

source: Terminal de alimentación positiva.
ca: Terminal d’alimentació positiva.

source: Terminal de alimentación negativa.
ca: Terminal d’alimentació negativa.

source: Funcionamiento
ca: Operació

source: El amplificador amplifica la diferencia entre los terminales de entrada ``+`` y ``-``. Si la entrada positiva ``+`` tiene una tensión superior a la entrada negativa ``-``, la salida tendrá una tensión positiva.
ca: L’amplificador amplifica la diferència entre els terminals d’entrada ``+`` i `` `. Si l’entrada positiva ``+`` té una tensió superior a l’entrada negativa `` ``, la sortida tindrà una tensió positiva.

source: Por el contrario si la entrada negativa ``-`` tiene una tensión superior a la entrada positiva ``+``, la salida tendrá una tensión negativa.
ca: Per contra, si l’entrada negativa `` `` té una tensió superior a l'entrada positiva ``+``, la sortida tindrà una tensió negativa.

source: Normalmente la diferencia en la tensión de entrada se multiplica a la salida por decenas o centenas de miles de veces la tensión de entrada. Esto significa que la ganancia de tensión es muy alta.
ca: Normalment, la diferència en la tensió d’entrada es multiplica a la sortida per desenes o centenars de milers de vegades la tensió d’entrada. Això significa que el guany de tensió és molt elevat.

source: La corriente absorbida por las entradas del amplificador es tan baja que en la práctica se puede considerar que vale cero. Esto significa que la **resistencia de entrada es muy alta** porque no absorbe corriente.
ca: El corrent absorbit per les entrades de l'amplificador és tan baix que a la pràctica es pot considerar, ja que val la pena zero. Això vol dir que ** La resistència a l’entrada és molt alta ** perquè no absorbeix el corrent.

source: La corriente de salida puede ser relativamente alta sin que cambie la tensión de salida. Esto significa que la **resistencia de salida es muy baja**.
ca: El corrent de sortida pot ser relativament alt sense canviar la tensió de sortida. Això significa que ** La resistència a la sortida és molt baixa **.

source: Ventajas
ca: Avantatges

source: Este es un circuito muy utilizado porque aporta muchas ventajas frente a los transistores individuales:
ca: Es tracta d’un circuit àmpliament utilitzat perquè proporciona molts avantatges respecte als transistors individuals:

source: Todos sus transistores internos incorporan polarización, por lo que apenas es necesario añadir resistencias.
ca: Tots els seus transistors interns incorporen polarització, de manera que difícilment és necessari afegir resistències.

source: Consigue una ganancia de tensión muy alta (decenas o centenas de miles).
ca: Obteniu un guany de tensió molt elevat (desenes o centenars de milers).

source: La corriente de entrada es tan baja que se puede considerar igual a cero. Esto facilita los cálculos y que las entradas del amplificador operacional no afecten al resto del circuito.
ca: El corrent d’entrada és tan baix que es pot considerar igual a zero. Això facilita els càlculs i que les entrades d’amplificadors operatius no afecten la resta del circuit.

source: Tiene una salida push-pull que entrega corriente relativamente alta tanto positiva como negativa.
ca: Té una sortida push-pull que proporciona un corrent relativament elevat tant positiu com negatiu.

source: La corriente de salida está limitada para que el circuito no se queme.
ca: El corrent de sortida és limitat perquè el circuit no es cremi.

source: Como **desventaja** se puede decir que la velocidad de los amplificadores operacionales es menor que la de los transistores individuales, pero esto no representa un problema en la mayoría de las aplicaciones de baja frecuencia.
ca: Com a ** desavantatge ** Es pot dir que la velocitat dels amplificadors operatius és inferior a la dels transistors individuals, però això no representa un problema en la majoria de les aplicacions de baixa freqüència.

source: Simulación
ca: Simulació

source: A continuación se puede ver una simulación de un amplificador operacional real (LM324) alimentado en las entradas con dos tensiones muy semejantes. En este circuito el amplificador está funcionando como comparador.
ca: A continuació, podeu veure una simulació d’un amplificador operatiu real (LM324) alimentat en les entrades amb dues tensions molt similars. En aquest circuit, l'amplificador funciona com a comparador.

source: Cuando se modifica el valor de la resistencia, la tensión de la entrada positiva cambia y se puede ver cómo el operacional enciende y apaga el led verde de la salida.
ca: Quan es modifica el valor de resistència, la tensió d’entrada positiva canvia i podreu veure com l’operació s’encén i extingeix el LED verd de la sortida.

source: Ejercicios
ca: Exercicis

source: Dibuja el símbolo de un amplificador operacional ideal.
ca: Dibuixa el símbol d’un amplificador operatiu ideal.

source: ¿Cuántos terminales tiene un amplificador operacional real? ¿Para que sirve cada uno?
ca: Quants terminals té un amplificador operatiu real? Per a què serveix cadascun?

source: Explica con tus palabras el funcionamiento de un amplificador operacional.
ca: Expliqueu amb les vostres paraules el funcionament d’un amplificador operatiu.

source: ¿Qué ventajas tiene un amplificador operacional frente a los amplificadores basados en transistores?
ca: Quins avantatges té un amplificador operatiu contra els transistors?

source: ¿Y qué desventaja tiene?
ca: I quin desavantatge té?

source: Modifica la resistencia variable del simulador y escribe con qué tensión de entrada ``+`` comienza a encender el led el amplificador operacional y con qué tensión de entrada ``+`` se enciende el led del todo.
ca: Modifiqueu la resistència variable del simulador i escriviu amb quina tensió d’entrada ``+`` L'amplificador operatiu comença a activar -se i amb quina tensió d'entrada ``
