Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/electronic-gate-not.po
Languages: ca

source: La puerta lógica NOT
ca: La porta lògica no

source: Los componentes más sencillos de la electrónica digital son las **puertas lógicas**, que llevan a cabo operaciones lógicas básicas. Combinando estas puertas lógicas se pueden llegar a construir circuitos mucho más complejos, hasta llegar a los computadores modernos.
ca: Els components més simples de l’electrònica digital són les portes ** lògiques **, que realitzen operacions lògiques bàsiques. Combinant aquestes portes lògiques, es poden crear circuits molt més complexos fins arribar als ordinadors moderns.

source: La puerta lógica más sencilla posible es la **puerta negación**, también llamada **puerta inversora** o **puerta NOT**. Esta puerta invierte el valor de la señal de entrada, de manera que si la entrada vale un 1 lógico, la salida valdrá un 0 lógico y viceversa.
ca: La porta lògica més senzilla és la porta ** de negació **, també anomenada ** porta inversora ** o ** no **. Aquesta porta inverteix el valor del senyal d’entrada, de manera que si l’entrada val la pena lògica, la sortida valdrà una lògica i viceversa.

source: El **símbolo de la puerta NOT** es el siguiente:
ca: El símbol de la porta ** no ** és el següent:

source: Puerta lógica NOT.
ca: Porta lògica no.

source: El círculo a la salida del triángulo es el que representa que la puerta invierte, o niega, el valor de entrada.
ca: El cercle a la sortida del triangle és el que representa que la porta inverteix o nega el valor d’entrada.

source: La **función lógica de la puerta NOT** se representa mediante una línea sobre el elemento a invertir o negar:
ca: La funció lògica de la porta no ** està representada per una línia de l'element per invertir o negar:

source: A continuación podemos ver la `tabla de verdad <https://es.wikipedia.org/wiki/Tabla_de_verdad#Negaci%C3%B3n>`__ de la puerta NOT, que representa todos los valores posibles de entrada y de salida de la puerta lógica:
ca: A continuació, podem veure la `Taula de veritat <https://es.wikipedia.org/wiki/tabla_de_verdad#negaci%C3%B3n>`__ del no puerta, que representa tots els valors possibles d'entrada i sortida de la porta lògica:

source: Tabla de verdad de la puerta lógica NOT.
ca: Taula de veritat de la porta lògica no.

source: Cuando la entrada (A) vale cero, la salida (Out) valdrá uno.
ca: Quan l’entrada valgui zero, la sortida (fora) valdrà una.

source: Cuando la entrada (A) vale uno, la salida (Out) valdrá cero.
ca: Quan l’entrada valgui una, la sortida (fora) valdrà zero.

source: Simulación
ca: Simulació

source: En la siguiente simulación podemos ver una puerta NOT con una entrada que puede cambiar de valor y una salida que vale siempre lo contrario al valor de entrada.
ca: En la simulació següent, podem veure una no Puerta amb una entrada que pot canviar el valor i una sortida que sempre val la pena el contrari del valor d’entrada.

source: En el simulador los valores se pueden representar con números (0, 1), con niveles lógicos (L, H) o con valores de tensión (0V, 5V), con la siguiente correspondencia:
ca: Al simulador els valors es poden representar amb nombres (0, 1), amb nivells lògics (L, H) o amb valors de tensió (0V, 5V), amb la correspondència següent:

source: Nivel
ca: Plana

source: Valor lógico
ca: Valor lògic

source: Valor de tensión
ca: Valor de tensió

source: L = LOW
ca: L = baix

source: 0 = Cero lógico
ca: 0 = Logical Zero

source: 0 Voltios
ca: 0 volts

source: H = HIGH
ca: H = alt

source: 1 = Uno lógico
ca: 1 = lògic

source: 5 Voltios
ca: 5 volts

source: Hay que clicar sobre el valor lógico de entrada para que cambie de valor.
ca: Heu de fer clic al valor d’entrada lògica per canviar el valor.

source: Ejercicios
ca: Exercicis

source: ¿Qué es una puerta lógica?
ca: Què és una porta lògica?

source: ¿Qué se puede llegar a construir con las puertas lógicas?
ca: Què es pot crear amb portes lògiques?

source: Explica con tus palabras el funcionamiento de la puerta lógica NOT.
ca: Expliqueu amb les vostres paraules el funcionament de la porta lògica no.

source: Dibuja el símbolo de la puerta NOT y escribe debajo su función lógica y sus tres diferentes nombres.
ca: Dibuixa el símbol no de la porta i escriu sota la seva funció lògica i els seus tres noms diferents.

source: Dibuja la tabla de verdad de la puerta NOT con **valores numéricos** 0 y 1.
ca: Dibuixa la taula de veritat de la no Puerta amb ** valors numèrics ** 0 i 1.

source: Dibuja la tabla de verdad de la puerta NOT con **niveles lógicos** L y H.
ca: Dibuixa la taula de veritat de la no Puerta amb ** nivells lògics ** L i H.

source: Realiza una simulación de dos puertas NOT en serie. ¿Cómo crees que será la tabla de verdad de las dos puertas?
ca: Feu una simulació de dos dimarts en sèrie. Com creieu que serà la taula de veritat de les dues portes?

source: Realiza la simulación y dibuja la tabla de verdad de las dos puertas en serie.
ca: Realitzeu la simulació i dibuixeu la taula de veritat de les dues portes en sèrie.
