Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/electric-serie-paralelo-resistencias.po
Languages: ca

source: Resistencias equivalentes
ca: Resistències equivalents

source: En esta unidad se estudiarán las resistencias equivalentes de circuitos con resistencias en serie, con resistencias en paralelo y con resistencias en montajes mixtos.
ca: Aquesta unitat estudiarà les resistències equivalents dels circuits amb resistències de sèries, amb resistències i resistències paral·leles en conjunts mixtes.

source: Una resistencia equivalente a un circuito con varias resistencias es aquella por la que pasará la misma corriente que por el circuito al alimentarlos con la misma fuente de tensión.
ca: Una resistència equivalent a un circuit amb diverses resistències és la que passarà el mateix corrent que pel circuit en alimentar -los amb la mateixa font de tensió.

source: Índice de contenidos:
ca: Índex de contingut:

source: Resistencia equivalente de un circuito en serie
ca: Resistència equivalent d’un circuit en sèrie

source: Un circuito con resistencias en serie está configurado como el de la siguiente figura:
ca: Es configura un circuit amb resistències en sèrie com a figura següent:

source: Este circuito se puede simplificar en un circuito con una sola resistencia que tenga un valor equivalente a las dos resistencias en serie. Este circuito se denomina circuito equivalente y por él circulará la misma corriente que por el circuito con dos resistencias.
ca: Aquest circuit es pot simplificar en un circuit amb una única resistència que té un valor equivalent a les resistències de dues sèries. Aquest circuit s’anomena circuit equivalent i el mateix corrent circularà que el circuit amb dues resistències.

source: Para calcular el valor de la resistencia equivalente a un circuito en serie, se deben sumar los valores de todas las resistencias en serie según la siguiente fórmula:
ca: Per calcular el valor de resistència equivalent a un circuit en sèrie, s’han d’afegir els valors de totes les resistències de la sèrie segons la fórmula següent:

source: En el caso de que el circuito esté compuesto por tres resistencias en serie:
ca: En cas que el circuit estigui format per tres resistències de sèries:

source: se deberán sumar los valores de las tres resistencias para calcular el valor de la resistencia equivalente, según la siguiente fórmula:
ca: Cal afegir els valors de les tres resistències per calcular el valor de resistència equivalent, segons la fórmula següent:

source: Si a un circuito le añadimos una resistencia en serie la resistencia total siempre aumentará y por lo tanto la corriente total siempre disminuirá.
ca: Si afegim una resistència a la sèrie a un circuit, la resistència total augmentarà sempre i, per tant, el corrent total sempre disminuirà.

source: Resistencia equivalente de un circuito en paralelo
ca: Resistència equivalent d’un circuit paral·lel

source: En la siguiente figura se puede ver un circuito con resistencias en paralelo y su circuito equivalente con una sola resistencia:
ca: A la figura següent podeu veure un circuit amb resistències paral·leles i el seu circuit equivalent amb una única resistència:

source: En el caso de un circuito con resistencias en paralelo, la resistencia equivalente se calculará con el inverso de la suma de las inversas de las resistencias según la siguiente fórmula:
ca: En el cas d’un circuit amb resistències paral·leles, la resistència equivalent es calcularà amb la inversa de la suma de la inversa de les resistències segons la fórmula següent:

source: La resistencia equivalente de un paralelo siempre será menor que cualquiera de las resistencias que forman el paralelo.
ca: La resistència equivalent d’un paral·lel sempre serà inferior a qualsevol de les resistències que formen el paral·lel.

source: Si el circuito está formado por tres resistencias en paralelo, el cálculo puede extenderse a tres resistencias en total según la siguiente fórmula:
ca: Si el circuit consta de tres resistències en paral·lel, el càlcul es pot estendre a tres resistències en total segons la fórmula següent:

source: Si a un circuito le añadimos una resistencia en paralelo, la resistencia total siempre disminuirá y por lo tanto la corriente total siempre aumentará.
ca: Si afegim una resistència paral·lela a un circuit, la resistència total sempre disminuirà i, per tant, el corrent total sempre augmentarà.

source: Resistencia equivalente de un circuito paralelo-serie
ca: Resistència equivalent d’un circuit de sèrie paral·lela

source: Los circuitos mixtos están compuestos por resistencias en serie y por resistencias en paralelo. Para resolver los circuitos mixtos primero habrá que resolver los circuitos serie o paralelo interiores y con el circuito ya simplificado resolver los circuitos serie o paralelo exteriores.
ca: Els circuits mixtes es componen de resistències en sèrie i resistències paral·leles. Per resoldre els circuits mixtes, caldrà resoldre el serial interior o els circuits paral·lels i, amb el circuit ja simplificat, resoldre els circuits de sèrie o paral·lel exteriors.

source: A continuación veremos varios ejemplos.
ca: A continuació, veurem diversos exemples.

source: En la siguiente figura podemos ver un circuito mixto de tres resistencias:
ca: A la figura següent podem veure un circuit mixt de tres resistències:

source: En este circuito mixto primero hay que resolver el paralelo formado por las resistencias R2 y R3, con lo cual el circuito se simplifica según la siguiente imagen.
ca: En aquest circuit mixt, el paral·lel format per resistències R2 i R3 s’ha de resoldre, cosa que simplifica segons la imatge següent.

source: A continuación se pueden sumar las resistencias R1 y R23 para calcular la resistencia equivalente del circuito completo:
ca: A continuació, podeu afegir les resistències R1 i R23 per calcular la resistència equivalent del circuit complet:

source: Resistencia equivalente de un circuito serie-paralelo
ca: Resistència equivalent d’un circuit de sèries-peer

source: En la siguiente figura podemos ver otro circuito mixto de tres resistencias.
ca: A la figura següent podem veure un altre circuit mixt de tres resistències.

source: En este circuito mixto primero hay que resolver la serie formada por las resistencias R1 y R2 sumando sus valores, con lo cual el circuito se simplifica según la siguiente imagen:
ca: En aquest circuit mixt primer, la sèrie formada per resistors R1 i R2 s’ha de resoldre afegint els seus valors, que es simplifica segons la imatge següent:

source: A continuación se puede calcular el paralelo de las resistencias R12 y R3 para hallar la resistencia equivalente del circuito completo:
ca: A continuació, podeu calcular el paral·lel de les resistències R12 i R3 per trobar la resistència equivalent del circuit complet:

source: Resistencia equivalente de un circuito dos series-paralelo
ca: Resistència equivalent d’un circuit de sèries dos paralls

source: En la siguiente figura podemos ver un circuito mixto de cuatro resistencias:
ca: A la figura següent podem veure un circuit mixt de quatre resistències:

source: En este circuito mixto primero hay que calcular el equivalente en serie de las resistencias R1 y R2 y por otro lado el equivalente en serie de las resistencias R3 y R4, con lo que el circuito se simplifica según la siguiente imagen:
ca: En aquest circuit mixt primer heu de calcular l’equivalent a la sèrie de resistències R1 i R2 i, d’altra banda, l’equivalent a la sèrie de les resistències R3 i R4, amb la qual el circuit es simplifica segons la imatge següent:

source: Una vez simplificado el circuito, se puede calcular el paralelo de las dos resistencias R12 y R34 según la fórmula correspondiente:
ca: Un cop simplificat el circuit, el paral·lel de les dues resistències R12 i R34 es pot calcular segons la fórmula corresponent:

source: Resistencia equivalente de un circuito dos paralelos-serie
ca: Resistència equivalent d’un circuit de dues sèries paral·leles

source: En la siguiente figura podemos ver otro circuito mixto de cuatro resistencias:
ca: A la figura següent podem veure un altre circuit mixt de quatre resistències:

source: En este circuito mixto primero hay que calcular el equivalente en paralelo de las resistencias R1 y R2 y por otro lado el equivalente en paralelo de las resistencias R3 y R4, con lo que el circuito se simplifica según la siguiente imagen:
ca: En aquest circuit mixt primer heu de calcular l’equivalent en paral·lel de les resistències R1 i R2 i, d’altra banda, l’equivalent en paral·lel de les resistències R3 i R4, amb les quals el circuit es simplifica segons la imatge següent:

source: Una vez simplificado el circuito, se puede calcular la serie de las dos resistencias R12 y R34 según la fórmula correspondiente:
ca: Un cop simplificat el circuit, podeu calcular la sèrie de les dues resistències R12 i R34 segons la fórmula corresponent:

source: Ejercicios
ca: Exercicis

source: Ejercicios de cálculo de resistencias equivalentes en serie, en paralelo y en circuitos mixtos.
ca: Exercicis de càlcul de resistència equivalents en sèries, en paral·lel i en circuits mixtes.

source: :download:`Calcular resistencias en serie y en paralelo. Formato PDF. <electric/electric-resistencias-serie-paralelo.pdf>`
ca: : Descarregueu: `Calculeu les resistències de la sèrie i en paral·lel. Format PDF. <Electric/Electric-resistances-Serie-Paralelo.pdf>`

source: :download:`Proyecto editable. Formato KiCad. <electric/electric-resistencias-serie-paralelo-kicad.zip>`
ca: : Descàrrega: `Projecte Editable. Format KICAD. <Electric/Electric-Resistors-Serie-Paralelo-Kicad.zip>`

source: :download:`Imágenes de los circuitos. <electric/electric-resistencias-serie-paralelo-images.zip>`
ca: : Descarregueu: `Imatges dels circuits. <Electric/Electric-resistances-Serie-Paralelo-images.zip>`

source: Cuestionarios
ca: Qüestionaris

source: `Cuestionario. Calcular resistencias equivalentes. <../test/es-electric-series-parallel-calc-2.html>`__
ca: `Qüestionari. Calculeu resistències equivalents. <../test/es-elèctric-sèrie-parallel-calc-2.html>`__
