Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/electric-simulador-leyohm.po
Languages: ca

source: :index:`Ley de Ohm`
ca: : Índex: `Ohm 'Llei

source: La ley de Ohm establece la relación que existe entre las tres magnitudes principales de un circuito eléctrico con resistencia.
ca: La llei d'Ohm estableix la relació entre les tres magnituds principals d'un circuit elèctric amb resistència.

source: Cuánto mayor sea la tensión, mayor será la corriente del circuito.
ca: Com més gran sigui la tensió, més gran és el corrent del circuit.

source: Cuanto mayor sea la resistencia, menor será la corriente del circuito.
ca: Com més gran sigui la resistència, més baix és el corrent del circuit.

source: Fórmula de la ley de Ohm
ca: Fórmula de llei ohm

source: La ley de Ohm expresada de forma matemática tiene la siguiente fórmula:
ca: La llei d'Ohm expressada de manera matemàtica té la fórmula següent:

source: Siendo las magnitudes y unidades las siguientes:
ca: Les magnituds i les unitats són les següents:

source: I = Intensidad de corriente en amperios [A]
ca: I = intensitat actual en amplificadors [a]

source: V = Tensión eléctrica en voltios [V]
ca: V = Tensió elèctrica en volts [V]

source: R = Resistencia eléctrica en ohmios [Ω]
ca: R = resistència elèctrica en ohms [ω]

source: Variación de la tensión
ca: Variació de tensió

source: En la siguiente simulación vamos a cambiar la **tensión** del circuito para comprobar cómo se comporta. Cambiando la tensión de la pila desde 5 voltios hasta 15 voltios (tres veces más), podemos comprobar cómo la corriente cambia aumentando hasta tres veces más su valor inicial:
ca: A la simulació següent canviarem la tensió ** del circuit per verificar com es comporta. Canviant la tensió de la pila de 5 volts a 15 volts (tres vegades més), podem comprovar com el corrent canvia augmentant fins a tres vegades més el seu valor inicial:

source: Tensión [V]
ca: Tensió [V]

source: Intensidad [A]
ca: Intensitat [a]

source: 5 voltios
ca: 5 volts

source: 0.1 amperios
ca: 0,1 amplificadors

source: 10 voltios
ca: 10 volts

source: 0.2 amperios
ca: 0,2 amperis

source: 15 voltios
ca: 15 volts

source: 0.3 amperios
ca: 0,3 amplificadors

source: **Ejercicio:** añade un circuito más a la simulación copiando y pegando uno de los circuitos existentes y cambiando el valor de la tensión de la pila para que la corriente valga 0.5 amperios.
ca: ** Exercici: ** Afegiu un circuit més a la simulació copiant i colpejant un dels circuits existents i canviant el valor de tensió de manera que el corrent val 0,5 amperis.

source: Variación de la resistencia
ca: Variació de resistència

source: En la siguiente simulación vamos a cambiar la **resistencia** del circuito para comprobar cómo se comporta. Cambiando el valor de la resistencia desde 10 ohmios hasta 50 ohmios, podemos comprobar cómo la corriente cambia desde su valor inicial hasta cinco veces menos:
ca: A la simulació següent canviarem la ** resistència ** del circuit per verificar com es comporta. Canviant el valor de resistència de 10 ohms a 50 ohms, podem comprovar com el corrent canvia del seu valor inicial a cinc vegades menys:

source: Resistencia [Ω]
ca: Resistència [ω]

source: 10 ohmios
ca: 10 ohms

source: 20 ohmios
ca: 20 ohms

source: 0.5 amperios
ca: 0,5 amperis

source: 50 ohmios
ca: 50 ohms

source: **Ejercicio:** añade un circuito más a la simulación copiando y pegando uno de los circuitos existentes y cambiando el valor de la resistencia para que la corriente valga 0.1 amperios.
ca: ** Exercici: ** Afegiu un circuit més a la simulació copiant i colpejant un dels circuits existents i canviant el valor de resistència de manera que el corrent val 0,1 amperis.

source: Ejercicios
ca: Exercicis

source: ¿Qué es la ley de Ohm? ¿A qué tipo de circuitos se aplica?
ca: Què és la llei d'Ohm? Quin tipus de circuits aplica?

source: ¿Cuál es la fórmula de la ley de Ohm y cuáles son sus magnitudes y unidades?
ca: Quina és la fórmula de la llei d'Ohm i quines són les seves magnituds i unitats?

source: ¿Qué le ocurre a un circuito con resistencia si aumentamos la tensión?
ca: Què passa amb un circuit amb resistència si augmentem la tensió?

source: ¿Qué le ocurre a un circuito con resistencia si aumentamos el valor de la resistencia?
ca: Què passa amb un circuit amb resistència si augmentem el valor de la resistència?

source: ¿Cuánto valdrá la intensidad de corriente en los siguientes circuitos?
ca: Quant valdrà la intensitat actual als circuits següents?

source: 20 voltios
ca: 20 volts

source: 1000 ohmios
ca: 1000 ohms

source: 230 voltios
ca: 230 volts

source: 3 voltios
ca: 3 volts

source: 200 ohmios
ca: 200 ohms
