Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/electronic-bjt-pushpull.po
Languages: ca

source: El esquema push-pull
ca: L’esquema Push-Pull

source: El `esquema push-pull <https://es.wikipedia.org/wiki/Salida_en_contrafase>`__, también llamado en contrafase, es un circuito utilizado en las etapas de salida de circuitos electrónicos para entregar tanto tensión y corriente positivas como tensión y corriente negativas.
ca: L’esquema `push-pull <https://es.wikipedia.org/wiki/salida_en_contrafase>` __, també anomenat contrafase, és un circuit utilitzat en les etapes de sortida del circuit electrònic per lliurar tensió positiva i tensió actual i corrent negatiu.

source: El esquema utiliza un transistor NPN para entregar corriente y tensión positiva y utiliza un transistor PNP para absorber corriente y entregar tensión negativa.
ca: L’esquema utilitza un transistor NPN per oferir tensió actual i positiva i utilitza un transistor PNP per absorbir el corrent i proporcionar tensió negativa.

source: Ambos transistores están en colector común o "seguidor de emisor" que, como recordaremos, es una configuración que amplifica la corriente de salida, pero no amplifica la tensión.
ca: Els dos transistors es troben en un col·leccionista comú o \ "seguidor emissor " que, com recordarem, és una configuració que amplifica el corrent de sortida, però no amplifica la tensió.

source: Esquema de dos transistores bipolares en montaje push-pull.
ca: Esquema de dos transistors bipolars en el conjunt de push-pull.

source: Los dos diodos en las bases de los transistores sirven para mantener una tensión de 1.2 voltios entre las bases, que coincide con la tensión de polarización de los dos transistores.
ca: Els dos díodes de les bases dels transistors serveixen per mantenir una tensió de 1,2 volts entre les bases, cosa que coincideix amb la tensió de polarització dels dos transistors.

source: Simulación
ca: Simulació

source: A continuación podemos ver una simulación de un circuito push-pull que consigue alimentar una carga con corrientes positivas y negativas. La parte superior del circuito es simétrica respecto a la parte inferior. Cada uno de los transistores se encarga de conducir una parte de la corriente. El transistor NPN superior conduce la corriente positiva y el transistor PNP inferior conduce la corriente negativa.
ca: A continuació, podem veure una simulació d’un circuit push-pull que aconsegueix alimentar una càrrega amb corrents positius i negatius. La part superior del circuit és simètrica respecte a la part inferior. Cadascun dels transistors és responsable de realitzar una part del corrent. El transistor NPN superior realitza el corrent positiu i el transistor PNP inferior realitza el corrent negatiu.

source: Ejercicios
ca: Exercicis

source: Dibuja un esquema simplificado de dos transistores bipolares trabajando en configuración push-pull.
ca: Dibuixa un esquema simplificat de dos transistors bipolars que treballen en la configuració de Push-Pull.

source: Dibuja un esquema realista de dos transistores bipolares trabajando en configuración push-pull o contrafase.
ca: Dibuixa un esquema realista de dos transistors bipolars que treballen en la configuració o el comptador de push-pull.

source: ¿Qué función realiza una etapa push-pull y dónde se pueden encontrar?
ca: Quina funció fa una etapa de push-pull i on es pot trobar?

source: ¿Qué tipo de amplificación realiza una etapa push-pull?
ca: Quin tipus d'amplificació té una etapa de push-pull?

source: ¿Qué ganancia de tensión tiene la etapa push-pull simulada?
ca: Quin guany de tensió té l’etapa simulada de push-pull?

source: Recuerda parar la simulación del circuito para poder medir con facilidad el valor máximo y el valor mínimo de tensión de entrada y de tensión de salida.
ca: No oblideu aturar la simulació del circuit per mesurar fàcilment el valor màxim i el valor mínim de tensió i tensió de sortida.

source: La fórmula de la ganancia de tensión es:
ca: La fórmula de guany de tensió és:

source: Ganancia\_V = \cfrac{V_{out\_max} - V_{out\_min}}{ V_{in\_max} - V_{in\_min}}
ca: Profit\_V = \cfrac{V_{out\_max} - V_{out\_min}}{ V_{in\_max} - V_{in\_min}}

source: ¿Qué ganancia de corriente tiene la etapa push-pull simulada?
ca: Quin guany actual té l’etapa simulada de push-pull?

source: La fórmula de la ganancia de corriente es:
ca: La fórmula de guany actual és:

source: Ganancia\_I = \cfrac{I_{out\_max} - I_{out\_min}}{ I_{in\_max} - I_{in\_min}}
ca: Profit\_I = \cfrac{I_{out\_max} - I_{out\_min}}{ I_{in\_max} - I_{in\_min}}

source: Busca en Internet la hoja de datos del popular amplificador operacional `LM321 <https://www.ti.com/lit/ds/symlink/lm321.pdf>`__. Dibuja la etapa de salida, basada en un circuito push-pull.
ca: Cerqueu a Internet la fitxa de dades del popular amplificador operatiu `lm321 <https://www.ti.com/lit/ds/symlink/lm321.pdf>`__. Dibuixa l’etapa de sortida, basada en un circuit d’empenta.
