Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/electronic-bjt-common-c.po
Languages: ca

source: El transistor en colector común
ca: El transistor del col·leccionista comú

source: Al transistor en colector común también se le llama habitualmente **seguidor de emisor**.
ca: El transistor del col·leccionista comú també sol anomenar -se ** seguidor emissor **.

source: En esta configuración el transistor tiene el colector conectado a la tensión positiva. La señal de entrada llega por la base del transistor y la señal amplificada sale por el emisor del transistor.
ca: En aquesta configuració, el transistor té el col·lector connectat a la tensió positiva. El senyal d’entrada arriba per la base del transistor i el senyal amplificat surt de l’emissor del transistor.

source: Esquema simplificado de un transistor NPN en colector común o también conocido como "seguidor de emisor".
ca: Esquema simplificat d’un transistor NPN en un col·leccionista comú o també conegut com \ "Emissuer Follower ".

source: Esta configuración permite amplificar la corriente de entrada manteniendo la tensión sin cambios. La tensión de salida, por lo tanto, será prácticamente la misma que la tensión de entrada, menos la tensión del diodo de base a emisor que se mantiene en un valor alrededor de 0.65 voltios.
ca: Aquesta configuració permet amplificar el corrent d’entrada mantenint la tensió sense canvis. La tensió de sortida, per tant, serà pràcticament la mateixa que la tensió d’entrada, excepte la tensió del díode base emissor que es manté a un valor d’uns 0,65 volts.

source: Este funcionamiento es útil en las etapas de salida de los circuitos, donde es necesaria una corriente alta, por ejemplo, para mover un altavoz.
ca: Aquesta operació és útil en les etapes de sortida del circuit, on un corrent alt és necessari, per exemple, per moure un altaveu.

source: A continuación puede verse una simulación de un transistor NPN en configuración de colector común. El transistor amplifica una señal que entra por la base generando una señal con mucha mayor corriente por el emisor.
ca: A continuació, es pot veure una simulació d’un transistor NPN en la configuració del col·leccionista comú. El transistor amplifica un senyal que entra a través de la base generant un senyal amb un corrent molt més gran per l'emissor.

source: La función de cada uno de los componentes es la siguiente:
ca: La funció de cadascun dels components és la següent:

source: La corriente que llega por la base se amplifica para que circule, multiplicada, por el colector y por el emisor.
ca: El corrent que arriba per la base s’amplifica per circular, multiplicar -se, pel col·leccionista i per l’emissor.

source: Ejercicios
ca: Exercicis

source: Dibuja un esquema simplificado de un transistor NPN trabajando en configuración de colector común, mostrando por dónde llega la señal de entrada y por dónde sale la señal amplificada.
ca: Dibuixa un esquema simplificat d’un transistor NPN que funciona en la configuració del col·leccionista comú, mostrant on es fa el senyal d’entrada i on surt el senyal amplificat.

source: Dibuja un esquema realista de un transistor NPN trabajando en configuración de colector común.
ca: Dibuixa un esquema realista d’un transistor NPN que treballa en la configuració del col·leccionista comú.

source: ¿Cuál es la función principal de un transistor funcionando en configuración de colector común?
ca: Quina és la funció principal d’un transistor que funciona en la configuració del col·leccionista comuna?

source: Dibuja una gráfica con la tensión del generador y la tensión de salida. ¿Qué diferencia puedes observar entre las gráficas?
ca: Dibuixeu un gràfic amb la tensió i la tensió de sortida del generador. Quina diferència podeu veure entre els gràfics?
