Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/electronic-bjt-diferencial.po
Languages: ca

source: El par diferencial
ca: La part diferencial

source: El `par diferencial <https://es.wikipedia.org/wiki/Amplificador_diferencial#Tecnolog%C3%ADa>`__ está compuesto por dos transistores con ambos emisores conectados a una fuente de corriente.
ca: El "diferencial par <https://es.wikipedia.org/wiki/amplifier_díferential#tecnolog%C3%ada>`__ està compost per dos transistors amb els dos emissors connectats a una font actual.

source: Cuando la tensión en las bases es la misma, la corriente por los colectores se mantiene igual en ambos transistores y, por lo tanto, no amplifica la señal.
ca: Quan la tensió a les bases és la mateixa, el corrent dels col·leccionistes continua sent el mateix en els dos transistors i, per tant, no amplifica el senyal.

source: Cuando la tensión en la base de un transistor es mayor que en la base del otro transistor la corriente se desvía hacia el transistor con mayor tensión en la base y esta señal 'diferencial' se amplifica en la salida.
ca: Quan la tensió a la base d’un transistor és més gran que a la base de l’altre transistor, el corrent es desvia al transistor amb major tensió a la base i aquest senyal “diferencial” s’amplifica a la sortida.

source: Por lo tanto este amplificador solo amplifica las diferencias entre dos tensiones de entrada y no amplifica (rechaza) los cambios que son comunes a las dos tensiones de entrada.
ca: Per tant, aquest amplificador només amplifica les diferències entre dues tensions d’entrada i no amplifica (rebutja) els canvis que són comuns a les dues tensions d’entrada.

source: Este amplificador (el par diferencial) se utiliza en la entrada de los muy populares amplificadores operacionales, que se verán más adelante.
ca: Aquest amplificador (el PAR diferencial) s’utilitza a l’entrada dels amplificadors operatius molt populars, que es veuran més endavant.

source: Esquema de dos transistores NPN en montaje diferencial.
ca: Esquema de dos transistors NPN en un muntatge diferencial.

source: El símbolo conectado debajo de los emisores de los transistores es un generador de corriente constante.
ca: El símbol connectat sota emissors transistos és un generador de corrent constant.

source: Simulación
ca: Simulació

source: A continuación puede verse la simulación de un par diferencial con dos transistores NPN. La señal de entrada diferencial tiene 25 milivoltios de amplitud de pico y la señal de salida tiene 1 voltio de amplitud de pico. Esto significa que la etapa tiene una ganancia de tensión a la salida de 40 veces la tensión de entrada.
ca: A continuació, es pot veure la simulació d’un PAR diferencial amb dos transistors NPN. El senyal d’entrada diferencial té 25 mil·livolts d’amplitud màxima i el senyal de sortida té 1 volt d’amplitud màxima. Això significa que l’etapa té un guany de tensió a la sortida de 40 vegades la tensió d’entrada.

source: Ejercicios
ca: Exercicis

source: Dibuja un esquema simplificado de dos transistores NPN trabajando en configuración de par diferencial.
ca: Dibuixa un esquema simplificat de dos transistors NPN que treballen en configuració parlamentària diferencial.

source: Dibuja un esquema realista de dos transistores NPN trabajando en configuración de par diferencial.
ca: Dibuixa un esquema realista de dos transistors NPN que treballen en la configuració parlamentària diferencial.

source: ¿Cuál es el objetivo principal que tiene un par diferencial? ¿En qué dispositivos populares se utiliza el par diferencial?
ca: Quin és l’objectiu principal que té un parroquial diferencial? Quins dispositius populars són els dispositius diferencials?

source: Modifica en la simulación los dos generadores de tensión de 1 voltio para que entreguen 2 voltios. ¿Cómo cambia la salida?
ca: Modifiqueu a la simulació els dos generadors de tensió d’1 volts per lliurar 2 volts. Com canvia la sortida?

source: Si aumentamos la tensión de los dos generadores a 3 voltios ¿Cómo cambia la salida?
ca: Si augmentem la tensió dels dos generadors a 3 volts, com canvia la sortida?

source: ¿Qué significa este funcionamiento?
ca: Què significa aquesta operació?

source: Realiza en el `simulador de circuitos </circuits/?startCircuit=empty.txt>`__ una simulación de un par diferencial con transistores PNP. El esquema será como el de la siguiente figura:
ca: Realitza al `Simulador de circuits </circuits/?startCircit=Empy.txt>`__ una simulació d'un parlament diferencial amb transistors PNP. L’esquema serà com la següent figura:

source: ¿Qué diferencias de funcionamiento tiene el circuito anterior respecto al primer circuito simulado?
ca: Quines diferències operatives té el circuit anterior respecte al primer circuit simulat?

source: ¿Qué rango de tensión común acepta el anterior circuito en su entrada?
ca: Quina gamma de tensió comuna accepta el circuit anterior a la seva entrada?
