Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/electric-ley-ohm-regla.po
Languages: ca

source: Regla de cálculo para la ley de Ohm
ca: Regla de càlcul per a la llei d'Ohm

source: En esta práctica construiremos una regla de cálculo para calcular las tres magnitudes de la ley de Ohm.
ca: En aquesta pràctica construirem una regla de càlcul per calcular les tres magnituds de la llei d’Ohm.

source: Las reglas de cálculo se utilizaron con frecuencia para realizar cálculos en Tecnología en el siglo pasado. Les debemos a las reglas de cálculo muchos diseños de aviones, puentes y hasta cohetes espaciales.
ca: Les regles de càlcul es van utilitzar freqüentment per realitzar càlculs en tecnologia durant el segle passat. Devem les regles de càlcul molts dissenys d’avions, ponts i fins i tot coets espacials.

source: En la década de 1970, con la aparición de las primeras calculadoras electrónicas modernas, las reglas de cálculo se fueron dejando de utilizar poco a poco, hasta que algunos años más tarde solo se podían encontrar en los museos. A pesar de haber desaparecido su uso, las reglas de cálculo tenían varias ventajas que podemos comprobar al utilizar la de esta práctica.
ca: A la dècada de 1970, amb l’aparició de les primeres calculadores electròniques modernes, les regles de càlcul es van deixar d’utilitzar poc a poc, fins que alguns anys després només es podien trobar als museus. Tot i haver desaparegut el seu ús, les regles de càlcul tenien diversos avantatges que podem comprovar quan utilitzem la d’aquesta pràctica.

source: Las reglas de cálculo utilizan los logaritmos para conseguir que las operaciones de multiplicación y división se puedan realizar con el simple desplazamiento de un cursor. Los logaritmos se descubrieron en el siglo XVII y desde entonces han sido una gran ayuda para la realización de cálculos hasta la aparición de la informática moderna a mediados del siglo XX.
ca: Les regles de càlcul utilitzen logaritmes per assegurar -se que les operacions de multiplicació i divisió es poden dur a terme amb el simple desplaçament d’un cursor. Els logaritmes es van descobrir al segle XVII i des de llavors han estat una gran ajuda per dur a terme càlculs a l’aparició de la informàtica moderna a mitjan segle XIX.

source: Montaje y uso
ca: Muntatge i ús

source: :download:`Regla de cálculo para calcular la ley de Ohm. Formato PDF <electric/electric-ley-ohm-regla.pdf>`
ca: : Descarregueu: `Regla de càlcul per calcular la llei d'Ohm. PDF <Electric-we-ohm-regla.pdf> `format

source: Para realizar esta práctica se debe imprimir la hoja PDF adjunta, recortar los bordes y doblar las solapas con mucha precisión. Una vez dobladas las solapas colocaremos el cursor dentro hasta que nos quede una regla como la que se puede ver en la imagen anterior.
ca: Per dur a terme aquesta pràctica, s’ha d’imprimir el full PDF adjunt, tallar les vores i plegar les solapes amb molta precisió. Un cop inclinades les solapes, col·locarem el cursor a l’interior fins que tinguem una regla com la que es pot veure a la imatge anterior.

source: Con la regla ya construida se debe mover el cursor central para que coincidan los datos del problema.
ca: Amb la regla ja construïda, el cursor central s’ha de moure de manera que coincideixin les dades del problema.

source: **Si conocemos la tensión**, habrá que mover la marca hasta el valor de tensión adecuado y a continuación buscar el valor de resistencia o el valor de corriente conocidos, que coincidirá con el valor final buscado.
ca: ** Si coneixem la tensió **, la marca haurà de traslladar -se al valor de tensió adequat i, a continuació, buscar el valor de resistència o el valor actual, que coincidirà amb el valor final buscat.

source: **Si no conocemos la tensión**, habrá que hacer coincidir en las reglas el valor de corriente y resistencia conocidos y la marca señalará el valor de tensión que soluciona el problema.
ca: ** Si no coneixem la tensió **, caldrà fer el valor de corrent i la resistència coneguts per coincidir en les regles i la marca indicarà el valor de tensió que resol el problema.
