Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/electronic-operational-differential.po
Languages: ca

source: El amplificador diferencial
ca: L'amplificador diferencial

source: Este circuito amplificador cuenta con dos entradas simétricas. La diferencia de tensión entre estas dos entradas se amplifica para producir una salida con la diferencia amplificada. De ahí el nombre de amplificador diferencial.
ca: Aquest circuit amplificador té dues entrades simètriques. La diferència de tensió entre aquestes dues entrades s’amplifica per produir una sortida amb la diferència amplificada. D’aquí el nom de l’amplificador diferencial.

source: La realimentación del circuito es negativa y proviene de la resistencia R2.
ca: La retroalimentació del circuit és negativa i prové de la resistència R2.

source: Esquema del amplificador diferencial.
ca: Esquema d’amplificadors diferencials.

source: Cálculo de ganancia
ca: Guanyar càlcul

source: La fórmula de la ganancia de este amplificador es la siguiente:
ca: La fórmula de guany d’aquest amplificador és la següent:

source: Teniendo en cuenta que la resistencia R1' = R1 y que la resistencia R2' = R2.
ca: Tenint en compte que la resistència r1 '= r1 i que la resistència r2' = r2.

source: En la práctica es importante que las resistencias R1 y R1' así como R2 y R2' tengan un valor lo más parecido posible entre sí, para evitar que se amplifiquen las tensiones comunes de las entradas y que solo se amplifique la diferencia entre las tensiones de entrada.
ca: A la pràctica és important que les resistències R1 i R1 'i R2 i R2' tinguin un valor el més a prop possible, per evitar que les tensions comunes de les entrades s’amplifiquin i que només s’amplifiqui la diferència entre les tensions d’entrada.

source: Resistencia de entrada y de salida
ca: Resistència a l’entrada i a la sortida

source: La resistencia de entrada a la tensión común de entrada vale:
ca: Val la pena la resistència a l’entrada d’entrada:

source: Y la resistencia de entrada a las diferencias de tensión de entrada vale:
ca: I val la resistència a les diferències de tensió d’entrada:

source: La resistencia de salida será muy baja, idealmente cero, porque la salida está directamente conectada a la salida del amplificador operacional.
ca: La resistència a la sortida serà molt baixa, idealment zero, perquè la sortida està directament connectada a la sortida de l'amplificador operatiu.

source: Simulación
ca: Simulació

source: En la siguiente simulación podemos ver un amplificador diferencial al que le llegan dos tensiones de entrada. Una tensión senoidal, V1, de entrada, es común a ambas entradas y no se amplifica su tensión. La otra tensión triangular, V2, representa la diferencia entre las dos tensiones de entrada y sí que se amplifica en la salida.
ca: A la següent simulació podem veure un amplificador diferencial que arriben dues tensions d’entrada. Un sinus, V1, la tensió d’entrada és comuna a les dues entrades i la seva tensió no s’amplifica. L’altra tensió triangular, V2, representa la diferència entre les dues tensions d’entrada i s’amplifica a la sortida.

source: Ejercicios
ca: Exercicis

source: Dibuja el esquema de un amplificador diferencial ideal. Añade debajo del dibujo la fórmula de la ganancia diferencial.
ca: Dibuixa l’esquema d’un amplificador diferencial ideal. Afegiu la fórmula de guany diferencial sota el dibuix.

source: ¿Qué tipo de realimentación tiene el amplificador diferencial? ¿Qué resistencia lo determina?
ca: Quin tipus de retroalimentació té l'amplificador diferencial? Quina resistència la determina?

source: ¿Qué función realiza un amplificador diferencial? ¿Qué es lo que no amplifica un amplificador diferencial?
ca: Quina funció té un amplificador diferencial? Què no amplifica un amplificador diferencial?

source: Con la fórmula de la ganancia calcula la ganancia que debe tener el amplificador diferencial simulado.
ca: Amb la fórmula de guany, calculeu el guany que ha de tenir l’amplificador diferencial simulat.

source: Modifica la simulación del amplificador diferencial de manera que la resistencia R1 tenga un valor ligeramente inferior, 9k. ¿Qué le ocurre a la tensión de salida del circuito?
ca: Modifica la simulació de l'amplificador diferencial de manera que la resistència R1 té un valor lleugerament inferior, 9k. Què passa amb la tensió de sortida del circuit?

source: Con ayuda del `simulador de circuitos <../circuits/?startCircuit=empty.txt>`__ dibuja un amplificador diferencial basado en un amplificador operacional ideal. La resistencia de entrada diferencial debe valer 100k ohmios. La ganancia diferencial debe valer 10.
ca: Amb l’ajuda del simulador de circuits <../ circuit/? StartCircuit = buits.txt>`__ dibuixar un amplificador diferencial basat en un amplificador operatiu ideal. La resistència a l’entrada diferencial ha de valer 100k ohms. El guany diferencial ha de valer 10.

source: Añade un generador de tensión senoidal de 0.1 voltio de pico entre las entradas. Comprueba que la salida de tensión vale 1 voltio de pico.
ca: Afegiu un generador de tensió sinoidal de 0,1 volt màxim entre les entrades. Comproveu que la sortida de tensió val 1 volt màxim.
