Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/electric-simulador-tension.po
Languages: ca

source: :index:`Tensión eléctrica`
ca: : Índex: `Tensió elèctrica '

source: La tensión eléctrica de un generador, también llamado voltaje eléctrico, es la energía con la que el generador impulsa a los electrones en un circuito eléctrico.
ca: La tensió elèctrica d’un generador, també anomenada tensió elèctrica, és l’energia amb la qual el generador condueix electrons en un circuit elèctric.

source: Todos los circuitos eléctricos necesitan al menos un generador que impulse a los electrones a través del circuito. El generador actúa como una bomba de agua con los electrones, obligándolos a moverse a través del circuito eléctrico.
ca: Tots els circuits elèctrics necessiten almenys un generador que condueix els electrons a través del circuit. The generator acts as a water pump with electrons, forcing them to move through the electrical circuit.

source: :index:`Voltios`
ca: : Índex: `volts '

source: La tensión eléctrica se mide en **voltios**, abreviado con la letra [V]. En la siguiente tabla aparecen las tensiones típicas de varios generadores comunes en nuestro entorno:
ca: La tensió elèctrica es mesura en ** volts **, abreujat amb la lletra [V]. A la taula següent apareixen al nostre entorn les tensions típiques de diversos generadors comuns:

source: Tensión [V]
ca: Tensió [V]

source: Pila alcalina tipo AA.
ca: Bateria alcalina de tipus AA.

source: 1,5 Voltios
ca: 1,5 volts

source: Pila botón de litio.
ca: Pila de botons de liti.

source: 3 Voltios
ca: 3 volts

source: Batería de un teléfono inteligente.
ca: Bateria d’un telèfon intel·ligent.

source: 3,6 Voltios
ca: 3,6 volts

source: Conector USB
ca: Connector USB

source: 5 Voltios
ca: 5 volts

source: Cargador de ordenador portátil.
ca: Carregador portàtil.

source: 20 Voltios
ca: 20 volts

source: Enchufe de pared.
ca: Pip de paret.

source: 230 Voltios
ca: 230 volts

source: Línea de transporte de media tensión.
ca: Línia de transport de tensió mitjana.

source: 22 000 Voltios
ca: 22.000 volts

source: :index:`Tensión de tierra`
ca: : Índex: `Tensió terrestre '

source: La tensión de la tierra (del terreno sobre el que andamos) se considera que vale cero voltios y es la referencia absoluta de cualquier circuito eléctrico. Se consigue normalmente clavando en el terreno una barra de cobre de un metro de longitud, al que se conecta un cable con colores amarillo y verde.
ca: Es considera que la tensió de la terra (el terreny on som) val la pena zero volts i és la referència absoluta de qualsevol circuit elèctric. Una barra de coure d’un metre de longitud normalment es numera a terra, a la qual es connecta un cable amb colors grocs i verds.

source: Toma de tierra con su cable amarillo-verde conectado.
ca: Posar a terra amb el vostre cable de color groc verd.

source: `Ali K <https://en.wikipedia.org/wiki/File:HomeEarthRodAustralia1.jpg>`__, `CC BY-SA 3.0 Unported <https://creativecommons.org/licenses/by-sa/3.0/deed.en>`__, via Wikimedia Commons.
ca: `Ali K <https://en.wikipedia.org/wiki/file:homeaAnthrodustralia1.jpg>`__, `cc by-sa 3.0 no portat <https://creativecommons.org/licenses/by-sa/3.0/ded.en>` `__, via commons Wikimedia.

source: A partir de la tensión de tierra las tensiones pueden ser tanto positivas como negativas. En los circuitos se suele dibujar el símbolo de tierra para indicar qué consideramos tensión cero.
ca: Des de la tensió terrestre, les tensions poden ser positives i negatives. En els circuits, el símbol de la Terra se sol dibuixar per indicar el que considerem tensió zero.

source: En el siguiente simulador podemos observar varios generadores en serie que suman sus tensiones. El color verde indica tensiones positivas y el color rojo indica tensiones negativas. El símbolo de tierra indica la tensión cero absoluta.
ca: Al simulador següent podem observar diversos generadors de sèries que afegeixen les seves tensions. El color verd indica tensions positives i el color vermell indica tensions negatives. El símbol de la Terra indica una tensió zero absoluta.

source: :index:`Voltímetro`
ca: : Índex: `Voltímetre '

source: El **voltímetro** es un aparato que mide la diferencia de tensión entre dos puntos de un circuito. Los voltímetros se conectan siempre en paralelo con los elementos que deseamos medir.
ca: El ** Voltímetre ** és un dispositiu que mesura la diferència de tensió entre dos punts d’un circuit. El voltímetre sempre es connecta en paral·lel amb els elements que volem mesurar.

source: Para simular un voltímetro debemos escogerlo desde el menú ``Dibujar``... ``Medidores y Etiquetas``... ``Añadir Voltímetro``.
ca: Per simular un voltímetre, hem de triar -lo entre `` dibuixar `` ...

source: En la siguiente simulación, añade los voltímetros necesarios para medir la tensión de las dos baterías juntas (V1 más V2), la tensión de la lámpara L1 y la tensión de la lámpara L2.
ca: A la següent simulació, afegiu els voltímetres necessaris per mesurar la tensió de les dues bateries juntes (V1 més V2), la tensió de la làmpada L1 i la tensió de la làmpada L2.

source: Ejercicios
ca: Exercicis

source: ¿Qué es la tensión o voltaje eléctrico?
ca: Què és la tensió elèctrica o la tensió?

source: ¿Por qué todos los circuitos eléctricos necesitan al menos un generador eléctrico?
ca: Per què tots els circuits elèctrics necessiten almenys un generador elèctric?

source: ¿Qué tensión en voltios tienen las pilas y baterías típicas?
ca: Quina tensió de volts té bateries i bateries típiques?

source: ¿Qué es la tensión de tierra?
ca: Què és la tensió de la Terra?

source: ¿Qué es un voltímetro? ¿Cómo se debe conectar para medir tensión?
ca: Què és un voltímetre? Com s’ha de connectar per mesurar la tensió?
