Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/electronic-morgan-laws.po
Languages: ca

source: Las leyes de De Morgan
ca: Les lleis de De Morgan

source: Las leyes de Augustus De Morgan o simplemente las `leyes de De Morgan <https://es.wikipedia.org/wiki/Leyes_de_De_Morgan>`__ son dos reglas de transformación que permiten intercambiar puertas AND y puertas OR simplemente negando o invirtiendo las entradas y salidas:
ca: Les lleis d’Augustus de Morgan o simplement les `De Morgan Laws <https://es.wikipedia.org/wiki/leyes_de_de_morgan>`__ són dues regles de transformació que permeten intercanviar i portes i portes per simplement negar o invertir les entrades i exits:

source: Transformación de OR con entradas negadas en NAND.
ca: Transformació de o amb entrades negades a NAND.

source: Transformación de AND con entradas negadas en NOR.
ca: I la transformació amb entrades negades en Nor.

source: En forma de fórmula lógica las expresiones serían:
ca: En forma de fórmula lògica, les expressions serien:

source: Otra forma de expresar las leyes de De Morgan es:
ca: Una altra manera d’expressar les lleis de De Morgan és:

source: Una puerta OR con todas sus entradas y salidas invertidas o negadas es equivalente a una puerta AND.
ca: Una porta amb totes les seves entrades i sortides invertides o denegades equival a una porta i una porta.

source: Transformación de una puerta OR toda negada a puerta AND.
ca: Transformació d’una porta o de totes les negades a Puerta i.

source: Una puerta AND con todas sus entradas y salidas invertidas o negadas es equivalente a una puerta OR.
ca: A i amb totes les seves entrades i sortides invertides o denegades equival a un OR.

source: Transformación de una puerta AND toda negada a puerta OR.
ca: Transformació d’una porta i tots negats a la porta o.

source: Doble negación
ca: Doble denegació

source: Hay que recordar del apartado dedicado a la puerta NOT, que una doble negación se cancela resultando en una línea sin negación:
ca: Cal recordar de la secció dedicada a la porta no, que es cancel·li una doble denegació donant lloc a una línia sense denegar:

source: Una doble negación se cancela entre sí.
ca: Una doble denegació es cancel·la entre si.

source: Conociendo las leyes de De Morgan y esta última ley, podremos intercambiar siempre cualquier puerta OR por una puerta AND y viceversa, independientemente de las entradas y salidas que tenga negadas.
ca: Coneixent les lleis de De Morgan i aquesta última llei, sempre podem intercanviar qualsevol o o viceversa porta, independentment de les entrades i sortides que han denegat.

source: Simulación
ca: Simulació

source: En la siguiente simulación podemos ver el funcionamiento de las leyes de De Morgan en varios circuitos.
ca: En la següent simulació podem veure el funcionament de les lleis de De Morgan en diversos circuits.

source: Según cambian los valores de entrada a las siguientes puertas lógicas, la puerta de arriba siempre entrega en la salida el mismo valor que la puerta de abajo, demostrando que son equivalentes.
ca: Segons els valors d’entrada a les portes lògiques següents, la porta de dalt sempre proporciona el mateix valor que la porta següent, demostrant que són equivalents.

source: Ejercicios
ca: Exercicis

source: Explica con tus palabras qué dicen las dos leyes de De Morgan.
ca: Expliqueu amb les vostres paraules què diuen les dues lleis de Morgan.

source: ¿Qué función lógica sería equivalente a cinco puertas NOT en serie?
ca: Quina funció lògica equivalia a cinc portes en sèrie?

source: Comprueba en la simulación anterior que la puerta superior tiene la misma salida que la puerta inferior en cada uno de los 4 circuitos que aparecen.
ca: Comproveu la simulació anterior que la porta superior té la mateixa sortida que la porta inferior de cadascun dels 4 circuits que apareixen.

source: Transforma las siguientes puertas lógicas para que utilicen la puerta alternativa según las leyes de De Morgan.
ca: Transforma les portes lògiques següents per utilitzar la porta alternativa segons les lleis de De Morgan.
