Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/estructuras-esfuerzos.po
Languages: ca

source: Esfuerzos
ca: Esforços

source: Las estructuras están destinadas a soportar cargas externas sin deformarse ni romperse. Como resultado de estas cargas externas las estructuras soportan fuerzas internas llamadas esfuerzos.
ca: Les estructures estan destinades a suportar les càrregues externes sense deformar -se ni trencar -se. Com a resultat d’aquestes càrregues externes, les estructures donen suport a les forces internes anomenades esforços.

source: Cargas y esfuerzos
ca: Càrregues i esforços

source: Carga
ca: Càrrega

source: Es una fuerza externa que actúa sobre una estructura. Puede ser un peso, un empuje, una dilatación térmica, etc.
ca: És una força externa que actua sobre una estructura. Pot ser un pes, una empenta, dilatació tèrmica, etc.

source: Esfuerzo
ca: Esforç

source: Tensión o fuerza interna que soporta una estructura como resultado de las cargas externas.
ca: Tensió interna o força que suporta una estructura com a resultat de càrregues externes.

source: Por ejemplo, una persona sentada en una silla es una carga para la silla. Debido a esta carga las patas de la silla soportan un esfuerzo de compresión.
ca: Per exemple, una persona asseguda en una cadira és una càrrega per a la cadira. A causa d'aquesta càrrega, les cames de la cadira admeten un esforç de compressió.

source: Hay 5 esfuerzos distintos. A continuación se explica cada uno.
ca: Hi ha cinc esforços diferents. A continuació s’explica cadascun.

source: :index:`Tracción`
ca: :index:`Tracció`

source: El esfuerzo de tracción tiende a estirar la estructura:
ca: L’esforç de tracció tendeix a estirar l’estructura:

source: Ejemplos de elementos que soportan este esfuerzo son:
ca: Exemples d’elements que donen suport a aquest esforç són:

source: :index:`Compresión`
ca: :index:`Compressió`

source: El esfuerzo de compresión tiende a comprimir la estructura:
ca: L’esforç de compressió tendeix a comprimir l’estructura:

source: :index:`Flexión`
ca: :index:`Flexió`

source: El esfuerzo de flexión tiende a doblar la estructura:
ca: L’esforç de flexió tendeix a doblegar l’estructura:

source: :index:`Torsión`
ca: :index:`Torsion`

source: El esfuerzo de torsión tiende a retorcer la estructura:
ca: L’esforç de torsió tendeix a torçar l’estructura:

source: :index:`Corte o cizalla`
ca: :index:`Tallar o cisalla`

source: El esfuerzo de corte o esfuerzo de cizalla tiende a cortar en dos la estructura:
ca: L’esforç de tall o d’esforç d’escolta tendeix a tallar l’estructura en dos:

source: Ejercicios
ca: Exercicis

source: Busca dos ejemplos de esfuerzos de tracción que no estén en esta página.
ca: Busqueu dos exemples d’estrès de tracció que no es troben en aquesta pàgina.

source: Busca dos ejemplos de esfuerzos de compresión que no estén en esta página.
ca: Cerqueu dos exemples d’esforços de compressió que no hi ha en aquesta pàgina.

source: Busca dos ejemplos de esfuerzos de flexión que no estén en esta página.
ca: Busqueu dos exemples d’esforços de flexió que no hi ha en aquesta pàgina.

source: Busca dos ejemplos de esfuerzos de torsión que no estén en esta página.
ca: Busqueu dos exemples d’esforços de torsió que no hi ha en aquesta pàgina.

source: Busca dos ejemplos de esfuerzos de cizalla o cortadura que no estén en esta página.
ca: Busqueu dos exemples d’esforços de cisalla o reducció que no es troben en aquesta pàgina.

source: Dibuja y nombra los esfuerzos que aparecen en un columpio cuando se sube un niño sobre el asiento.
ca: Dibuixa i nomena els esforços que apareixen en un swing quan un nen es posa al seient.

source: Analiza los esfuerzos que aparecen en una mesa cuando se coloca un peso encima de ella.
ca: Analitzeu els esforços que apareixen sobre una taula quan es col·loca un pes al damunt.

source: Analiza los esfuerzos que aparecen en una grúa cuando levanta una carga.
ca: Analitzeu els esforços que apareixen en una grua quan aixeca una càrrega.

source: `Origen de la imagen <https://commons.wikimedia.org/wiki/File:Jib_crane.jpg>`__
ca: `Origen de la imatge <https://commons.wikimedia.org/wiki/file:jib_crane.jpg>` `` `
