Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/estructuras-estabilidad.po
Languages: ca

source: Estabilidad
ca: Estabilitat

source: Existen varios problemas que pueden presentar las estructuras debido a su falta de estabilidad. A continuación se detallan las más comunes.
ca: Hi ha diversos problemes que poden presentar les estructures per la seva manca d’estabilitat. A continuació, es detallen els més comuns.

source: :index:`Vuelco`
ca: :index:`Robo`

source: El vuelco de una estructura se produce cuando el centro de gravedad no se encuentra sobre la base de apoyo de la estructura.
ca: El canvi d'una estructura es produeix quan el centre de gravetat no es basa en el suport de l'estructura.

source: :index:`Centro de gravedad`:
ca: :index:`Centre de gravetat ':

source: Es el punto medio de toda la masa de la estructura. Es el punto donde intuitivamente tenemos que apoyar la estructura para que esta no vuelque a un lado o a otro.
ca: És el punt mig de tota la massa de l'estructura. És el punt en què hem donat suport intuïtivament l’estructura de manera que no es gira cap a un costat o altre.

source: En el caso de un martillo, su centro de gravedad se encuentra en el mango, muy cerca de la cabeza, que es la parte que más pesa.
ca: En el cas d’un martell, el seu centre de gravetat es troba al mànec, molt a prop del cap, que és la part més pesada.

source: En el caso del camión de la figura, el centro de gravedad está en el punto rojo, relativamente alto.
ca: En el cas del camió de la figura, el centre de gravetat es troba al punt vermell, relativament alt.

source: En la primera imagen el centro de gravedad cae dentro de la zona de apoyo por lo que el camión es estable y no vuelca.
ca: A la primera imatge, el centre de gravetat es troba dins de la zona de suport, de manera que el camió és estable i no gira.

source: En la segunda imagen el camión está inclinado y el centro de gravedad está a punto de salir de la zona de apoyo. El camión está a punto de volcar.
ca: A la segona imatge, el camió s’inclina i el centre de gravetat està a punt de deixar la zona de suport. El camió està a punt de bolcar.

source: En la tercera imagen el camión se ha inclinado más y el centro de gravedad no está sobre la zona de apoyo. En este caso el camión no es estable y volcará.
ca: A la tercera imatge, el camió ha inclinat més i el centre de gravetat no es troba a la zona de suport. En aquest cas, el camió no és estable i girarà.

source: Para que se produzca el **vuelco** de una estructura, el centro de gravedad debe caer fuera de la zona de apoyo de la estructura con el suelo.
ca: Perquè es produeixi ** ** d'una estructura, el centre de gravetat ha de caure fora de la zona de suport de l'estructura amb el sòl.

source: Soluciones al vuelco
ca: Solucions de desviació

source: Existen varias soluciones para evitar que una estructura vuelque.
ca: Hi ha diverses solucions per evitar que es converteixi una estructura.

source: Añadir un contrapeso
ca: Afegiu un contrapès

source: Cuando una estructura está demasiado escorada hacia un lado o un peso lateral puede hacerla volcar, un contrapeso en el lado contrario puede solucionar el problema.
ca: Quan una estructura està massa escalada a un costat o a un pes lateral, pot fer -la bolcar, un contrapès al costat oposat pot solucionar el problema.

source: Ejemplo: Contrapeso en las grúas de obra o en los camiones-grúa.
ca: Exemple: contrapès a les grues de treball o als camions.

source: Grúa de obra con contrapeso a la izquierda.
ca: Treball amb el contrapès esquerre.

source: Imagen de `Photomix <https://pixabay.com/es/users/photomix-company-1546875/>`__ en `Pixabay <https://pixabay.com/es/photos/edificio-grua-sitio-de-construcci%c3%b3n-1804030/>`__.
ca: Imatge de `Photomix <https://pixabay.com/es/users/photomix-company-1546875/>`__ a `pixabay <https://pixabay.com/photos/edificio-grua-sitio-de-construcci%C3%

source: Ampliar la base de apoyo
ca: Amplieu la base de suport

source: Cuanto mayor sea la base de apoyo, más difícil es que el centro de gravedad caiga fuera de la base.
ca: Com més gran sigui la base de suport, més difícil és que el centre de gravetat caigui fora de la base.

source: Ejemplos: Camión grúa con apoyos extensibles. Coche deportivo muy ancho. Las personas separan instintivamente los pies entre sí para tener mayor base de apoyo cuando el suelo se mueve.
ca: Exemples: camió de grua amb suports extensibles. Cotxe esportiu molt ampli. Les persones instintivament separen els peus els uns dels altres per tenir una base de suport més gran quan es mou el sòl.

source: Camión de bomberos con grúa y apoyos extensibles.
ca: Camió de bombers amb grua i suports extensibles.

source: Imagen de `Hermann Kollinger <https://pixabay.com/es/users/kollinger-15617407/>`__ en `Pixabay <https://pixabay.com/es/photos/bomberos-pesado-r%c3%bcstfahrzeug-srf-5211377/>`__.
ca: Imatge de `Hermann Kolinger <https://pixabay.com/es/users/kolinger-15617407/>`__ a `pixabay <https://pixabay.com/es/photos/bomberos-psado-r%C3%BCSTFahrzeug-srf-521137/>` `` `` `` `` `` ```

source: Bajar el centro de gravedad
ca: Baixeu el centre de gravetat

source: Si el centro de gravedad está más bajo, es más difícil que caiga fuera de la base de apoyo.
ca: Si el centre de gravetat és menor, és més difícil caure de la base de suport.

source: Ejemplos: Para conseguir bajar el centro de gravedad de un camión, hay que colocar los bultos más pesados en la parte baja y los ligeros en la parte alta. Los automóviles deportivos suelen ser bajos para tener el centro de gravedad bajo y conseguir así mayor estabilidad.
ca: Exemples: Per obtenir el centre de gravetat d’un camió, heu de col·locar els paquets més pesats a la part inferior i els llums de la part superior. Els cotxes esportius solen tenir un centre de gravetat baix i aconseguir una major estabilitat.

source: Fórmula 1 con centro de gravedad muy bajo.
ca: Fórmula 1 amb un centre de gravetat molt baix.

source: Imagen de `Nathan Wright <https://pixabay.com/es/users/cozmicphotos-2999334/>`__ en `Pixabay <https://pixabay.com/es/photos/f1-coche-carreras-raza-velocidad-2722971/>`__.
ca: Imatge de `Nathan Wright <https://pixabay.com/es/users/cozmicphotos-2999334/>`__ a `pixabay <https://pixabay.com/es/photos/f1-coche-carreras-raza-velity-2722971/>` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` ''

source: Anclar la estructura al suelo
ca: Ancoreu l'estructura a terra

source: Con esta solución se refuerza la estructura ampliándola al suelo.
ca: Amb aquesta solució, l'estructura es reforça ampliant -la a terra.

source: Ejemplos: Vientos de una tienda de campaña. Cables de anclaje de una antena. Farola o mástil de bandera anclados al suelo.
ca: Exemples: vents d’una tenda de campanya. Cables d’ancoratge d’antena. Bola o pal de bandera ancorada a terra.

source: Antenas de radio con vientos para anclarlas al suelo.
ca: Antenes de ràdio amb vents per ancorar -les a terra.

source: Imagen de `LoggaWiggler <https://pixabay.com/es/users/loggawiggler-15/>`__ en `Pixabay <https://pixabay.com/es/photos/antenas-parab%c3%b3licas-inal%c3%a1mbrico-43232/>`__.
ca: Imatge de `logGawiggler <https://pixabay.com/es/users/loggawiggler-15/>`__ a `pixabay <https://pixabay.com/es/photos/antenas-parab%C3%B3licaS-inal%C3%A1Mbrico-43232/>` `` `` `` `` `` `` `` ``

source: El `pandeo <https://es.wikipedia.org/wiki/Pandeo>`__ es una inestabilidad que se produce en barras y columnas **esbeltas** sometidas a compresión.
ca: El `buckling <https://es.wikipedia.org/wiki/pandeo>`__ És una inestabilitat que es produeix en barres i columnes ** esvelt ** sotmès a compressió.

source: Cuando la forma de la barra o columna es muy estrecha y muy larga (esbelta), corre el riesgo de doblarse y perder así su resistencia. El resultado final es que la estructura se flexiona hasta partirse y fallar.
ca: Quan la forma de la barra o la columna és molt estreta i molt llarga (esvelta), corre el risc de doblegar i perdre la seva resistència. El resultat final és que l'estructura es flexiona fins que es divideix i falla.

source: Soluciones al pandeo
ca: Solucions Pandeo

source: Hacer el perfil más grueso
ca: Feu el perfil més gruixut

source: Si aumentamos el perfil de la barra o de la columna haciendo que sean más gruesos, dejarán de ser esbeltos y el pandeo no se producirá.
ca: Si augmentem el perfil de la barra o la columna que fa que siguin més gruixuts, deixaran de ser esvelts i no es produirà la fulla.

source: Por ejemplo, se puede utilizar un tubo grueso con paredes finas en vez de una barra maciza. Los dos tienen el mismo peso y la misma cantidad de material, pero el tubo hueco no pandea mientras que la barra maciza, que es más esbelta, si pandea.
ca: Per exemple, es pot utilitzar un tub gruixut amb parets fines en lloc d’una barra sòlida. Els dos tenen el mateix pes i la mateixa quantitat de material, però el tub buit no s’aboca mentre que la barra sòlida, que és més esvelta, si Pandea.

source: Esto se utiliza, por ejemplo, en las estructuras de las bicicletas que están formadas por **barras tubulares** o en las estructuras de las torres eléctricas formadas por **barras en forma de L** en vez de barras macizas.
ca: S'utilitza, per exemple, en les estructures de les bicicletes formades per ** barres tubulars ** o en les estructures de les torres elèctriques formades per les barres en forma de ** l ** en lloc de barres sòlides.

source: Sujetar el centro de la barra
ca: Mantingueu el centre de la barra

source: Si sujetamos el centro de la barra para evitar que se mueva, el pandeo no llegará a producirse.
ca: Si mantenim el centre de la barra per evitar que es mogui, no es produirà la fulla.

source: Por ejemplo, una torre de alta tensión está construida con cuatro barras verticales esbeltas que soportan la mayor parte del peso y barras horizontales y oblicuas entre ellas que evitan que las barras verticales puedan pandear.
ca: Per exemple, una torre d’alta tensió es construeix amb quatre esveltes barres verticals que admeten la major part del pes i les barres horitzontals i oblices que impedeixen que les barres verticals s’enfilin.

source: Oscilaciones
ca: Oscil·lacions

source: Las oscilaciones o vibraciones de una estructura pueden ser beneficiosas o perjudiciales.
ca: Les oscil·lacions o vibracions d’una estructura poden ser beneficioses o perjudicials.

source: En ciertos casos conviene que la estructura no sea completamente rígida. Si la estructura puede flexionarse y oscilar ante una carga externa, esto permite que no llegue a fallar. Ejemplos de este comportamiento lo tenemos en los rascacielos que oscilan en su azotea en caso de terremoto o en caso de soportar vientos fuertes. Los mástiles de barco o las alas de un avión también son capaces de oscilar para adaptarse a los esfuerzos que soportan. Si estas estructuras fuesen completamente rígidas podrían destruirse con los grandes esfuerzos que soportan.
ca: En determinats casos, és convenient que l'estructura no sigui completament rígida. Si l'estructura es pot flexionar i oscil·lar abans d'una càrrega externa, això li permet fallar. Els exemples d’aquest comportament ho tenen en els gratacels que oscil·len al seu sostre en cas de terratrèmol o en cas de donar suport a forts vents. Els pals del vaixell o les ales d’un avió també poden oscil·lar per adaptar -se als esforços que recolzen. Si aquestes estructures fossin completament rígides, es podrien destruir amb els grans esforços que donen suport.

source: En otros casos las oscilaciones pueden llegar a sumarse poco a poco igual que ocurre en un columpio, haciendo que la estructura oscile cada vez con mayor amplitud hasta llegar a desmoronarse. Esto es lo que le pasó al famoso puente de `Tacoma Narrows <https://es.wikipedia.org/wiki/Puente_de_Tacoma_Narrows>`__ apodado Gallopin Gertie por las grandes oscilaciones que sufría cuando soplaba la brisa del verano en que se inauguró. Al llegar el otoño, un viento de apenas 64 kilómetros por hora derrumbó el puente, afortunadamente sin producir muertes. Puedes ver una grabación del suceso en YouTube:
ca: En altres casos, les oscil·lacions poden unir -se gradualment a la mateixa que en un swing, provocant que l'estructura oscil·li cada cop més amplitud fins que s'esfondri. Això és el que va passar amb el famós `Tacoma Narrows <https://es.wikipedia.org/wiki/puente_de_tacoma_narrows>`__ sobrenomenat Gallopin Gertie per les grans oscil·lacions que va patir quan la brisa de l'estiu bufava en les quals es va inaugurar. Quan va arribar la caiguda, un vent de només 64 quilòmetres per hora es va esfondrar el pont, afortunadament sense produir morts. Podeu veure un esdeveniment enregistrant a YouTube:

source: Vídeo: `Tacoma Narrows Bridge Collapse "Gallopin' Gertie". <https://www.youtube-nocookie.com/embed/j-zczJXSxnw>`__
ca: Vídeo: `Tacoma Narrows Pont Collapse " Gallopin 'Gertie \ ". <https://www.youtube-nocokie.com/embed/j-zczjxsxnw> `` `

source: Sin llegar a ser tan dramáticas, las oscilaciones pueden producir en otros casos ruidos y vibraciones muy molestas. Esto se produce especialmente en las frecuencias de resonancia que son las frecuencias en las que vibra una estructura de forma natural. Sumando poco a poco los efectos de una pequeña vibración a la misma frecuencia de resonancia, la oscilación, igual que en un columpio, puede llegar a hacerse muy grande y molesta.
ca: Sense ser tan dramàtics, les oscil·lacions poden produir sorolls i vibracions molt molestes en altres casos. Això es produeix especialment en freqüències de ressonància que són les freqüències en què una estructura vibra de forma natural. Poc a poc, els efectes d’una petita vibració a la mateixa freqüència de ressonància, l’oscil·lació, que en un swing, poden ser molt grans i molestos.

source: Soluciones a las oscilaciones
ca: Solucions a les oscil·lacions

source: Evitar las cargas oscilantes
ca: Eviteu les càrregues oscil·lants

source: Esta es la solución que toman los soldados que caminan en formación por encima de un puente que no es muy rígido. En este caso los soldados dejan de caminar a la vez y comienzan a caminar de manera desorganizada para que el puente no resuene al mismo ritmo de los pasos [#f1]_ .
ca: Aquesta és la solució dels soldats que caminen en formació per sobre d’un pont que no és gaire rígid. En aquest cas, els soldats deixen de caminar alhora i comencen a caminar de manera desorganitzada perquè el pont no ressoni el mateix ritme dels passos [#F1] _.

source: Amortiguar la estructura
ca: Xoqueu l'estructura

source: Vídeo: `amortiguador de masa sintonizada <https://www.youtube-nocookie.com/embed/7SCUGTA8xEI>`__
ca: VÍDEO: `Sintonització de l'absorbidor de xocs de masses <https://www.youtube-nocokie.com/embed/7scugta8xei>`__

source: Vídeo: `ejemplo didactico de estructura sismo resistente. <https://www.youtube-nocookie.com/embed/QUI7acilEJo>`__
ca: Vídeo: `Exemple didàctic d'estructura de terratrèmols resistents. <https://www.youtube-nocoakie.com/embed/qui7acileJo>`__

source: Ejercicios
ca: Exercicis

source: ¿Qué problemas de estabilidad pueden tener las estructuras?
ca: Quins problemes d’estabilitat poden tenir les estructures?

source: ¿Cuándo vuelca una estructura?
ca: Quan gira una estructura?

source: ¿Qué soluciones hay para evitar que una estructura vuelque? Escribe un ejemplo de cada una.
ca: Quines solucions hi ha per evitar que es converteixi una estructura? Escriviu un exemple de cadascun.

source: ¿Qué es el pandeo?
ca: Què està fent un cop de puny?

source: ¿Cómo se pueden evitar las oscilaciones perjudiciales en una estructura?
ca: Com es poden evitar les oscil·lacions de danys en una estructura?

source: Notas
ca: Notes

source: El `puente de Broughton <http://www.wikivia.org/wikivia/index.php?title=Puente_de_Broughton_(colapso_estructural)>`__ fue un puente de suspensión en Manchester, Inglaterra, que en 1831 colapsó a raíz del paso de una tropa de soldados caminando en formación.
ca: El `Brouchton Bridge <http://www.wikivia.org/wikivia/index.php?title=puente_de_broughton_ (collapse_structural)>`__ va ser un pont de suspensió a Manchester, Anglaterra, que el 1831 es va esfondrar després del pas d'un troop de soldats que caminava en formació.
