Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/estructuras-bridge-designer.po
Languages: ca

source: Diseño de puentes
ca: Disseny del pont

source: El programa para diseño de puentes "Bridge Designer" proporciona una introducción práctica a la ingeniería a través de una experiencia de diseño auténtica y realista.
ca: El programa de disseny del pont \ "Bridge Designer " proporciona una introducció pràctica a l'enginyeria mitjançant una experiència de disseny autèntica i realista.

source: Este software proporciona las herramientas para diseñar, probar y optimizar un puente de acero para autopista, basado en especificaciones, restricciones y criterios de rendimiento realistas.
ca: Aquest programari proporciona les eines per dissenyar, provar i optimitzar un pont d’acer d’autopista, basat en especificacions realistes, restriccions i criteris de rendiment.

source: Uno de los objetivos del programa es minimizar la cantidad de material utilizada en la construcción, como corresponde a un criterio ecológico.
ca: Un dels objectius del programa és minimitzar la quantitat de material utilitzat en la construcció, ja que correspon a un criteri ecològic.

source: The Bridge Designer es un software para Windows y Mac OS X, gratuito y de dominio público. Se proporciona y está destinado únicamente para uso educativo.
ca: El Bridge Designer és un programari per a Windows i Mac OS X, de domini públic i públic. Es proporciona i només està destinat a ús educatiu.

source: Enlaces
ca: Enllaços

source: `The Bridge Designer. Página principal. <http://bridgedesigner.org/>`__
ca: `El dissenyador del pont. Pàgina principal. <http://bridgedesigner.org/>`__

source: `The Bridge Designer. Download <http://bridgedesigner.org/download/>`__
ca: `El dissenyador del pont. Descarregueu <http://bridgedesigner.org/download/> `__

source: `Instalador para Windows desde la página de Source Forge. <https://sourceforge.net/projects/wpbdc/files/Current%20Release/jre/setupbdv16j.exe/download>`__
ca: `Instal·lador de Windows de la pàgina Forge Source. <https://sourceforge.net/projects/wpbdc/files/current%20release/jre/setupbdv16j.exe/download> `` `` `` `` `` `` `` ``

source: `Instalador Bridge Designer 1.6 <../_static/downloads/bridge-designer-setup-v16j.exe>`__
ca: `Bridge Designer 1.6 <../_ Static/Downloads/Bridge-Disigner-Stup-V16J.exe>` __

source: Tutorial en Inglés de 19 minutos de duración.
ca: 19 -Minute Tutorial en anglès.

source: Vídeo: `Bridge Designer 2016 Tutorial. <https://www.youtube-nocookie.com/embed/9w9fTC4eh3w>`__
ca: Vídeo: `Bridge Designer Tutorial 2016. <https://www.youtube-nocokie.com/embed/9w9ftc4eh3w>`__

source: Ejercicios
ca: Exercicis

source: Diseñar un puente con el código **BRI02A** y plantilla **Through Truss - Warren** para que tenga el menor coste posible.
ca: Dissenyeu un pont amb el codi ** BRI02A ** i la plantilla ** a través de Truss - Warren ** per tenir el menys cost possible.

source: Diseñar un puente con el código **BRI02A** y plantilla **Through Truss - Howe** para que tenga el menor coste posible.
ca: Dissenyeu un pont amb el codi ** BRI02A ** i la plantilla ** a través de Truss - Howe ** per tenir el menys cost possible.

source: Diseñar un puente con el código **BRI23A** y plantilla **Continuous Arch - Warren** para que tenga el menor coste posible.
ca: Dissenyeu un pont amb el codi ** BRI23A ** i plantilla ** Arch continu - Warren ** per tenir el menor cost possible.

source: Diseñar un puente con el código **BRI23A** y plantilla **Continuous Arch - Pratt** para que tenga el menor coste posible.
ca: Dissenyeu un pont amb el codi ** BRI23A ** i plantilla ** Arch continu - Pratt ** per tenir el menor cost possible.

source: Diseñar un puente con el código **BRI12C** y plantilla **Cable Stayed Warren Truss** para que tenga el menor coste posible.
ca: Dissenyar un pont amb el codi ** BRI12C ** i la plantilla ** es van mantenir Warren Truss Cable ** per tenir el cost més baix possible.

source: Diseñar un puente con el código **BRI15A** y plantilla **Cable Stayed Warren Truss** para que tenga el menor coste posible.
ca: Dissenyar un pont amb el codi ** BRI15A ** i la plantilla ** es van mantenir Warren Truss Cable ** per tenir el cost més baix possible.

source: Diseñar un puente con el código **BRI15A** y plantilla **Suspended Warren Truss** para que tenga el menor coste posible.
ca: Dissenyeu un pont amb el codi ** BRI15A ** i la plantilla ** Suspended Warren Truss ** per tenir el menys cost possible.

source: Diseñar un puente con el código **BRI54A** y plantilla **Continuous Deck Truss** para que tenga el menor coste posible.
ca: Dissenyeu un pont amb el codi ** BRI54A ** i la plantilla ** Truss de coberta contínua ** per tenir el menor cost possible.

source: Diseñar un puente con el código **BRI02A** y sin plantilla (elegir plantilla <none>). A continuación se diseñará el puente con la forma de la siguiente imagen.
ca: Dissenyeu un pont amb el codi ** BRI02A ** i sense plantilla (trieu <No> plantilla). El pont es dissenyarà a continuació a la imatge següent.

source: El puente debe tener el menor coste posible.
ca: El pont ha de tenir el cost menys possible.

source: Diseñar un puente con el código **BRI76A** y forma libre. Se pueden utilizar cables de suspensión y el apoyo central.
ca: Dissenyar un pont amb el codi ** BRI76A ** i forma lliure. Es poden utilitzar cables de suspensió i suport central.

source: Puntuación
ca: Puntuació
