Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/estructuras-intro.po
Languages: ca

source: Introducción a las Estructuras
ca: Introducció a les estructures

source: Es un conjunto de elementos destinados a soportar esfuerzos sin romperse ni deformarse.
ca: És un conjunt d’elements destinats a donar suport als esforços sense trencar -se ni deformar -se.

source: En la **naturaleza** existen multitud de estructuras desde el tronco que sostiene un árbol hasta nuestro esqueleto. Todas ellas soportan esfuerzos para superar la gravedad y en el caso de los esqueletos también permiten el movimiento.
ca: A la naturalesa ** ** hi ha moltes estructures del tronc que manté un arbre al nostre esquelet. Tots ells donen suport als esforços per superar la gravetat i en el cas dels esquelets també permeten el moviment.

source: En el **ámbito técnico** la construcción de estructuras para fabricar viviendas, barcos o vasijas es tan antigua como la propia civilización. Hoy en día las estructuras pueden ser muy complejas y permiten construir edificios, automóviles, aviones, puentes, torres de alta tensión, presas y un sinfín de aparatos sin los cuales el mundo actual, tal y como lo conocemos, no existiría.
ca: En l’àmbit tècnic ** ** La construcció d’estructures per fabricar cases, vaixells o vaixells és tan antiga com la civilització mateixa. Avui les estructures poden ser molt complexes i permetre construir edificis, cotxes, avions, ponts, torres d’alta tensió, preses i dispositius interminables sense els quals el món actual, tal com el coneixem, no existiria.

source: Origen de las estructuras
ca: Origen de les estructures

source: Las estructuras se pueden diferenciar dependiendo de su origen:
ca: Les estructures es poden diferenciar segons el seu origen:

source: **Naturales**
ca: ** Natural **

source: Tronco de un árbol.
ca: Un tronc d’arbre.

source: Caparazón de tortuga.
ca: Shell Turtle.

source: Esqueleto humano.
ca: Esquelet humà

source: Conchas de moluscos.
ca: Closques de mol·lusc.

source: Nido de pájaro.
ca: Niu d'ocells.

source: **Artificiales**
ca: ** Artificial **

source: Puente colgante.
ca: Pont de suspensió.

source: Estructura de un edificio.
ca: Estructura d’un edifici.

source: Carcasa de ordenador.
ca: Habitatge informàtic.

source: Grúa de obra.
ca: Grua de treball.

source: Muralla.
ca: Paret.

source: Clasificación de las estructuras
ca: Classificació d’estructures

source: Dependiendo de sus elementos podemos clasificar las estructuras en los siguientes grupos:
ca: Segons els seus elements, podem classificar les estructures dels grups següents:

source: Masivas
ca: Massiva

source: Formadas por una gran masa de material sin apenas huecos.
ca: Format per una gran massa de material amb gairebé cap buit.

source: Ejemplos: Presa de agua. Pirámide. Murallas.
ca: Exemples: presa d’aigua. Piràmide. Parets

source: Presa de agua de Hoover.
ca: Presa d’aigua de Hoover.

source: `Adam Kliczek <https://commons.wikimedia.org/wiki/File:Hoover_Dam,_02.jpg>`__, `CC BY-SA 3.0 International <https://creativecommons.org/licenses/by-sa/3.0/deed.en>`__, via Wikimedia Commons.
ca: `Adam Kliczek <https://commons.wikimedia.org/wiki/file:hover_dam._02.jpg>` __, `cc by-sa 3.0 internacional <https://creativecommons.org/licenses/by-sa/3.0/deed.en>` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` ` `` `` `` `` ``

source: Abovedadas
ca: Vaid

source: Formadas por arcos y bóvedas.
ca: Format per arcs i voltes.

source: Ejemplos: Techo de catedral gótica. Puente romano. Acueducto. Panteón de Roma.
ca: Exemples: sostre de la catedral gòtica. Pont romà. Aqüeducte. Panteó de Roma.

source: Arcos del acueducto de Segovia.
ca: Arcs de l'aqüeducte de Segòvia.

source: `Carlos Delgado <https://commons.wikimedia.org/wiki/File:Acueducto_de_Segovia_-_21.jpg>`__, `CC BY-SA 3.0 International <https://creativecommons.org/licenses/by-sa/3.0/deed.en>`__, via Wikimedia Commons.
ca: `Carlos Delgado <https://commons.wikimedia.org/wiki/file:acueduct_de_segovia_-_21.jpg>`__, `cc by-sa 3.0 internacional <https://creativecommons.org/licenses/by-sa/3.0/deed.en>` `` `` `` `` `` `` `` `` `` `` `` `Wikimedia Commons.

source: Trianguladas
ca: Triangulat

source: Formadas por barras unidas entre sí en triángulos.
ca: Format per barres unides entre si en triangles.

source: Ejemplos: Grúa de obra. Torre Eiffel. Torre de alta tensión.
ca: Exemples: grua de treball. Torre Eiffel. Torre d’alta tensió.

source: Puente con estructura triangulada.
ca: Pont amb estructura triangulada.

source: `Waz8 <https://commons.wikimedia.org/wiki/File:Shelburne_Falls_-_truss_bridge_over_Deerfield_River.jpg>`__, `CC0 1.0 <https://creativecommons.org/publicdomain/zero/1.0/deed.en>`__, via Wikimedia Commons.
ca: `Waz8 <https://commons.wikimedia.org/wiki/file:shelburne_falls_-_truss_bridge_ver_deerfield_riviver.jpg>`__, `cc0 1.0 <https://creativecommons.org/publicdomain/zero/1.0/deed.en> __, __, via via via via a via via8 Wikimedia Commons.

source: Entramadas
ca: Fotogrames

source: Formadas por elementos verticales y horizontales.
ca: Format per elements verticals i horitzontals.

source: Ejemplos: Estructura de edificio. Sillas y mesas. Escalera de mano.
ca: Exemples: Estructura de l’edifici. Cadires i taules. Escala.

source: Grúa en forma de pórtico.
ca: Grua en forma de pòrtic.

source: `Richard Humphrey <https://commons.wikimedia.org/wiki/File:Travelling_beam_crane_at_Tallington_concrete_works_-_geograph.org.uk_-_4292023.jpg>`__, `CC BY-SA 2.0 International <https://creativecommons.org/licenses/by-sa/2.0/deed.en>`__, via Wikimedia Commons.
ca: `Richard Humphrey <https://commons.wikimedia.org/wiki/file:Travelling_beam_crane_at_tallington_concrete_works_- _geograph.org.uk_-_4292023.jpg>` `__,` cc by -a -a 2.0 International <https://creativecommons.org/licenses/by-sa/2.0/deed.en>`__, a través de Wikimedia Commons.

source: Colgantes
ca: Penjolls

source: Formadas por cables que soportan las cargas.
ca: Format per cables que admeten les càrregues.

source: Ejemplos: Teleférico. Puente atirantado o puente colgante. Grúa de obra. Tirolina.
ca: Exemples: telefèric. Pont attirant o pont de pupple. Grua de treball. Tirolina

source: Puente colgante de San Francisco.
ca: Pont de suspensió de San Francisco.

source: `Mikebhuang <https://commons.wikimedia.org/wiki/File:San_Francisco%E2%80%93Oakland_Bay_Bridge_at_Night.jpg>`__, `CC BY-SA 4.0 International <https://creativecommons.org/licenses/by-sa/4.0/deed.en>`__, via Wikimedia Commons.
ca: `Mikebhuang <https://commons.wikimedia.org/wiki/file:san_francisco%E2%80%93oakland_bay_bridge_at_night.jpg>` `` `` cc by-sa 4.0 International <https://creativecommons.org/licenses/by-sa/4.0/deed.en>`__, a través de Wikimedia Commons.

source: Laminares
ca: Laminaris

source: Formadas por una lámina o pared delgada.
ca: Format per una làmina o paret fina.

source: Ejemplos: Cuenco. Caparazón de tortuga. Casco para moto. Depósito de agua.
ca: Exemples: Bowl. Shell Turtle. Casc de moto. Dipòsit d’aigua.

source: Casco para motorista.
ca: Casc per a motorista.

source: `Stefania Anghelea <https://commons.wikimedia.org/wiki/File:Moto_Days_2013.jpg>`__, `CC BY-SA 4.0 International <https://creativecommons.org/licenses/by-sa/4.0/deed.en>`__, via Wikimedia Commons.
ca: `Stefania anghelea <https://commons.wikimedia.org/wiki/file:moto_days_2013.jpg>`__, `cc by-sa 4.0 internacional <https://creativecommons.org/licenses/by-sa/4.0/deed.en>` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` ` `` `` `` `` `

source: Movimiento en las estructuras
ca: Moviment en estructures

source: La mayoría de las estructuras se construyen para que no puedan moverse. Sin embargo algunas estructuras deben permitir el movimiento para poder funcionar correctamente. Estas estructuras seguirán resistiendo los esfuerzos y su propio peso sin romperse, pero permitirán el movimiento de alguna de sus partes.
ca: La majoria de les estructures es construeixen perquè no es puguin moure. Tot i això, algunes estructures han de permetre que el moviment funcioni correctament. Aquestes estructures continuaran resistint els esforços i el seu propi pes sense trencar -se, però permetran el moviment de qualsevol de les seves parts.

source: Estructuras móviles
ca: Estructures mòbils

source: Se pueden desplazar o están articuladas. Soportan cargas mientras permiten el movimiento.
ca: Es poden moure o s’articulen. Suporten càrregues mentre permeten el moviment.

source: Ejemplos: Puerta con bisagra. Puente levadizo. Silla con ruedas. Grúa.
ca: Exemples: porta amb frontissa. Drawbridge. Cadira de rodes. Grua.

source: Estructuras fijas
ca: Estructures fixes

source: No se desplazan ni se pueden mover.
ca: No es mouen ni es mouen.

source: Ejemplos: Puente. Edificio. Torre de alta tensión. Cuenco.
ca: Exemples: Bridge. Edifici. Torre d’alta tensió. Bol.

source: Ejercicios
ca: Exercicis

source: Enumera cuatro estructuras naturales y cinco artificiales.
ca: Enumereu quatre estructures artificials naturals i cinc.

source: Enumera cuatro estructuras masivas.
ca: Enumereu quatre estructures massives.

source: Enumera cuatro estructuras abovedadas.
ca: Enumereu quatre estructures de volta.

source: Enumera cuatro estructuras trianguladas
ca: Enumereu quatre estructures triangulades

source: Enumera cuatro estructuras entramadas
ca: Enumereu quatre estructures marc

source: Enumera cuatro estructuras colgantes
ca: Enumereu quatre estructures penjants

source: Enumera cuatro estructuras laminadas
ca: Enumereu quatre estructures laminades

source: Indica las diferencias entre las estructuras trianguladas y entramadas
ca: Indica les diferències entre estructures triangulades i marc

source: Clasifica las siguientes estructuras:
ca: Classifiqueu les estructures següents:

source: Acueducto
ca: Aqüeducte

source: Caparazón de tortuga
ca: Closca de tortugues

source: Carcasa de ordenador
ca: Habitatge informàtic

source: Casco
ca: Casc

source: Conchas de moluscos
ca: Closques de mol·lusc

source: Cuenco
ca: Tassa

source: Esqueleto humano
ca: Esquelet humà

source: Estructura de edificio
ca: Estructura de l'edifici

source: Grúa de obra
ca: Grua de treball

source: Iglesia
ca: Esglèsia

source: Mesa
ca: Taula

source: Muralla china.
ca: Mur de la Xina.

source: Pirámide.
ca: Piràmide.

source: Presa de agua.
ca: Presa d’aigua

source: Puente atirantado.
ca: Pont atirant.

source: Puente romano
ca: Pont romà

source: Silla
ca: Cadira

source: Teleférico
ca: Telefèric

source: Torre de alta tensión
ca: Torre d'alta tensió

source: Tronco de un árbol
ca: Tronc de l'arbre

source: Indica a qué tipo de estructura se refiere cada una de las siguientes frases:
ca: Indica quin tipus d’estructura es refereix a cadascuna de les frases següents:

source: Formada por cables que soportan las cargas.
ca: Format per cables que admeten les càrregues.

source: Formada por elementos verticales y horizontales.
ca: Format per elements verticals i horitzontals.

source: Formada por arcos y bóvedas.
ca: Format per arcs i voltes.

source: Formada por una gran masa de material sin apenas huecos.
ca: Format per una gran massa de material amb gairebé cap buit.

source: Formada por una lámina o pared delgada.
ca: Format per una làmina o paret fina.

source: Formada por barras unidas entre sí en triángulos.
ca: Format per barres unides entre si en triangles.
