Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/html-intro.po
Languages: ca

source: Introducción a los ejercicios HTML y CSS
ca: Introducció als exercicis HTML i CSS

source: Editor de texto
ca: Editor de text

source: Para crear los archivos que se van a ver en este tutorial solo se necesita un simple editor de texto.
ca: Per crear els fitxers que es veuran en aquest tutorial, només cal un simple editor de text.

source: En Windows, el más simple es el Block de notas, que tiene la ventaja de encontrarse en todas las versiones de Windows.
ca: A Windows, el més senzill és el bloc de notes, que té l’avantatge d’estar a totes les versions de Windows.

source: A la hora de guardar por primera vez el código HTML o el código CSS hay que seleccionar dos opciones para no tener problemas con el archivo.
ca: En desar el codi HTML o el codi CSS per primera vegada, heu de seleccionar dues opcions per no tenir problemes amb el fitxer.

source: El tipo de archivo debe ser "Todos los archivos (\*.\*)"
ca: El tipus de fitxer ha de ser \ "Tots els fitxers (\*. \*) "

source: Con esta opción, la extensión del archivo se podrá elegir como .html o como .css en vez de guardar la extensión por defecto .txt, que no serviría.
ca: Amb aquesta opció, es pot triar l’abast del fitxer com a .html o com .css en lloc de desar l’extensió .txt predeterminada, que no serviria.

source: La codificación debe ser UTF-8
ca: La codificació ha de ser UTF-8

source: De esta forma los caracteres especiales como los acentos o la eñe se guardarán y se visualizarán correctamente.
ca: D’aquesta manera, es desaran i es mostraran caràcters especials com Accents o Eñe correctament.

source: Para guardar las modificaciones posteriores del archivo .html no es necesario repetir todo este proceso.
ca: Per desar les modificacions posteriors del fitxer .html, no cal repetir tot aquest procés.

source: Simplemente selecciona en el menú Archivo... Guardar o pulsa Ctrl-G y se guardará correctamente.
ca: Simplement seleccioneu al menú Fitxer ... Desa o feu clic a Ctrl-G i es desarà correctament.

source: Si se quiere utilizar un editor de texto más profesional y con más opciones el `editor de texto Notepad++ <https://notepad-plus-plus.org/>`__ es libre, gratuito y una gran opción.
ca: Si voleu utilitzar un editor de text més professional i amb més opcions, el `` editor de text Notepad ++ <https://notepad-plus-plus.org/>`__ és gratuït, gratuït i una opció fantàstica.

source: La ventaja de utilizar Notepad++ u otro editor de textos avanzado es que estos editores hacen **resaltado de sintaxis** y eso ayuda mucho a comprobar errores y evitarlos mientras se escribe el código.
ca: L’avantatge d’utilitzar NotePad ++ o un altre editor de text avançat és que aquests editors fan ** destacats de la sintaxi ** i això ajuda molt a comprovar els errors i evitar -los mentre escriuen el codi.

source: Visualización en navegador y modificaciones
ca: Visualització i modificacions del navegador

source: Una vez guardado el archivo HTML, al pinchar sobre él se abrirá en el navegador y podemos ver el resultado.
ca: Un cop desat el fitxer HTML, feu clic a ell s’obrirà al navegador i podem veure el resultat.

source: Para realizar modificaciones, tendremos que volver a editar el archivo con el editor de textos. No es posible modificar un archivo HTML a través del navegador.
ca: Per fer modificacions, haurem d’editar el fitxer amb l’editor de text. No és possible modificar un fitxer HTML a través del navegador.

source: Para conseguirlo debemos pulsar el botón derecho del ratón sobre el archivo y elegir la opción Abrir con... para elegir el Block de notas.
ca: Per aconseguir -ho, hem de prémer el botó dret del ratolí del fitxer i triar l’opció Obrir amb ... per triar les notes.

source: Otra solución es arrastrar el archivo HTML sobre el Block de notas y se abrirá su contenido para editarlo.
ca: Una altra solució és arrossegar el fitxer HTML al bloc Notes i el seu contingut s’obrirà per editar -lo.

source: Errores de código
ca: Errors de codi

source: Normalmente el navegador no muestra los errores que se han cometido al escribir el código. En ocasiones no muestra nada si el código es incorrecto.
ca: Normalment, el navegador no mostra els errors que s’han comès a l’hora d’escriure el codi. De vegades no mostra res si el codi és incorrecte.

source: Para visualizar los errores de código, en el navegador Firefox seleccionamos en el menú de Herramientas... Desarrollador Web... Inspector
ca: Per visualitzar els errors de codi, al navegador Firefox seleccionem al menú Eines ... desenvolupador web ... Inspector

source: Aparecerá en la parte baja del navegador un conjunto de herramientas muy útil para comprobar qué parte del código corresponde a la pantalla y viceversa.
ca: A la part inferior del navegador apareixerà una eina molt útil per comprovar quina part del codi correspon a la pantalla i viceversa.

source: **Errores habituales**
ca: ** Errors habituals **

source: Esta es una pequeña lista con los errores más habituales. Conviene repasarla antes de buscar otros errores menos comunes.
ca: Aquesta és una petita llista amb els errors més habituals. S'hauria de revisar abans de buscar altres errors menys habituals.

source: No se ha cerrado una etiqueta correctamente. Por ejemplo, en <h1>Título<h1> le falta la barra en la segunda etiqueta: </h1>
ca: Una etiqueta no s'ha tancat correctament. Per exemple, a <h1> títol <H1> Li falta la barra de la segona etiqueta:

source: No se ha cerrado un comentario correctamente.
ca: Un comentari no s'ha tancat correctament.

source: Editor de texto para Linux
ca: Editor de text per a Linux

source: Existen muchos editores de texto compatibles con el sistema operativo Linux. Los editores por defecto tales como Pluma Text Editor o Gedit sirven para realizar cualquier práctica de este tutorial.
ca: Hi ha molts editors de text compatibles amb el sistema operatiu Linux. Els editors predeterminats com l'editor de text o la ploma GEDIT s'utilitzen per realitzar qualsevol pràctica d'aquest tutorial.

source: Se recomienda utilizar Gedit con resaltado de sintaxis (syntax hightlighting) para encontrar los errores con más facilidad. Para activar esta opción hay que seleccionar en el menú View... Highlight mode... y el lenguaje utilizado.
ca: Es recomana utilitzar GEDIT amb la sintaxi destacada (Syntax Hightlight) per trobar errors amb més facilitat. Per activar aquesta opció, heu de seleccionar al menú Vista ... Mode ressaltar ... i el llenguatge utilitzat.
