Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/html-tags.po
Languages: ca

source: Resumen de etiquetas HTML
ca: Resum de l'etiqueta HTML

source: Etiquetas básicas
ca: Etiquetes bàsiques

source: Etiqueta inicial que informa al navegador de que a continuación viene un documento de tipo HTML.
ca: Etiqueta inicial que informa al navegador que a continuació ve un document de tipus HTML.

source: Etiqueta inicial y final de todos los documentos de tipo HTML.
ca: Etiqueta inicial i final de tots els documents de tipus HTML.

source: ``<head> </head>``
ca: `` <head> </nad>`

source: Sección de cabecera del documento. En esta sección se define el título de la página, los estilos, etc.
ca: Secció de capçalera del document. Aquesta secció defineix el títol de la pàgina, estils, etc.

source: Título de la página HTML. Debe aparecer en la sección <head>.
ca: Títol de la pàgina HTML. Ha d’aparèixer a la secció <now>.

source: ``<body> </body>``
ca: `` <E Body

source: Cuerpo del documento. En esta sección estarán todos los contenidos que aparecen en la página web. Textos, imágenes, listas, tablas, etc.
ca: Cos del document. En aquesta secció hi haurà tots els continguts que apareixen al lloc web. Textos, imatges, llistes, taules, etc.

source: ``<!-- Comentario -->``
ca: `` <!-Comentari-> ''

source: Esta etiqueta es un comentario que no se verá en el navegador. Sirve para comentar aclarar el contenido HTML y facilitar su comprensión.
ca: Aquesta etiqueta és un comentari que no es veurà al navegador. Serveix per comentar per aclarir el contingut HTML i facilitar la seva comprensió.

source: Plantilla de documento HTML.
ca: Plantilla de document HTML.

source: Etiquetas de contenido
ca: Etiquetes de contingut

source: Etiqueta de párrafo. Engloba un párrafo de texto con varias frases consecutivas. Terminan en un punto y aparte.
ca: Etiqueta de paràgraf. Engloba un paràgraf de text amb diverses frases consecutives. Acaben en un punt i a part.

source: Encabezado de primer nivel. Equivale a un título de capítulo.
ca: Encapçalament de primer nivell. És equivalent a un títol de capítol.

source: Encabezado de segundo nivel. Equivale a un título de sección.
ca: Encapçalament de segon nivell. Equival a un títol de secció.

source: Encabezado de tercer nivel. Equivale a un título de subsección.
ca: Encapçalament de tercer nivell. És equivalent a un títol de subsecció.

source: Encabezado de cuarto nivel.
ca: Encapçalament del quart nivell.

source: Salto de línea
ca: Salt de línia

source: Salto de línea. Lo que esté escrito a continuación aparecerá en la siguiente línea en el navegador.
ca: Salt de línia. El que s’escriu a continuació apareixerà a la línia següent del navegador.

source: Línea horizontal de separación.
ca: Línia de separació horitzontal.

source: Tipos de texto
ca: Tipus de text

source: Texto destacado con énfasis. El tipo de letra será *itálica*.
ca: Text destacat amb èmfasi. El tipus de lletra serà *italic *.

source: Texto importante con énfasis fuerte. El tipo de letra será **negrita**.
ca: Text important amb un fort èmfasi. El tipus de lletra serà ** negreta **.

source: El texto interior es una cita de otra fuente o de otro autor.
ca: El text interior és una cita d’una altra font o d’un altre autor.

source: Etiqueta que incluye una sección de texto que se ha copiado de otra página. La etiqueta blockquote contiene un atributo cite que describe la dirección de donde se ha tomado el texto. Normalmente esta sección aparece desplazada hacia la derecha.
ca: Etiqueta que inclou una secció de text que s'ha copiat des d'una altra pàgina. L’etiqueta BlockQuote conté un atribut CITE que descriu l’adreça de la qual s’ha pres el text. Normalment, aquesta secció apareix desplaçada a la dreta.

source: ``<pre> </pre>``
ca: `` <st> </st>`

source: Etiqueta de texto preformateado. Se preservan todos los espacios y saltos de línea. La fuente utilizada es de ancho fijo (monospaced).
ca: Etiqueta de text preformat. Es conserven tots els espais i línies. La font utilitzada és fixa (monospaced).

source: ``<code> </code>``
ca: `` <code> </coe>`

source: Etiqueta para incluir código para ordenador. El tipo de letra será de ancho fijo.
ca: Etiqueta per incloure el codi de l'ordinador. El tipus de lletra es fixarà en ampli.

source: Hipervínculos, imágenes y objetos
ca: Hiperenllaços, imatges i objectes

source: ``<a href="salto"> Texto </a>``
ca: `` <a href = \ "salt "> text </a> ``

source: Hipervínculo. En el navegador aparecerá el texto que se encuentra entre las etiquetas. Al pinchar sobre el texto, saltará a la referencia que contiene href.
ca: Hiperenllaç. El text entre les etiquetes apareixerà al navegador. En fer clic al text, saltarà a la referència que conté HREF.

source: ``<img src="imagen">``
ca: `` <img src = \ "imatge ">`

source: Vínculo a una imagen que se insertará en el documento.
ca: Enllaç a una imatge que s’inserirà al document.

source: ``<object data=""> </object>``
ca: `` <Objecte data = \ ""> </bject>`

source: Esta etiqueta inserta en la página HTML un elemento externo que puede ser un archivo de texto, un vídeo, sonidos, una página web, etc. El nombre y ruta del objeto se escribe dentro de el atributo data.
ca: Aquesta etiqueta insereix a la pàgina HTML un element extern que pot ser un fitxer de text, un vídeo, sons, una pàgina web, etc. El nom i la ruta de l'objecte s'escriuen dins de l'atribut de dades.

source: ``id="nombre"``
ca: `` id = \ "nom "`

source: Este atributo aparece dentro de una etiqueta para darle nombre. el nombre tiene que ser único y no repetirse, para distinguir las etiquetas entre sí.
ca: Aquest atribut apareix dins d’una etiqueta per donar -la. El nom ha de ser únic i no repetir, per distingir les etiquetes les unes de les altres.

source: Listas y definiciones
ca: Llistes i definicions

source: ``<ol> </ol>``
ca: `` <i> </l>`

source: Etiqueta de lista numerada.
ca: Etiqueta de llista numerada.

source: Etiqueta de lista no numerada.
ca: Etiqueta de llista no nombrada.

source: Etiqueta que contiene un elemento de la lista.
ca: Etiqueta que conté un element de la llista.

source: Etiqueta de definición de palabras.
ca: Etiqueta de definició de paraules.

source: Palabra a definir.
ca: Paraula que s'ha de definir.

source: Definición de una palabra.
ca: Definició d'una paraula.

source: Tablas de datos
ca: Taules de dades

source: ``<table> </table>``
ca: `` <bable> </bable>`

source: Etiqueta de tabla.
ca: Etiqueta de taula.

source: ``<tr> </tr>``
ca: `` <str> </r>`

source: Etiqueta una fila dentro de una tabla.
ca: Etiqueta una fila dins d’una taula.

source: ``<thead> </thead>``
ca: `` <sad> </sad>`

source: Etiqueta la cabecera de una tabla. Está en la primera fila de una tabla.
ca: Etiqueta l’encapçalament d’una taula. Es troba a la primera fila d’una taula.

source: Etiqueta cada uno de los elementos de una cabecera de tabla.
ca: Etiqueta cadascun dels elements d'una capçalera de taula.

source: ``<tbody> </tbody>``
ca: `` <body> </body>`

source: Cuerpo de una tabla, donde se encuentran los contenidos de la tabla. Permite separar la cabecera de los contenidos.
ca: Cos d’una taula, on es troba el contingut de la taula. Permet separar la capçalera del contingut.

source: Etiqueta un elemento de una tabla. Debe estar dentro de una fila.
ca: Etiqueta un element d’una taula. Ha d’estar dins d’una fila.

source: Este atributo aparece dentro de un elemento de tabla <td>. Permite unir la celda actual con las celdas de la derecha de la misma fila, para hacer una sola celda más grande.
ca: Aquest atribut apareix dins d’un element de taula <td>. Permet unir -se a la cel·la actual amb les cèl·lules de la dreta de la mateixa fila, per fer una sola cel·la més gran.

source: Este atributo aparece dentro de un elemento de tabla <td>. Permite unir la celda actual con las celdas de abajo de la misma columna, para hacer una sola celda más grande.
ca: Aquest atribut apareix dins d’un element de taula <td>. Permet unir -se a la cel·la actual amb les cel·les per sota de la mateixa columna, per fer una sola cel·la més gran.

source: Plantilla de tabla de datos sin cabecera.
ca: Taula de dades sense cap.
