Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/informatica-hardware-esquema-ordenador.po
Languages: ca

source: Hardware de un ordenador personal
ca: Maquinari d’ordinador personal

source: `Gustavb <https://commons.wikimedia.org/wiki/File:Personal_computer,_exploded_5.svg>`__, `CC BY-SA 3.0 Unported <https://creativecommons.org/licenses/by-sa/3.0/deed.en>`__, via Wikimedia Commons.
ca: `Gustavb <https://commons.wikimedia.org/wiki/file:Personal_computer._exploded_5.svg>` __, `cc bya 3.0 Unported <https://creatcommons.org/licenses/by-sa/3.0/deed.en>` `` `` `` `` `` `` `` `` `` `` `` `` Wikimedia Commons.

source: Monitor.
ca: Supervisar.

source: Microprocesador (CPU) y zócalo.
ca: Microprocessador (CPU) i Zocalo.

source: Módulo de memoria RAM y ranuras DIMM.
ca: Mòdul RAM i ranures DIMM.

source: Tarjetas y ranuras de expansión PCI.
ca: Targetes d’expansió PCI i ranures.

source: Fuente de alimentación.
ca: Alimentació.

source: Unidad de disco óptico (CD, DVD, BD).
ca: Unitat de disc òptic (CD, DVD, BD).

source: Unidad de disco duro o unidad de estado sólido.
ca: Unitat de disc dur o unitat sòlida.

source: Teclado.
ca: Teclat.

source: Ratón.
ca: Mouse.

source: Esquema general de un ordenador
ca: Esquema general d’un ordinador

source: En el gráfico siguiente se pueden ver los elementos principales de un ordenador.
ca: Al gràfic següent podeu veure els elements principals d’un ordinador.

source: Estos elementos son los siguientes:
ca: Aquests elements són els següents:

source: La **memoria ROM**, es la encargada de almacenar a largo plazo los programas y los datos, aunque el ordenador esté apagado.
ca: La memòria ** ROM ** és responsable d’emmagatzemar programes i dades a llarg termini, fins i tot si l’ordinador està desactivat.

source: La **memoria RAM**, es la encargada de almacenar los programas y los datos para que el procesador pueda trabajar con ellos.
ca: El ** Ram **, és responsable d’emmagatzemar programes i dades perquè el processador pugui treballar amb ells.

source: La **CPU o unidad central de proceso** es el "cerebro" del ordenador, el elemento que procesa los programas y los datos.
ca: La ** CPU o la unitat de procés central ** és el \ "cervell " de l'ordinador, l'element que processa els programes i les dades.

source: El **bus de CPU** se encarga de transportar los datos entre la CPU, la memoria y el sistema de entrada/salida.
ca: El bus ** CPU ** és responsable de transportar les dades entre la CPU, la memòria i el sistema d’entrada/sortida.

source: El **sistema de entrada/salida** conecta el ordenador con el exterior y se encarga de transportar información entre el bus de CPU y varios buses de conexión secundarios, que suelen ser estándar, como USB, HDMI o Ethernet.
ca: El ** Sistema d’entrada/sortida ** connecta l’ordinador amb l’exterior i s’encarrega de transportar informació entre el bus CPU i diversos autobusos de connexió secundària, que solen ser estàndard, com ara USB, HDMI o Ethernet.

source: Los **periféricos** se encargan de realizar 3 tareas fundamentales.
ca: Els ** perifèrics ** són els responsables de realitzar 3 tasques fonamentals.

source: Entrada de datos al ordenador (por ejemplo, un teclado)
ca: Entrada de dades a l’ordinador (per exemple, un teclat)

source: Salida de datos del ordenador (por ejemplo, una pantalla)
ca: Sortida de dades de l'ordinador (per exemple, una pantalla)

source: Almacenamiento externo (por ejemplo, una memoria USB)
ca: Emmagatzematge extern (per exemple, una memòria USB)

source: La siguiente figura representa el esquema de un ordenador personal.
ca: La figura següent representa l’esquema d’un ordinador personal.

source: En este caso la memoria ROM, barata y de baja velocidad, se conecta a la CPU mediante el bus LPC de baja velocidad. Cuando el ordenador arranca, la información de la ROM es transferida a la memoria RAM, donde se ejecuta el programa de arranque del PC.
ca: En aquest cas, la memòria ROM, barata i de baixa velocitat està connectada a la CPU mitjançant el bus LPC de baixa velocitat. Quan s’inicia l’ordinador, la informació de ROM es transfereix a RAM, on s’executa el programa d’inici del PC.

source: Test de la unidad
ca: Test de prova

source: `Test de hardware de un ordenador personal I. <../test/es-hardware-pc-1.html>`__
ca: `Prova de maquinari d'un ordinador personal I. <../ Test/ es-scourge-p-1.html>`__

source: `Test de hardware de un ordenador personal II. <../test/es-hardware-pc-2.html>`__
ca: `Prova de maquinari d'un ordinador personal II. <../ test/ es-scarce-p-2.html>`__
