Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/informatica-hardware-comunicaciones.po
Languages: ca

source: A pesar de ser un estándar pensado para pantallas antiguas de tipo CRT y que ofrece peores prestaciones en las pantallas digitales LCD, se sigue utilizando en ordenadores y monitores actuales para guardar la compatibilidad con dispositivos antiguos.
ca: Tot i ser un estàndard dissenyat per a pantalles antigues de CRT i ofereix pitjors avantatges en les pantalles digitals LCD, encara s’utilitza en ordinadors i monitors actuals per emmagatzemar la compatibilitat amb dispositius antics.

source: Conector VGA macho.
ca: Connector VGA masculí.

source: El conector `DVI <https://es.wikipedia.org/wiki/Digital_Visual_Interface>`__ (Digital Visual Interface) es un estándar para comunicar vídeo que utiliza señales tanto analógicas como digitales.
ca: El `dvi <https://es.wikipedia.org/wiki/digital_visual_interface>`__ (interfície visual digital) és un estàndard per comunicar un vídeo que utilitza senyals analògics i digitals.

source: El conector DVI permite atornillar el cable a la caja del ordenador por lo que es más robusto que el conector HDMI.
ca: El connector DVI permet que el cable es cargola a la caixa de l’ordinador, de manera que sigui més robust que el connector HDMI.

source: Conector DVI macho.
ca: Connector DVI Macho.

source: El conector `HDMI <https://es.wikipedia.org/wiki/High-Definition_Multimedia_Interface>`__ (High-Definition Multimedia Interface) es un estándar que permite transferir tanto **vídeo** como **audio** con señales digitales.
ca: El `connector HDMI <https://es.wikipedia.org/wiki/hight

source: Este es uno de los estándares más utilizados en todo tipo de equipos multimedia nuevos, no solo en equipos informáticos.
ca: Aquest és un dels estàndards més utilitzats en tot tipus de nous equips multimèdia, no només en equips informàtics.

source: El conector es más frágil que otros conectores de vídeo y resulta más sencillo que se desconecte de manera inadvertida.
ca: El connector és més fràgil que altres connectors de vídeo i és més fàcil desconnectar de manera inadvertida.

source: Conector HDMI macho.
ca: Connector HDMI masculí.

source: `Evan-Amos <https://commons.wikimedia.org/wiki/File:HDMI-Connector.jpg>`__, via Wikimedia Commons.
ca: `Evan-amos <https://commons.wikimedia.org/wiki/file:hdmi-connector.jpg>`__, a través de Wikimedia Commons.

source: Comparación entre conexiones de vídeo
ca: Comparació entre connexions de vídeo

source: Señal
ca: Signar

source: Conector
ca: Connector

source: Contenido
ca: Content

source: Analógica
ca: Analògic

source: Robusto
ca: Robust

source: y digital
ca: i digital

source: Débil
ca: Feble

source: Audio y
ca: Àudio i

source: Conectores de red
ca: Connectors de xarxa

source: El estándar de red local `Ethernet <https://es.wikipedia.org/wiki/Ethernet>`__ se utiliza para conectar ordenadores en redes de área local, que suelen unir entre sí a ordenadores de un mismo edificio o incluso de diversos edificios que sean cercanos.
ca: L’estàndard de xarxa local `Ethernet <https://es.wikipedia.org/wiki/ethernet>`__ s’utilitza per connectar ordinadors en àrees locals, que normalment s’uneixen a ordinadors d’un mateix edifici o fins i tot de diversos edificis propers.

source: Los cables de cobre suelen soportar una distancia máxima de 100 metros, pero esta distancia se puede ampliar utilizando switch intermedios que hagan de repetidores o usando cables de fibra óptica.
ca: Els cables de coure solen suportar una distància màxima de 100 metres, però aquesta distància es pot estendre mitjançant un interruptor intermedi que fa que els repetidors o que utilitzin cables de fibra òptica.

source: Conector Ethernet RJ-45 hembra.
ca: Connector Ethernet RJ-45 Femení.

source: `Amin <https://commons.wikimedia.org/wiki/File:Ethernet_port.jpg>`__, `CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0/>`__, via Wikimedia Commons.
ca: `Amin <https://commons.wikimedia.org/wiki/file:ethernet_port.jpg>`__, `cc by-sa 4.0 <https://creativecommons.org/licenses/by-s/4.0/> __, a través de Wikimedia Commons.

source: Cable UTP de Ethernet con conector RJ-45 macho.
ca: Cable UTP Ethernet amb connector masculí RJ-45.

source: `David Monniaux <https://commons.wikimedia.org/wiki/File:Ethernet_RJ45_connector_p1160054.jpg>`__, `CC BY-SA 3.0 <https://creativecommons.org/licenses/by-sa/3.0/>`__, via Wikimedia Commons.
ca: `David Monniaux <https://commons.wikimedia.org/wiki/file:ethernet_rj45_connector_p1160054.jpg>` __, `cc by-sa 3.0 <https://creativecommons.org/licenses/by-sa/3.0/> `` `` `` `` `Wikimedia Commons.

source: El cable utilizado para las conexiones suele ser cable de cobre UTP (Unshielded Twisted Pair o par trenzado no apantallado). Este es un tipo de cable con peores prestaciones que los cables de fibra óptica, pero es más barato de instalar y sencillo de manejar, por lo que se utilizan mayoritariamente en conexiones cercanas, de decenas de metros.
ca: El cable que s’utilitza per a les connexions sol ser un cable de coure UTP (parella retorçada no protegida o un parell de trenat no shielt). Aquest és un tipus de cable amb pitjors avantatges que els cables de fibra òptica, però és més barat instal·lar -se i senzill de manejar, de manera que s’utilitzen principalment en connexions properes, desenes de metres.

source: Cable UTP de Ethernet, con cuatro pares de cable de cobre trenzados y sin apantallar.
ca: Cable UTP Ethernet, amb quatre parells de cable de coure trenat i no progut.

source: `Baran Ivo <https://commons.wikimedia.org/wiki/File:UTP_cable.jpg>`__, via Wikimedia Commons.
ca: `Baran Ivo <https://commons.wikimedia.org/wiki/file:utp_cable.jpg>`__, a través de Wikimedia Commons.

source: Estándares de comunicaciones Ethernet más usados con cable de cobre.
ca: Normes de comunicacions Ethernet més utilitzades amb cable de coure.

source: UTP Categoría 3
ca: Categoria UTP 3

source: UTP Categoría 5
ca: Categoria UTP 5

source: UTP Categoría 5e
ca: Categoria UTP 5

source: UTP Categoría 6A
ca: Categoria UTP 6A

source: Comunicación por fibra óptica
ca: Comunicació de fibra òptica

source: Los estándares de `comunicación por fibra óptica <https://es.wikipedia.org/wiki/Comunicaci%C3%B3n_por_fibra_%C3%B3ptica#Aplicaciones>`__ abarcan desde enlaces domésticos para audio digital, pasando por enlaces de alta velocidad y grandes distancias para Ethernet, hasta enlaces intercontinentales para comunicaciones por Internet.
ca: Els estàndards de la comunicació de fibra òptica <https://es.wikipedia.org/wiki/comunicaci%C3%B3n_por_fibra_%C3%B3ptica#aplicaciones> `__ cobertura de enllaços domèstics per a àudio digital, mitjançant enllaços altes i grans distàncies per a Ethernet, encara intercontinental.

source: La tecnología más conocida por la mayoría de las personas es la `FTTH o fibra hasta el hogar <https://es.wikipedia.org/wiki/Fibra_hasta_la_casa>`__, que instalan las compañías telefónicas para dar acceso a Internet en los hogares.
ca: La tecnologia més coneguda per la majoria de la gent és la `ftth o la fibra a casa <https://es.wikipedia.org/wiki/fibra_hsta_la_casa>`__, que instal·len empreses telefòniques per donar accés a Internet a les llars.

source: Las ventajas de la fibra óptica frente a los cables de cobre consisten en que puede llevar información a mucha mayor velocidad. Además los cables de fibra óptica pueden alcanzar distancias mucho mayores sin pérdidas en la señal.
ca: Els avantatges de la fibra òptica contra els cables de coure són que pot transportar informació a una velocitat molt més alta. A més, els cables de fibra òptica poden arribar a distàncies molt més grans sense pèrdues de senyal.

source: Las desventajas de la fibra óptica consisten en su mayor costo y su mayor dificultad de instalación.
ca: Els desavantatges de la fibra òptica consisteixen en el seu major cost i la seva major dificultat d’instal·lació.

source: El estándar `wifi <https://es.wikipedia.org/wiki/Wifi>`__ es una tecnología que permite conectar equipos entre sí o a Internet de forma inalámbrica. Es la versión inalámbrica del estándar Ethernet, de redes locales.
ca: L’estàndard `wifi <https://es.wikipedia.org/wiki/wifi>`__ és una tecnologia que permet connectar equips entre ells o a Internet sense fils. És la versió sense fils de l'estàndard Ethernet de les xarxes locals.

source: La gran ventaja que tiene consiste en que no necesita cables para realizar las conexiones.
ca: El gran avantatge que té és que no necessita cables per fer les connexions.

source: La principal desventaja de las redes wifi se basa en que comparte el medio de transmisión, el aire, con todos los demás equipos. Esto hace que se congestione cuando hay muchos equipos funcionando cerca unos de otros y puede tener brechas de seguridad (robo o espionaje de las señales wifi).
ca: El principal desavantatge de les xarxes WI -FI es basa en compartir el mitjà de transmissió, aire, amb la resta d’equips. Això ho fa congestionat quan hi ha molts equips que treballen a prop i poden tenir buits de seguretat (robatori o espionatge de senyals WiFi).

source: Existen muchos estándares distintos dentro del wifi. Los más modernos, como el `802.11ax o Wi-Fi 6 <https://es.wikipedia.org/wiki/IEEE_802.11ax>`__ de 2020, pueden llegar a transmitir a velocidades mayores de 60 Mbyte/s hasta distancias de 100 o más metros, dependiendo de los obstáculos que se encuentre la señal. Cuanto mayor sea la distancia o los obstáculos, menor será la velocidad de transmisión.
ca: Hi ha molts estàndards diferents dins del WI -FI. Els més moderns, com el `802.11ax o Wi-Fi 6 <https://es.wikipedia.org/wiki/ieee_802.11ax>` `` de 2020, poden transmetre a velocitats superiors a 60 mbyte/s fins a distàncies de 100 o més metres, depenent de les obstacles que es troba el senyal. Com més gran sigui la distància o els obstacles, més baixa és la velocitat de transmissió.

source: Logotipo del estándar Wifi.
ca: Logotip estàndard Wi -Fi.

source: `Autor <https://commons.wikimedia.org/wiki/File:WiFi_Logo.svg>`__, via Wikimedia Commons.
ca: `Autor <https://commons.wikimedia.org/wiki/file:wifi_ogo.svg>`__, a través de Wikimedia Commons.

source: El estándar `Bluetooth <https://es.wikipedia.org/wiki/Bluetooth>`__ de comunicaciones inalámbricas sirve para facilitar las comunicaciones entre dispositivos móviles, sin utilizar cables. El Bluetooth es capaz de conectar el teléfono inteligente a unos auriculares inalámbricos o al sistema de manos libres de un automóvil.
ca: El estàndard `Bluetooth <https://es.wikipedia.org/wiki/bluetooth>`__ Les comunicacions sense fils serveixen per facilitar les comunicacions entre dispositius mòbils, sense utilitzar cables. El Bluetooth és capaç de connectar el telèfon intel·ligent a auriculars sense fils o al sistema sense mans d’un cotxe.

source: Este estándar también sirve para realizar transferencias de archivos entre dispositivos, por ejemplo, para imprimir un documento en una impresora desde un ordenador portátil sin utilizar cables.
ca: Aquesta norma també serveix per fer transferències de fitxers entre dispositius, per exemple, per imprimir un document en una impressora des d’un ordinador portàtil sense utilitzar cables.

source: Este estándar tiene un alcance más limitado que la conexión Wifi (unos 10 metros) y es menos versátil. Como ventaja, tiene un consumo mucho menor que la conexión Wifi.
ca: Aquesta norma té un rang més limitat que la connexió Wi -FI (uns 10 metres) i és menys versàtil. Com a avantatge, té un consum molt inferior a la connexió Wi -FI.

source: Logotipo del estándar Bluetooth.
ca: Logotip estàndard Bluetooth.

source: `Bluetooth SIG, Inc. <https://commons.wikimedia.org/wiki/File:BluetoothLogo.svg>`__, via Wikimedia Commons.
ca: `Bluetooth Sig, Inc. <https://commons.wikimedia.org/wiki/file:bluetoothogo.svg>`__, a través de Wikimedia Commons.

source: Test de la unidad
ca: Test de prova

source: `Test de comunicaciones I. <../test/es-hardware-comunicaciones-1.html>`__
ca: `Test de comunicacions I. <../ Test/ Es-Hardware-Communications-1.html>`__ __

source: `Test de comunicaciones II. <../test/es-hardware-comunicaciones-2.html>`__
ca: `Test de comunicacions II. <../ Test/ es-Hardware-Communications-2.html>`__

source: `Test de comunicaciones III. <../test/es-hardware-comunicaciones-3.html>`__
ca: `Test de comunicacions III. <../ Test/ es-Hardware-Communications-3.html> `__

source: `Test de comunicaciones IV. <../test/es-hardware-comunicaciones-4.html>`__
ca: `IV Test de comunicacions. <../ test/ es-hardware-comunicacions-4.html>`__
