Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/informatica-hardware-cpu.po
Languages: ca

source: Por encima de ellas están las CPU de 32 bits, mucho más potentes y rápidas. Son las utilizadas en smartphones, smartTV, impresoras, etc.
ca: A sobre d'ells hi ha la CPU de 32 bits, molt més potent i ràpid. Són els que s’utilitzen en telèfons intel·ligents, smartTV, impressores, etc.

source: Los ordenadores personales actuales utilizan, en la mayoría de los casos, procesadores y software de 64 bits.
ca: Els ordinadors personals actuals utilitzen, en la majoria dels casos, processadors i programari de 64 bits.

source: Tipo de buses
ca: Tipus d’autobusos

source: Es el tipo de comunicación con el que se transfiere información entre el procesador y el resto de elementos del ordenador. Cuantos más buses tenga un procesador y más rápidos sean, mayor será su rendimiento.
ca: És el tipus de comunicació amb la qual es transfereix informació entre el processador i la resta d’elements de l’ordinador. Com més autobusos té un processador i més ràpid, més gran serà el vostre rendiment.

source: Actualmente los procesadores de ordenador personal tienen tres buses de comunicaciones con el exterior, para mejorar la velocidad de transferencia:
ca: Actualment, els processadors d’ordinadors personals tenen tres autobusos de comunicacions amb l’exterior, per millorar la velocitat de transferència:

source: Bus directo con la memoria RAM.
ca: Bus directe amb RAM.

source: Bus directo con los puertos PCI Express.
ca: Bus directe amb ports expressos PCI.

source: Bus DMI para conectar con el resto de dispositivos (USB, PCI, Sata, Ethernet, etc).
ca: Bus DMI per connectar -se amb la resta de dispositius (USB, PCI, SATA, Ethernet, etc.).

source: Pruebas de rendimiento
ca: Proves de rendiment

source: Las pruebas de rendimiento, también llamadas `benchmark <https://es.wikipedia.org/wiki/Benchmark_(inform%C3%A1tica)>`__, son una técnica para medir el rendimiento de un sistema informático o de sus componentes por separado.
ca: Les proves de rendiment, també anomenades `Benchmark <https://es.wikipedia.org/wiki/benchmark_ (Informar%c3%a1tica)>`__, són una tècnica per mesurar el rendiment d'un sistema informàtic o els seus components per separat.

source: Son pruebas muy útiles a la hora de comparar procesadores entre sí. Debido a la gran cantidad de parámetros o características que definen a un procesador, no es sencillo calcular su rendimiento final. Sin embargo las pruebas benchmark darán un simple número que representa aproximadamente la potencia de un procesador.
ca: Són evidències molt útils quan es comparen els processadors. A causa de la gran quantitat de paràmetres o característiques que defineixen un processador, no és fàcil calcular el seu rendiment final. Tanmateix, les proves de referència donaran un nombre senzill que representa aproximadament la potència d’un processador.

source: Test clásicos muy conocidos son los siguientes.
ca: Les proves clàssiques conegudes són les següents.

source: MIPS
ca: Bips

source: Los `MIPS <https://es.wikipedia.org/wiki/Millones_de_instrucciones_por_segundo>`__ o millones de instrucciones por segundo.
ca: Els `mips <https://es.wikipedia.org/wiki/millones_de_instrucciones_por_segundo>`__ o milions d'instruccions per segon.

source: Es un test muy útil para comparar de forma relativa procesadores a lo largo de la historia y ver cómo crece la potencia de cómputo de forma exponencial con el tiempo. A pesar de todo es un test con ciertos problemas a la hora de comparar diferentes arquitecturas, por lo que ha caído en desuso.
ca: És una prova molt útil per comparar relativament els processadors al llarg de la història i veure com la potència informàtica creix exponencialment amb el pas del temps. Malgrat tot, és una prova amb certs problemes quan es compara diferents arquitectures, de manera que ha caigut en desús.

source: Un ordenador personal típico de 2022 tiene aproximadamente 200 000 MIPS.
ca: Un ordinador personal típic de 2022 té aproximadament 200.000 MIPS.

source: FLOPS
ca: Bangeres

source: Los `FLOPS <https://es.wikipedia.org/wiki/Operaciones_de_coma_flotante_por_segundo>`__ u operaciones de coma flotante por segundo, mide cuántas operaciones matemáticas con decimales es capaz de realizar un ordenador. Son habituales los múltiplos, así un MFLOPS es igual a 1 millón de operaciones en coma flotante por segundo.
ca: Els `flops <https://es.wikipedia.org/wiki/operations_de_coma_flotant_por_segundo>`__ O Operacions de coma flotant per segon, mesura quantes operacions matemàtiques amb decimals és capaç de fer un ordinador. Els múltiples són habituals, per la qual cosa un mflops és igual a un milió d’operacions en coma flotant per segon.

source: Esta medida es útil para conocer cómo es de rápida una máquina para resolver problemas científicos y de cálculo intensivo.
ca: Aquesta mesura és útil per saber com una màquina és ràpida per resoldre problemes científics i càlcul intensiu.

source: Un ordenador personal típico de 2022 tiene aproximadamente 50 000 MFLOPS.
ca: Un ordinador personal típic de 2022 té aproximadament 50.000 mflops.

source: SPECint y SPECfp
ca: Specint i spefp

source: `Standard Performance Evaluation Corporation (SPEC) <https://es.wikipedia.org/wiki/Standard_Performance_Evaluation_Corporation>`__ es un consorcio sin fines de lucro que incluye a vendedores de computadoras, integradores de sistemas, universidades, grupos de investigación, publicadores y consultores de todo el mundo. Tiene dos objetivos: crear un benchmark estándar para medir el rendimiento de computadoras y controlar y `publicar los resultados de estos tests <http://www.spec.org/>`__.
ca: `Standard Performance Avaluation Corporation (SPEC) <https://es.wikipedia.org/wiki/standard_performance_evaluation_corporation>` __ és un consorci sense ànim de lucre que inclou ordinadors venedors, integradors de sistemes, universitats, grups de recerca, grups de publicació i consultors del món. Té dos objectius: crear un punt de referència estàndard per mesurar el rendiment i el control de l’ordinador i publicar els resultats d’aquestes proves <http://www.spec.org/>`__.

source: Otros test:
ca: Altres proves:

source: PassMark
ca: Passeig

source: El `Test PassMark <https://www.cpubenchmark.net/>`__ es uno de los test comerciales más conocidos para ordenadores personales.
ca: El "Test Passmark <https://www.cpubenchmark.net/>`__ és una de les proves comercials més conegudes per a ordinadors personals.

source: Test de la unidad
ca: Test de prova

source: `Test de procesadores I <../test/es-hardware-procesadores-1.html>`__
ca: `Processadors Test I <../test/es-scroll-processes-1.html>`__

source: `Test de procesadores II <../test/es-hardware-procesadores-2.html>`__
ca: `Processadors Test II <../test/Es-Hardware-Processors-2.html>`__

source: `Test de procesadores III <../test/es-hardware-procesadores-3.html>`__
ca: `Processadors Test III <../test/es-Scroll-Processors-3.html>`__

source: `Test de procesadores IV <../test/es-hardware-procesadores-4.html>`__
ca: `Prova de processadors IV <../test/es-scroll-processes-4.html>`__
