Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/informatica-hardware-almacenamiento.po
Languages: ca

source: Violeta (405 nm)
ca: Violet (405 nm)

source: Costo de la unidad de lectura / escritura
ca: Cost unitari de lectura / escriptura

source: Costo del disco
ca: Cost del disc

source: Costo por gigabyte
ca: Cost per gigabyte

source: Año de lanzamiento
ca: Any de llançament

source: Diámetro de disco
ca: Diàmetre del disc

source: Discos ópticos Blu-ray.
ca: Discos òptics Blu-ray.

source: En el momento en el que salieron al mercado, estas unidades de almacenamiento óptico tenían más capacidad que los propios discos duros, por lo que era un método de almacenamiento muy barato para realizar backup o copias de seguridad. Hoy en día, la capacidad de los discos duros ha crecido tanto que su costo de almacenamiento ha bajado muchísimo, hasta los 0,023 €/GB, por lo que ya no son rentables estas unidades ópticas para almacenar grandes cantidades de datos.
ca: En el moment en què van anar al mercat, aquestes unitats d’emmagatzematge òptic tenien més capacitat que els discos durs, per la qual cosa era un mètode d’emmagatzematge molt barat per realitzar còpies de seguretat o còpies de seguretat. Avui en dia, la capacitat dels discs durs ha crescut tant que el seu cost d’emmagatzematge ha reduït molt, fins a 0,023 €/GB, de manera que aquestes unitats òptiques ja no són rendibles per emmagatzemar grans quantitats de dades.

source: Las memorias USB también han crecido exponencialmente en su capacidad y en 2022 una unidad con mayor capacidad que un Blu-ray es relativamente barata (5€). Aunque el precio por gigabyte siga siendo algo mayor en las memorias USB (0,12 - 0,05€/gigabyte) que en un Blu-ray, su mayor versatilidad y facilidad de lectura/escritura han hecho que asuman muchas aplicaciones que antes se realizaban con discos ópticos, tales como los reproductores de música.
ca: Els records USB també han crescut exponencialment en la seva capacitat i el 2022 una unitat amb una capacitat més gran que un Blu-ray és relativament barat (5 €). Tot i que el preu per gigabyte es manté una mica més gran en els records USB (0,12 - 0,05 €/gigabyte) que en un blu -ray, la seva major versatilitat i facilitat de lectura/escriptura han provocat moltes aplicacions que abans feien amb discos òptics, com ara jugadors de música.

source: Hace años era frecuente que los programas se vendieran grabados en discos ópticos. Hoy en día, gracias a las redes de fibra óptica, se ha popularizado la descarga de programas por Internet y los discos de almacenamiento virtual como medio de transmisión de datos entre particulares.
ca: Anys enrere era habitual que els programes es venguessin enregistrats en discos òptics. Avui, gràcies a les xarxes de fibra òptica, s'ha popularitzat la descàrrega de programes d'Internet i els discos d'emmagatzematge virtual com a mitjà de transmissió de dades entre individus.

source: Por todas estas razones el uso de discos ópticos ha decaído poco a poco y hoy en día son muy pocas las aplicaciones en las que tienen alguna ventaja.
ca: Per tots aquests motius, l’ús de discos òptics ha disminuït a poc i avui hi ha molt poques aplicacions en les quals tenen un avantatge.

source: La `cinta magnética <https://es.wikipedia.org/wiki/Cinta_magn%C3%A9tica_de_almacenamiento_de_datos>`__ es un soporte de almacenamiento basado en una cinta de plástico impregnada en su superficie con material magnético y enrollada en un cartucho. Ha sido uno de los primeros medios de almacenamiento masivo de datos desde el origen de la informática.
ca: La `cinta magnètica <https://es.wikipedia.org/wiki/cinta_magen%C3%A9Tica_de_almacecione_de_datos>` __ És un suport d'emmagatzematge basat en una cinta de plàstic impregnat a la seva superfície amb material magnètic i enrotllat en un cartró. Ha estat un dels primers mitjans d’emmagatzematge massiu de dades des de l’origen de la informàtica.

source: Tiene algunas desventajas, como es su acceso secuencial a la información y por lo tanto su lentitud. Su mayor ventaja es su bajo precio por gigabyte, pudiendo almacenar la misma información que un disco duro por menos precio.
ca: Té alguns desavantatges, com ara el seu accés seqüencial a la informació i, per tant, la seva lentitud. El seu avantatge més gran és el seu preu baix per Gigabyte, poder emmagatzemar la mateixa informació que un disc dur per menys preu.

source: Hoy en día su uso se limita a realizar copias de respaldo de grandes cantidades de datos. La tecnología más conocida es la LTO (Linear Tape Open), que en su versión LTO-9 es capaz de almacenar hasta 18 terabytes de datos en un solo cartucho.
ca: Avui el seu ús es limita a fer còpies de suport de grans quantitats de dades. La tecnologia més coneguda és la LTO (Linear Tape Open), que en la seva versió LTO-9 és capaç d’emmagatzemar fins a 18 terabytes de dades en un sol cartutx.

source: Cinta magnética LTO-2.
ca: Cinta magnètica LTO-2.

source: El `disquete o disco flexible <https://es.wikipedia.org/wiki/Disquete>`__ es una tecnología basada en un disco de plástico flexible impregnado en su superficie con un material ferromagnético que almacena la información y encapsulado en una carcasa de papel o plástico.
ca: El `disquet o disc <https://es.wikipedia.org/wiki/disqueque>`__ és una tecnologia basada en un disc de plàstic flexible impregnat a la seva superfície amb un material ferromagnètic que emmagatzema informació i encapsulat en un paper o un habitatge de plàstic.

source: Los disquetes o floppies llegaron a dominar el almacenamiento externo durante cerca de 30 años, sobre todo en las décadas de 1980 y 1990, pero actualmente son una tecnología obsoleta.
ca: Els disquets o disquets van arribar a dominar l’emmagatzematge extern durant uns 30 anys, especialment als anys vuitanta i noranta, però actualment són una tecnologia obsoleta.

source: Su influencia pasada puede observarse en la actualidad en los iconos de grabación de datos en disco, que se suelen representar con un disco flexible de 3 1/2 pulgadas.
ca: La seva influència passada es pot veure avui en les icones de gravació de dades de disc, que normalment es representen amb un disc flexible de 3 1/2 polzades.

source: Discos flexibles (floppy disks) de diferentes tamaños.
ca: Discos flexibles (disquets) de diferents mides.

source: Almacenamiento en red
ca: Emmagatzematge a la xarxa

source: Los dispositivos de almacenamiento en red son dispositivos especializados en el almacenamiento de datos a los que se accede a través de una red local Ethernet o a través de Internet, dando la impresión de que se está trabajando con una unidad de almacenamiento local.
ca: Els dispositius d’emmagatzematge de xarxa són dispositius especialitzats en l’emmagatzematge de dades que s’accedeix a través d’una xarxa local Ethernet o a Internet, donant la impressió que el treball s’està fent amb una unitat d’emmagatzematge local.

source: El almacenamiento en red permite que la información y los recursos de almacenamiento se puedan optimizar y compartir entre varios ordenadores.
ca: L’emmagatzematge de xarxa permet optimitzar i compartir recursos d’informació i emmagatzematge entre diversos ordinadors.

source: El `servidor NAS (Network Attached Storage) <https://es.wikipedia.org/wiki/Almacenamiento_conectado_en_red>`__ es un ordenador dedicado a almacenar datos en sus unidades de disco o de estado sólido y enviar o recibir estos datos a través de la red local. Permite almacenar, recuperar y compartir los datos en un punto centralizado para todos los ordenadores de una red local.
ca: El `NAS Server (emmagatzematge adjunt de xarxa) <https://es.wikipedia.org/wiki/almacechión_conecado_en_red>`__ és un ordinador dedicat a emmagatzemar dades al vostre disc o unitats d'estat sòlid i enviar o rebre aquestes dades a través de la xarxa local. Permet emmagatzemar, recuperar i compartir les dades en un punt centralitzat per a tots els equips d’una xarxa local.

source: Normalmente los servidores NAS son equipos diseñados para atender exclusivamente a esta función. Contienen varias bahías para añadir unidades de almacenamiento (HDD o SSD) en conexión :term:`RAID` para aumentar sus prestaciones.
ca: NASS NAS normalment són equips dissenyats per servir a aquesta funció exclusivament. Contenen diverses badies per afegir unitats d’emmagatzematge (HDD o SSD) en connexió: TER: `RAID 'per augmentar el seu rendiment.

source: Synology DiskStation NAS (Network Attached Storage) de 6 bahías.
ca: Synology Diskstation NAS (emmagatzematge adjunt de xarxa) de 6 badies.

source: La `nube <https://es.wikipedia.org/wiki/Computaci%C3%B3n_en_la_nube>`__ es el nombre comercial que se le ha dado a los centros de datos, compuestos por multitud de ordenadores que pueden actuar como servidores de datos o como servidores de aplicaciones online.
ca: El `Cloud <https://es.wikipedia.org/wiki/computaci%C3%B3n_en_la_nube>`__ és el nom comercial que s'ha donat als centres de dades, compost per una multitud d'ordinadors que poden actuar com a servidors de dades o com a servidors d'aplicacions en línia.

source: Estos centros de datos pertenecen a grandes compañías como `Amazon (Amazon Web Services) <https://es.wikipedia.org/wiki/Amazon_Web_Services>`__, `Microsoft (Azure) <https://es.wikipedia.org/wiki/Microsoft_Azure>`__, `Google (Google Cloud Platform) <https://es.wikipedia.org/wiki/Google_Cloud>`__ u otras compañías menores.
ca: Aquests centres de dades pertanyen a grans empreses com ara Amazon (Amazon Web Services) <https://es.wikipedia.org/wiki/amazon_web_services>`__,` microsoft (azure) <https: /es.wikipedia.org/wiki/microsoft_azure> `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `Google (Google Cloud Platform) <https://es.wikipedia.org/wiki/google_cloud>`__ o altres empreses menors.

source: La nube puede ser utilizada por usuarios particulares, por ejemplo, cuando almacenamos nuestros datos en Google Drive, o puede ser usada por grandes compañías como Netflix, que almacena sus series y películas en los servidores de Amazon (AWS) para servirlos por streaming.
ca: El núvol pot ser utilitzat per usuaris privats, per exemple, quan emmagatzemem les nostres dades a Google Drive, o pot ser utilitzat per grans empreses com Netflix, que emmagatzema la seva sèrie i pel·lícules a Amazon Servers (AWS) per servir -les en streaming.

source: Vídeo: `Inside a Google data center. <https://www.youtube-nocookie.com/embed/XZmGGAbHqa0>`__
ca: VÍDEO: `Dins de Google Data Center. <https://www.youtube-nocokie.com/embed/xzmggabhqa0>`__

source: Test de la unidad
ca: Test de prova

source: `Test de almacenamiento de la información I. <../test/es-hardware-almacenamiento-1.html>`__
ca: `Prova d'emmagatzematge d'informació

source: `Test de almacenamiento de la información II. <../test/es-hardware-almacenamiento-2.html>`__
ca: `Prova d'emmagatzematge d'informació II. <../test/es-scarce-scoring-2.html>`__

source: `Test de almacenamiento de la información III. <../test/es-hardware-almacenamiento-3.html>`__
ca: `Prova d'emmagatzematge d'informació III. <../test/es-scarce-scoring-3.html>`__

source: `Test de almacenamiento de la información IV. <../test/es-hardware-almacenamiento-4.html>`__
ca: `Prova d'emmagatzematge d'informació IV. <../test/es-Hardware-Summaceing-4.html>`__

source: `Test de almacenamiento de la información V. <../test/es-hardware-almacenamiento-5.html>`__
ca: `Prova d'emmagatzematge d'informació V. <../test/es-Scourge-Counting-5.html>`__

source: `Test de almacenamiento de la información VI. <../test/es-hardware-almacenamiento-6.html>`__
ca: `Prova d'emmagatzematge d'informació vi. <../test/es-Hardware-Summaceing-6.html>`__
