Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/informatica-hardware-almacenamiento.po
Languages: ca

source: Almacenamiento de información
ca: Emmagatzematge d'informació

source: Los ordenadores son dispositivos que tratan y transforman información, por lo que los dispositivos que almacenan esta información son fundamentales para determinar la capacidad y velocidad del ordenador.
ca: Els ordinadors són dispositius que tracten i transformen la informació, de manera que els dispositius que emmagatzemen aquesta informació són fonamentals per determinar la capacitat i la velocitat de l’ordinador.

source: Índice de contenidos:
ca: Índex de contingut:

source: Clasificación de dispositivos de almacenamiento
ca: Classificació dels dispositius d'emmagatzematge

source: **Según su posición y vinculación al ordenador local:**
ca: ** Segons la seva posició i enllaç a l'ordinador local: **

source: Almacenamiento primario
ca: Emmagatzematge primari

source: Memoria RAM
ca: Carner

source: Memoria caché
ca: Memòria de la memòria cau

source: Búfer de datos
ca: Buffer de dades

source: Almacenamiento secundario
ca: Emmagatzematge secundari

source: Memoria ROM
ca: Memòria de Rom

source: Disco de estado sólido SSD
ca: Disc d’estat sòlid SSD

source: Disco duro magnético HDD
ca: Disc dur magnètic HDD

source: Almacenamiento externo
ca: Emmagatzematge extern

source: Unidades ópticas CD-ROM, DVD, Blu-ray
ca: Unitats de CD-ROM, DVD, Blu-ray

source: Memoria USB
ca: Memòria USB

source: Tarjetas SD
ca: Targetes SD

source: Cinta magnética
ca: Cinta magnètica

source: Almacenamiento virtual
ca: Emmagatzematge virtual

source: Equipos NAS
ca: Equips de la NAS

source: Almacenamiento en la nube
ca: Emmagatzematge de núvol

source: **Según su método de almacenamiento:**
ca: ** Segons el vostre mètode d'emmagatzematge: **

source: Dispositivos de estado sólido
ca: Dispositius d’estat sòlid

source: Unidad de estado sólido SSD
ca: Unitat d’estat sòlid SSD

source: Memorias USB
ca: Memòries USB

source: Dispositivos de almacenamiento magnético
ca: Dispositius d’emmagatzematge magnètic

source: Discos duros HDD
ca: HDD Hard Drives

source: Dispositivos de almacenamiento óptico
ca: Dispositius d’emmagatzematge òptic

source: Discos DVD
ca: Discos de DVD

source: Las memorias de almacenamiento primario son los dispositivos que contienen la información con la que el procesador está trabajando. Son las memorias más rápidas y cercanas a la unidad central de proceso.
ca: Les memòries d’emmagatzematge primàries són els dispositius que contenen la informació amb què funciona el processador. Són els records més ràpids i ràpids a prop de la unitat de procés central.

source: La `memoria RAM <https://es.wikipedia.org/wiki/Memoria_de_acceso_aleatorio>`__ o memoria de acceso aleatorio es una memoria de almacenamiento temporal para los programas y datos que maneja la CPU.
ca: El `Ram

source: La memoria RAM debe ser muy rápida para no ralentizar la velocidad de la unidad central de proceso (CPU). Una memoria RAM actual puede transferir más de 20 gigabytes por segundo.
ca: La memòria RAM ha de ser molt ràpida per no alentir la velocitat de la unitat de procés central (CPU). Una memòria RAM actual pot transferir més de 20 gigabytes per segon.

source: También debe tener suficiente tamaño para contener todos los programas, apps y datos que se estén ejecutando de forma simultanea en el ordenador. En 2022, un smartphone medio suele tener de 4 a 8 gigabytes de RAM y un ordenador personal, de 8 a 16 gigabytes de RAM.
ca: També ha de ser suficient per contenir tots els programes, aplicacions i dades que s’estan executant simultàniament a l’ordinador. El 2022, un telèfon intel·ligent mitjà sol tenir gigabytes de 4 a 8 ram i un ordinador personal, de 8 a 16 gigabytes de ram.

source: Módulo de memoria RAM DDR4
ca: Mòdul RAM DDR4

source: La desventaja de la memoria RAM consiste en que pierde sus datos cuando se apaga la alimentación del ordenador. Además suele ser mucho más cara que las memorias de almacenamiento secundario, 5€/gigabyte de una memoria RAM frente a 0,02€/gigabyte de un disco duro en 2022.
ca: El desavantatge de la memòria RAM és que perd les seves dades quan el feed de l'ordinador està desactivat. També és molt més car que els records d’emmagatzematge secundari, 5 €/gigabyte d’una memòria RAM en comparació amb 0,02 €/gigabyte d’un disc dur el 2022.

source: La `memoria caché <https://es.wikipedia.org/wiki/Cach%C3%A9_(inform%C3%A1tica)>`__ es un tipo de memoria rápida que almacena temporalmente los contenidos leídos de la memoria RAM para que las posteriores peticiones de lectura se puedan atender con mayor rapidez.
ca: El `Cache <https://es.wikipedia.org/wiki/cach%C3%A9_ (Informe%C3%A1tica)>` __ és un tipus de memòria ràpida que emmagatzema temporalment el contingut llegit de la memòria Ram de manera que les sol·licituds de lectura posteriors es poden tractar més ràpidament.

source: Funciona de manera semejante a la memoria RAM, pero es de menor tamaño y de acceso más rápido. Surgió cuando la memoria RAM ya no fue capaz de trabajar a la misma velocidad del procesador y sirve para que el procesador reduzca el tiempo de acceso a los datos y programas ubicados en la memoria RAM que se utilizan con más frecuencia.
ca: Funciona similar a la RAM, però és més petit i ràpid. Va sorgir quan la memòria RAM ja no era capaç de treballar a la mateixa velocitat del processador i serveix per al processador per reduir el temps d’accés a les dades i programes situats a la memòria RAM que s’utilitzen amb més freqüència.

source: Hoy en día la memoria caché de la RAM suele estar integrada dentro del propio procesador y suele tener un tamaño de varios megabytes.
ca: Avui la memòria cau de la memòria RAM s’integra generalment al propi processador i sol tenir una mida de diversos megabytes.

source: Los dispositivos de almacenamiento secundario de un ordenador son memorias no volátiles, es decir, que almacenan datos a pesar de que el ordenador no tenga alimentación. Se suelen instalar de forma permanente en el interior del ordenador para que almacenen el sistema operativo y los diferentes programas y datos de uso habitual.
ca: Els dispositius d’emmagatzematge secundaris d’un ordinador són records no volàtils, és a dir, emmagatzemen dades tot i que l’ordinador no té menjar. Normalment s’instal·len permanentment a l’ordinador per emmagatzemar el sistema operatiu i els diferents programes i dades per a ús habitual.

source: Los dispositivos de almacenamiento secundario son más lentos que los de almacenamiento primario. Como contrapartida tienen mayor capacidad de almacenamiento.
ca: Els dispositius d’emmagatzematge secundaris són més lents que l’emmagatzematge primari. Com a contrapart, tenen una capacitat d’emmagatzematge més gran.

source: La `memoria ROM <https://es.wikipedia.org/wiki/Imagen_ROM>`__ (Read Only Memory) o memoria de solo lectura es una memoria de almacenamiento permanente de programas y datos del ordenador. En esta memoria se almacena el denominado `Firmware <https://es.wikipedia.org/wiki/Firmware>`__, programas de solo lectura que manejan un dispositivo.
ca: La "memòria ROM <https://es.wikipedia.org/wiki/imagen_rom>`__ (només llegiu la memòria) o la memòria només és una memòria d'emmagatzematge permanent de programes i dades informàtiques. En aquesta memòria, el So -Called `Firmware <https://es.wikipedia.org/wiki/firmware>`__, llegint programes únics que gestionen un dispositiu.

source: Muchas memorias ROM que se utilizan hoy en día no son realmente de solo lectura. Suelen estar basadas en tecnología Flash y se pueden reescribir múltiples veces. Por esta razón, hoy en día a esta memoria también se la denomina memoria Flash.
ca: Molts records de ROM que s’utilitzen avui en dia no estan llegint realment. Normalment es basen en la tecnologia flash i es poden reescriure diverses vegades. Per aquest motiu, avui aquesta memòria també s’anomena memòria flash.

source: Las memorias Flash suelen ser más lentas, más sencillas y de menor capacidad que las memorias incluidas en las unidades SSD, aunque ambas estén basadas internamente en una tecnología similar.
ca: Les memòries flash solen ser més lentes, més senzilles i menys capacitat que les memòries incloses en les unitats SSD, tot i que ambdues es basen internament en una tecnologia similar.

source: Ejemplos de memoria ROM son la memoria del BIOS (Sistema Básico de Entrada Salida) de un ordenador personal, o el programa interno de dispositivos como un router, un mando a distancia, etc.
ca: Exemples de ROM són la memòria del BIOS (sistema de sortida bàsic) d’un ordinador personal o del programa intern de dispositius com un encaminador, un control remot, etc.

source: Memoria ROM Phoenix BIOS de una placa base de ordenador personal.
ca: Phoenix BIOS ROM Memòria d’una placa d’ordinador personal.

source: Unidad de disco duro (HDD)
ca: Unitat de disc dur (HDD)

source: La `unidad de disco duro <https://es.wikipedia.org/wiki/Unidad_de_disco_duro>`__ es un tipo de memoria secundaria basada en un disco giratorio impregnado con una sustancia magnética que permite almacenar información de forma permanente.
ca: La `unitat de disc dur <https://es.wikipedia.org/wiki/unitat_disco_duro>`__ és un tipus de memòria secundària basada en un disc rotatiu impregnat amb una substància magnètica que permet emmagatzemar informació permanent.

source: Los discos duros son los encargados de almacenar los programas y los datos para que se mantengan mientras el ordenador está apagado.
ca: Els discos durs són els responsables d’emmagatzemar programes i dades per mantenir -les mentre l’ordinador estigui desactivat.

source: Cuando un usuario de ordenador quiere utilizar un programa o visualizar un archivo de datos, la información se lee desde el disco duro y pasa a escribirse en la memoria RAM para que la CPU pueda trabajar con ellos.
ca: Quan un usuari de l’ordinador vol utilitzar un programa o visualitzar un fitxer de dades, la informació es llegeix des del disc dur i s’escriu en RAM perquè la CPU pugui treballar amb ells.

source: Los discos duros llevan muchos años en el mercado (desde 1956) por lo que se basan en tecnologías asentadas y muy optimizadas. A pesar de ello, se van sustituyendo poco a poco por los SSD por las múltiples ventajas que presentan estos últimos.
ca: Els discos durs han estat al mercat durant molts anys (des de 1956), de manera que es basen en tecnologies resoltes i molt optimitzades. Malgrat això, es substitueixen gradualment per les SSD pels múltiples avantatges que aquests presenten.

source: Unidad de disco duro (HDD) con conexión SATA, vista desde abajo.
ca: Unitat de disc dur (HDD) amb connexió SATA, vista des de baix.

source: Unidad de estado sólido (SSD)
ca: Unitat d’estat sòlid (SSD)

source: La `unidad de estado sólido <https://es.wikipedia.org/wiki/Unidad_de_estado_s%C3%B3lido>`__ es un tipo de memoria secundaria basada en chips de tecnología Flash que almacenan información de forma permanente.
ca: La `unitat d'estat sòlid <https://es.wikipedia.org/wiki/unitat_de_s%C3%B3lido>`__ és un tipus de memòria secundària basada en xips de tecnologia flash que emmagatzemen definitivament informació.

source: Son más modernos en el mercado (desde 1989) que los discos duros y tienen menos capacidad a igualdad de precio, pero van mejorando rápidamente con los años y están sustituyendo poco a poco a los discos duros tradicionales.
ca: Són més moderns al mercat (des de 1989) que els discs durs i tenen menys capacitat d’igualtat de preus, però milloren ràpidament al llarg dels anys i substitueixen gradualment els discs durs tradicionals.

source: Unidad de almacenamiento de estado sólido (SSD) con conexión PCI Express.
ca: Unitat d’emmagatzematge d’estat sòlid (SSD) amb connexió PCI Express.

source: Comparativa entre HDD y SSD
ca: Comparació entre HDD i SSD

source: Ventajas de los SSD:
ca: Avantatges dels SSD:

source: Mayor velocidad de transferencia. Más de 600 megabytes/s de un SSD frente a 100 megabytes/s de un HDD.
ca: Velocitat de transferència més alta. Més de 600 megabytes/s d'un SSD en comparació amb 100 megabytes/s d'un disc dur.

source: Menor tiempo de acceso. 0,1 milisegundos de un SSD frente a 10 milisegundos de un HDD.
ca: Menys temps d’accés. 0,1 mil·lisegons d’un SSD en comparació amb 10 mil·lisegons d’un disc dur.

source: Mayor resistencia a los golpes y a las vibraciones.
ca: Major resistència als cops i vibracions.

source: Menor tasa de fallos de los SSD al no tener partes móviles.
ca: La taxa de fallades de SSD inferior al no tenir parts mòbils.

source: Menor consumo eléctrico. 4W ó 5W de un SSD a máximo rendimiento frente a 6W a 10W de un HDD.
ca: Menor consum d’electricitat. 4W o 5W d’un SSD de rendiment màxim en comparació amb 6W a 10W d’un disc dur.

source: Menor tamaño físico.
ca: Mida física inferior.

source: Menor ruido generado.
ca: El soroll inferior generat.

source: Desventajas de los SSD:
ca: Desavantatges dels SSD:

source: Menor resistencia a un gran número de escrituras.
ca: Menor resistència a un gran nombre d’escrits.

source: Mayor precio por gigabyte. 140€/TB de un SSD frente a 24€/TB de un HDD en 2022.
ca: Gigabyte Preu més elevat. 140 €/TB d’un SSD en comparació amb 24 €/TB d’un disc dur el 2022.

source: SMART
ca: Intel·ligent

source: `SMART <https://es.wikipedia.org/wiki/S.M.A.R.T.>`__ es una tecnología que implementan los discos duros y las unidades de estado sólido. Es un sistema de detección temprana de fallos que permite conocer con antelación si un disco duro da señales de fallar próximamente.
ca: `Smart <https://es.wikipedia.org/wiki/s.m.a.r.t.>`__ És una tecnologia que implementa discos durs i unitats d'estat sòlid. És un sistema de detecció de fallades precoç que us permet saber amb antelació si un disc dur permet que els signes fallin aviat.

source: La tecnología SMART monitoriza parámetros de la unidad como su temperatura, sectores defectuosos, cantidad de datos escritos, errores de lectura, tiempo de funcionamiento, número de arranques, etc. Aunque no es capaz de detectar todos los fallos posibles, sí permite avisar ante la mayoría de los fallos debidos a una degradación de la unidad.
ca: La tecnologia intel·ligent supervisa els paràmetres d’unitats com la seva temperatura, els sectors defectuosos, la quantitat de dades escrites, els errors de lectura, el temps de funcionament, el número d’inici, etc. Tot i que no és capaç de detectar tots els fracassos possibles, permet notificar la majoria de fallades a causa d’una degradació de la unitat.

source: Existen varios programas que permiten leer los parámetros SMART de una unidad de almacenamiento. Algunos programas de monitorización son:
ca: Hi ha diversos programes que permeten llegir els paràmetres intel·ligents d’una unitat d’emmagatzematge. Alguns programes de control són:

source: `Clear Disk Info <https://www.carifred.com/cleardiskinfo/>`__
ca: `Informació del disc clar <https://www.carifred.com/coleardiskinfo/>`__

source: RAID
ca: Assaltar

source: Un sistema `RAID (matriz redundante de discos independientes) <https://es.wikipedia.org/wiki/RAID>`__ es una tecnología que permite unir varias unidades de disco duro (HDD) o unidades de estado sólido (SSD) para conseguir aumentar sus prestaciones. Se utiliza en servidores de datos y en ordenadores de altas prestaciones. Se necesita una controladora RAID especializada para conectar los discos al ordenador.
ca: Una `raid (matriu redundant de discos independents) <https://es.wikipedia.org/wiki/raid>`__ És una tecnologia que permet unir -se a diverses unitats de disc dur (HDD) o unitats d'estat sòlid (SSD) per augmentar el seu rendiment. S'utilitza en servidors de dades i ordinadors d'alt rendiment. Es necessita un controlador especialitzat RAID per connectar els discos a l’ordinador.

source: En un primer nivel RAID, el sistema operativo ve una sola unidad donde en realidad hay varios discos duros. La velocidad de transferencia total aumenta al unir las velocidades de transferencia de cada uno de los discos.
ca: En un primer nivell, el sistema operatiu veu una sola unitat on hi ha en realitat diversos discs durs. La velocitat de transferència total augmenta unint les velocitats de transferència de cadascun dels discos.

source: En niveles RAID posteriores, se utiliza un disco para almacenar datos redundantes de paridad. Esto permite que los datos no se pierdan ante el fallo de una de las unidades. Al detectar una unidad dañada, ésta se puede cambiar por otra nueva y el sistema recuperará automáticamente los datos perdidos a partir de los datos redundantes.
ca: Als nivells de RAID posteriors, un àlbum s'utilitza per emmagatzemar dades redundants de la paritat. Això permet que les dades no es perdin en el fracàs d’una de les unitats. Quan es detecti una unitat danyada, es pot canviar a una de nova i el sistema recuperarà automàticament les dades perdudes de les dades redundants.

source: Un `búfer de datos <https://es.wikipedia.org/wiki/B%C3%BAfer_de_datos>`__ es un espacio de memoria temporal que almacena datos de lectura o de escritura que se dirigen a un periférico. De esta forma se acelera el funcionamiento del procesador y se evita que un dispositivo pierda datos durante una transferencia de datos irregular.
ca: Un `buffer de dades <https://es.wikipedia.org/wiki/b%C3%Bafer_de_datos>`__ és un espai de memòria temporal que emmagatzema dades de lectura o escriptura que es dirigeixen a un perifèric. D’aquesta manera s’accelera l’operació del processador i s’evita que un dispositiu perdi dades durant una transferència irregular de dades.

source: Los búfer de escritura para un dispositivo más lento que el procesador, como un disco duro o un pendrive, almacenan varios megabytes de datos que son enviados en ráfagas rápidas por el procesador para, más tarde, escribirlos en el dispositivo de almacenamiento a menor velocidad y de manera continua.
ca: L’escriptura del buffer per a un dispositiu més lent que el processador, com ara un disc dur o un Pendrive, emmagatzema diversos megabytes de dades que el processador s’envien en ràfegues ràpides per, més tard, escriviu -les al dispositiu d’emmagatzematge a velocitat inferior i contínuament.

source: Los dispositivos de entrada, como los teclados o ratones, también tienen un búfer de lectura que va almacenando los datos que envían los periféricos hasta que el procesador los lee rápidamente. De esta manera el procesador principal no tiene que estar atendiendo continuamente a un dispositivo lento, sino que lo atiende a ráfagas rápidas y sin esperas.
ca: Els dispositius d’entrada, com els teclats o els ratolins, també disposen d’un buffer de lectura que emmagatzema les dades que els perifèrics envien fins que el processador els llegeixi ràpidament. D’aquesta manera, el processador principal no ha d’assistir contínuament a un dispositiu lent, però atén a ràfegues ràpides i esperades.

source: Los búfer de datos suelen encontrarse dentro de los periféricos de entrada/salida y de los medios de almacenamiento.
ca: El buffer de dades es troba generalment dins dels perifèrics d’entrada/sortida i dels suports d’emmagatzematge.

source: Los dispositivos de almacenamiento externo se pueden desconectar con facilidad del ordenador para ser transportados.
ca: Els dispositius d'emmagatzematge externs es poden desconnectar fàcilment de l'ordinador per ser transportat.

source: Su velocidad suele ser más lenta que la de los anteriores métodos de almacenamiento interno, pero presentan la ventaja de su mayor movilidad y facilidad de transporte.
ca: La seva velocitat sol ser més lenta que la dels mètodes d’emmagatzematge intern anteriors, però té l’avantatge de la seva major mobilitat i facilitat de transport.

source: La `memoria USB <https://es.wikipedia.org/wiki/Memoria_USB>`__ es una memoria externa basada en `tecnología flash <https://es.wikipedia.org/wiki/Memoria_flash>`__ con conexión al ordenador de tipo USB.
ca: La `memòria USB <https://es.wikipedia.org/wiki/memoria_USB>`__ és una memòria externa basada en `tecnologia flash <https://es.wikipedia.org/wiki/memoria_flash>`__ amb connexió amb l'ordinador de tipus USB.

source: Su capacidad máxima aumenta con los años debido a la ley de Moore. En 2022 se puede comprar una memoria USB de 512 gigabytes por un precio de unos 40 Euros.
ca: La seva capacitat màxima augmenta al llarg dels anys a causa de la llei de Moore. El 2022 podeu comprar una memòria USB de 512 gigabytes per un preu d’uns 40 euros.

source: La velocidad de lectura suele ser menor que la de un disco duro y la velocidad de escritura suele ser mucho menor en la mayoría de los dispositivos.
ca: La velocitat de lectura sol ser inferior a la d’un disc dur i la velocitat d’escriptura sol ser molt inferior a la majoria de dispositius.

source: Memoria USB (pendrive).
ca: Memòria USB (Pendrive).

source: Tarjeta SD
ca: Targeta SD

source: La memoria en `tarjeta SD <https://es.wikipedia.org/wiki/Secure_Digital>`__ se basa en la misma tecnología que las unidades de memoria USB y tiene rendimientos semejantes.
ca: La memòria de la targeta SD <https://es.wikipedia.org/wiki/secure_digital> `__ es basa en la mateixa tecnologia que les unitats de memòria USB i té rendiments similars.

source: El estándar de conexión de la tarjeta SD es más sencillo que el estándar USB. Además el tamaño físico de las tarjetas SD suele ser menor que el de los pendrive, especialmente en las tarjetas microSD.
ca: L’estàndard de connexió de la targeta SD és més fàcil que l’estàndard USB. A més, la mida física de les targetes SD sol ser inferior a la del Pendrive, especialment en les targetes microSD.

source: Tarjetas de memoria microSD de varias capacidades.
ca: Targetes de memòria microSD de diverses capacitats.

source: El `CD-ROM <https://es.wikipedia.org/wiki/CD-ROM>`__, el `DVD <https://es.wikipedia.org/wiki/DVD>`__ y el `Blu-ray <https://es.wikipedia.org/wiki/Disco_Blu-ray>`__ son unidades ópticas de almacenamiento de datos.
ca: El `cd-rom <https://es.wikipedia.org/wiki/cd-rom>`__, el `dvd <https://es.wikipedia.org/wiki/dvd>`__ i el `blu-ray <https:/es.wikipedia.org/wiki/disco_by>`__ Són unitats d'emmagatzematge de dades òptiques.

source: Disco óptico CD-ROM.
ca: Disc òptic CD-ROM.

source: Todas ellas se basan en una lámina de material metálico plateado que refleja un fino haz de luz láser o no la refleja dependiendo de las marcas que se graban en un surco en forma de espiral a lo largo del disco.
ca: Tots ells es basen en una fulla de material metàl·lic de plata que reflecteix un feix làser fi o no el reflecteix en funció de les marques que es registren en una ranura en espiral al llarg del disc.

source: La diferencia fundamental entre las distintas tecnologías es la creciente capacidad de almacenamiento y mayor velocidad de transferencia de los dispositivos más modernos.
ca: La diferència fonamental entre diferents tecnologies és la creixent capacitat d’emmagatzematge i una velocitat de transferència més elevada dels dispositius més moderns.

source: Micrografía de la superficie de un CD-ROM en la que se pueden ver los surcos con las marcas.
ca: Micrografia de la superfície d’un CD-ROM en què es poden veure els solcs amb les marques.

source: Las características típicas de los distintos dispositivos de almacenamiento óptico son las siguientes:
ca: Les característiques típiques dels diferents dispositius d’emmagatzematge òptic són les següents:

source: Parámetro
ca: Paràmetre

source: Capacidad de almacenamiento
ca: Capacitat d’emmagatzematge

source: 8,0 gigabytes a doble capa
ca: 8.0 Gigabytes de doble capçalera

source: 50 gigabytes a doble capa
ca: 50 Gigabytes de doble cap

source: Velocidad de transferencia
ca: Velocitat de transferència

source: Láser de lectura / escritura
ca: Lectura / escriptura làser

source: Infrarrojo (780 nm)
ca: Infrarojos (780 nm)

source: Rojo (650 nm)
ca: Vermell (650 nm)
