Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/informatica-calc-ejercicios.po
Languages: ca

source: Ejercicios de Calc
ca: Exercicis de Calc

source: Esta sección consta de 20 ejercicios en los que aplicaremos varios de los contenidos tratados en las prácticas guiadas.
ca: Aquesta secció consta de 20 exercicis en què aplicarem diversos continguts tractats en pràctiques guiades.

source: Crea en el ordenador una carpeta con tu nombre en la que guardaremos los documentos generados.
ca: Creeu a l’ordinador una carpeta amb el vostre nom en què desarem els documents generats.

source: Índice de contenidos:
ca: Índex de contingut:

source: Ejercicio 1: Lista numerada
ca: Exercici 1: Llista numerada

source: En un nuevo archivo de Calc crea a partir de la celda **B2** una lista vertical de 100 alumnos con el formato ALUMNO 1, ALUMNO 2, ... ALUMNO 100. Numera los alumnos en la columna A. A partir de la celda **C1** crea una lista horizontal de 20 notas con el formato NOTA 1, NOTA 2, ... NOTA 20.
ca: En un nou fitxer Calc, crea des de la cel·la ** B2 ** una llista vertical de 100 estudiants amb el format 1 de l'estudiant, Student 2, ... Student 100. Numera els estudiants de la columna A. de la cel·la ** C1 ** Creeu una llista horitzontal de 20 notes amb el format Nota 1, Nota 2, ... Nota 20.

source: Dale a la **Columna A** un ancho de 1cm y alinea su contenido a la derecha.
ca: Doneu a la columna ** A ** una amplada d'1 cm i alineeu el seu contingut a la dreta.

source: Dale a la **Columna B** un ancho de 3cm y centra su contenido.
ca: Doneu a la columna ** B ** una amplada de 3cm i centra el seu contingut.

source: Dale a la **Fila 1** una altura de 2cm y centra su contenido horizontal y verticalmente.
ca: Doneu a la ** fila 1 ** una alçada de 2cm i centra el seu contingut horitzontalment i verticalment.

source: Guarda el archivo resultante como **"Ejercicio_01_NombreAlumno.ods"**.
ca: Deseu el fitxer resultant com a ** \ "Exercici_01_nombrerealumno.ods " **.

source: Recuerda que ODS es la extensión del archivo por defecto, no es necesario que la escribas porque Calc la añade de modo automático.
ca: Recordeu que ODS és l’abast del fitxer predeterminat, no cal que l’escrigui perquè Calc l’afegeix automàticament.

source: Ejercicio 2: Formato de archivo
ca: Exercici 2: Format de fitxer

source: Abre la hoja de cálculo del ejercicio anterior **"Ejercicio_01_NombreAlumno.ods"** y guárdala como:
ca: Obriu el full de càlcul de l'exercici anterior ** \ "Exercici_01_NAMES.

source: **Ejercicio_02_NombreAlumno.xls** (formato de MS Excel 2003)
ca: ** Exercici_02_namenalumno.xls ** (format MS Excel 2003)

source: **Ejercicio_02_NombreAlumno.xlsx** (formato de MS Excel 2007)
ca: ** Exercici_02_name.xlsx ** (format MS Excel 2007)

source: Ejercicio 3: Formato de celdas
ca: Exercici 3: Format de la cel·la

source: En un nuevo archivo de Calc dale a las celdas señaladas el formato que observas en la imagen.
ca: En un nou fitxer calc, doneu a les cel·les indicat el format que observeu a la imatge.

source: Guarda el archivo resultante como **"Ejercicio_03_NombreAlumno.ods"**.
ca: Mantingueu el fitxer resultant com a ** \ "Exercici_03_NOMBREALUMNO.ODS " **.

source: Ejercicio 4: Formato de texto
ca: Exercici 4: Format de text

source: En una nueva hoja de cálculo modifica el formato de las celdas y del texto contenido en ellas tal y como se indica abajo, para obtener un resultado igual al de la imagen.
ca: En un nou full de càlcul modifica el format de les cel·les i el text que hi ha inclosos tal com s’indica a continuació, per obtenir un resultat igual al de la imatge.

source: Filas 2 y 3: Altura de 3cm.
ca: Files 2 i 3: 3cm d'alçada.

source: Ancho de las columnas: B = 1cm, C = 2cm y D = 3cm.
ca: Amplada de la columna: b = 1cm, c = 2cm i d = 3cm.

source: Celdas B2 y B3 combinadas, con texto centrado horizontal y verticalmente dispuesto en vertical. Formato de texto Arial tamaño 10 puntos, negrita, sombra y color azul.
ca: Les cèl·lules B2 i B3 combinades, amb un text horitzontal i centrat verticalment disposats en vertical. Format de text Arial mida 10 punts, negreta, ombra i color blau.

source: Texto de la **celda C2** centrado, fuente Arial, tamaño 8 puntos, estilo cursiva y color verde.
ca: Text de la cel·la ** C2 ** Centrada, Font Arial, Mida 8 Punts, Estil italic i color verd.

source: Texto de la **celda D2** alineado a la izquierda, fuente Times New Roman, tamaño 11 puntos, subrayado.
ca: Text de la cel·la ** D2 ** alineat a l'esquerra, Fuente Times New Roman, de mida 11, subratllada.

source: Texto de la **celda C3** centrado, fuente Arial, tamaño 10 puntos, negrita y color rojo oscuro.
ca: Text de la ** cel·la C3 ** Centrada, Fonta Arial, mida de 10 punts, color vermell atrevit i fosc.

source: Texto de la **celda D3** alineado horizontalmente a la derecha y verticalmente abajo.
ca: Text de la cel·la ** D3 ** alineat horitzontalment a la dreta i verticalment a sota.

source: Guarda el archivo resultante como **"Ejercicio_04_NombreAlumno.ods"**.
ca: Deseu el fitxer resultant com a ** \ "Exercici_04_nombrerealumno.ods " **.

source: Ejercicio 5: Alquiler de videojuegos
ca: Exercici 5: lloguer de videojocs

source: Imagina que tienes que crear una hoja de cálculo para una tienda de alquiler de videojuegos. El modelo es el que puedes ver en la imagen de abajo.
ca: Imagineu -vos que heu de crear un full de càlcul per a un lloguer de videojocs. El model és el que podeu veure a la imatge següent.

source: Cuando se introduzcan las fechas de alquiler y de devolución, la hoja deberá calcular los días de préstamo y el importe a cobrar.
ca: Quan s’introdueixen les dates de lloguer i de devolució, el full ha de calcular els dies del préstec i l’import a recollir.

source: El precio diario normal se aplicará cuando la duración del préstamo sea igual o inferior a 7 días. Para más días se aplicará el otro precio.
ca: El preu diari normal s'aplicarà quan la durada del préstec sigui igual o inferior a 7 dies. Durant més dies, s’aplicarà l’altre preu.

source: Daremos a cada celda el formato apropiado (moneda, fecha o número).
ca: Donarem a cada cel·la el format adequat (moneda, data o número).

source: Prueba el funcionamiento de la hoja introduciendo diferentes fechas y precios diarios.
ca: Proveu el funcionament del full introduint diferents dates i preus diaris.

source: Guarda el archivo resultante como **"Ejercicio_05_NombreAlumno.ods"**.
ca: Deseu el fitxer resultant com a ** \ "Exercici_05_nombrerealumno.ods " **.

source: Ejercicio 6: Proteger celdas
ca: Exercici 6: protegir les cèl·lules

source: Abre el archivo que creaste en la práctica anterior y protege todas las celdas excepto las celdas **B1** y **B2** (en las que se introducen las fechas de alquiler y devolución) con la contraseña **12345**.
ca: Obriu el fitxer que heu creat a la pràctica anterior i protegiu totes les cel·les, excepte les cel·les ** B1 ** i ** B2 ** (en què s’introdueixen les dates de lloguer i devolució) amb la contrasenya ** 12345 **.

source: Guarda el archivo resultante como **"Ejercicio_06_NombreAlumno.ods"**.
ca: Deseu el fitxer resultant com a ** \ "Exercici_06_NOMBREALUMNO.ODS " **.

source: Ejercicio 7: Superficie de los continentes
ca: Exercici 7: superfície dels continents

source: Crea una nueva hoja de cálculo. Renombra la primera hoja como **"Continentes"**. Introduce un gráfico de columnas a partir de los siguientes datos:
ca: Creeu un full de càlcul nou. Canvieu el nom del primer full com a ** \ "continents " **. Introduïu un gràfic de columnes de les dades següents:

source: Dale a las celdas y al texto el formato que quieras.
ca: Doneu a les cel·les i al text el format que vulgueu.

source: Guarda el archivo resultante como **"Ejercicio_07_NombreAlumno.ods"**.
ca: Deseu el fitxer resultant com a ** \ "Exercici_07_nombrerealumno.ods " **.

source: Ejercicio 8: Superficie de los océanos
ca: Exercici 8: Superfície de l’oceà

source: Abre el archivo del ejercicio anterior. Introduce una nueva hoja llamada **"Océanos"** e inserta en ella un gráfico de tarta (círculos) a partir de los siguientes datos:
ca: Obriu el fitxer de l'exercici anterior. Introduïu un nou full anomenat ** \ "Oceans " ** i inseriu un gràfic de pastissos (cercles) de les dades següents:

source: Guarda el archivo resultante como **"Ejercicio_08_NombreAlumno.ods"** protegido con la contraseña de apertura **12345**.
ca: Mantingueu el fitxer resultant com a ** \ "Exercici_08_NOMBREALUMNO.ODS " ** protegit amb la contrasenya d'obertura ** 12345 **.

source: Ejercicio 9: Ventas de comerciales
ca: Exercici 9: vendes comercials

source: Usando el "pegado especial" copia todo el contenido del documento de texto `Ejercicio_09.odt <../_static/tutorial-calc/calc/cas/pract/almac/Ejercicio_09.odt>`__ en una nueva hoja de cálculo. Dale a las celdas y al texto el formato que aparece en la imagen. Obtén la suma de las ventas anuales de cada comercial y obtén los valores de ventas "medio", "máximo" y "mínimo" de cada mes.
ca: Utilitzant la cola especial \ "Special " Copieu tot el contingut del document de text `Exercici_09.odt <../_ Static/Tutorial-Calc/Calc/CAS/Practic/Store/Exercici_09.ODT>` `__ en un nou full de càlcul. Doneu a les cel·les i al text el format que apareix a la imatge. Obteniu la suma de les vendes anuals de cada comercial i obteniu els valors de vendes \ "mitjà ", \ "màxim " i \ "mínim " de cada mes.

source: Guarda el archivo resultante como **"Ejercicio_09_NombreAlumno.ods"**.
ca: Deseu el fitxer resultant com a ** \ "Exercici_09_NOMBREALUMNO.ODS " **.

source: Ejercicio 10: Servicio de Atención Técnica
ca: Exercici 10: Servei d’atenció tècnica

source: En una hoja de cálculo nueva introduce datos como los de la imagen y un Fontwork (usa los diseños que quieras). Haz que Calc obtenga el importe total que será la suma de las horas de servicio por su precio más el precio del km por su importe. El costo del km tendrá dos valores, uno para las distancias superiores a 10km y otro para las inferiores.
ca: En un nou full de càlcul introdueix dades com la imatge i un tipus de lletra (utilitzeu els dissenys que vulgueu). Feu que Cal obtenir la quantitat total que serà la suma de les hores de servei pel seu preu més el preu del KM per la seva quantitat. El cost de Km tindrà dos valors, un per a distàncies superiors a 10 km i un per als inferiors.

source: Una vez diseñada la hoja introduce datos para probar su funcionamiento.
ca: Un cop dissenyat el full, introduïu dades per provar el seu funcionament.

source: Guarda el archivo resultante como **"Ejercicio_10_NombreAlumno.ods"**.
ca: Deseu el fitxer resultant com a ** \ "Exercici_10_namer.ods " **.

source: Ejercicio 11: Función logarítmica
ca: Exercici 11: Funció logarítmica

source: Basándote en la imagen, crea una hoja que proporcione los resultados y el gráfico de una función logarítmica con base decidida por el usuario. Personaliza el formato de las tablas y del gráfico.
ca: A partir de la imatge, creeu un full que proporcioni els resultats i el gràfic d’una funció logarítmica basada per l’usuari. Personalitzeu el format de les taules i el gràfic.

source: Guarda el archivo resultante como **"Ejercicio_11_NombreAlumno.ods"**.
ca: Deseu el fitxer resultant com a ** \ "Exercici_11_nombrerealumno.ods " **.

source: Ejercicio 12: Cálculo de notas
ca: Exercici 12: Càlcul de notes

source: En una nueva hoja de cálculo introduce datos similares a los de la imagen (usa el formato que quieras). Introduce las siguientes ponderaciones a las notas:
ca: En un nou full de càlcul introdueix dades similars a les de la imatge (utilitzeu el format que vulgueu). Introduïu els pesos següents a les notes:

source: Trabajo: 30%
ca: Treball: 30%

source: Haz que Calc genere automáticamente las notas (del 1 al 10) y que calcule la nota final sin decimales.
ca: Feu que el Calc generi automàticament les notes (d’1 a 10) i calculeu el grau final sense decimals.

source: Guarda el archivo resultante como **"Ejercicio_12_NombreAlumno.ods"**.
ca: Deseu el fitxer resultant com a ** \ "Exercici_12_nombrerealumno.ods " **.

source: Ejercicio 13: Colores en inglés
ca: Exercici 13: colors en anglès

source: Basándote en la práctica guiada número 23 diseña una hoja de cálculo en la que el usuario deberá introducir uno de los colores de la lista y Calc le proporcionará su nombre en inglés.
ca: Basat en la pràctica guiada número 23 dissenya un full de càlcul en què l’usuari ha d’introduir un dels colors de la llista i CALC proporcionarà el vostre nom en anglès.

source: Guarda el archivo resultante como **"Ejercicio_13_NombreAlumno.ods"**.
ca: Deseu el fitxer resultant com a ** \ "Exercici_13_nombrerealumno.ods " **.

source: Ejercicio 14: Imágenes, formas e hiperenlaces
ca: Exercici 14: imatges, formes i hiperenllaços

source: En una nueva hoja de cálculo introduce:
ca: En un nou full de càlcul introdueix:

source: Tu nombre y apellidos en un **"Fontwork"**.
ca: El vostre nom i cognom en un ** \ "fontwork " **.

source: La imagen `Ejercicio_14.jpg <../_static/tutorial-calc/calc/cas/pract/almac/Ejercicio_14.jpg>`__.
ca: La imatge `Exercici_14.jpg <../_ static/tutorial-calc/calc/cas/pràctica/magatzem/exercici_14.jpg>`__.

source: Una **forma**, la que quieras, de la barra de herramientas de dibujo.
ca: Una forma ** **, la que vulgueu, de la barra d’eines de dibuix.

source: Gira la imagen 45º y ponla de fondo.
ca: Gireu la imatge de 45º i poseu -la al fons.

source: En la forma crea un **hiperenlace** a la definición de **"teclado"** en Wikipedia.
ca: En la forma crea un ** hiperlace ** a la definició de ** \ "teclat " ** a Wikipedia.

source: Guarda el archivo resultante como **"Ejercicio_14_NombreAlumno.ods"**.
ca: Mantingueu el fitxer resultant com a ** \ "Exercici_14_nombrerealumno.ods " **.

source: Ejercicio 15: Temperaturas
ca: Exercici 15: temperatures

source: Sabiendo que:
ca: Sabent això:

source: Para pasar de ºC a ºF hay que multiplicar por 9, dividir entre 5 y después sumar 32.
ca: Per passar de ºC a ºF, heu de multiplicar per 9, dividir -vos per 5 i després afegir 32.

source: Para pasar de ºF a ºC hay que restar 32, después multiplicar por 5 y al final dividir entre 9.
ca: Per passar de ºF a ºC, heu de restar 32, després multiplicar -vos per 5 i al final es divideix per 9.

source: Crea una hoja de cálculo en la que el usuario introduzca grados centígrados y Calc proporcione los grados farenheit y viceversa.
ca: Creeu un full de càlcul en què l'usuari introdueixi graus Celsius i Calc proporciona els graus de Farenheit i viceversa.

source: Guarda el archivo resultante como **"Ejercicio_15_NombreAlumno.ods"**.
ca: Deseu el fitxer resultant com a ** \ "Exercici_15_nombrerealumno.ods " **.

source: Ejercicio 16: Evolución de la población
ca: Exercici 16: Evolució de la població

source: Copia y pega los datos contenidos en el documento `Ejercicio_16.odt <../_static/tutorial-calc/calc/cas/pract/almac/Ejercicio_16.odt>`__ en un nuevo archivo de Calc usando el "pegado especial".
ca: Copieu i enganxeu les dades contingudes al document `Exercici_16.odt <../_ Static/Tutorial-Calc/Calc/CAS/Prac/Store/Exercici_16.ODT>`__ en un nou fitxer de Calc mitjançant el \ "Special Stuck ".

source: Inserta un gráfico (escoge el que consideres más adecuado) y personalizalo poniéndole fondo, formato de texto, etc.
ca: Inseriu un gràfic (trieu el que considereu més adequat) i personalitzeu -lo posant fons, format de text, etc.

source: Guarda el archivo resultante como **"Ejercicio_16_NombreAlumno.ods"**.
ca: Deseu el fitxer resultant com a ** \ "Exercici_16_NOMBREALUMNO.ODS " **.

source: Ejercicio 17: Ordenar datos
ca: Exercici 17: Dades de la comanda

source: Abre el archivo `Ejercicio_17.ods <../_static/tutorial-calc/calc/cas/pract/almac/Ejercicio_17.ods>`__ que contiene cuatro hojas. Copia y pega la lista de alumnos y notas de la primera hoja en las otras tres hojas y ordena como sigue estos datos:
ca: Obriu el `Exercici_17.ods <../_ Static/Tutorial-Calc/Calc/CAS/Practic/Warehouse/Exercici_17.ods>`__ Contenint quatre fulls. Copieu i enganxeu la llista d’estudiants i notes del primer full als altres tres fulls i ordeneu com segueixen aquestes dades:

source: Hoja "alfabético": orden alfabético **ascendente**.
ca: "Full alfabètic ": ordre alfabètic ** ascending **.

source: Hoja "mate": orden **ascendente** por la nota de matemáticas.
ca: Full \ "Mate ": Ordre ** Ascending ** per la nota de matemàtiques.

source: Hoja "física": orden **descendente** primero por la nota de física y segundo por la nota de ciencias.
ca: Full \ "Física ": Ordre ** Descendir ** Primer per la nota de física i segon per la nota de ciències.

source: Hoja "ciencias": orden **ascendente** primero por la nota de ciencias, segundo por la nota de física y tercero por la nota de matemáticas.
ca: Full \ "Ciències ": Ordre ** Ascendent ** Primer per la nota de ciència, segona per la física i la tercera nota de la nota de matemàtiques.

source: Guarda el archivo resultante como **"Ejercicio_17_NombreAlumno.ods"**.
ca: Deseu el fitxer resultant com a ** \ "Exercici_17_nombrerealumno.ods " **.

source: Ejercicio 18: Filtrar datos
ca: Exercici 18: dades de filtre

source: Abre el archivo `Ejercicio_18.ods <../_static/tutorial-calc/calc/cas/pract/almac/Ejercicio_18.ods>`__.
ca: Obriu el `Exercici_18.ods <../_ Static/Tutorial-Calc/Calc/CAS/Practic/Warehouse/Exercici_18.ods>`__.

source: Imagina que contiene datos de los usuarios de una red social. Usa el filtro para contestar a la información que se solicita en las cuestiones de las tres primeras filas.
ca: Imagineu -vos que conté dades dels usuaris d’una xarxa social. Utilitzeu el filtre per respondre a la informació sol·licitada en problemes de les tres primeres files.

source: Una vez contestadas las cuestiones, guarda el archivo resultante como **"Ejercicio_18_NombreAlumno.ods"**.
ca: Un cop contestades els problemes, mantingueu el fitxer resultant com ** \ "Exercici_18_nombrerealumno.ods " **.

source: Ejercicio 19: Evaluación
ca: Exercici 19: Avaluació

source: Abre el archivo que creaste en el ejercicio 12. Después de la columna de "Nota final" añade la columna **"Evaluación"** en la que Calc deberá poner, en función del valor de la "Nota final":
ca: Obriu el fitxer que heu creat a l'exercici 12. Després de la columna de \ "Nota final " afegeix la columna ** \ "Avaluació " ** en la qual cal posar Calc, depenent del valor de la \ "Nota final ":

source: "Insuficiente" si la nota es menor de 5.
ca: \ "Insuficient " Si la nota és inferior a 5.

source: "Suficiente" si la nota es igual o superior a 5 e inferior a 6.
ca: \ "Prou " Si la nota és igual o superior a 5 i inferior a 6.

source: "Bien" si la nota es igual o superior a 6 e inferior a 7.
ca: \ "Bo " Si la nota és igual o superior a 6 i menys de 7.

source: "Notable" si la nota es igual o superior a 7 e inferior a 9.
ca: \ "Notable " si la nota és igual o superior a 7 i inferior a 9.

source: "Sobresaliente" si la nota es igual o mayor que 9.
ca: \ "Pendent " Si la nota és igual o superior a 9.

source: Pulsa la combinación de teclas SHIFT+CTRL+F9 para probar el funcionamiento de la hoja de cálculo.
ca: Premeu la combinació Kift+Ctrl+F9 per provar el funcionament del full de càlcul.

source: Guarda el archivo resultante como **"Ejercicio_19_NombreAlumno.ods"**.
ca: Deseu el fitxer resultant com a ** \ "Exercici_19_namer.ods " **.

source: Ejercicio 20: Formato condicional
ca: Exercici 20: Format condicional

source: Abre el archivo generado en el ejercicio anterior y crea cinco nuevos estilos de celda: insuficiente, suficiente, bien, notable y sobresaliente. Cada estilo tendrá un formato de celda (bordes, color, etc.) y de texto (fuente, tamaño, etc.) distinto del resto.
ca: Obriu el fitxer generat a l’exercici anterior i creeu cinc nous estils de cèl·lules: insuficients, suficients, bons, notables i destacats. Cada estil tindrà un format de cel·la (vores, color, etc.) i text (font, mida, etc.) que no sigui la resta.

source: Usando el formato condicional aplica los nuevos estilos a las celdas de la columna "Evaluación". Pulsa la combinación de teclas SHIFT+CTRL+F9 para probar el funcionamiento de la hoja de cálculo.
ca: L'ús del format condicional aplica els nous estils a les cel·les de la columna \ "Avaluació ". Premeu la combinació Kift+Ctrl+F9 per provar el funcionament del full de càlcul.

source: Guarda el archivo resultante como **"Ejercicio_20_NombreAlumno.ods"**.
ca: Deseu el fitxer resultant com a ** \ "Exercici_20_namerumno.ods " **.

source: Créditos
ca: Crèdits

source: Autor de los ejercicios originales: José Manuel Blanco Guimarey
ca: Autor dels exercicis originals: José Manuel Blanco Guimarey

source: Licencia: `Creative Commons BY-NC-SA <https://creativecommons.org/licenses/by-nc-sa/4.0/>`__
ca: Llicència: `Creative Commons By-NC-S

source: Fuente: `Ejercicios propuestos <../_static/tutorial-calc/calc/index.html>`__
ca: Font: `Exercicis proposats <../_ Static/Tutorial-Calc/Calc/Index.html>`__

source: Créditos del tutorial: `Créditos <../_static/tutorial-calc/calc/docs/creditos.html>`__
ca: Crèdits tutorials: `Crèdits <../_ Static/Tutorial-Calc/Calc/Docs/CreditOS.html>`__
