Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/informatica-software-sistema-operativo.po
Languages: ca

source: `GNU/Linux <https://es.wikipedia.org/wiki/GNU/Linux>`__ es un sistema operativo libre desarrollado por multitud de empresas y voluntarios y es el más `popular entre los ordenadores profesionales <https://en.wikipedia.org/wiki/Usage_share_of_operating_systems#Market_share_by_category>`__, tales como servidores web y supercomputadores. Además se encuentra en multitud de dispositivos embebidos tales como videoconsolas, routers, televisores inteligentes, etc. También se encuentra en el núcleo del sistema operativo Android.
ca: `Gnu/linux <https://es.wikipedia.org/wiki/gnu/linux>`__ És un sistema operatiu gratuït desenvolupat per moltes empreses i voluntaris i és el més popular entre els ordinadors professionals entre els ordinadors professionals <https://en.wikipedia.org/wiki/usage_share_of_operating_systems#market_share_by_category> `__, com ara servidors web i supercomputants. També es troba en molts dispositius incrustats com ara consoles de vídeo, encaminadors, televisors intel·ligents, etc. També es troba al nucli del sistema operatiu Android.

source: El sistema operativo GNU/Linux está basado en el antiguo sistema operativo `Unix <https://es.wikipedia.org/wiki/Unix>`__.
ca: El sistema operatiu GNU/Linux es basa en l’antic sistema operatiu `unix <https://es.wikipedia.org/wiki/unix>`__.

source: GNU/Linux tiene muchas interfaces gráficas de usuario (GUI). Algunas son muy simples, orientadas a dispositivos con poca memoria (XFCE), otras son parecidas a la interfaz de Windows (KDE) y otras son parecidas a la interfaz gráfica de Apple (Gnome).
ca: GNU/Linux té moltes interfícies gràfiques d’usuari (GUI). Alguns són molt senzills, orientats a dispositius amb poca memòria (XFCE), d’altres són similars a la interfície Windows (KDE) i d’altres són similars a la interfície gràfica d’Apple (GNOME).

source: Una interfaz gráfica que se suele utilizar en muchos dispositivos embebidos es una página web desde la que se controlan los parámetros del dispositivo. Es una interfaz muy rápida y ligera. Un ejemplo se puede ver al conectarse con un navegador al router de Internet.
ca: Una interfície gràfica que s’utilitza normalment en molts dispositius incrustats és una pàgina web des de la qual es controlen els paràmetres del dispositiu. És una interfície molt ràpida i lleugera. Es pot veure un exemple en connectar -se amb un navegador amb l’encaminador d’Internet.

source: GNU/Linux también puede ejecutarse sin interfaz gráfica, por línea de comandos, lo que es muy útil para los profesionales y para que el sistema ocupe muy poca memoria en el dispositivo.
ca: GNU/Linux també es pot executar sense interfície gràfica, per línia de comandaments, molt útil per als professionals i que el sistema ocupi molt poca memòria al dispositiu.

source: GNU/Linux es un sistema operativo `multiusuario <https://es.wikipedia.org/wiki/Multiusuario>`__, por lo que una sola computadora puede dar servicio a varias terminales a la vez, con distintos usuarios conectados a ellas.
ca: GNU/Linux és un sistema operatiu multi -usuari <https://es.wikipedia.org/wiki/multiusuari>`__, de manera que un sol ordinador pot servir diversos terminals al mateix temps, amb diferents usuaris connectats a ells.

source: El sistema GNU/Linux tiene multitud de aplicaciones de todos los ámbitos y está orientado a desarrolladores.
ca: El sistema GNU/Linux té moltes aplicacions de totes les àrees i està orientat als desenvolupadors.

source: En algunos casos falta compatibilidad con programas muy populares, que pueden ejecutarse con el programa "Wine" de emulación de Windows.
ca: En alguns casos, no hi ha compatibilitat amb programes molt populars, que es poden executar amb el programa \ "vi " de Windows.

source: Al ser un sistema operativo de código abierto y controlado por la comunidad, es muy personalizable. Existen multitud de distribuciones gratuitas orientadas a todo tipo de ámbitos.
ca: Al ser un sistema operatiu de font obert i controlat, és molt personalitzable. Hi ha moltes distribucions gratuïtes orientades a tot tipus d’àrees.

source: Su gran facilidad de personalización y su gran seguridad contra el malware es lo que hace a este sistema operativo tan atractivo para instalarlo en servidores web y todo tipo de ordenadores profesionales.
ca: La seva gran facilitat de personalització i la seva gran seguretat contra el programari maliciós és el que fa que aquest sistema operatiu sigui tan atractiu per instal·lar -lo en servidors web i tot tipus d’ordinadors professionals.

source: Al ser GNU/Linux software abierto, algunos desarrolladores de hardware tales como Nvidia han puesto dificultades para realizar controladores para sus productos. A día de hoy la mayoría de los dispositivos tienen soporte en el sistema operativo, que es compatible con una amplia variedad de hardware.
ca: En ser un programari obert GNU/Linux, alguns desenvolupadors de maquinari com NVIDIA han posat dificultats per realitzar controladors per als seus productes. Avui en dia, la majoria de dispositius tenen suport al sistema operatiu, que és compatible amb una gran varietat de maquinari.

source: GNU/Linux es un sistema operativo gratuito, lo que abarata el precio final de los dispositivos que funcionan con él.
ca: GNU/Linux és un sistema operatiu gratuït, que redueix el preu final dels dispositius que hi treballen.

source: El sistema GNU/Linux tiene muchas distribuciones orientadas a todo tipo de aplicaciones y a todo tipo de plataformas hardware. Estas son algunas de las distribuciones más populares.
ca: El sistema GNU/Linux té molts tipus orientats a tot tipus d'aplicacions i a tot tipus de plataformes de maquinari. Aquestes són algunes de les distribucions més populars.

source: `Ubuntu <https://es.wikipedia.org/wiki/Ubuntu>`__, orientada sobre todo a usuarios domésticos.
ca: `Ubuntu <https://es.wikipedia.org/wiki/ubuntu>`__, orientat principalment als usuaris nacionals.

source: `Debian <https://es.wikipedia.org/wiki/Debian_GNU/Linux>`__, orientada a mantener una distribución abierta, de software libre.
ca: `Debian <https://es.wikipedia.org/wiki/debian_gnu/linux>`__, destinat a mantenir una distribució oberta, programari lliure.

source: `MAX <https://www.educa2.madrid.org/web/max>`__, orientada a la educación en la Comunidad de Madrid.
ca: `Max <https://www.educa2.madrid.org/web/max>`__, orientat a l'educació a la comunitat de Madrid.

source: `Red Hat Linux <https://es.wikipedia.org/wiki/Red_Hat>`__, orientada a mainframes y al entorno empresarial.
ca: `Red Hat Linux <https://es.wikipedia.org/wiki/red_hat>`__, orientat a mainframes i a l'entorn empresarial.

source: `Kali Linux <https://es.wikipedia.org/wiki/Kali_Linux>`__, orientada a pentesting y ciberseguridad.
ca: `Kali Linux <https://es.wikipedia.org/wiki/kali_linux>`__, orientat a la pentet i la ciberseguretat.

source: `Linux embebido <https://es.wikipedia.org/wiki/Linux_embebido>`__, orientada a pequeños dispositivos inteligentes.
ca: `Linux incrustat <https://es.wikipedia.org/wiki/linux_embeBido>`__, dirigit a petits dispositius intel·ligents.

source: Sistema Operativo :index:`macOS`
ca: Sistema operatiu: Índex: `macOS '

source: `macOS <https://es.wikipedia.org/wiki/MacOS>`__ es un sistema operativo para ordenadores personales de escritorio y portátiles de la empresa Apple. Es el segundo sistema más utilizado para ordenadores personales, con una `cuota de mercado del 21% en 2023 <https://en.wikipedia.org/wiki/Usage_share_of_operating_systems#Market_share_by_category>`__.
ca: `MacOS <https://es.wikipedia.org/wiki/macos>`__ És un sistema operatiu per a ordinadors personals d'escriptori i ordinadors portàtils de la companyia Apple. És el segon sistema més utilitzat per a ordinadors personals, amb una quota de mercat del 21% el 2023 <https://en.wikipedia.org/wiki/usage_share_of_opeating_systems#market_share_by_category> `__.

source: El sistema operativo macOS está basado en el antiguo sistema operativo `Unix <https://es.wikipedia.org/wiki/Unix>`__, al igual que GNU/Linux.
ca: El sistema operatiu macOS es basa en l’antic sistema operatiu `Unix <https://es.wikipedia.org/wiki/unix>`__, així com gnu/linux.

source: Es más minimalista y elegante que la interfaz gráfica de Windows. La barra de menú se encuentra siempre en la parte superior de la pantalla, en vez de en las ventanas de cada aplicación.
ca: És més minimalista i elegant que la interfície gràfica de Windows. La barra de menús sempre es troba a la part superior de la pantalla, en lloc de les finestres de cada aplicació.

source: macOS tiene un soporte completo de gestos en el `touchpad <https://es.wikipedia.org/wiki/Panel_t%C3%A1ctil>`__.
ca: MacOS té un suport de gest complet al `touchpad <https://es.wikipedia.org/wiki/panel_t%C3%A1cl>`__.

source: macOS tiene una menor gama de software disponible debido a su menor cuota de mercado y a su menor popularidad. Sin embargo, macOS sigue siendo una plataforma con una base de desarrolladores activa y una amplia gama de software de calidad disponible, especialmente para aplicaciones de diseño y edición de medios.
ca: MacOS té una gamma de programari inferior disponible a causa de la seva menor quota de mercat i la seva menys popular. Tot i això, MacOS segueix sent una plataforma amb una base de desenvolupadors activa i una àmplia gamma de programari de qualitat disponible, especialment per al disseny de suports i les aplicacions d’edició.

source: macOS es mucho más resistente a ataques de malware que Windows. Entre otras razones debido a que se diseñan menos programas maliciosos para este sistema operativo al ser menos popular y porque tiene un diseño que previene mejor de los ataques.
ca: MacOS és molt més resistent als atacs de programari maliciós que Windows. Entre altres raons perquè els programes menys maliciosos estan dissenyats perquè aquest sistema operatiu sigui menys popular i perquè té un millor disseny d’atacs.

source: Aunque macOS tiene algunas posibilidades de personalización, estas son más limitadas en comparación con las que ofrecen Windows o Linux.
ca: Tot i que MacOS té algunes possibilitats de personalització, aquestes són més limitades en comparació amb les que ofereixen Windows o Linux.

source: macOS está diseñado para funcionar exclusivamente en dispositivos Apple, como MacBooks, iMacs y Mac Pros. Esto significa que macOS está muy optimizado para estos dispositivos, es más eficiente y tiene mayor estabilidad, pero no es compatible con otros fabricantes.
ca: MacOS està dissenyat per funcionar exclusivament en dispositius Apple, com ara MacBooks, IMacs i Mac Pros. Això significa que els macOS estan molt optimitzats per a aquests dispositius, és més eficient i té una major estabilitat, però no és compatible amb altres fabricants.

source: En cuanto a los periféricos, macOS tiene una menor variedad de dispositivos compatibles y, en la mayor parte de los casos, los controladores son proporcionados por Apple.
ca: Pel que fa als perifèrics, MACOS té una varietat inferior de dispositius compatibles i, en la majoria dels casos, Apple proporciona controladors.

source: El sistema operativo macOS ya viene preinstalado de forma gratuita en todos los dispositivos Apple. El desarrollo del sistema operativo se financia con el costo del hardware, ya que es un sistema exclusivo para los productos Apple.
ca: El sistema operatiu macOS ja està pre -instal·lat de forma gratuïta a tots els dispositius Apple. El desenvolupament del sistema operatiu es finança amb el cost del maquinari, ja que és un sistema exclusiu per a productes Apple.

source: Las versiones de macOS no tienen diferentes ediciones.
ca: Les versions macOS no tenen edicions diferents.

source: Las últimas versiones de macOS son las siguientes:
ca: Les darreres versions de macOS són les següents:

source: Noviembre de 2020
ca: Novembre de 2020

source: Sistema Operativo :index:`iOS`
ca: Sistema operatiu: Índex: `OS '

source: `iOS <https://es.wikipedia.org/wiki/IOS>`__ es el sistema operativo de la empresa **Apple** para sus dispositivos móviles, incluyendo el smartphone iPhone, la tableta iPad y el reproductor de música iPod.
ca: `Os <https://es.wikipedia.org/wiki/ios>`__ És el sistema operatiu de la companyia ** Apple ** per als seus dispositius mòbils, inclòs el telèfon intel·ligent iPhone, la tauleta iPad i el reproductor de música iPod.

source: Actualmente `Apple lidera las ventas de teléfonos inteligentes de gama alta <https://www.enriquedans.com/2023/03/analizando-el-mercado-de-los-smartphones-y-la-estrategia-de-apple.html>`__, por lo que el sistema operativo iOS lidera las tendencias del sector.
ca: Actualment, Apple lidera vendes de telèfons intel·ligents de gamma alta.

source: Aunque es similar a la interfaz de su competidor Android, tiende a ser más uniforme y consistente en todos los dispositivos Apple, mientras que la interfaz de Android puede variar según el fabricante.
ca: Tot i que és similar a la interfície del seu competidor Android, acostuma a ser més uniforme i format per tots els dispositius Apple, mentre que la interfície Android pot variar segons el fabricant.

source: La App Store de Apple tiende a ser más estricta con la calidad y el control de las aplicaciones. Como resultado, la disponibilidad de software es menor en el sistema operativo iOS, aunque la mayoría de las aplicaciones más populares se pueden encontrar sin problema.
ca: Apple's App Store tendeix a ser més estricta amb la qualitat i el control de les aplicacions. Com a resultat, la disponibilitat de programari és menor en el sistema operatiu iOS, tot i que la majoria de les aplicacions més populars es poden trobar sense problemes.

source: Por otro lado la menor diversidad de hardware en los dispositivos Apple hace que las aplicaciones sean más robustas y estén más optimizadas.
ca: D'altra banda, la menor diversitat de maquinari dels dispositius Apple fa que les aplicacions siguin més robustes i optimitzades.

source: Los dispositivos iOS suelen tener actualizaciones del sistema operativo durante mucho más tiempo, hasta 6 años, en comparación con los dispositivos Android, que apenas tienen actualizaciones del sistema operativo durante un período de 2 años desde el lanzamiento del dispositivo.
ca: Els dispositius iOS solen tenir actualitzacions del sistema operatiu durant molt de temps, fins a 6 anys, en comparació amb els dispositius Android, que amb prou feines tenen actualitzacions del sistema operatiu durant un període de 2 anys des del llançament del dispositiu.

source: El sistema iOS ofrece menos opciones y menos flexibilidad en la personalización que el sistema competidor Android.
ca: El sistema iOS ofereix menys opcions i menys flexibilitat en la personalització que el sistema de competidors Android.

source: iOS solo es compatible con los dispositivos Apple. Esto restringe mucho su uso a un solo fabricante. Como ventaja, al tener un ecosistema de hardware más controlado, es más sencillo optimizar las aplicaciones.
ca: IOS només és compatible amb els dispositius Apple. Això restringeix molt el seu ús a un únic fabricant. Com a avantatge, tenir un ecosistema de maquinari més controlat, és més fàcil optimitzar les aplicacions.

source: iOS viene preinstalado por defecto en los dispositivos móviles de Apple y no tiene precio. Por otra parte, la financiación de su desarrollo se hace con el elevado precio de los dispositivos de Apple en comparación con los dispositivos de la competencia.
ca: iOS arriba preinstal·lat per defecte en dispositius mòbils Apple i no té preu. D'altra banda, el finançament del seu desenvolupament es fa amb l'elevat preu dels dispositius d'Apple en comparació amb els dispositius de competència.

source: Las últimas versiones de iOS son las siguientes:
ca: Les darreres versions d’iOS són les següents:

source: Septiembre de 2021
ca: Setembre de 2021

source: Septiembre de 2022
ca: Setembre de 2022

source: Las versiones anteriores se encuentran sin soporte, por lo que es recomendable actualizarlas a una versión más moderna.
ca: Les versions anteriors es troben sense suport, per la qual cosa és recomanable actualitzar -les a una versió més moderna.

source: Otros Sistemas Operativos
ca: Altres sistemes operatius

source: :index:`z/OS`
ca: : Índex: `z/os`

source: z/OS es un sistema operativo de IBM que se utiliza en mainframes, computadoras de gran escala utilizadas en grandes empresas. Es uno de los sistemas operativos más antiguos y ampliamente utilizados en el mundo empresarial.
ca: Z/OS és un sistema operatiu IBM que s’utilitza en fotogrames principals, ordinadors a gran escala que s’utilitzen en grans empreses. És un dels sistemes operatius més antics i més utilitzats del món empresarial.

source: z/OS se caracteriza por ser robusto, fiable, escalable y seguro. Ofrece una amplia gama de capacidades, incluyendo la gestión de recursos del sistema, la ejecución de trabajos en lote (batch), la administración de sistemas de archivos y dispositivos, la gestión de seguridad y la capacidad de ejecutar múltiples aplicaciones a la vez.
ca: Z/Es caracteritza per ser robust, fiable, escalable i segur. Ofereix una àmplia gamma de capacitats, inclosa la gestió de recursos del sistema, l'execució de lot (lot), l'administració de sistemes de fitxers i dispositius, la gestió de seguretat i la capacitat d'executar diverses aplicacions alhora.

source: :index:`FreeRTOS`
ca: : Índex: `Freertos '

source: FreeRTOS es un sistema operativo en tiempo real diseñado para sistemas embebidos, es decir, dispositivos electrónicos que realizan tareas específicas tales como lavadoras, ascensores, sistemas de control industrial, aparatos IoT (Internet de las Cosas), gestión del motor del automóvil, alarmas, equipos de diagnóstico médico, etc.
ca: Freertos és un sistema operatiu de temps real dissenyat per a sistemes incrustats, és a dir, dispositius electrònics que realitzen tasques específiques com rentadores, ascensors, sistemes de control industrial, dispositius IoT (Internet de les coses), gestió de motors automobilístics, alarmes, equips de diagnòstic mèdic, etc.

source: FreeRTOS se caracteriza por su pequeño tamaño y su bajo consumo de recursos, lo que lo hace adecuado para sistemas con poca memoria y pequeña capacidad de procesamiento.
ca: Freertos es caracteritza per la seva petita mida i el seu baix consum de recursos, cosa que el fa adequat per a sistemes amb poca memòria i poca capacitat de processament.

source: Está escrito en lenguaje C y se puede portar a una amplia variedad de arquitecturas de procesadores, lo que lo hace altamente adaptable a diferentes plataformas y dispositivos.
ca: Està escrit en llenguatge C i es pot portar a una gran varietat d’arquitectures de processadors, cosa que la fa molt adaptable a diferents plataformes i dispositius.

source: FreeRTOS es de código abierto, su código fuente está disponible para el público y se puede modificar y distribuir bajo una licencia de software libre. Esto brinda flexibilidad y permite a los desarrolladores personalizar y adaptar el sistema operativo según las necesidades específicas de sus aplicaciones.
ca: Freertos és de codi obert, el seu codi font està disponible per al públic i es pot modificar i distribuir amb una llicència de programari gratuïta. Això proporciona flexibilitat i permet als desenvolupadors personalitzar i adaptar el sistema operatiu segons les necessitats específiques de les seves aplicacions.

source: Test de la unidad
ca: Test de prova

source: `Test de Sistema Operativo I. <../test/es-software-sistema-operativo-1.html>`__
ca: `Test del sistema operatiu I. <../ Test/ es-Software-System-Operative-1.html> __

source: `Test de Sistema Operativo II. <../test/es-software-sistema-operativo-2.html>`__
ca: `Test del sistema operatiu II. <../ Test/ es-Software-System-Operative-2.html>`__

source: `Test de Sistema Operativo III. <../test/es-software-sistema-operativo-3.html>`__
ca: `Test del sistema operatiu III. <../ Esoftware-System-Operative-3.html> __

source: `Test de Sistema Operativo IV. <../test/es-software-sistema-operativo-4.html>`__
ca: `Prova del sistema operatiu. <../ Test/ es-Software-System-Operative-4.html> `__

source: `Test de Sistema Operativo V. <../test/es-software-sistema-operativo-5.html>`__
ca: `Test del sistema operatiu V. <../ Test/ es-Software-System-Operative-5.html>`__

source: `Test de Sistema Operativo VI. <../test/es-software-sistema-operativo-6.html>`__
ca: `Prova del sistema operatiu VI. <../ Test/ es-Software-System-Operative-6.html>`__
