Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/informatica-hardware-cpu.po
Languages: ca

source: Procesadores
ca: Processadors

source: Los procesadores son el "cerebro" de los ordenadores, los componentes que realizan las operaciones dictadas por los programas o aplicaciones.
ca: Els processadors són el "cervell" dels ordinadors, els components que realitzen les operacions emeses pels programes o aplicacions.

source: Los tipos de procesadores más habituales son la CPU y la GPU, aunque hay algunos más que se estudiarán a continuación como la TPU, el DSP, los microcontroladores o la FPGA.
ca: Els tipus més comuns de processadors són la CPU i la GPU, tot i que n’hi ha més que s’estudiaran a continuació, com ara TPU, DSP, microcontroladors o FPGA.

source: Índice de contenidos:
ca: Índex de contingut:

source: Unidad central de procesamiento (:index:`CPU`)
ca: Unitat central de processament (:index:`CPU`)

source: Una `CPU o unidad central de procesamiento <https://es.wikipedia.org/wiki/Unidad_central_de_procesamiento>`__, también llamada **microprocesador**, es un componente de ordenador dedicado a interpretar las instrucciones de los programas informáticos. Pueden realizar operaciones lógicas, aritméticas y de movimiento de datos.
ca: Una `CPU o unitat de processament central <https://es.wikipedia.org/wiki/unitat_central_de_processing>`__, també anomenat*microprocessador **, és un component informàtic dedicat a interpretar les instruccions dels programes informàtics. Poden realitzar operacions lògiques, aritmètiques i de moviment de dades.

source: Es el componente más complejo de un ordenador. Una CPU de ordenador personal, en 2022, tiene de `25 000 millones a 100 000 millones de transistores <https://en.wikipedia.org/wiki/Transistor_count>`__.
ca: És el component més complex d’un ordinador. Una CPU d’ordinador personal, el 2022, compta amb `25.000 a 100 mil milions de transistors <https://en.wikipedia.org/wiki/transistor_count>`__.

source: Las CPU más conocidas y usadas en la actualidad son las de la empresa Intel (i3, i5, i7, i9, Xeon) o las de la empresa AMD (Ryzen) para ordenadores personales y servidores.
ca: Les CPU més conegudes i usades són actualment les de la Intel Company (i3, i5, i7, i9, xeon) o les de la companyia AMD (Ryzen) per a ordinadors i servidors personals.

source: Los teléfonos inteligentes, tabletas, televisores y otros dispositivos inteligentes (smart) utilizan CPU basadas en arquitectura ARM (Dimensity, Snapdragon, Kirin, etc.)
ca: Els telèfons intel·ligents, tauletes, televisors i altres dispositius intel·ligents (intel·ligents) utilitzen CPU basat en l’arquitectura de braços (dimensitat, Snapdragon, Kirin, etc.)

source: CPU 80486DX típica de los PC de mediados de los años 90.
ca: CPU 80486dx Típic dels PC de mitjan anys 90.

source: `Solipsist <https://commons.wikimedia.org/wiki/File:Intel_80486DX2_bottom.jpg>`__, `CC BY-SA 2.0 Generic <https://creativecommons.org/licenses/by-sa/2.0/deed.en>`__, via Wikimedia Commons.
ca: `Solipsist <https://commons.wikimedia.org/wiki/file:intel_80486dx2_bottom.jpg>`__, `cc by-sa 2.0 genèric <https://creativecommons.org/licenses/by-sa/2.0/deed.en>` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` Wikimedia Commons.

source: Coprocesador matemático (:index:`FPU`)
ca: Coprocessador matemàtic (:index:`FPU`)

source: El `coprocesador matemático o unidad de coma flotante <https://es.wikipedia.org/wiki/Unidad_de_coma_flotante>`__ es un tipo de procesador que está especializado en realizar operaciones matemáticas en coma flotante (con decimales), tales como multiplicaciones divisiones, operaciones trigonométricas, logaritmos y exponenciales.
ca: El `coprocessador matemàtic o la unitat de coma flotant <https://es.wikipedia.org/wiki/unitat_de_coma_flotante>`__ és un tipus de processador especialitzat en realitzar operacions matemàtiques en coma flotant (amb decimals), com ara divisions de multiplicacions, operacions trigonòmiques, lògies i lògies.

source: En sus comienzos eran circuitos separados de la CPU, pero hoy en día se encuentran integradas dentro del mismo chip de las CPU más potentes.
ca: En els seus inicis eren circuits separats de la CPU, però avui en dia s’integren al mateix xip de CPU més potent.

source: Este coprocesador o FPU permite acelerar los programas que necesitan realizar gran cantidad de operaciones matemáticas tales como los programas de diseño por ordenador en 2 y en 3 dimensiones, los programas de hojas de cálculo o el software científico.
ca: Aquest coprocessador o FPU permet accelerar programes que necessiten realitzar moltes operacions matemàtiques, com ara programes de disseny d’ordinadors en dimensions de 2 i 3, programes de full de càlcul o programari científic.

source: Hay coprocesadores especializados en realizar operaciones matemáticas orientadas a multimedia (MMX) que aceleran la compresión y descompresión de audio y vídeo. Gracias a estos coprocesadores, los programas de edición o de visualización de vídeo pueden trabajar velozmente y sin problemas en alta definición.
ca: Hi ha coprocessadors especialitzats en operacions matemàtiques orientades a multimèdia (MMX) que acceleren la compressió i la descompressió d’àudio i vídeo. Gràcies a aquests coprocessadors, els programes d’edició o visualització de vídeo poden funcionar ràpidament i sense problemes d’alta definició.

source: Unidad de procesamiento gráfico (:index:`GPU`)
ca: Unitat de processament gràfic (:index:`GPU`)

source: Una `GPU o unidad de procesamiento gráfico <https://es.wikipedia.org/wiki/Unidad_de_procesamiento_gr%C3%A1fico>`__ es un procesador especializado, dedicado a calcular gráficos de forma intensiva para aligerar la carga del procesador central. Es capaz de calcular muy rápido operaciones de dibujo en tres dimensiones tales como el antialiasing (suavizar bordes de las figuras) dibujar triángulos, cuadrados, elipses, etc.
ca: Una `GPU o unitat de processament gràfic <https://es.wikipedia.org/wiki/unitat_de_processing_gr%C3%A1fico>`__ és un processador especialitzat, dedicat a calcular gràfics intensament per alleugerir la càrrega del processador central. És capaç de calcular un dibuix molt ràpid en tres dimensions com els antialiasing (suavitzant les vores de les figures) dibuixen triangles, quadrats, el·lipses, etc.

source: :index:`Tarjeta gráfica`
ca: :index:`Targeta gràfica`

source: La mayoría de las CPUs actuales tienen ya integradas pequeñas GPUs con una capacidad limitada para manejar gráficos. Es suficiente para manejar programas ofimáticos o navegar por Internet, pero no tienen bastante capacidad para manejar videojuegos, programas de diseño, etc. Por esa razón en los ordenadores de mayor potencia se utilizan `tarjetas gráficas <https://es.wikipedia.org/wiki/Tarjeta_gr%C3%A1fica>`__ especializadas, que llegan a consumir mucha más potencia eléctrica que la propia CPU y realizan un mayor número de operaciones por segundo.
ca: La majoria de les CPU actuals ja tenen petites GPU amb una capacitat limitada per gestionar els gràfics. N’hi ha prou de gestionar els programes d’oficina o navegar en línia, però no tenen prou capacitat per gestionar videojocs, programes de disseny, etc. Per això als ordinadors de potència més alta `` targetes gràfiques <https://es.wikipedia.org/wiki/tarjeta_gr%C3%A1Fica> `` especialitzades, que es contenen molt més elèctriques que la CPU i de la pròpia operació per segon.

source: Tarjeta gráfica Radeon HD 5570.
ca: Radeon HD 5570 Targeta gràfica.

source: `Evan-Amos <https://commons.wikimedia.org/wiki/File:Sapphire-Radeon-HD-5570-Video-Card.jpg>`__, Public Domain, via Wikimedia Commons.
ca: `Evan-amos <https://commons.wikimedia.org/wiki/file:Sapphire-Radeon-HD-5570-Video-Card.jpg>`__, domini públic, a través de Wikimedia Commons.

source: Unidad de procesamiento tensorial (:index:`TPU`)
ca: Unitat de processament de tensions (:index:`TPU`)

source: Una `TPU o unidad de procesamiento tensorial <https://es.wikipedia.org/wiki/Unidad_de_procesamiento_tensorial>`__ es un procesador dedicado al cálculo intensivo de operaciones de redes neuronales, usadas en Inteligencia Artificial.
ca: Una `TPU o unitat de processament tensorial <https://es.wikipedia.org/wiki/unitat_de_processing_tensorial>`__ és un processador dedicat al càlcul intensiu de les operacions de xarxes neuronals, utilitzat en intel·ligència artificial.

source: El término TPU se utiliza por Google para un circuito inventado por la empresa, pero cada vez más circuitos incorporan capacidades semejantes para el cálculo de redes neuronales, por ejemplo, en los teléfonos inteligentes.
ca: El terme TPU és utilitzat per Google per a un circuit inventat per l'empresa, però cada vegada més circuits incorporen capacitats similars per al càlcul de xarxes neuronals, per exemple, en telèfons intel·ligents.

source: Esta unidad TPU acelera procesos tales como el reconocimiento facial, el procesamiento de voz u otras operaciones basadas en inteligencia artificial.
ca: Aquesta unitat TPU accelera processos com el reconeixement facial, el processament de veu o altres operacions basades en la intel·ligència artificial.

source: Procesador de señales digitales (:index:`DSP`)
ca: Processador de senyal digital (:index:`DSP`)

source: Un `DSP o procesador de señales digitales <https://es.wikipedia.org/wiki/Procesador_de_se%C3%B1ales_digitales>`__ es un procesador especializado en ejecutar operaciones numéricas relacionadas con el tratamiento de señales, a muy alta velocidad.
ca: Un `DSP o processador de senyal digital <https://es.wikipedia.org/wiki/processor_de_se%C3%B1ales_digitales>`__ és un processador especialitzat en executar operacions numèriques relacionades amb el tractament del senyal, a una velocitat molt alta.

source: Sus aplicaciones típicas son el tratamiento en tiempo real de señales de audio, voz, imagen, vídeo, etc. Con estas aplicaciones se puede eliminar el eco en las líneas de comunicación, hacer más claras las imágenes de órganos en los equipos de diagnóstico médico por ultrasonidos o por resonancia magnética, realizar ajustes de **auto-tune** en la voz de los cantantes, decodificar canciones en los reproductores mp3, comprimir fotografías en cámaras digitales, y una larga lista de aplicaciones que están relacionadas con el proceso de señales.
ca: Les seves aplicacions típiques són el tractament en temps real de l’àudio, la veu, la imatge, el vídeo, etc. Amb aquestes aplicacions, Echo es pot eliminar a les línies de comunicació, fer òrgans d’òrgans en equips de diagnòstic mèdic mitjançant ultrasons o ressonància magnètica més clara, fer ajustaments de ** Tune automàtic al procés de senyal.

source: :index:`Microcontroladores`
ca: :index:`Microcontroladors`

source: Un `microcontrolador <https://es.wikipedia.org/wiki/Microcontrolador>`__ es un pequeño ordenador contenido en un solo chip. Incorpora la CPU, la memoria RAM, memoria Flash ROM y periféricos de entrada/salida en un espacio pequeño y a bajo precio.
ca: Un `microcontroller <https://es.wikipedia.org/wiki/microcontroller>`__ és un ordinador petit contingut en un sol xip. Incorpora la CPU, la memòria RAM, la memòria ROM Flash i els perifèrics d’entrada/sortida en un espai petit i baix.

source: Estos procesadores se utilizan para controlar periféricos tales como el teclado, el ratón, la cámara web, el monitor, los discos duros, etc.
ca: Aquests processadors s’utilitzen per controlar els perifèrics com el teclat, el ratolí, la càmera web, el monitor, els discs durs, etc.

source: Gracias a los microcontroladores, la CPU principal del ordenador se descarga de las tareas de control de los periféricos, que serían muy costosas en tiempo y recursos si tuviera que administrarlas directamente.
ca: Gràcies als microcontroladors, la CPU principal de l’ordinador es descarrega de les tasques de control dels perifèrics, cosa que seria molt car en temps i recursos si hagués de gestionar -los directament.

source: Otra aplicación de los microcontroladores es automatizar con una pequeña capacidad de cálculo dispositivos cotidianos como el microondas, la lavadora, el ABS de un automóvil, una cerradura electrónica, etc.
ca: Una altra aplicació de microcontroladors és automatitzar amb una petita capacitat de càlcul dispositius quotidians com el microones, la rentadora, l’abs d’un cotxe, un pany electrònic, etc.

source: Una `FPGA <https://es.wikipedia.org/wiki/Field-programmable_gate_array>`__ es un procesador basado en puertas lógicas programables. Todos los procesadores y todos los circuitos digitales están hechos de puertas lógicas. En el caso de las FPGA, estas puertas lógicas se pueden conectar de manera programable, con lo cual se puede construir un circuito a medida de las necesidades del usuario.
ca: Un `fpga <https://es.wikipedia.org/wiki/field-programmable_gate_array>`__ és un processador basat en portes lògiques programable. Tots els processadors i tots els circuits digitals estan fets de portes lògiques. En el cas de FPGA, aquestes portes lògiques es poden connectar programant, cosa que pot crear un circuit adaptat a les necessitats de l’usuari.

source: Estos circuitos pueden programarse para resolver tareas especializadas de forma mucho más rápida que con una CPU convencional. Aplicaciones típicas son, sistemas de visión por ordenador, minado de criptomonedas, emulación de hardware antiguo, aprendizaje automático, realización de prototipos de circuitos a medida (ASIC), etc.
ca: Aquests circuits es poden programar per resoldre tasques especialitzades molt més ràpidament que amb una CPU convencional. Les aplicacions típiques són els sistemes de visió informàtica, la criptomoneda minada, l’emulació de maquinari antic, l’aprenentatge automàtic, els prototips de circuit personalitzats (ASIC), etc.

source: Al ejecutar las operaciones de forma paralela, las FPGA pueden acelerar los cálculos y ser varias veces más rápidas que una CPU en operaciones tales como la compresión de audio y vídeo.
ca: Quan s’executa en paral·lel, FPGA pot accelerar els càlculs i ser diverses vegades més ràpid que una CPU en operacions com ara la compressió d’àudio i vídeo.

source: Los lenguajes más utilizados para programar las FPGA son VHDL y Verilog.
ca: Els idiomes més utilitzats per programar la FPGA són VHDL i Verilog.

source: Características de un procesador
ca: Característiques d’un processador

source: A continuación se presentan las características que se utilizan para comparar distintos procesadores y evaluar su desempeño.
ca: A continuació, es presenten les característiques utilitzades per comparar diferents processadors i avaluar el seu rendiment.

source: Consumo energético
ca: Consum d’energia

source: El consumo de un procesador es cada vez más importante.
ca: El consum d’un processador és cada cop més important.

source: Por una parte, cuanto menor consumo tenga un procesador, más tiempo va a durar la batería del dispositivo que lo contiene.
ca: D'una banda, el consum inferior té un processador, més temps la bateria del dispositiu que el conté durarà.

source: Por otro lado, en los ordenadores conectados a la red eléctrica, cuanto menor sea el consumo de electricidad menor será el costo de mantener el ordenador funcionando. Este consumo eléctrico es tan elevado para los ordenadores de alto rendimiento, que la electricidad llega a costar anualmente más que el precio del propio procesador. Esa es la razón por la que se cambian los procesadores de los servidores antes de que acabe su vida útil. Es más barato instalar un procesador nuevo más eficiente, que mantener el antiguo funcionando.
ca: D'altra banda, als ordinadors connectats a la xarxa elèctrica, com més baix sigui el consum d'electricitat, més baix és el cost de mantenir l'ordinador en funcionament. Aquest consum d’electricitat és tan elevat per als ordinadors d’alt rendiment, que l’electricitat costa anualment més que el preu del propi processador. Aquesta és la raó per la qual es canvien els processadors de servidors abans del final de la seva vida útil. És més barat instal·lar un processador nou més eficient que no pas mantenir el vell funcionament.

source: El consumo de potencia, también llamado TDP, se mide en vatios. Una CPU típica de un ordenador personal consume alrededor de 100 vatios en funcionamiento normal. Por el contrario una CPU típica de un teléfono inteligente consume alrededor de 5 vatios.
ca: El consum d'energia, també anomenat TDP, es mesura en watts. Una CPU típica d’un ordinador personal consumeix uns 100 watts en funcionament normal. Per contra, una CPU típica d’un telèfon intel·ligent consumeix uns 5 watts.

source: Frecuencia de reloj
ca: Freqüència del rellotge

source: Es la frecuencia a la que funciona un procesador y determina la cantidad de instrucciones que podrá ejecutar en un segundo. Las frecuencias típicas de los procesadores actuales para ordenadores personales y teléfonos inteligentes varían desde los 1000MHz hasta los 4000MHz. Cuanto mayor sea la velocidad de reloj, más rápido será un procesador, si el resto de parámetros se mantienen iguales.
ca: És la freqüència a la qual un processador treballa i determina la quantitat d’instruccions que podeu executar en un segon. Les freqüències típiques dels processadors actuals per a ordinadors personals i telèfons intel·ligents varien de 1000MHz a 4.000MHz. Com més gran sigui la velocitat del rellotge, més ràpid serà un processador, si la resta de paràmetres segueix sent igual.

source: El :index:`overclocking` es una técnica que consiste en hacer funcionar a un procesador a una frecuencia más elevada que la frecuencia para la que está diseñado. El overclocking se usa para acelerar el funcionamiento del ordenador y que procese información más rápido. Muchos procesadores admiten trabajar a mayor frecuencia que la nominal, pero esta técnica conlleva un mayor consumo energético y la posibilidad de fallos en el sistema.
ca: El :index:`overclocking` és una tècnica que consisteix a operar un processador a una freqüència superior a la freqüència per a la qual està dissenyat. El overclocking s’utilitza per accelerar el funcionament de l’ordinador i processar informació més ràpida. Molts processadors admeten treballar amb més freqüència que el nominal, però aquesta tècnica comporta un major consum d’energia i la possibilitat de fallades del sistema.

source: Número de núcleos
ca: Nombre de nuclis

source: Los procesadores actuales están compuestos por varios procesadores individuales llamados núcleos. Cuantos más núcleos tenga un procesador, más operaciones podrá realizar en paralelo.
ca: Els processadors actuals estan compostos per diversos processadors individuals anomenats nuclis. Com més nuclis tinguin un processador, més operacions es poden realitzar en paral·lel.

source: Los procesadores pueden dividir el cálculo de algunas tareas entre varios núcleos. Por lo tanto, cuantos más núcleos tenga el procesador, más rápida será la ejecución de estas tareas. Por otro lado, la realización de ciertas tareas no se puede compartir entre varios núcleos y la velocidad final no será mayor por muchos núcleos que tenga el procesador.
ca: Els processadors poden dividir el càlcul d'algunes tasques entre diversos nuclis. Per tant, com més nuclis tingui el processador, més ràpid serà l’execució d’aquestes tasques. D'altra banda, la realització de certes tasques no es pot compartir entre diversos nuclis i la velocitat final no serà major per molts nuclis que el processador té.

source: En 2022 un procesador de tamaño medio para ordenador personal suele tener de 6 a 12 núcleos.
ca: El 2022, un processador de mida mitjana per a ordinadors personals sol tenir de 6 a 12 nuclis.

source: Número de hilos de ejecución
ca: Nombre de fils d'execució

source: Los hilos de ejecución son la cantidad de programas diferentes que se pueden ejecutar a la vez por parte del procesador. En realidad un procesador solo podrá ejecutar un programa por núcleo, pero los hilos permiten duplicar de forma virtual el número de tareas y acelerar un poco más la velocidad de ejecución.
ca: Els fils d'execució són el nombre de programes diferents que el processador pot executar alhora. En realitat, un processador només pot executar un programa bàsic, però els fils permeten pràcticament doblar el nombre de tasques i accelerar una mica més la velocitat d’execució.

source: En 2022 un procesador típico de Intel suele tener dos hilos de ejecución por núcleo. Es decir, una CPU de 8 núcleos tendrá 16 hilos de ejecución.
ca: El 2022, un processador Intel típic sol tenir dos fils d'execució bàsics. És a dir, una CPU de 8 core tindrà 16 fils d’execució.

source: Memoria caché
ca: Memòria de la memòria cau

source: Es una memoria intermedia que permite acceder a los datos y programas de manera más rápida cuando el procesador tiene que acceder repetidamente a los mismos datos de la memoria RAM.
ca: És una memòria intermèdia que permet accedir a dades i programes més ràpidament quan el processador ha d’accedir repetidament a les mateixes dades de RAM.

source: Los procesadores deben leer información de la memoria RAM para realizar su tarea, tanto información del programa a ejecutar como de los datos a procesar. La velocidad de transferencia de la memoria RAM suele ser más lenta que la velocidad de proceso del procesador. La memoria caché se utiliza como una memoria intermedia que almacena los contenidos de la memoria RAM que se leen de forma repetida. De esta forma se puede disponer de los datos más rápido mientras se están procesando.
ca: Els processadors han de llegir la informació de RAM per realitzar la seva tasca, tant la informació del programa a executar com les dades a processar. La velocitat de transferència de memòria RAM sol ser més lenta que el procés del procés del processador. La memòria de la memòria cau s’utilitza com a memòria intermèdia que emmagatzema el contingut de la memòria RAM que es llegeix repetidament. D’aquesta manera, podeu tenir les dades més ràpidament mentre s’estan processant.

source: Cuanto mayor sea el tamaño de la memoria caché mayor será la velocidad final del procesador.
ca: Com més gran sigui la mida de la memòria cau, més gran és la velocitat final del processador.

source: La mayoría de las CPU tienen varios niveles de memoria caché incluidos. Cada nivel de memoria caché es más lento que el anterior, pero de mayor tamaño. Se suele dar el valor del mayor de ellos. Una CPU típica de un ordenador personal en 2022 suele tener un tamaño de memoria caché en torno a los 6 Megabytes.
ca: La majoria de les CPU tenen diversos nivells de memòria cau inclosos. Cada nivell de memòria cau és més lent que l’anterior, però més gran. Normalment es dóna el valor dels més grans. Una CPU típica d’un ordinador personal el 2022 sol tenir una mida de memòria cau d’uns 6 megabytes.

source: Número de bits
ca: Nombre de bits

source: Cada procesador puede manejar a la vez un número concreto de bits. El número de bits determina la cantidad de memoria a la que se puede acceder y la rapidez con la que se ejecutarán ciertas operaciones. Un procesador de 8 bits tratará la información cuatro veces más lento que uno de 32 bits.
ca: Cada processador pot gestionar al mateix temps un nombre específic de bits. El nombre de bits determina la quantitat de memòria a la qual es pot accedir i la velocitat amb què s’executaran determinades operacions. Un processador de 8 bits tractarà la informació quatre vegades més lent que un dels 32 bits.

source: Los procesadores más simples, como los que incorpora un teclado de ordenador o un horno microondas, son de 8 bits.
ca: Els processadors més simples, com els que incorporen un teclat de l’ordinador o un forn de microones, són de 8 bits.
