Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/informatica-hardware-perifericos.po
Languages: ca

source: Las tres tecnologías más usuales son la tecnología `láser con tóner <https://es.wikipedia.org/wiki/Impresora#T%C3%B3ner>`__, la tecnología de `inyección de tinta <https://es.wikipedia.org/wiki/Impresora#Inyecci%C3%B3n_de_tinta>`__ y la tecnología `térmica <https://es.wikipedia.org/wiki/Impresora_t%C3%A9rmica>`__ utilizada para imprimir los tickets de compra.
ca: Les tres tecnologies més habituals són la tecnologia `` làser amb tòner <https://es.wikipedia.org/wiki/impressora#t%C3%B3ner>`__,` Ink Injection Technology <https://es.wikipedia.org/wiki/impressoria#in -leci%c3%b3n_detinta>>`__ i la tecnologia tèrmica <https://es.wikipedia.org/wiki/impresora_t%C3%A9Rmica>`__ S'utilitza per imprimir els bitllets de compra.

source: El `DAC <https://www.culturasonora.es/hifi/que-es-un-dac/>`__ o conversor digital a analógico es un periférico de salida que permite convertir los archivos digitales del ordenador en música o sonido analógico con alta fidelidad, mayor que la de una simple tarjeta de sonido de ordenador.
ca: El `dac <https://www.culturasonora.es/hifi/que-es-un-dac/>`__ o un convertidor digital per a analògic és un perifèric de sortida que permet que els fitxers digitals de l’ordinador es converin en música o música analògica amb alta fidelitat, més gran que la d’una targeta de so simple.

source: DAC de audio.
ca: Audio DAC.

source: `Vg30et <https://commons.wikimedia.org/wiki/File:DAC_in_the_box.jpg>`__, `CC BY-SA 3.0 <https://creativecommons.org/licenses/by/3.0/deed.en>`__, via Wikimedia Commons.
ca: `` Vg30et <https://commons.wikimedia.org/wiki/file:dac_in_the_box.jpg>`__,` cc by-sa 3.0 <https://creatcommons.org/licenses/by/3.0/deed.en>`__, via wikimedia commons.

source: Altavoces
ca: Parlants

source: Los `altavoces <https://es.wikipedia.org/wiki/Altavoz>`__ para ordenador van acompañados normalmente de un amplificador de sonido para aumentar el nivel de la señal de salida del ordenador y producir sonidos de alto volumen.
ca: Els "altaveus <https://es.wikipedia.org/wiki/altavoz>`__ per a l'ordinador normalment estan acompanyats d'un amplificador de so per augmentar el nivell del senyal de sortida de l'ordinador i produir sons d'alt volum.

source: Altavoces USB.
ca: Ponents USB.

source: `Evan-Amos <https://commons.wikimedia.org/wiki/File:Logitech-usb-speakers.jpg>`__, Public Domain, via Wikimedia Commons.
ca: `Evan-amos <https://commons.wikimedia.org/wiki/file:Logitech-usb-speakers.jpg>`__, domini públic, a través de Wikimedia Commons.

source: Normalmente se utilizan sistemas estéreo con dos altavoces, uno derecho y otro izquierdo, pero también se pueden utilizar sistemas de `sonido envolvente 5.1 <https://es.wikipedia.org/wiki/Sonido_envolvente_5.1>`__ si el archivo original de audio/vídeo y la tarjeta de sonido lo permiten.
ca: Els sistemes estèreo normalment s’utilitzen amb dos altaveus, un a la dreta i un a l’esquerra, però també podeu utilitzar el so d’embolcall 5.1 <https: /.wikipedia.org/wiki/sonido_envolvolvento_5.1>`__ si el fitxer d’àudio/vídeo original i la targeta de so ho permeten.

source: Pilotos luminosos LED
ca: Pilots lluminosos dirigits

source: Los pilotos luminosos `LED <https://es.wikipedia.org/wiki/Led>`__ son pequeñas luces que informan de los estados del ordenador. Las cajas de ordenador y los teclados suelen tener pilotos LED para avisar de que el ordenador está encendido, que el disco duro está funcionando, que se está produciendo la carga de la batería o que se ha activado el teclado numérico.
ca: Els pilots lluminosos `led <https://es.wikipedia.org/wiki/led>`__ són petites llums que denuncien els estats de l'ordinador. Les caixes d’ordinador i els teclats solen portar pilots per advertir que l’ordinador està encès, que el disc dur funciona, que la càrrega de la bateria s’està produint o que s’ha activat el teclat numèric.

source: Pilotos LED de un teclado.
ca: Pilots LED d’un teclat.

source: `Daniel Beardsmore <https://commons.wikimedia.org/wiki/File:Lock_LEDs.jpg>`__, Public Domain, via Wikimedia Commons.
ca: `Daniel Beardsmore <https://commons.wikimedia.org/wiki/file:lock_leds.jpg>` __, domini públic, a través de Wikimedia Commons.

source: Motor de vibración
ca: Motor de vibracions

source: El motor de vibración se utiliza en los smartphones para indicar un evento de forma silenciosa. De esta manera, el motor puede informar de una llamada entrante o que ha llegado un nuevo mensaje con un nivel de ruido muy bajo.
ca: El motor de vibració s’utilitza en telèfons intel·ligents per indicar un esdeveniment en silenci. D’aquesta manera, el motor pot denunciar una trucada entrant o que ha arribat un nou missatge amb un nivell de soroll molt baix.

source: Motor que produce vibración.
ca: Motor que produeix vibracions.

source: Línea braille
ca: Braille Line

source: La `línea braille <https://es.wikipedia.org/wiki/Dispositivo_Braille>`__ es un periférico de salida que transforma texto del ordenador en una serie de puntos braille para que las personas con discapacidad visual puedan leer en ella.
ca: La `Braille Line <https://es.wikipedia.org/wiki/dispositivo_braille>`__ és un perifèric de sortida que transforma el text de l’ordinador en una sèrie de punts braille perquè les persones amb discapacitats visuals puguin llegir -hi.

source: Dispositivo de braille.
ca: Dispositiu Braille.

source: `Ixitixel <https://commons.wikimedia.org/wiki/File:Refreshable_Braille_display.jpg>`__, `CC BY-SA 3.0 <https://creativecommons.org/licenses/by/3.0/deed.en>`__, via Wikimedia Commons.
ca: `Ixitixel <https://commons.wikimedia.org/wiki/file:Refreshable_braille_display.jpg>` __, `cc by-sa 3.0 <https://creativecommons.org/licenses/by/3.0/deed.en>` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` ` `` `` `` `` `` `` `` ``

source: Estos periféricos agrupan varios dispositivos en uno y permiten tanto la entrada como la salida de datos del ordenador.
ca: Aquests perifèrics agrupen diversos dispositius en un i permeten la sortida de dades d’entrada i de l’ordinador.

source: Pantalla táctil
ca: Pantalla tàctil

source: La `pantalla táctil <https://es.wikipedia.org/wiki/Pantalla_t%C3%A1ctil>`__ es una pantalla informática que tiene detectores que permiten conocer la posición del dedo cuando toca o cuando se desplaza sobre su superficie. Esto hace que la pantalla sea interactiva y permite tanto la salida como la entrada de datos.
ca: La "pantalla tàctil <https://es.wikipedia.org/wiki/panalla_t%C3%A1Cl>`__ És una pantalla d'ordinador que té detectors que permeten conèixer la posició del dit quan es juga o quan es mou a la seva superfície. Això fa que la pantalla sigui interactiva i permet l’entrada de sortida i de dades.

source: Con la pantalla táctil se pueden dar órdenes a un dispositivo.
ca: Amb la pantalla tàctil podeu donar comandes a un dispositiu.

source: Pantalla táctil de un smartphone.
ca: Pantalla tàctil d’un telèfon intel·ligent.

source: `Victorgrigas <https://commons.wikimedia.org/wiki/File:Bangalore_Wikipedian_on_phone_5_closeup.jpg>`__, `CC BY-SA 3.0 <https://creativecommons.org/licenses/by/3.0/deed.en>`__, via Wikimedia Commons.
ca: `Victorgrigas <https://commons.wikimedia.org/wiki/file:bangalore_wikipedian_on_phone_5_cleop a través de Wikimedia Commons.

source: Impresora multifunción
ca: Impressora multifunció

source: La `impresora multifunción <https://es.wikipedia.org/wiki/Impresora_multifunci%C3%B3n>`__ es una combinación de impresora con escáner, por lo que permite la entrada y la salida de datos. Estas dos funciones le permiten actuar como una fotocopiadora o como un fax.
ca: La `impressora multifunció <https://es.wikipedia.org/wiki/impressorera_multifunci%C3%B3n>`__ és una combinació d'impressora amb un escàner, de manera que permet l'entrada i sortida de dades. Aquestes dues funcions us permeten actuar com a fotocopiador o com a fax.

source: Impresora multifuncion.
ca: Impressora multifunció.

source: Casco de realidad virtual
ca: Casc de realitat virtual

source: El `casco de realidad virtual <https://es.wikipedia.org/wiki/Casco_de_realidad_virtual>`__ también llamado gafas de realidad virtual, es un dispositivo que permite reproducir imágenes creadas por ordenador sobre una pantalla muy cercana a los ojos, por lo que las imágenes parecen mucho mayores que las de las pantallas normales. También se reproduce sonido estéreo por los auriculares incorporados.
ca: El "casc de realitat virtual <https://es.wikipedia.org/wiki/casco_de_reality_virtual>`__ també anomenat ulleres de realitat virtual, és un dispositiu que permet reproduir imatges creades per ordinador en una pantalla molt a prop dels ulls, de manera que les imatges semblen molt més grans que les de pantalles normals. El so estèreo també es reprodueix per auriculars construïts.

source: El casco de realidad virtual tiene sensores de posición y movimiento que permiten conocer dónde mira el usuario, para acompasar las imágenes presentadas a los movimientos de cabeza, de manera que al usuario le parece encontrarse inmerso en la realidad virtual que muestra el dispositivo.
ca: El casc de realitat virtual té sensors de posició i de moviment que permeten saber on es veu l’usuari, per acompanyar les imatges presentades als moviments del cap, de manera que l’usuari sembla estar immers en la realitat virtual que mostra el dispositiu.

source: Casco de realidad virtual.
ca: Casc de realitat virtual.

source: `Samwalton9 <https://commons.wikimedia.org/wiki/File:Oculus_Consumer_Version_1.jpg>`__, `CC BY-SA 4.0 <https://creativecommons.org/licenses/by/4.0/deed.en>`__, via Wikimedia Commons.
ca: `Samwalton9 <https://commons.wikimedia.org/wiki/file:oculus_consumer_version_1.jpg>`__, `cc by-sa 4.0 <https://creativecommons.org/licenses/by/4.0/deed.en>` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `

source: Tarjeta de sonido
ca: Targeta de son

source: La `tarjeta de sonido <https://es.wikipedia.org/wiki/Tarjeta_de_sonido>`__ es un dispositivo de entrada / salida que traduce entre señales analógicas y señales digitales.
ca: La "targeta de so <https://es.wikipedia.org/wiki/tarjeta_de_sonido>`__ és un dispositiu d'entrada/sortida que es tradueix entre senyals analògics i senyals digitals.

source: Las señales de entrada al ordenador desde un micrófono, desde una guitarra eléctrica o desde un reproductor de sonido son analógicas. La tarjeta de sonido transforma estas entradas analógicas mediante un `ADC <https://es.wikipedia.org/wiki/Conversi%C3%B3n_anal%C3%B3gica-digital>`__ en señales digitales que pueden ser procesadas por el ordenador.
ca: Les senyals d’entrada a l’ordinador des d’un micròfon, des d’una guitarra elèctrica o d’un reproductor de so són analògics. La targeta de so transforma aquestes entrades analògiques mitjançant un `ADC <https://es.wikipedia.org/wiki/conversi%C3%B3N_ANAL%C3%B3GICA-Digital>` `__ en senyals digitals que pot processar l'ordinador.

source: Cuando queremos que el ordenador reproduzca un sonido, es necesario convertir las señales digitales del ordenador en señales analógicas que pueden amplificarse y enviarse a unos altavoces. La tarjeta de sonido tiene un `DAC <https://es.wikipedia.org/wiki/Conversi%C3%B3n_digital-anal%C3%B3gica>`__ que realiza esta conversión de señales digitales a señales analógicas.
ca: Quan volem que l’ordinador reprodueixi un so, cal convertir els senyals digitals de l’ordinador en senyals analògics que es poden amplificar i enviar als altaveus. La targeta de so té un `dac <https://es.wikipedia.org/wiki/conversi%C3%B3n_digital-anal%C3%B3Gica>`__ que realitza aquesta conversió de senyals digitals a senyals analògics.

source: Tarjeta de sonido externa.
ca: Targeta de so externa.

source: `Woookie <https://commons.wikimedia.org/wiki/File:Soundblaster_Live_USB.png>`__, `CC BY-SA 3.0 <https://creativecommons.org/licenses/by/3.0/deed.en>`__, via Wikimedia Commons.
ca: `Woookie <https://commons.wikimedia.org/wiki/file:soundblaster_live_usb.png>`__, `cc by-sa 3.0 <https://creativecommons.org/licenses/by/3.0/deed.en>` `__, via commons Wikimedia.

source: Vídeo: `Explicación de Jaime Altozano sobre las tarjetas de sonido <https://www.youtube-nocookie.com/embed/4Wp8X7MvGB0>`__.
ca: Vídeo: `Jaime Altozano Explicació sobre les targetes de so <https://www.youtube-nocokie.com/embed/4wp8x7mvgb0>`__.

source: Test de la unidad
ca: Test de prova

source: `Test de periféricos I <../test/es-hardware-perifericos-1.html>`__
ca: `Test perifèric I <../ Test/ Es-Scourge-Periferic-1.html>`__

source: `Test de periféricos II <../test/es-hardware-perifericos-2.html>`__
ca: `Test perifèric II <../ Test/ Es-Hardware-Perifericos-2.html>`__

source: `Test de periféricos III <../test/es-hardware-perifericos-3.html>`__
ca: `Test perifèric III <../ Test/ Es-Scourge-Periferals-3.html>`__

source: `Test de periféricos IV <../test/es-hardware-perifericos-4.html>`__
ca: `Test perifèric IV <../ Test/ Es-Hardware-Perifericos-4.html>`__
