Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/informatica-hardware-intro.po
Languages: ca

source: Introducción al :index:`hardware`
ca: Introducció a: Índex: `maquinari '

source: El `hardware <https://es.wikipedia.org/wiki/Hardware>`__ (pronunciado jard.wer) es el conjunto de las partes físicas de un sistema informático. Son los componentes eléctricos, electrónicos y mecánicos de un ordenador tales como cables, cajas, periféricos, etc.
ca: Hardware <https://es.wikipedia.org/wiki/hardware>`__ (jardí pronunciat) és el conjunt de les parts físiques d'un sistema informàtic. Són els components elèctrics, electrònics i mecànics d’un ordinador com ara cables, caixes, perifèrics, etc.

source: Por el contrario los programas y datos de un ordenador son intangibles y se denominan software (pronunciado soft.wer).
ca: Per contra, els programes i les dades d’un ordinador són intangibles i s’anomenen programari (pronunciat soft.wer).

source: Informática
ca: Informàtica

source: La informática es la ciencia que se encarga del estudio de las técnicas, tecnologías y herramientas necesarias para recopilar, almacenar, procesar y transmitir información de manera eficiente y segura.
ca: La informàtica és la ciència responsable de l’estudi de les tecnologies, tecnologies i eines necessàries per recollir, emmagatzemar, processar i transmetre informació de manera eficient i segura.

source: La informática incluye una variedad de campos, como la programación, la bases de datos, la inteligencia artificial, la criptografía, las redes de computadoras, la configuración del hardware, entre otros.
ca: La informàtica inclou una varietat de camps, com ara programació, bases de dades, intel·ligència artificial, criptografia, xarxes informàtiques, configuració de maquinari, entre d'altres.

source: Los avances en la informática han permitido el desarrollo de dispositivos y sistemas informáticos que nos facilitan la vida diaria y han transformado completamente la forma en que nos comunicamos y accedemos a la información.
ca: Els avenços en informàtica han permès el desenvolupament de dispositius i sistemes informàtics que faciliten la vida diària i han transformat completament la manera de comunicar -nos i accedir a la informació.

source: Ordenadores y computadores
ca: Ordinadors i ordinadors

source: La palabra ordenador procede del francés "ordinateur" acuñado para fines comerciales por la empresa IBM en 1955 en Francia. Este término hace referencia a la capacidad que tienen los ordenadores para ordenar y clasificar grandes cantidades de datos, tales como listados de nombres por orden alfabético.
ca: La paraula ordinador prové del francès \ "ordinal " creat amb finalitats comercials per la Companyia IBM el 1955 a França. Aquest terme fa referència a la capacitat dels ordinadors d’ordenar i classificar grans quantitats de dades, com ara noms de noms en ordre alfabètic.

source: Por el contrario en el mundo anglosajón y en Latinoamérica es más común utilizar la palabra computador, del inglés "computer". Esta palabra se utilizaba para denominar a una persona dedicada a realizar cálculos matemáticos y luego fue adaptada para referirse a las máquinas que realizan esta función.
ca: Al contrari del món anglosaxó i a Amèrica Llatina, és més habitual utilitzar la paraula ordinador, des de l'anglès \ "ordinador ". Aquesta paraula es va utilitzar per trucar a una persona dedicada a realitzar càlculs matemàtics i després es va adaptar per referir -se a les màquines que realitzen aquesta funció.

source: Hitos históricos de la informática
ca: Fites informàtiques històriques

source: En 1725, un francés hijo de un fabricante de órganos, `Basile Bouchon <https://es.wikipedia.org/wiki/Basile_Bouchon>`__, adapta el concepto de los mecanismos de relojería utilizados en las cajas de música a la tarea repetitiva de un telar, operado a través de una cinta perforada.
ca: El 1725, un fill francès d’un fabricant d’òrgans, `Basile Bouchon <https://es.wikipedia.org/wiki/basile_bouchon>`__, adapta el concepte dels mecanismes de rellotge utilitzats en caixes de música a la tasca repetitiva d’un teler, operat a través d’una cinta perforada.

source: En 1801 el francés `Joseph Marie Jacquard <https://es.wikipedia.org/wiki/Joseph_Marie_Jacquard>`__ inventa un telar automático utilizando tarjetas perforadas para programar el telar. Esto permitía que hasta los usuarios más inexpertos pudieran elaborar complejos diseños y patrones en las telas.
ca: El 1801, el francès `Joseph Marie Jacquard <https://es.wikipedia.org/wiki/joseph_marie_jacquard>`__ inventa un teler automàtic mitjançant targetes perforades per programar el teler. Això va permetre fins i tot als usuaris amb més experiència fer dissenys i patrons complexos en els teixits.

source: El matemático británico `Charles Babbage <https://es.wikipedia.org/wiki/Charles_Babbage>`__ construyó entre 1833 y 1842 una máquina mecánica programable para hacer cualquier tipo de cálculo, la máquina analítica, que no llegó a funcionar por problemas mecánicos de difícil solución en esa época.
ca: El matemàtic britànic `Charles Babbage <https://es.wikipedia.org/wiki/charles_babbage>`__ construït entre 1833 i 1842 Una màquina mecànica programable per fer qualsevol tipus de càlcul, la màquina analítica, que no funcionava a causa de problemes mecànics de solució difícil en aquell moment.

source: Su proyecto innovador incluía todos los elementos de un ordenador tal y como lo concebimos actualmente. Disponía de dispositivos de entrada basados en las tarjetas perforadas del telar Jacquard, un procesador aritmético que calculaba números, una unidad de control que determinaba qué tarea debía ser realizada, un mecanismo de salida y una memoria donde los números podían ser almacenados hasta ser procesados.
ca: El seu projecte innovador incloïa tots els elements d’un ordinador tal com vam concebre actualment. Tenia dispositius d’entrada basats en les targetes de perforació del teler Jacquard, un processador aritmètic que calculava els números, una unitat de control que va determinar quina tasca s’ha de realitzar, un mecanisme de sortida i una memòria on es podien emmagatzemar els números fins que es processessin.

source: La matemática y escritora `Ada Lovelace <https://es.wikipedia.org/wiki/Ada_Lovelace>`__ crea junto a Babbage el primer programa para el ordenador mecánico, por lo que se la considera la primera programadora de computadoras de la historia.
ca: La matemàtica i l'escriptora `Ada Lovelace <https://es.wikipedia.org/wiki/ada_lovelace>`__ crea amb babbage el primer programa per a l'ordinador mecànic, de manera que es considera el primer programador informàtic de la història.

source: `Herman Hollerith <https://es.wikipedia.org/wiki/Herman_Hollerith>`__ desarrolló la tecnología de procesamiento de tarjetas perforadas de datos para el censo de los Estados Unidos de América de 1890. También fundó la compañía Tabulating Machine Company que más tarde se uniría a otras dos compañías para formar la actual IBM. IBM manufacturó y comercializó una variedad de máquinas de registro para crear, ordenar, y tabular tarjetas perforadas.
ca: `Herman Hollerith <https://es.wikipedia.org/wiki/herman_hollerith>`__ va desenvolupar la tecnologia de processament de targetes que va impulsar les dades per al cens dels Estats Units d'Amèrica de 1890. També va fundar la companyia de màquines tabulants que després s'uniria a dues empreses per formar el IBM actual. IBM fabricat i comercialitzat diverses màquines de registre per crear, ordenar i tabular targetes perforades.

source: En el año 1936 el alemán `Konrad Zuse <https://es.wikipedia.org/wiki/Konrad_Zuse>`__ creó el primer ordenador general de la historia, llamado Z1. El Z1 era el primer sistema informático totalmente programable. Su tecnología estaba basada en relés electromecánicos.
ca: El 1936, el alemany `konrad zuse <https://es.wikipedia.org/wiki/konrad_zuse>`__ va crear el primer ordinador general de la història, anomenat Z1. El Z1 va ser el primer sistema informàtic completament programable. La seva tecnologia es basava en relleus electromecànics.

source: Durante la segunda guerra mundial se desarrollan los ordenadores basados en válvulas de vacío, más rápidas que los relés mecánicos. El `Colossus Mark I <https://es.wikipedia.org/wiki/Colossus>`__, fabricado por los británicos en 1944, ayudó a descifrar los mensajes de la máquina de cifrado alemana enigma. El `ENIAC <https://es.wikipedia.org/wiki/ENIAC>`__, desarrollado por EEUU en 1946, sirvió para calcular tablas de tiro balístico, entre otras funciones.
ca: Durant la Segona Guerra Mundial es desenvolupen els ordinadors basats en vàlvules de buit, més ràpidament que els relés mecànics. El "Colossus Mark I <https://es.wikipedia.org/wiki/colossus>`__, fabricat pels britànics el 1944, va ajudar a desxifrar els missatges de la màquina de xifratge enigma alemanya. El `eniac <https://es.wikipedia.org/wiki/eniac>`__, desenvolupat pels Estats Units el 1946, va servir per calcular les taules de tir balístiques, entre altres funcions.

source: En 1954 aparece el ordenador `TRADIC <https://es.wikipedia.org/wiki/Tradic>`__, primero en utilizar la nueva tecnología de los transistores, mucho más rápidos, fiables y pequeños que las válvulas de vacío. La tecnología de transistores todavía se utiliza para fabricar los ordenadores actuales.
ca: El 1954, apareix, la tradició <https://es.wikipedia.org/wiki/tradic>`__, primer a utilitzar la nova tecnologia dels transistors, molt més ràpid, més ràpid, fiable i petit que les vàlvules de buit. La tecnologia del transistor encara s’utilitza per fabricar ordinadors actuals.

source: En 1971 la empresa `Intel <https://es.wikipedia.org/wiki/Intel>`__ presentó el primer **microprocesador** en un solo chip, el 4004. Pocos años después aparecieron varios microprocesadores de 8 bit en un solo chip, que sirvieron de base a los primeros ordenadores personales de venta masiva.
ca: El 1971, la companyia `Intel <https://es.wikipedia.org/wiki/intel>`__ va presentar el primer microprocessador ** ** en un sol xip, el 4004. Uns anys més tard, diversos microprocessadors de 8 bits van aparèixer en un sol xip, que va servir com a base per als primers computadors personals de la venda de masses.

source: En 1977 aparecen en el mercado tres ordenadores personales dirigidos al consumo masivo, entre los que destaca el Apple II. Hasta ese momento los ordenadores eran máquinas orientadas a las empresas. Comienza la era de la informática personal.
ca: El 1977, hi ha tres ordinadors personals dirigits al consum massiu, entre els quals destaca Apple II. Fins aleshores, els ordinadors estaven orientats a les empreses. Comença l’època de la informàtica personal.

source: En 1981 la empresa IBM lanza su ordenador personal con sistema operativo de Microsoft. Este ordenador tenía un diseño abierto que permitió que otras compañías fabricasen ordenadores clónicos, compatibles con el de IBM. La mayoría de los ordenadores actuales de sobremesa y ordenadores portátiles están basados en este primer ordenador de IBM.
ca: El 1981, la companyia IBM va llançar el seu ordinador personal amb el sistema operatiu de Microsoft. Aquest ordinador tenia un disseny obert que permetia a altres empreses fer ordinadors clònics, compatibles amb el d’IBM. La majoria d’ordinadors d’escriptori actuals i ordinadors portàtils es basen en aquest primer ordinador IBM.

source: Alrededor de 1995 `Internet <https://es.wikipedia.org/wiki/Internet>`__, una red limitada a universidades, centros de cálculo o bases militares, comienza a ser utilizada de forma masiva por todo tipo de usuarios. Pocos años más tarde, en 1998, aparece la empresa Google con un buscador que facilita enormemente las búsquedas de páginas web en Internet.
ca: Al voltant de 1995 `Internet <https://es.wikipedia.org/wiki/internet>`__, una xarxa limitada a universitats, centres de càlcul o bases militars, comença a ser utilitzada massivament per tot tipus d'usuaris. Uns anys després, el 1998, la companyia de Google apareix amb un motor de cerca que facilita molt les cerques de pàgines web a Internet.

source: En 2007 la empresa Apple lanza al mercado el primer teléfono inteligente con pantalla táctil, precursor de todos los teléfonos inteligentes actuales. La informática deja de estar asociada al escritorio y comienza a estar disponible permanentemente en el bolsillo del usuario.
ca: El 2007, l’empresa d’Apple llança el primer telèfon intel·ligent amb pantalla tàctil, precursor de tots els telèfons intel·ligents actuals. La informàtica deixa d’associar -se al taulell i comença a estar disponible de manera permanent a la butxaca de l’usuari.

source: Esquema de un ordenador
ca: Esquema d’un ordinador

source: El esquema básico de un ordenador contiene los siguientes componentes.
ca: L’esquema bàsic d’un ordinador conté els components següents.

source: Esquema básico de un ordenador.
ca: Esquema bàsic d’un ordinador.

source: Test de la unidad
ca: Test de prova

source: `Test de introducción al hardware I. <../test/es-hardware-intro-1.html>`__
ca: `Introducció al maquinari I. <../ Test/ Es-Hardware-Intro-1.html>`__

source: `Test de introducción al hardware II. <../test/es-hardware-intro-2.html>`__
ca: `Introducció al maquinari II. <../ Test/ es-Hardware-Intro-2.html>`__
