Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/informatica-software-imagenes.po
Languages: ca

source: :index:`Formatos de imagen`
ca: :index:`Formats d'imatge`

source: Existen dos grandes tipos de formatos de imagen, los formatos de mapa de bits y los formatos vectoriales.
ca: Hi ha dos grans tipus de formats d’imatges, formats de mapes de bits i formats vectorials.

source: Formato de `imagen de mapa de bits <https://es.wikipedia.org/wiki/Imagen_de_mapa_de_bits>`__
ca: Imatge del mapa de bits <https://es.wikipedia.org/wiki/imagen_de_mapa_de_bits>

source: Las imágenes de mapa de bits, también llamadas **Raster**, están formadas por muchos puntos de color denominados `píxeles <https://es.wikipedia.org/wiki/P%C3%ADxel>`__, que conforman una fotografía o dibujo. Cuando este tipo de imagen se amplía, se pueden ver los diferentes píxeles de la imagen como elementos diferentes. Esto hace que la calidad de la imagen empeore en estos casos.
ca: Les imatges del mapa de bits, també anomenades ** Raster **, estan formades per molts punts de color anomenats `píxels <https://es.wikipedia.org/wiki/p%C3%Adxel>`__, que formen una fotografia o un dibuix. Quan aquest tipus d’imatge s’amplia, podeu veure els diferents píxels de la imatge com a elements diferents. Això empitjora la qualitat de la imatge en aquests casos.

source: Un ejemplo de imagen de mapa de bits es las imágenes que toma una cámara fotográfica digital o un escáner.
ca: Un exemple d’imatge del mapa de bits són les imatges preses per una càmera digital o un escàner.

source: Formato de `imagen vectorial <https://es.wikipedia.org/wiki/Gr%C3%A1fico_vectorial>`__
ca: `` Format d'imatge vectorial <https://es.wikipedia.org/wiki/gr%C3%A1ficia_vecorial>`__

source: Las imágenes vectoriales están formadas por instrucciones que determinan la aparición de objetos tales como líneas, círculos, cuadrados o `curvas de Bézier <https://es.wikipedia.org/wiki/Curva_de_B%C3%A9zier>`__. Cuando este tipo de imagen se amplía, las líneas y curvas permanecen con la misma calidad, sin que se puedan apreciar puntos que formen la imagen.
ca: Les imatges vectorials estan formades per instruccions que determinen l’aparició d’objectes com línies, cercles, quadrats o `corbes de Bézier <https://es.wikipedia.org/wiki/curva_de_b%C3%A9Zier>`__. Quan aquest tipus d’imatge s’amplia, les línies i les corbes es mantenen amb la mateixa qualitat, sense veure punts que formen la imatge.

source: Un ejemplo de imagen vectorial se puede encontrar en las letras TrueType de un editor de textos o de un documento PDF. Estas letras se pueden ampliar todo lo que se desee sin perder nunca su calidad.
ca: Es pot trobar un exemple de imatge vectorial a les lletres Truetype d’un editor de text o d’un document PDF. Aquestes cartes poden ampliar tot el que vulgueu sense perdre mai la vostra qualitat.

source: Diferencia entre una imagen de mapa de bits (Raster) y una imagen vectorial (SVG).
ca: Diferència entre una imatge del mapa de bits (ràster) i una imatge vectorial (SVG).

source: Índice de contenidos:
ca: Índex de contingut:

source: Esquemas de color
ca: Esquemes de colors

source: Existen dos grandes esquemas de color, el aditivo y el sustractivo. Cada uno de ellos tiene un campo de aplicación distinto y es conveniente utilizar cada uno en su ámbito, para obtener los mejores resultados.
ca: Hi ha dos esquemes de colors grans, l’additiu i el subtractiu. Cadascun d'ells té un camp d'aplicació diferent i és convenient utilitzar -les en el seu camp, per obtenir els millors resultats.

source: Esquema de color aditivo RGB
ca: Esquema de colors additius RGB

source: Este esquema se denomina aditivo porque genera los diferentes colores **añadiendo** fuentes de luz. Es el esquema utilizado en los monitores, televisores proyectores o pantallas de teléfono.
ca: Aquest esquema s’anomena additiu perquè genera els diferents colors ** afegint ** fonts de llum. És l’esquema que s’utilitza en monitors, pantalles telefòniques o pantalles telefòniques.

source: Los colores primarios a partir de los que se forman todos los demás son el **rojo** (Red), el **verde** (Green) y el **azul** (Blue). De esos tres colores proviene el nombre RGB.
ca: Els colors principals dels quals es formen tots els altres són ** vermell ** (xarxa), ** verd ** (verd) i ** blau ** (blau). D’aquests tres colors prové el nom RGB.

source: Este esquema funciona basándose en que el ojo humano tiene tres receptores de color (rojo, verde y azul) que utiliza para detectar todos los colores del arcoíris a partir de una combinación de todos ellos. Así nuestro ojo percibe el color amarillo como una combinación de luz roja más luz verde.
ca: Aquest esquema funciona basat en el fet que l’ull humà té tres receptors de colors (vermell, verd i blau) que utilitza per detectar tots els colors de l’arc de Sant Martí a partir d’una combinació de tots ells. Així, el nostre ull percep el color groc com una combinació de llum vermella més llum verda.

source: Los colores secundarios se forman sumando dos colores primarios:
ca: Els colors secundaris es formen afegint dos colors primaris:

source: Rojo + Verde = Amarillo
ca: Vermell + verd = groc

source: Rojo + Azul = Magenta
ca: Vermell + blau = magenta

source: Verde + Azul = Cian
ca: Verd + blau = cian

source: Rojo + Verde + Azul = Blanco
ca: Vermell + verd + blau = blanc

source: Ausencia de color = Negro
ca: Absència de color = negre

source: Esquema de color sustractivo CMYK
ca: Esquema de colors subtractius CMYK

source: Este esquema se denomina sustractivo porque genera los diferentes colores reflejando la luz blanca, que contiene todos los colores, menos algún color que se sustrae con una tinta. Por ejemplo, la tinta amarilla reflejará toda la luz blanca que le llega, menos el color azul, que se sustrae o absorbe en el interior de la tinta. Este es el esquema de color que se utiliza en las imprentas.
ca: Aquest esquema s’anomena subtractiu perquè genera els diferents colors que reflecteixen la llum blanca, que conté tots els colors, excepte algun color robat amb una tinta. Per exemple, la tinta groga reflectirà tota la llum blanca que arriba a ella, excepte el color blau, que es roba o s’absorbeix dins de la tinta. Aquest és l’esquema de colors que s’utilitza a la impremta.

source: Los colores primarios a partir de los que se forman todos los demás son el **cian** (Cyan), el magenta (Magent), el **amarillo** (Yellow) y el color **negro** (Key). Si las tintas fuesen perfectas, podrían conseguir el color negro sumando todas ellas (CMY) pero en la práctica resulta más sencillo y se ve más oscuro al utilizar una tinta específica para conseguir el color negro.
ca: Els colors principals dels quals es formen tots els altres són ** cian ** (cian), la magenta (Magent), el ** groc ** (groc) i el color ** negre ** (clau). Si les tintes fossin perfectes, podrien obtenir el color negre afegint -ne totes (CMY), però a la pràctica és més fàcil i sembla més fosc quan s’utilitza una tinta específica per obtenir el color negre.

source: Los colores secundarios se obtienen mezclando tintas y por lo tanto absorbiendo más de un color. De los tres colores que tiene la luz blanca (rojo, verde y azul) la tinta amarilla absorbe azul, la tinta cian absorbe rojo y la tinta magenta absorbe el verde. Al mezclar tintas amarilla y cian, se absorben el azul y el rojo, quedando solo el color verde como resultado final.
ca: Els colors secundaris s’obtenen barrejant tintes i, per tant, absorbint més d’un color. Dels tres colors que la llum blanca (vermell, verd i blau) té la tinta groga absorbeix blau, la tinta cian absorbeix el vermell i la tinta magenta absorbeix el verd. En barrejar tintes grogues i cianes, el blau i el vermell s’absorbeixen, deixant només el color verd com a resultat final.

source: Este esquema se utiliza para la impresión de revistas, libros, folletos, carteles y todo tipo de trabajos de imprenta. También es la base de las impresoras a color y de las pinturas al óleo, acuarelas, ceras, etc.
ca: Aquest esquema s’utilitza per a la impressió de revistes, llibres, fulletons, pòsters i tot tipus de treballs d’impressió. També és la base de les impressores de colors i les pintures a l’oli, les aquarel·les, les ceres, etc.

source: Cian + Magenta = Azul
ca: Cian + magenta = blau

source: Cian + Amarillo = Verde
ca: Cian + groc = verd

source: Magenta + Amarillo = Rojo
ca: Magenta + groc = vermell

source: Cian + Magenta + Amarillo = Negro
ca: Cian + magenta + groc = negre

source: Ausencia de color = Blanco
ca: Absència de color = blanc

source: Profundidad de color
ca: Profunditat de color

source: La profundidad de color se refiere al número de colores distintos que puede mostrar una imagen. La menor profundidad de color es la de una imagen que solo trabaja con 2 colores (blanco y negro).
ca: La profunditat del color fa referència al nombre de colors diferents que pot mostrar una imatge. La profunditat de colors més baixa és la d’una imatge que només funciona amb 2 colors (blanc i negre).

source: La profundidad de color en las imágenes JPEG estándar de cámara fotográfica es de 8 bits (256 niveles) para cada uno de los tres tonos RGB, con un resultado total de 24 bits ó 16 millones de colores distintos.
ca: La profunditat de color a les imatges de la càmera estàndard de la càmera és de 8 bits (256 nivells) per a cadascun dels tres tons RGB, amb un resultat total de 24 bits o 16 milions de colors diferents.

source: Por último las cámaras profesionales pueden tomar imágenes de tipo RAW con hasta 14 bits (16384 niveles) para cada uno de los tres tonos RGB, con un resultado total de 42 bits ó 4 billones de colores distintos. En la práctica esta profundidad de color no se puede representar en papel ni nosotros somos capaces de apreciarla, pero permite trabajar con la imagen para editarla o 'revelarla' como nos convenga sin pérdidas de calidad.
ca: Finalment, les càmeres professionals poden prendre imatges de tipus brut amb fins a 14 bits (16384 nivells) per a cadascun dels tres tons RGB, amb un resultat total de 42 bits o 4.000 milions de colors diferents. A la pràctica, aquesta profunditat de color no es pot representar en paper o podem apreciar -la, però us permet treballar amb la imatge per editar -la o “revelar -la” ja que ens convé sense pèrdues de qualitat.

source: Profundidad de color de 1 bit
ca: De profunditat de color de 1 bit

source: 2 colores.
ca: 2 colors.

source: Esta profundidad de color se utiliza para enviar fax, almacenar texto o dibujos sencillos. La ventaja que presenta es que ocupa muy poco espacio.
ca: Aquesta profunditat de color s’utilitza per enviar fax, emmagatzemar text o dibuixos senzills. L’avantatge que presenta és que ocupa molt poc espai.

source: Profundidad de color de 4 bits
ca: Profunditat de color de 4 bits

source: 16 colores.
ca: 16 colors.

source: Es una profundidad de color demasiado baja y presenta errores evidentes en la imagen, pero se puede utilizar en escaneado de documentos para representar color con un tamaño total más reducido.
ca: És una profunditat de color massa baixa i presenta errors evidents a la imatge, però es pot utilitzar en documents per representar el color amb una mida total més petita.

source: Profundidad de color de 8 bits gris
ca: Profunditat de color de 8 bits gris

source: 256 tonos de gris.
ca: 256 tons de gris.

source: No tiene apenas pérdida de calidad en los tonos, pero no permite representar color.
ca: Amb prou feines té pèrdues de qualitat en tons, però no permet representar el color.

source: Profundidad de color de 8 bits
ca: Profunditat de color de 8 bits

source: 256 colores.
ca: 256 colors.

source: Este es el estándar de las imágenes con formato GIF. Permite representar suficientes colores como para que no se aprecie demasiada pérdida de calidad, con la ventaja de permitir reducir el tamaño de la imagen con respecto al color verdadero (True color).
ca: Aquest és l’estàndard d’imatges del format GIF. Permet que es representin prou colors de manera que no hi hagi molta pèrdua de qualitat, amb l’avantatge de permetre reduir la mida de la imatge respecte al veritable color (color veritable).

source: Profundidad de color de 24 bits
ca: Profunditat de color de 24 bits

source: 16 millones de colores (256 tonos de rojo, 256 de verde y 256 de azul).
ca: 16 milions de colors (256 tons de vermell, 256 verd i 256 blau).

source: También llamado color verdadero o **True Color**. Este es el estándar de las imágenes con formato JPEG. Tiene una calidad suficiente como para almacenar fotografías, pero no tiene tanta calidad como para realizar operaciones de edición de imágenes sin peligro de perder precisión.
ca: També es diu veritable color o ** color veritable **. Aquest és l’estàndard de les imatges amb format JPEG. Té una qualitat suficient per emmagatzemar fotografies, però no té tanta qualitat per realitzar operacions d’edició d’imatges sense perill de perdre la precisió.

source: Profundidad de color de 36 a 48 bits
ca: Profunditat de color de 36 a 48 bits

source: 14 bits por cada tono RGB = 42 bits ó 4 billones de colores.
ca: 14 bits per a cada to RGB = 42 bits o 4.000 milions de colors.

source: Los esquemas con mayor número de colores que el de 8 bits por cada tono RGB no presentan diferencias apreciables para el ojo humano.
ca: Els esquemes amb el major nombre de colors que els de 8 bits per a cada to RGB no tenen diferències apreciables per a l’ull humà.

source: Cuando una imagen tiene más de 8 bits por tono RGB se pueden realizar operaciones de edición de imágenes con menos pérdida de calidad que en las imágenes con menos colores, que no son apropiadas para las operaciones de edición.
ca: Quan una imatge té més de 8 bits per to RGB, les operacions d’edició d’imatges es poden dur a terme amb menys pèrdua de qualitat que a les imatges amb menys colors, que no són adequats per a l’edició d’operacions.

source: Formatos de mapa de bits
ca: Formats de mapes de bits

source: Los siguientes formatos de **imágenes de mapa de bits** están compuestos por píxeles o puntos de la imagen que se almacenan uno a uno en el archivo hasta completar la imagen.
ca: Els formats següents de les imatges del mapa de ** bits ** estan compostos per píxels o punts de la imatge que s’emmagatzemen un per un al fitxer fins que es finalitzi la imatge.

source: El formato `JPEG <https://es.wikipedia.org/wiki/Joint_Photographic_Experts_Group>`__ (Joint Photographic Experts Group), creado en 1992, es un formato de archivo de imagen que se utiliza para almacenar fotografías en un formato comprimido. Este formato de archivo tiene pérdidas (es lossy), lo que significa que se pierde cierta cantidad de información de la imagen al comprimirla para que ocupe menos espacio, especialmente en los pequeños detalles, generando un ruido llamado `artefactos <https://es.wikipedia.org/wiki/Artefacto_de_compresi%C3%B3n>`__. Por esa razón este formato no es una buena opción para guardar imágenes de dibujos, texto, gráficas, etc.
ca: El `jpeg <https://es.wikipedia.org/wiki/joint_photography_experts_group>`__ (grup de fotografies fotogràfiques conjuntes), creat el 1992, és un format de fitxer d’imatge que s’utilitza per emmagatzemar fotografies en un format comprimit. Aquest format de fitxer té pèrdues (és pèrdua), cosa que significa que es perd una certa informació sobre la imatge quan la comprimeix per ocupar menys espai, especialment en petits detalls, generant un soroll anomenat `artefactes <https://es.wikipedia.org/wiki/artefacto_de_compresi%C3_b3n>`__. Per això, aquest format no és una bona opció per desar imatges de dibuixos, text, gràfics, etc.

source: Fotografía almacenada en formato JPEG.
ca: Fotografia emmagatzemada en format JPEG.

source: El formato de archivo JPEG se puede utilizar para almacenar imágenes en varios formatos de color, incluyendo RGB de 8 bits por color, CMYK y YCbCr. La profundidad de color de este formato (8 bits por cada tono RGB) es reducida y por lo tanto no es una buena opción para editar fotografías. Para esa tarea es mucho mejor utilizar los formatos RAW de cada cámara fotográfica que llegan a tener 36 ó 42 bits por pixel.
ca: El format de fitxer JPEG es pot utilitzar per emmagatzemar imatges en diversos formats de colors, inclosos RGB de 8 bits per color, CMYK i YCBCR. La profunditat de color d’aquest format (8 bits per a cada to RGB) es redueix i, per tant, no és una bona opció per editar fotografies. Per a aquesta tasca, és molt millor utilitzar els formats crus de cada càmera que tinguin 36 o 42 bits per píxel.

source: El formato JPEG no permite definir transparencias en la imagen por lo que tampoco es una buena opción para insertar imágenes recortadas. Para esa tarea es mejor utilizar un formato que permita transparencias, como el PNG.
ca: El format JPEG no permet definir transparències a la imatge, de manera que no és una bona opció inserir imatges tallades. Per a aquesta tasca, és millor utilitzar un format que permeti transparències, com PNG.

source: PNG
ca: Pàg.

source: El formato `PNG <https://es.wikipedia.org/wiki/Portable_Network_Graphics>`__ (Portable Network Graphics) fue creado en 1995 como un formato de imagen con compresión y sin pérdidas, es decir, que no pierde ningún detalle durante la compresión de la imagen.
ca: El `png <https://es.wikipedia.org/wiki/portable_network_graphics>`__ (gràfics de xarxa portàtil) es va crear el 1995 com a format d'imatge amb compressió i sense pèrdues, és a dir, no perd cap detall durant la compressió de la imatge.

source: El formato PNG es ideal para almacenar imágenes de dibujos o texto ya que, al no tener pérdidas, se almacenarán sin ruido o "artefactos".
ca: El format PNG és ideal per emmagatzemar imatges de dibuixos o text, ja que, sense pèrdues, es guardaran sense soroll ni \ "artefactes ".

source: Imagen PNG de una cuadrícula coloreada.
ca: Imatge PNG d’una graella de colors.

source: Este formato también es ideal para imágenes que utilicen **transparencias**, ya que cada píxel puede ser almacenado junto a un código de color transparente que evita que se noten los bordes.
ca: Aquest format també és ideal per a imatges que utilitzen ** transparències **, ja que cada píxel es pot emmagatzemar al costat d’un codi de colors transparent que impedeix que es notin les vores.

source: Si bien se puede utilizar para guardar fotografías, no es aconsejable porque, al no tener pérdidas, su tamaño es mucho mayor que el de las imágenes JPEG. Si lo que se desea es guardar una fotografía sin pérdidas para poder editarla, es preferible utilizar el formato TIFF.
ca: Tot i que es pot utilitzar per estalviar fotografies, no és aconsellable perquè, sense tenir pèrdues, la seva mida és molt més gran que la de les imatges JPEG. Si el que es vol és estalviar una fotografia sense pèrdues per poder editar -la, és preferible utilitzar el format TIFF.

source: El formato PNG puede guardar las imágenes con diversas profundidades de color adaptadas a cada aplicación. Con los colores blanco y negro (1 bit por pixel) se pueden almacenar imágenes de texto o similares con un nivel de compresión muy alto. También se pueden almacenar imágenes en escala de grises o imágenes con color verdadero (RGB de 8 bits por color).
ca: El format PNG pot desar les imatges amb diverses profunditats de color adaptades a cada aplicació. Amb colors en blanc i negre (1 bit per píxel), podeu emmagatzemar text o imatges similars amb un nivell de compressió molt alt. També podeu emmagatzemar gris o imatges amb una escala de colors veritable (RGB de 8 bits per color).

source: El formato PNG no permite almacenar colores CMYK adaptados a la impresión en papel.
ca: El format PNG no permet emmagatzemar els colors CMYK adaptats a la impressió de paper.

source: El formato `GIF <https://es.wikipedia.org/wiki/Graphics_Interchange_Format>`__ (Graphics Format Interchange) fue lanzado en 1987 por CompuServe y es ampliamente utilizado en Internet tanto en imágenes como en animaciones debido a su amplio soporte y compatibilidad.
ca: El `gif <https://es.wikipedia.org/wiki/graphics_interchange_format>`__ (intercanvi de format gràfic) va ser llançat el 1987 per Compuserve i és àmpliament utilitzat a Internet tant en imatges com en animacions a causa del seu ampli suport i compatibilitat.

source: Como característica especial, este es el único formato popular que puede guardar imágenes en movimiento o animaciones. Los vídeos con imágenes fotográficas aparecen con una gran pérdida de color debido a que este formato solo puede manejar una paleta de 256 colores, no obstante esto no ha impedido que sea muy utilizado.
ca: Com a característica especial, aquest és l’únic format popular que pot estalviar imatges o animacions en moviment. Els vídeos amb imatges fotogràfiques apareixen amb una gran pèrdua de color, ja que aquest format només pot gestionar una paleta de 256, però això no ha impedit que s’utilitzi àmpliament.

source: El formato GIF permite guardar dibujos con transparencias, pero con `peor calidad que con el formato PNG de 24 bits <https://desarrolloweb.com/articulos/transparencia-formatos-graficos-web-gif-png.html>`__.
ca: El format GIF us permet estalviar dibuixos amb transparències, però amb una "pitjor qualitat que amb el format PNG de 24 bits <https://development.com/articulos/transparencia-formatos-raficos-weB-gif-png.html>`__.

source: La aplicación principal del formato GIF es almacenar pequeños dibujos y animaciones con o sin transparencia.
ca: L’aplicació principal del format GIF és emmagatzemar petits dibuixos i animacions amb o sense transparència.

source: TIFF
ca: Tetf

source: El formato `TIFF <https://es.wikipedia.org/wiki/TIFF>`__ (Tagged Image File Format) se publicó en su versión 6 en 1992 y tiene un gran uso en la industria gráfica y en la fotografía profesional por su versatilidad y compresión sin pérdidas.
ca: El `tiff <https://es.wikipedia.org/wiki/tiff>`__ (format de fitxer d'imatge etiquetats) es va publicar a la seva versió 6 el 1992 i té un gran ús en la indústria gràfica i en fotografia professional per la seva versatilitat i compressió sense pèrdues.

source: Es un formato que ocupa mucha memoria cuando almacena fotografías sin pérdidas, especialmente si se utiliza una gran profundidad de color, con 16 bits por cada tono de color RGB. Sin embargo, estas características hacen que el formato TIFF sea muy apreciado en edición fotográfica profesional y fotografía científica.
ca: És un format que ocupa molta memòria quan emmagatzema fotografies sense pèrdues, sobretot si s’utilitza una profunditat de color gran, amb 16 bits per a cada to de color RGB. Tot i això, aquestes característiques fan que el format TIFF sigui molt apreciat en l’edició fotogràfica professional i la fotografia científica.

source: RAW
ca: Cru

source: El formato `RAW <https://es.wikipedia.org/wiki/Raw_(formato)>`__ es un conjunto de formatos que utilizan las cámaras fotográficas profesionales y de alta gama para guardar las imágenes tal y como han sido captadas por el sensor de la cámara. Tienen una gran profundidad de color (de 36 a 48 bits por pixel) y se almacenan sin pérdidas, por lo que cada fichero ocupa un gran tamaño comparado con la imagen equivalente en formato JPEG.
ca: El `Raw <https://es.wikipedia.org/wiki/raw_ (format)>`__ és un conjunt de formats utilitzats per càmeres fotogràfiques professionals i altes per salvar les imatges ja que han estat capturades pel sensor de la càmera. Tenen una gran profunditat de color (de 36 a 48 bits per píxel) i s’emmagatzemen sense pèrdues, de manera que cada fitxer ocupa una mida gran en comparació amb la imatge equivalent del format JPEG.
