Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/informatica-hardware-clasificacion.po
Languages: ca

source: Clasificación de los ordenadores
ca: Classificació dels ordinadors

source: Dependiendo de la potencia, del tamaño del hardware y de su función, podemos clasificar a los ordenadores en alguno de los siguientes apartados.
ca: Segons la potència, la mida del maquinari i la seva funció, podem classificar els ordinadors en una de les seccions següents.

source: Controladores programables
ca: Controladors programables

source: Son pequeños ordenadores de baja potencia, destinados a controlar de forma inteligente aparatos domésticos, elementos de un automóvil, etc. Estos controladores son los que permiten realizar programas a una lavadora, temporizar digitalmente un horno microondas, activar el freno ABS de un automóvil, realizar mediciones de consumo eléctrico a distancia, validar una tarjeta de transporte en el autobús, encender una bombilla mediante conexión wifi, controlar una máquina expendedora, etc.
ca: Són petits ordinadors de baixa potència, destinats a dispositius domèstics intel·ligents, elements d’un cotxe, etc. Aquests controladors són els que permeten als programes una rentadora, calendari digitalment un forn de microones, activen el fre ABS d’un cotxe, fan mesures de consum elèctric remot, validen una targeta de transport al bus, activeu una bulb mitjançant connexió WI -FI, controleu una màquina d’exposa, etc.

source: En la industria se utilizan controladores programables especializados para mover máquinas de forma automática o para recoger datos y controlar procesos industriales. Estos controladores se denominan `PLC <https://es.wikipedia.org/wiki/Controlador_l%C3%B3gico_programable>`__ y `SCADA <https://es.wikipedia.org/wiki/SCADA>`__.
ca: A la indústria, els controladors programables especialitzats s’utilitzen per moure màquines automàticament o per recopilar dades i controlar processos industrials. Aquests controladors s’anomenen `plc <https://es.wikipedia.org/wiki/controlerador_l%C3%B3Gico_programable>`__ i `scada <https://es.wikipedia.org/wiki/scada>` `__.

source: A medida que se abaratan los precios de los componentes electrónicos, cada vez más aparatos incorporan pequeños ordenadores que les añaden inteligencia. Estos pequeños controladores añadidos a los objetos cotidianos y conectados a Internet es lo que se denomina `Internet de las cosas <https://es.wikipedia.org/wiki/Internet_de_las_cosas>`__ o IoT.
ca: Com que els preus dels components electrònics són més barats, cada vegada més dispositius incorporen petits ordinadors que aporten intel·ligència. Aquests petits controladors afegits a objectes quotidians i connectats a Internet és el que s’anomena “Internet de les coses <https://es.wikipedia.org/wiki/internet_de_las_cosas>` `__ o IoT.

source: Uno de los controladores para uso doméstico y de entretenimiento más conocido es la placa `Arduino UNO <https://es.wikipedia.org/wiki/Arduino_Uno>`__, con arquitectura de 8 bits y 32 kbytes de memoria de programa.
ca: Un dels conductors d’ús domèstic i d’entreteniment és el més conegut és l’arduino uno <https://es.wikipedia.org/wiki/arduino_uno>`__, amb arquitectura de 8 bits i 32 kbytes de memòria del programa.

source: Placa controladora Arduino UNO.
ca: Arduino One Controller Plate.

source: Wearables
ca: Portàtil

source: Un wearable o `tecnología vestible <https://es.wikipedia.org/wiki/Tecnolog%C3%ADa_vestible>`__ es un pequeño ordenador incorporado a prendas de vestir. Incluye a los relojes inteligentes o smartwatch, gafas inteligentes, etc.
ca: Una tecnologia vestida o vestida <https://es.wikipedia.org/wiki/tecnolog%C3%ADA_Vestible>`__ és un ordinador petit incorporat a la roba. Inclou rellotges intel·ligents o smartwatch, ulleres intel·ligents, etc.

source: Esta tecnología puede ser utilizada para monitorizar la salud de los usuarios.
ca: Aquesta tecnologia es pot utilitzar per controlar la salut dels usuaris.

source: Apple Watch Serie 6 Navy Blue.
ca: Apple Watch 6 Navy Blue Series.

source: Ordenador de una sola placa (SBC)
ca: Ordinador de plaques úniques (SBC)

source: Los `ordenadores de una sola placa <https://es.wikipedia.org/wiki/Placa_computadora>`__ son ordenadores completos en una sola placa de circuito impreso de tamaño reducido que incluye una CPU, RAM, periféricos, conectores y demás componentes típicos de un ordenador.
ca: Els `ordinadors simples de placa <https://es.wikipedia.org/wiki/paca_computadora>`__ són ordinadors complets en una sola placa de circuit imprès reduït que inclou una CPU, RAM, perifèrics, connectors i altres components típics d'un ordinador.

source: Uno de los SBC de bajo costo más conocidos es la placa Raspberry Pi. Es un microordenador personal que ejecuta el sistema operativo Linux y solo necesita añadir un teclado, un ratón y un monitor para tener con ella un PC operativo.
ca: Un dels SBC de baix nivell més baix és la placa PI de Raspberry. És un microordenament personal que executa el sistema operatiu de Linux i només necessita afegir un teclat, un ratolí i un monitor per tenir un PC operatiu amb ell.

source: `Evan-Amos <https://commons.wikimedia.org/wiki/File:Raspberry-Pi-2-Bare-BR.jpg>`__, Public Domain, via Wikimedia Commons.
ca: `Evan-amos <https://commons.wikimedia.org/wiki/file:raspberry-pi- 2-bare-br.jpg>`__, domini públic, a través de Wikimedia Commons.

source: Son pequeños ordenadores pensados para añadir inteligencia (smart) a una televisión tradicional. Permiten desde decodificar las señales digitales vía satélite hasta añadir capacidades como conectarse a Internet y ver servicios de streaming como Netflix, HBO o Amazon Prime.
ca: Són petits ordinadors dissenyats per afegir intel·ligència (intel·ligent) a una televisió tradicional. Permeten descodificar senyals de satèl·lit digital fins a afegir capacitats com connectar -se a Internet i veure serveis de streaming com Netflix, HBO o Amazon Prime.

source: Algunos de los más conocidos son `Google Chromecast <https://es.wikipedia.org/wiki/Google_Chromecast>`__, `Amazon Fire TV <https://es.wikipedia.org/wiki/Amazon_Fire_TV>`__ y `Apple TV <https://es.wikipedia.org/wiki/Apple_TV>`__,
ca: Alguns dels més coneguts són "Google Chromecast <https://es.wikipedia.org/wiki/apple_tv>`__,

source: Muchos televisores actuales (smartTV) ya llevan incorporados ordenadores que permiten realizar estas tareas, al igual que conectarse por Internet a las empresas fabricantes. Esto ha ocasionado polémicas debido a que estos televisores pueden grabar las conversaciones de su alrededor y enviarlas al fabricante.
ca: Molts televisors actuals (SmartTV) ja tenen ordinadors incorporats que permeten aquestes tasques, a més de connectar els fabricants en línia. Això ha provocat controvèrsies perquè aquests televisors poden registrar les converses que els envolten i enviar -les al fabricant.

source: `PAG DEV <https://commons.wikimedia.org/wiki/File:Amazon_Fire_TV_4k.jpg>`__, `CC BY-SA 4.0 International <https://creativecommons.org/licenses/by-sa/4.0/deed.en>`__, via Wikimedia Commons.
ca: `Pàgina dev <https://commons.wikimedia.org/wiki/file:amazon_fire_tv_4k.jpg>` __, `` cc by-sa 4.0 internacional <https://creativecommons.org/licenses/by-sa/4.0/deed.en> `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `

source: Videoconsolas
ca: Consoles de vídeo

source: Las `videoconsolas <https://es.wikipedia.org/wiki/Videoconsola>`__ son ordenadores orientados a ejecutar videojuegos. Pueden tener una potencia relativamente elevada.
ca: Les `consoles de vídeo <https://es.wikipedia.org/wiki/videoconsola>`__ són ordinadors destinats a executar videojocs. Poden tenir una potència relativament alta.

source: Su uso se reduce exclusivamente al juego y la disponibilidad de muchos de estos juegos está limitada a una sola plataforma, por lo que muchos usuarios de videojuegos prefieren usar un ordenador personal (PC) de altas características en su lugar. La diferencia entre los dos tipos de ordenadores reside en el precio. Para una misma potencia de proceso, un PC puede costar el doble que una videoconsola de última generación equivalente.
ca: El seu ús es redueix exclusivament al joc i la disponibilitat de molts d'aquests jocs es limita a una sola plataforma, de manera que molts usuaris de videojocs prefereixen utilitzar un ordinador personal (PC) de funcions altes. La diferència entre els dos tipus d’ordinadors rau en el preu. Per a la mateixa potència de procés, un PC pot costar el doble que un estat de consoles de jocs -t -t.

source: Sony PlayStation 4 de 2014.
ca: Sony PlayStation 4 del 2014.

source: `Evan-Amos <https://commons.wikimedia.org/wiki/File:PS4-Console-wDS4.jpg>`__, Public Domain, via Wikimedia Commons.
ca: `Evan-amos <https://commons.wikimedia.org/wiki/file:ps4-console-wds4.jpg>` __, domini públic, a través de Wikimedia Commons.

source: Ordenadores dedicados
ca: Ordinadors dedicats

source: Existen más tipos de ordenadores dedicados a realizar una sola función de forma especializada. Son ordenadores más potentes que los controladores programables.
ca: Hi ha més tipus d’ordinadors dedicats a una sola funció de manera especialitzada. Són ordinadors més potents que controladors programables.

source: Ejemplos de este tipo de ordenadores son los servidores de datos `NAS <https://es.wikipedia.org/wiki/Almacenamiento_conectado_en_red>`__ que permiten compartir archivos de datos en una red de ordenadores, fotocopiadoras, routers, cajeros automáticos, etc.
ca: Exemples d’aquest tipus d’ordinadors són els servidors de dades `nas <https://es.wikipedia.org/wiki/almacecenamiento_conetado_en_red>`__ que permeten compartir fitxers de dades en una xarxa d’ordinadors, fotocopietes, encaminadors, caixers automàtics, etc.

source: Teléfono inteligente
ca: Telèfon intel·ligent

source: Un `teléfono inteligente <https://es.wikipedia.org/wiki/Tel%C3%A9fono_inteligente>`__ o smartphone es un dispositivo que combina las funciones de un teléfono móvil con las de un ordenador de bolsillo.
ca: Un `smartphone <https://es.wikipedia.org/wiki/tel%C3%A9phone_inteligente>` __ o smartphone és un dispositiu que combina les funcions d’un telèfon mòbil amb les d’un ordinador de butxaca.

source: Actualmente son los ordenadores de uso más habitual para la mayoría de las personas.
ca: Actualment són els ordinadors d’ús més comú per a la majoria de la gent.

source: Su sistema operativo suele ser Android (de Google) o iOS (de Apple).
ca: El seu sistema operatiu sol ser Android (de Google) o iOS (de Apple).

source: `SimonWaldherr <https://commons.wikimedia.org/wiki/File:IPhone_13_Pro.jpg>`__, `CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0/deed.en>`__, via Wikimedia Commons.
ca: `Simonwaldherr <https://commons.wikimedia.org/wiki/file:iphone_13_pro.jpg>` __, `cc by-sa 4.0 <https://creativecommons.org/licenses/by-sa/4.0/deed.en>` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` ` `` `` `` `` `` `` `` `` `` `` `` `` ``

source: Tableta
ca: Taula

source: Una `tableta <https://es.wikipedia.org/wiki/Tableta_(computadora)>`__ o tablet es un pequeño ordenador basado en una pantalla táctil que generalmente funciona con los mismos sistemas operativos que los teléfonos móviles (Android e iOS).
ca: Una `tauleta <https://es.wikipedia.org/wiki/ableeta_ (ordinador)>`__ o tauleta és un ordinador petit basat en una pantalla tàctil que sol funcionar amb els mateixos sistemes operatius que els telèfons mòbils (Android i iOS).

source: En ciertos casos pueden incluir periféricos como un teclado o ratón, aunque la mayoría de las veces solo se manejan mediante la pantalla táctil.
ca: En determinats casos, poden incloure perifèrics com un teclat o un ratolí, tot i que la majoria de vegades només es gestionen mitjançant la pantalla tàctil.

source: Hay teléfonos inteligentes con un tamaño mayor del habitual (mayor de 6 pulgadas de diagonal) se les denomina tabléfonos o phablet.
ca: Hi ha telèfons intel·ligents amb una mida més gran de l’habitual (superior a 6 polzades de diagonal) s’anomenen tabonos o phablet.

source: Ordenador portátil
ca: Ordinador de llibreta

source: Un `ordenador portátil <https://es.wikipedia.org/wiki/Computadora_port%C3%A1til>`__ es un ordenador personal (PC) capaz de realizar todas las tareas de un ordenador de escritorio, pero con un pequeño tamaño y batería incluida por lo que se puede desplazar fácilmente para ser usado en cualquier lugar.
ca: Un `portàtil <https://es.wikipedia.org/wiki/computadora_port%C3%A1til>`__ és un ordinador personal (PC) capaç de realitzar totes les tasques d’un ordinador d’escriptori, però amb una mida petita i una bateria inclosa perquè es pugui moure fàcilment a qualsevol lloc.

source: Los portátiles **Netbooks** son ordenadores pensados para conectarse a Internet y tienen menos capacidades que un portátil habitual. Suelen llevar un sistema operativo ligero basado en Linux y tienen un precio reducido. Los modelos más conocidos son los **Chromebook** de Google.
ca: Els ordinadors portàtils ** netbooks ** són ordinadors dissenyats per connectar -se a Internet i tenir menys capacitats que un ordinador portàtil habitual. Normalment porten un sistema operatiu de llum basat en Linux i tenen un preu reduït. Els models més coneguts són el ** Chromebook ** de Google.

source: `Pixabay <https://commons.wikimedia.org/wiki/File:Black_laptop_computer_open_frontal.svg>`__ `CC0 1.0 Public Domain <https://creativecommons.org/publicdomain/zero/1.0/deed.en>`__
ca: `Pixabay <https://commons.wikimedia.org/wiki/file:Black_laptop_computer_open_frontal.svg>` __ `cc0 1.0 dominis públics <https://creativecommons.org/publicdomain/zero/1.0/deed.en>` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` ``

source: Ordenador personal de escritorio
ca: Ordinador d'escriptori personal

source: Con ordenador personal o PC se suele denominar a un microordenador de escritorio, de uso general, para ser usado por una persona. Los ordenadores personales actuales comenzaron a venderse en 1981 por IBM aunque pronto aparecieron ordenadores con un funcionamiento semejante (clónicos) fabricados por otras empresas.
ca: Amb un ordinador o un ordinador personal, una microordesa d’escriptori s’anomena generalment, d’ús general, per ser utilitzat per una persona. Els ordinadors personals actuals van començar a vendre’s el 1981 per IBM, tot i que els ordinadors aviat van aparèixer amb un funcionament similar (clonic) fabricat per altres empreses.

source: Su sistema operativo suele ser Windows, MacOS o Linux.
ca: El seu sistema operatiu sol ser Windows, MacOS o Linux.

source: Los ordenadores personales de altas prestaciones también se denominan `estación de trabajo <https://es.wikipedia.org/wiki/Estaci%C3%B3n_de_trabajo>`__. Tienen mucha más potencia de cálculo y capacidad de almacenamiento que un ordenador personal habitual.
ca: Els ordinadors personals d’alt rendiment també s’anomenen “Estació de treball <https://es.wikipedia.org/wiki/estatry%C3%B3N_DE_TRABAJO>`__. Tenen molta més potència de càlcul i capacitat d’emmagatzematge que un ordinador personal habitual.

source: Imagen de `OpenClipart-Vectors <https://pixabay.com/es/users/openclipart-vectors-30363/>`__ en `Pixabay <https://pixabay.com/es/vectors/computadora-escritorio-158675/>`__
ca: Imatge de `OpenClipart-Vectors <https://pixabay.com/es/users/openclipart-vectors-30363/>`__ a `pixabay <https://pixabay.com/es/vectors/computadora-scrrity-158675/>` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` ` `` `` `'

source: Un mainframe o `unidad central <https://es.wikipedia.org/wiki/Unidad_central>`__ es un ordenador utilizado principalmente por grandes organizaciones para aplicaciones críticas que requieren ordenadores muy fiables y con gran capacidad de almacenamiento.
ca: Un mainframe o una "unitat central <https://es.wikipedia.org/wiki/unitat_central>`__ És un ordinador utilitzat principalment per grans organitzacions per a aplicacions crítiques que requereixen ordinadors molt fiables i amb una gran capacitat d'emmagatzematge.

source: Estos ordenadores se utilizan para realizar operaciones bancarias, censos, servidores de Internet, etc.
ca: Aquests ordinadors s’utilitzen per dur a terme operacions bancàries, censos, servidors d’Internet, etc.

source: Clúster de ordenadores
ca: Clúster d'ordinador

source: Un `clúster de ordenadores <https://es.wikipedia.org/wiki/Cl%C3%BAster_de_computadoras>`__ es un gran ordenador compuesto por un conjunto de ordenadores unidos entre sí por una red de alta velocidad y sincronizados por un sistema operativo, que suele ser Linux, para que se comporten como un solo ordenador.
ca: Un `Cluster d’ordinadors <https://es.wikipedia.org/wiki/cl%C3%Baster_de_computadores>`__ és un gran ordinador compost per un conjunt d’ordinadors units per una xarxa d’alta velocitat i sincronitzada per un sistema operatiu, que sol ser linux, de manera que es comporten com a ordinador únic.

source: Actualmente este tipo de ordenadores está sustituyendo poco a poco a los mainframes en sus funciones.
ca: Actualment, aquest tipus d’ordinadors substitueix gradualment els fotogrames principals en les seves funcions.

source: `Hindermath <https://commons.wikimedia.org/wiki/File:Nec-cluster.jpg>`__, `CC BY-SA 3.0 <https://creativecommons.org/licenses/by-sa/3.0/deed.en>`__, via Wikimedia Commons.
ca: `Hynderath <https://commons.wikimedia.org/wiki/file:nec-cluster.jpg>`__, `cc by-sa 3.0 <https://creativecommons.org/licenses/by-sa/3.0/deed.en>`__, via wikimedia commons.

source: Superordenador
ca: Superordenor

source: Un `superordenador <https://es.wikipedia.org/wiki/Supercomputadora>`__ es un ordenador utilizado para realizar grandes cálculos tales como predecir el tiempo atmosférico, investigaciones sobre el genoma, nuevos medicamentos, etc. Manejan grandes cantidades de datos realizando una gran cantidad de cálculos por segundo (hasta 16 000 millones de millones de operaciones por segundo en 2022)
ca: Un `supercomputador <https://es.wikipedia.org/wiki/supercomputera>`__ és un ordinador utilitzat per realitzar grans càlculs com predir el temps atmosfèric, la investigació del genoma, els nous medicaments, etc.

source: En un principio se utilizaban mainframes dedicados a cálculo intensivo, pero actualmente están basados en la tecnología de clúster de ordenadores.
ca: Al principi es van utilitzar els primers primers llocs dedicats al càlcul intensiu, però actualment es basen en la tecnologia de clústers d’ordinadors.

source: En España el superordenador más famoso es el `MareNostrum <https://es.wikipedia.org/wiki/MareNostrum>`__, compuesto por un clúster de 48 896 procesadores Intel Xeon.
ca: A Espanya, el supercomputador més famós és el `Marenostrum <https://es.wikipedia.org/wiki/marenostrum>`__, compost per un clúster de 48 896 processadors Intel Xeon.

source: Supercomputador MareNostrum 4 en el centro de supercomputación de Barcelona.
ca: Marenostrum 4 Supercomputador al Centre de Supercomputació de Barcelona.

source: `Vcarceler <https://commons.wikimedia.org/wiki/File:BSC-MareNostrum4-F.jpg>`__, `CC BY-SA 4.0 <https://creativecommons.org/licenses/by/4.0/deed.en>`__, via Wikimedia Commons.
ca: `Vcarceler <https://commons.wikimedia.org/wiki/file:bsc-marenostrum4-f.jpg>` __, `cc by-sa 4.0 <https://creativecommons.org/licenses/by/4.0/deed.en>` `__, via commons Wikimedia.

source: Test de la unidad
ca: Test de prova

source: `Test de clasificación de ordenadores I. <../test/es-hardware-clasificacion-1.html>`__
ca: `Computar la prova de classificació I. <../test/es-scan-classification-1.html>`__

source: `Test de clasificación de ordenadores II. <../test/es-hardware-clasificacion-2.html>`__
ca: `Prova de classificació informàtica II. <../test/es-scan-classification-2.html>`__
