Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/informatica-machine-learning.po
Languages: ca

source: Inteligencia Artificial
ca: Intel·ligència artificial

source: Curso de Inteligencia Artificial
ca: Curs d’intel·ligència artificial

source: Curso online gratuito `Elementos de IA <https://course.elementsofai.com/es/>`__.
ca: Curs en línia gratuït `Elements de IA <https://course.elementsofai.com/es/>` __.

source: `Capítulo 1: ¿Qué es la IA? <https://course.elementsofai.com/es/1>`__
ca: `Capítol 1: Què és AI? <https://course.elementsofai.com/es/1>`__

source: `Capítulo 2: Resolución de problemas con IA <https://course.elementsofai.com/es/2>`__
ca: `Capítol 2: Resolució de problemes amb Ia <https://course.elementsofai.com/es/2>`__

source: `Capítulo 3: La IA del mundo real <https://course.elementsofai.com/es/3>`__
ca: `Capítol 3: L'AI del món real <https://course.elemempofai.com/es/3>`__

source: `Capítulo 4: Aprendizaje automático <https://course.elementsofai.com/es/4>`__
ca: `Capítol 4: Lear automàtic

source: `Capítulo 5: Las redes neuronales <https://course.elementsofai.com/es/5>`__
ca: `Capítol 5: Xarxes neuronals <https://course.elementsofai.com/es/5>`__ __

source: `Capítulo 6: Trascendencia <https://course.elementsofai.com/es/6>`__
ca: `Capítol 6: Transcendència <https://course.elementsofai.com/es/6>`__

source: Libro Computadoras que aprenden
ca: Reservar ordinadors que aprenen

source: El mundo de la inteligencia artificial ha generado una gran cantidad de debates y opiniones entre expertos y personalidades influyentes, ya en el 2014, Stephen Hawking, uno de los científicos más renombrados de nuestro tiempo, advirtió sobre los peligros potenciales de la IA y su capacidad para superar a la humanidad. Más cerca en el tiempo, Elon Musk, innovador empresario, ha abogado por un enfoque responsable y ético en el desarrollo de la IA, argumentando que puede ser una herramienta valiosa para resolver problemas de nuestro mundo pero siempre bajo una estricta regulación.
ca: El món de la intel·ligència artificial ha generat molts debats i opinions entre experts i personalitats influents, ja el 2014, Stephen Hawking, un dels científics més reconeguts del nostre temps, va advertir sobre els possibles perills de la IA i la seva capacitat de superar la humanitat. Amb el pas del temps, Elon Musk, un empresari innovador, ha defensat un enfocament ètic responsable i ètic en el desenvolupament de la IA, argumentant que pot ser una eina valuosa per resoldre problemes del nostre món, però sempre sota una regulació estricta.

source: Ambos puntos de vista son importantes a la hora de comprender los desafíos y oportunidades que ofrece esta tecnología, sobre todo cuando es aplicada a la educación.
ca: Els dos punts de vista són importants a l’hora de comprendre els reptes i les oportunitats que ofereix aquesta tecnologia, especialment quan s’apliquen a l’educació.

source: Es por eso lo valioso que representa este libro escrito por Diego Craig, un profesional con una sólida formación y amplia experiencia en el campo de la tecnología educativa, quién pretende introducir al lector en los conceptos claves de la inteligencia artificial y su aplicación en el ámbito educativo.
ca: És per això que el valuós que representa aquest llibre escrit per Diego Craig, un professional amb una formació sòlida i una àmplia experiència en el camp de la tecnologia educativa, que té la intenció d’introduir el lector en els conceptes clau de la intel·ligència artificial i la seva aplicació en l’àmbit educatiu.

source: Se abordan temas como el impacto de ChatGPT, explorando las opiniones y debates que rodean su uso; cuestiones éticas, privacidad, definiciones, su uso para el diálogo y se examinan aplicaciones prácticas en una variedad de contextos.
ca: Es tracten temes com l'impacte de Chatgpt, explorant les opinions i els debats que envolten el seu ús; Els problemes ètics, la privadesa, les definicions, el seu ús per al diàleg i les aplicacions pràctiques s’examinen en diversos contextos.

source: Diego Craig brinda una introducción a los conceptos clave de la IA y su aplicación en la educación, abordando tanto los aspectos positivos como los potenciales desafíos y riesgos.
ca: Diego Craig proporciona una introducció als conceptes clau de la IA i la seva aplicació en educació, abordant tant aspectes positius com possibles reptes i riscos.

source: `Libro Computadoras que aprenden, de Diego F. Craig. Formato PDF. <../_static/document/computadoras-que-aprenden-2023.pdf>`__
ca: `Book That Learn, de Diego F. Craig. Format PDF. <../_ Static/Document/Computers-What-Aprenden-2023.pdf>`__

source: Vídeos de DotCSV
ca: Vídeos Dotcsv

source: Vídeo: `¿Tiene la IA de Google CONSCIENCIA? -> NO, pero me preocupa... (LaMDA). <https://www.youtube-nocookie.com/embed/Ko7WFx4rUw0>`__
ca: Vídeo: `Tens la IA de Google Aware? -> No, però em preocupa ... (Lamda). <https://www.youtube-nocokie.com/embed/ko7wfx4ruw0>`__

source: Vídeo: `DotCSV. GATO: La nueva IA de DeepMind que lo aprende TODO. <https://www.youtube-nocookie.com/embed/EoZFxj-qhUY>`__
ca: Vídeo: `Dotcsv. Cat: la nova IA de DeepMind que ho aprèn tot. <https://www.youtube-nocoakie.com/embed/eozfxj-quy>`__

source: Vídeo: `DotCSV. Esta Inteligencia Artificial ESCRIBE MEJOR QUE TÚ... GPT-3. <https://www.youtube-nocookie.com/embed/C1eOiOkD_8A>`__
ca: Vídeo: `Dotcsv. Aquesta intel·ligència artificial escriu millor que tu ... GPT-3. <https://www.youtube-nocokie.com/embed/c1eokd_8a>`__

source: Vídeo: `¿Qué significa realmente "Inteligencia Artificial"? Subespacios, pareidolias y creatividad. <https://www.youtube-nocookie.com/embed/3eMmmj3roOs>`__
ca: Vídeo: "Què fa realment " Intel·ligència artificial \ "? Subespais, pareidolies i creativitat. <https://www.youtube-nocookie.com/embed/3emmj3roos>`__

source: Vídeo: `Jaime Altozano. Hablemos de inteligencias artificiales. <https://www.youtube-nocookie.com/embed/GqKnlBq2MA4>`__
ca: Vídeo: `Jaime Altozano. Parlem d’intel·ligències artificials. <https://www.youtube-nocokie.com/embed/gqknlbq2ma4>`__

source: Vídeo: `Jeremy Howard. Las maravillosas y pavorosas consecuencias de los computadores que pueden aprender. <https://www.youtube-nocookie.com/embed/t4kyRyKyOpo>`__
ca: Vídeo: `Jeremy Howard. Les meravelloses i terribles conseqüències dels ordinadors que poden aprendre. <https://www.youtube-nocokie.com/embed/t4kyrykyo>`__

source: Computadoras e Inteligencia Artificial.
ca: Informàtica i intel·ligència artificial.

source: Vídeo: `El Futuro de las Computadoras Será Radicalmente Diferente. <https://www.youtube-nocookie.com/embed/qNtxODk_Lmk>`__
ca: Vídeo: `El futur dels ordinadors serà radicalment diferent. <https://www.youtube-nocokie.com/embed/qntxodk_lmk>`__
