Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/informatica-hardware-perifericos.po
Languages: ca

source: Periféricos
ca: Perifèrics

source: Los periféricos son dispositivos que permiten que la información entre y salga de un ordenador.
ca: Els perifèrics són dispositius que permeten informació entre i deixar un ordinador.

source: Los periféricos de entrada son como los sentidos de un ordenador. Recogen información del exterior para que el ordenador pueda 'ver' con una cámara, 'oír' con un micrófono, o 'sentir' la posición de la mano del usuario con un ratón.
ca: Els perifèrics d’entrada són com els sentits d’un ordinador. Recopilen informació de l'estranger perquè l'ordinador pugui "veure" amb una càmera, "escoltar" amb un micròfon o "sentir" la posició de l'usuari amb un ratolí.

source: Los periféricos de salida son como los músculos del ordenador, que le permiten exteriorizar la información que tiene en su interior. Así, gracias a los periféricos de salida, podemos ver la información del ordenador en forma de imágenes en un monitor, impresas en una hoja por una impresora, en forma de sonidos de un altavoz, o de vibración de un smartphone.
ca: Els perifèrics de sortida són com els músculs de l’ordinador, que li permeten externalitzar la informació que hi ha al seu interior. Així, gràcies als perifèrics de sortida, podem veure la informació de l’ordinador en forma d’imatges d’un monitor, imprès en un full per una impressora, en forma de sons d’un altaveu o vibració d’un telèfon intel·ligent.

source: Índice de contenidos:
ca: Índex de contingut:

source: Clasificación de los periféricos
ca: Classificació de perifèrics

source: Periféricos de entrada
ca: Perifèrics d’entrada

source: Periféricos de salida
ca: Perifèrics de sortida

source: Periféricos de entrada/salida
ca: Perifèrics d’entrada/sortida

source: Son dispositivos que permiten al ordenador obtener información del exterior, a través de sensores y de interfaces de usuario de entrada de datos.
ca: Són dispositius que permeten a l’ordinador obtenir informació de l’estranger, mitjançant sensors i interfícies d’usuari d’entrada de dades.

source: Ratón
ca: Ratolí

source: El `ratón <https://es.wikipedia.org/wiki/Rat%C3%B3n_(inform%C3%A1tica)>`__ o mouse es un dispositivo que se utiliza para manejar con una mano un puntero en un entorno gráfico de ordenador.
ca: El `ratolí <https://es.wikipedia.org/wiki/rat%C3%B3N_ (Informeu%C3%A1tica)>` __ o ratolí és un dispositiu que s'utilitza per manejar amb una mà un punter en un entorn gràfic d'ordinador.

source: El ratón detecta los movimientos en dos dimensiones sobre una superficie plana en la que se apoya. Un puntero o flecha en la pantalla del ordenador muestra los movimientos del ratón.
ca: El ratolí detecta els moviments en dues dimensions sobre una superfície plana on es basa. Un punter o fletxa de la pantalla de l’ordinador mostra els moviments del ratolí.

source: El ratón también suele tener varios pulsadores y una rueda que se puede girar, para interactuar con las pantallas del entorno gráfico.
ca: El ratolí també sol tenir diversos botons i una roda que es pot girar, per interactuar amb les pantalles de l’entorn gràfic.

source: Pese a la aparición de nuevas tecnologías, como la pantalla táctil, el ratón aún sigue siendo muy utilizado.
ca: Malgrat l’aparició de noves tecnologies, com la pantalla tàctil, el ratolí encara s’utilitza àmpliament.

source: Ratón con cable.
ca: Ratolí de cable.

source: `Nzeemin <https://commons.wikimedia.org/wiki/File:Microsoft_IntelliMouse_Explorer_40A.jpg>`__, `CC BY-SA 3.0 <https://creativecommons.org/licenses/by/3.0/deed.en>`__, via Wikimedia Commons.
ca: `Nzeemin <https://commons.wikimedia.org/wiki/file:microsoft_intellimouse_explorer_40a.jpg>` __, `cc by-sa 3.0 <https://creativecommons.org/licenses/by/3.0/deed.en>` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `Wikimedia Commons.

source: Teclado
ca: Teclat

source: El `teclado <https://es.wikipedia.org/wiki/Teclado_(inform%C3%A1tica)>`__ es uno de los primeros dispositivos de entrada al ordenador que han existido. Está inspirado en el teclado de las máquinas de escribir, con configuración de teclas QWERTY.
ca: El teclat <https://es.wikipedia.org/wiki/teclado_ (Informeu%c3%a1tica)>`__ és un dels primers dispositius d'entrada de l'ordinador que han existit. Està inspirat en el teclat TypewRiter, amb la configuració de les tecles QWERTY.

source: El teclado es casi imprescindible para poder escribir texto en un ordenador. A pesar de la desarrollo de nuevas tecnologías, como el reconocimiento de voz en los teléfonos inteligentes, aún sigue siendo muy utilizado el teclado en pantalla.
ca: El teclat és gairebé essencial per poder escriure text en un ordinador. Malgrat el desenvolupament de noves tecnologies, com el reconeixement de veu als telèfons intel·ligents, el teclat de la pantalla encara s’utilitza àmpliament.

source: Teclado español.
ca: Teclat espanyol.

source: `Oona Räisänen <https://commons.wikimedia.org/wiki/File:Computer_keyboard_ES_layout.svg>`__, `CC0 1.0 <https://creativecommons.org/publicdomain/zero/1.0/deed.en>`__, via Wikimedia Commons.
ca: `Oona räisänen <https://commons.wikimedia.org/wiki/file:computer nom `` `` `` `` `` ``

source: El teclado estándar de ordenador es de 102 teclas en Europa y se dividen en los siguientes grupos.
ca: El teclat de l’ordinador estàndard és 102 tecles a Europa i es divideixen en els grups següents.

source: Bloque de funciones F1 a F12.
ca: Bloc de funcions F1 a F12.

source: Bloque alfanumérico con números del 0 al 9, letras y algunas teclas especiales como el tabulador, espaciador, enter, etc.
ca: Bloc alfanumèric amb números de 0 a 9, lletres i algunes claus especials com la pestanya, l’espaiador, l’entrada, etc.

source: Bloque especial con teclas de dirección y otras como inicio, fin, suprimir, insertar, imprimir pantalla, etc.
ca: Bloc especial amb claus de direcció i altres com Start, End, Suprimir, Inserir, Imprimir pantalla, etc.

source: Bloque numérico a la derecha, con los números y las operaciones básicas +, -, \*, /.
ca: Bloc numèric a la dreta, amb els números i les operacions bàsiques +, -, \*, /.

source: Escáner
ca: Escàner

source: El `escáner <https://es.wikipedia.org/wiki/Esc%C3%A1ner_inform%C3%A1tico>`__ es un periférico de entrada que se utiliza para realizar fotografías digitales de documentos, diapositivas o transparencias.
ca: El `Scanner <https://es.wikipedia.org/wiki/ESC%C3%A1ner_inform%C3%A1tico>` __ és un perifèric d'entrada que s'utilitza per fer fotografies digitals de documents, diapositives o transparències.

source: La resolución mínima recomendada es de 150dpi (puntos por pulgada). Aunque los escáner actuales pueden llegar con facilidad a resoluciones de 600dpi o mayores, esto genera archivos de datos mayores de lo necesario.
ca: La resolució mínima recomanada és de 150dpi (punts per polzada). Tot i que l’escàner actual pot arribar fàcilment a 600dpi o majors resolucions, això genera dades de dades més grans de les necessàries.

source: Los escáneres se pueden combinar con técnicas de `OCR <https://es.wikipedia.org/wiki/Reconocimiento_%C3%B3ptico_de_caracteres>`__ o Reconocimiento Óptico de Caracteres para poder transformar un texto en formato imagen a un texto digitalizado.
ca: Els escàners es poden combinar amb `OCR <https://es.wikipedia.org/wiki/ Reconeixement_%C3%B3PTICO_DE_CARATELS>`__ o reconeixement de caràcters òptics de caràcters per transformar un text en un format d'imatge en un text digitalitzat.

source: Escaner.
ca: Escàner.

source: `Arpingstone <https://commons.wikimedia.org/wiki/File:Scanner.view.750pix.jpg>`__, Public Domain, via Wikimedia Commons.
ca: `Arpingstone <https://commons.wikimedia.org/wiki/file:scanner.view.750pix.jpg>`__, domini públic, a través de Wikimedia Commons.

source: Cámara web
ca: Càmera web

source: La `cámara web <https://es.wikipedia.org/wiki/C%C3%A1mara_web>`__ , en inglés webcam, es una pequeña cámara digital conectada al ordenador con la que se puede capturar imágenes fijas y vídeo (imagen en movimiento) para transmitirlos a distancia por Internet.
ca: La `Webcam <https://es.wikipedia.org/wiki/c%C3%A1mara_web>`__, en anglès web, és una petita càmera digital connectada a l'ordinador amb la qual podeu capturar imatges i vídeo fixes (imatge en moviment) per transmetre -les a distància en línia.

source: Desde el comienzo de los confinamientos en 2020 con motivo de la pandemia COVID, se han popularizado mucho las videoconferencias para realizar reuniones mediante servicios como Zoom, WhatsApp, Microsoft Teams, Google Meet, Skype, Webex, etc.
ca: Des del començament dels confinaments el 2020 amb motiu de la Pandèmia Covid, les videoconferències per celebrar reunions com Zoom, WhatsApp, equips de Microsoft, Google Meet, Skype, WebX, etc.

source: Cámara web externa.
ca: Càmera web externa.

source: `Entereczek <https://commons.wikimedia.org/wiki/File:Creative.webcam.jpg>`__, `CC BY-SA 3.0 <https://creativecommons.org/licenses/by/3.0/deed.en>`__, via Wikimedia Commons.
ca: `Entreeczek <https://commons.wikimedia.org/wiki/file:Creative.webcam.jpg>` __, `cc by-sa 3.0 <https://creativecommons.org/licenses/by/3.0/deed.en>`__, via wikimedia commons.

source: Micrófono
ca: Micròfon

source: El `micrófono <https://es.wikipedia.org/wiki/Micr%C3%B3fono>`__ es un dispositivo que recoge el sonido del ambiente y lo traduce a señales eléctricas. Posteriormente una :term:`Tarjeta de sonido` traduce estas señales eléctricas a señales digitales que puede utilizar el ordenador.
ca: El `micròfon <https://es.wikipedia.org/wiki/micr%C3%B3Phone>`__ és un dispositiu que recopila el so de l'entorn i el tradueix en senyals elèctrics. Posteriorment un: terme: `targeta de so 'tradueix aquests senyals elèctrics a senyals digitals que podeu utilitzar l'ordinador.

source: En algunos casos, los micrófonos de las cámaras web, de los ordenadores portátiles o de los smartphones llevan ya incluido un conversor analógico-digital para convertir las señales eléctricas que salen del micrófono a señales digitales, pero en estos casos suelen tener menor calidad que cuando se utiliza un micrófono y una tarjeta de sonido dedicados.
ca: En alguns casos, els micròfons de les càmeres web, de portàtils o telèfons intel·ligents ja inclouen un convertidor analògic-digital per convertir els senyals elèctrics que deixen el micròfon a senyals digitals, però en aquests casos solen tenir una qualitat inferior a la quan s’utilitza un micròfon i una targeta de so dedicada.

source: Según la tecnología de los micrófonos, estos puede ser magneto-dinámicos, de condensador, de carbón o piezoeléctricos.
ca: Segons la tecnologia del micròfon, aquests poden ser magneto-dinàmiques, condensador, carbó o piezoelèctric.

source: Micrófono magneto-dinámico de marca Sennheiser.
ca: Micròfon Magneto-dinàmic Sennheiser.

source: `ChrisEngelsma <https://commons.wikimedia.org/wiki/File:SennMicrophone.jpg>`__, `CC BY-SA 3.0 <https://creativecommons.org/licenses/by/3.0/deed.en>`__, via Wikimedia Commons.
ca: `Chisengelsma <https://commons.wikimedia.org/wiki/file:sennmicrophone.jpg>` __, `cc by-sa 3.0 <https://creativecommons.org/licenses/by/3.0/deed.en>` `__, via wikimedia commons.

source: Tableta gráfica
ca: Tauleta gràfica

source: La `tableta gráfica o tableta digitalizadora <https://es.wikipedia.org/wiki/Tableta_digitalizadora>`__ es un periférico que permite al usuario introducir gráficos o dibujos a mano, tal como lo haría con un lápiz y papel. También permite apuntar y señalar los objetos que se encuentran en la pantalla del ordenador.
ca: La tauleta gràfica o la tauleta digitalitzadora <https://es.wikipedia.org/wiki/ablete_digitizador>`__ és un perifèric que permet a l'usuari introduir gràfics o dibuixos de mà, com ho faria amb un llapis i un paper. També us permet apuntar i assenyalar els objectes que es troben a la pantalla de l’ordinador.

source: Consiste en una superficie plana sobre la que el usuario puede dibujar una imagen utilizando el estilete (lapicero) que viene junto a la tableta. Dependiendo de la tableta, la imagen puede aparecer en la tableta y en el ordenador a la vez o aparecer solo en el ordenador.
ca: Consisteix en una superfície plana en la qual l’usuari pot dibuixar una imatge mitjançant l’estiletto (ploma) que ve al costat de la tauleta. Segons la tauleta, la imatge pot aparèixer a la tauleta i a l’ordinador alhora o aparèixer només a l’ordinador.

source: Tableta gráfica.
ca: Tauleta gràfica

source: El `GPS <https://es.wikipedia.org/wiki/GPS>`__ o Sistema de Posicionamiento Global es un sistema del departamento de defensa de Estados Unidos que utiliza satélites artificiales que envían señales de radio, para localizar un receptor en cualquier posición del globo terráqueo con una precisión de pocos metros. Sistemas semejantes son el sistema Galileo de Europa o el sistema Glonass de Rusia.
ca: El `GPS <https://es.wikipedia.org/wiki/gps>`__ o el sistema de posicionament global és un sistema del departament de defensa dels Estats Units que utilitza satèl·lits artificials que envien senyals de ràdio, per localitzar un receptor en qualsevol posició del planeta amb una precisió de pocs metres. Sistemes similars són el sistema Galileu d’Europa o el sistema de glonass rus.

source: El GPS es ampliamente utilizado en los teléfonos inteligentes así como en dispositivos weareables. Permite dar servicios como la navegación punto a punto, localización de amigos cercanos, cálculo de recorridos para runners, etc.
ca: El GPS s’utilitza àmpliament tant en telèfons intel·ligents com en dispositius desgastables. Permet serveis com ara la navegació per punt de punt, la ubicació dels amics propers, el càlcul de les rutes de corredors, etc.

source: La localización de una persona es una información que las grandes corporaciones consideran muy valiosa. Dónde vives, qué lugares y qué personas frecuentas, a qué hora sales de casa o del trabajo, en qué vehículos te mueves, etc. Toda esta información se puede deducir de la localización GPS y es especialmente sensible y privada, por lo que debemos restringir el uso del GPS a los momentos y aplicaciones que consideremos imprescindibles.
ca: La ubicació d’una persona és informació que les grans corporacions consideren molt valuoses. On viviu, quins llocs i quines persones feu, a quina hora aneu a casa o treballeu, en quins vehicles us moveu, etc. Tota aquesta informació es pot deduir de la ubicació del GPS i és especialment sensible i privada, per la qual cosa hem de restringir l’ús de GPS als moments i aplicacions que considerem essencials.

source: Acelerómetro
ca: Acceleròmetre

source: El `acelerómetro <https://es.wikipedia.org/wiki/Aceler%C3%B3metro>`__ es un sensor capaz de medir aceleraciones. Está integrado en los smartphones, pulseras de actividad física, mandos de videoconsolas, etc.
ca: L’acceleròmetre <https://es.wikipedia.org/wiki/celer%C3%B3meter>`__ és un sensor capaç de mesurar les acceleracions. Està integrat en telèfons intel·ligents, polseres d’activitat física, controls de consoles de vídeo, etc.

source: Este sensor puede detectar el movimiento que realizamos cuando andamos, corremos o cuando movemos los brazos en varias direcciones. En combinación con el giroscopio permite conocer los movimientos que realizamos con gran precisión.
ca: Aquest sensor pot detectar el moviment que fem quan caminem, correm o quan moem els braços en diverses direccions. En combinació amb el giroscopi, permet conèixer els moviments que realitzem amb una gran precisió.

source: Estos sensores sirven para realizar juegos de baile en los que el mando sabe dónde está nuestra mano y cómo la movemos. También permite conocer cómo andamos o corremos y predecir el consumo de energía realizado o incluso, en aplicaciones médicas, para predecir la aparición de Alzheimer.
ca: Aquests sensors serveixen per realitzar jocs de ball en què el comandament sap on és la nostra mà i com la mourem. També ens permet saber com caminem o predirem i predir el consum d’energia feta o fins i tot, en aplicacions mèdiques, per predir l’aparició d’Alzheimer.

source: Otra aplicación del acelerómetro es conocer dónde se encuentra el suelo (por la aceleración de la gravedad) y, a partir de esta información, girar las fotografías que se tomen para que siempre se muestren hacia arriba.
ca: Una altra aplicació de l’acceleròmetre és saber on es troba el sòl (mitjançant l’acceleració de la gravetat) i, a partir d’aquesta informació, gireu les fotografies realitzades de manera que es mostrin sempre.

source: Giroscopio
ca: Giroscopi

source: El `giroscopio <https://es.wikipedia.org/wiki/Gir%C3%B3scopo>`__ es un sensor que sirve para conocer la orientación en el espacio de un objeto. Está integrado en los smartphones, pulseras de actividad física, mandos de videoconsolas, etc. En combinación con el acelerómetro permite conocer con mucha precisión qué movimientos realizamos.
ca: El `Gyroscope <https://es.wikipedia.org/wiki/gir%C3%B3Scopo>`__ és un sensor que serveix per conèixer l'orientació a l'espai d'un objecte. Està integrat en telèfons intel·ligents, polseres d’activitat física, controls de consoles de vídeo, etc. En combinació amb l’acceleròmetre, us permet conèixer molt precisament quins moviments fem.

source: Magnetómetro
ca: Magnetòmetre

source: El `magnetómetro <https://es.wikipedia.org/wiki/Magnet%C3%B3metro#Uso_en_dispositivos_m%C3%B3viles>`__ es un sensor de campo magnético. Como la Tierra tiene un campo magnético, con el magnetómetro que incluye un smartphone se puede situar el norte como lo hace una **brújula**.
ca: El `magnetòmetre <https://es.wikipedia.org/wiki/magnet%C3%B3meter#uso_en_dispositivos_m%C3%B3Viles>` __ és un sensor de camp magnètic. Com que la Terra té un camp magnètic, amb el magnetòmetre que inclou un telèfon intel·ligent, podeu situar el nord com ho fa un ** Compass **.

source: Termómetro de batería
ca: Termòmetre de la bateria

source: El `termómetro <https://es.wikipedia.org/wiki/Term%C3%B3metro>`__ de la batería sirve para conocer la temperatura que tiene la batería del teléfono inteligente. A partir de esta información podemos conocer el uso que estamos dando al smartphone porque un mayor uso se traduce en una mayor temperatura de la batería. También podemos conocer si se está cargando el teléfono o, de forma indirecta, la temperatura ambiente.
ca: El `termòmetre <https://es.wikipedia.org/wiki/termerrino 3TC3%B3Meter>`__ de la bateria serveix per conèixer la temperatura de la bateria del telèfon intel·ligent. A partir d’aquesta informació podem conèixer l’ús que estem donant al telèfon intel·ligent perquè un major ús es tradueix en una temperatura de bateria més elevada. També podem saber si es carrega el telèfon o, indirectament, la temperatura ambient.

source: Son dispositivos que permiten que la información del ordenador se muestre al exterior.
ca: Són dispositius que permeten que la informació de l’ordinador es mostri fora.

source: Monitor
ca: Observar

source: El `monitor de ordenador <https://es.wikipedia.org/wiki/Monitor_de_computadora>`__ también llamado pantalla, es uno de los principales dispositivos de salida del ordenador para mostrar información al usuario. También puede considerarse un periférico de entrada si es táctil.
ca: El `Monitor Computer <https://es.wikipedia.org/wiki/monitor_de_computadora>` __ també anomenat pantalla, és un dels principals dispositius de sortida de l'ordinador per mostrar informació a l'usuari. També es pot considerar una entrada perifèrica si és tàctil.

source: La tecnología que predomina actualmente es la de las pantallas planas de **cristal líquido (LDC)** y están comenzando a usarse cada vez con mayor frecuencia las pantallas `OLED o AMOLED <https://es.wikipedia.org/wiki/Diodo_org%C3%A1nico_de_emisi%C3%B3n_de_luz>`__.
ca: La tecnologia que actualment predomina és la de les pantalles planes de ** cristall líquid (LDC) ** i comencen a utilitzar cada cop més sovint el `` OLED o AMOLED <https://es.wikipedia.org/wiki/diod_org%C3%C3%C3%C3%C3%C3%

source: El tamaño de un monitor se mide en pulgadas de la diagonal de la pantalla visualizadora (sin el marco exterior). Tamaños típicos son desde las 5" de los smartphones hasta las 24" de un monitor típico de PC.
ca: La mida d’un monitor es mesura en polzades de la diagonal de la pantalla de visualització (sense el marc exterior). Les mides típiques són de 5 \ "de telèfons intel·ligents a 24 " d'un monitor típic de PC.

source: La resolución mínima de un monitor de ordenador hoy en día debería ser de Full HD (1920x1080 pixel), aunque los portátiles más pequeños, tabletas y smartphones con frecuencia no llegan a esa resolución. WXGA es una resolución estándar algo menor con 1366x768 pixel.
ca: La resolució mínima d’un monitor d’ordinador actual hauria de ser Full HD (1920x1080 píxels), tot i que els ordinadors portàtils, tauletes i telèfons intel·ligents més petits sovint no arriben a aquesta resolució. WXGA és una resolució estàndard una mica inferior amb 1366x768 píxels.

source: El **pixel** es el punto más pequeño que se puede representar en un monitor.
ca: El ** píxel ** és el punt més petit que es pot representar en un monitor.

source: `Zzubnik <https://commons.wikimedia.org/wiki/File:Computer_monitor.jpg>`__, Public Domain, via Wikimedia Commons.
ca: `Zzubnik <https://commons.wikimedia.org/wiki/file:computer_monitor.jpg>`__, domini públic, a través de Wikimedia Commons.

source: Proyector de vídeo
ca: Projector de vídeo

source: El `proyector de vídeo <https://es.wikipedia.org/wiki/Proyector_de_video>`__ o cañón proyector es un aparato óptico que proyecta una imagen fija o en movimiento sobre una pared o una pantalla de proyección, a partir de una señal de vídeo que procede de un ordenador. Esto permite visualizar la información del ordenador para todo un auditorio como lo hace una pantalla de cine.
ca: El `Projector de vídeo <https://es.wikipedia.org/wiki/projector_de_video>` __ o projector canyon és un dispositiu òptic que projecta una imatge fixa o en moviment en una pantalla de paret o projecció, a partir d’un senyal de vídeo que prové d’un ordinador. Això permet visualitzar la informació de l’ordinador per a un auditori sencer com ara una pantalla de pel·lícula.

source: Proyector de vídeo.
ca: Projector de vídeo.

source: `Christian Herzog <https://commons.wikimedia.org/wiki/File:Projectiondesign_(Barco_Fredrikstad)_video_projector_at_HighEnd-2009_(3556283833).jpg>`__, `CC BY 2.0 <https://creativecommons.org/licenses/by/2.0/deed.en>`__, via Wikimedia Commons.
ca: `Christian Herzog <https://commons.wikimedia.org/wiki/file:Projectionesign_ (ship_fredrkstad) _video_projector_at_highend-2009_ (3556283833) .jpg>`__, `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` <https://creativecommons.org/licenses/by/2.0/deed.en>`__, a través de Wikimedia Commons.

source: La `impresora <https://es.wikipedia.org/wiki/Impresora>`__ es un periférico de salida que permite imprimir textos y gráficos en papel de manera permanente.
ca: La "impressora <https://es.wikipedia.org/wiki/impresora>`__ és un perifèric de sortida que permet imprimir textos i gràfics en paper de manera permanent.

source: Impresora láser.
ca: Impressora làser.

source: `Alex Muñoz1 <https://commons.wikimedia.org/wiki/File:Samsung_ML-2010.jpg>`__, `CC BY 2.0 <https://creativecommons.org/licenses/by/2.0/deed.en>`__, via Wikimedia Commons.
ca: `Alex Muñoz1 <https://commons.wikimedia.org/wiki/file:samsung_ml-2010.jpg>` __, `cc per 2.0 <https://creativecommons.org/licenses/by/2.0/ded.en>` `__, via commons Wikimedia.
