Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/informatica-software-sistema-operativo.po
Languages: ca

source: :index:`Sistema Operativo`
ca: : Índex: `Sistema operatiu '

source: Un `sistema operativo <https://es.wikipedia.org/wiki/Sistema_operativo>`__, también llamado SO, es un **conjunto de programas** que hacen que una computadora funcione. Es un intermediario que gestiona el hardware de una computadora para dar servicio al resto de los programas de aplicación que se ejecutan en ella.
ca: Un "sistema operatiu <https://es.wikipedia.org/wiki/system_operative>`__, també anomenat SO, és un **conjunt de programes** que fan que un ordinador funcioni. És un intermediari que gestiona el maquinari d’un ordinador per servir a la resta de programes d’aplicació que s’executen.

source: El sistema operativo es el encargado de **administrar los recursos** de la computadora, como el procesador, la memoria y los dispositivos de entrada y salida, para que otros programas puedan utilizarlos de manera eficiente y coordinada.
ca: El sistema operatiu s’encarrega de **gestionar els recursos** de l’ordinador, com ara el processador, la memòria i els dispositius d’entrada i sortida, de manera que altres programes puguin utilitzar -los de manera eficient i coordinada.

source: Por ejemplo, el sistema operativo es el encargado de dar un bloque de memoria vacía a cada programa a medida que estos se van ejecutando. Se asegura de que cada programa tenga suficiente espacio en la memoria RAM y que no coincida con los demás. El sistema operativo también se asegura de que el procesador se reparte entre todos los programas cada poco tiempo, dando la impresión de que todos se ejecutan a la vez. Cuando varios programas envían varias páginas para imprimir a una sola impresora, el sistema operativo se encarga de enviar las páginas de forma ordenada para que estas no se mezclen y que no se produzca un error. El sistema operativo realiza una gestión similar cuando varios programas quieren escribir a la vez en la memoria permanente.
ca: Per exemple, el sistema operatiu s’encarrega de donar un bloc de memòria buit a cada programa a mesura que s’executin. Assegura que cada programa té prou espai a la memòria RAM i que no coincideixi amb els altres. El sistema operatiu també garanteix que el processador es distribueix entre tots els programes cada vegada, donant la impressió que tothom s’executa alhora. Quan diversos programes envien diverses pàgines per imprimir a una sola impressora, el sistema operatiu és responsable d’enviar les pàgines de manera ordenada perquè no es barregin i no produeixin un error. El sistema operatiu realitza una gestió similar quan diversos programes volen escriure alhora en memòria permanent.

source: El sistema operativo también proporciona una **interfaz de usuario** para que los usuarios puedan interactuar con la computadora y realizar diferentes tareas a la vez, como navegar por Internet, escribir documentos, reproducir música y vídeos, entre otras cosas.
ca: El sistema operatiu també proporciona una interfície d’usuari ** ** perquè els usuaris puguin interactuar amb l’ordinador i realitzar diferents tasques alhora, com ara navegar en línia, escriure documents, reproduir música i vídeos, entre altres coses.

source: Si no existiese el sistema operativo, cada una de las aplicaciones tendría que incluir una interfaz propia, un gestor de impresoras propio, un gestor de memoria propio y ponerse de acuerdo con todos los demás programas para compartir los recursos de la misma computadora de manera ordenada.
ca: Si el sistema operatiu no existís, cadascuna de les aplicacions hauria d’incloure la seva pròpia interfície, un propi gestor d’impressors, un gestor de memòria pròpia i estar d’acord amb tots els altres programes per compartir els recursos d’un mateix ordinador de manera ordenada.

source: Índice de contenidos:
ca: Índex de contingut:

source: Componentes de un Sistema Operativo
ca: Components d’un sistema operatiu

source: Los `componentes de un sistema operativo <https://es.wikipedia.org/wiki/Sistema_operativo#Componentes>`__ tienen la tarea de conseguir que las diferentes partes de una computadora trabajen juntas.
ca: Els `components d'un sistema operatiu <https://es.wikipedia.org/wiki/system_operative# components>`__ tenen la tasca d’aconseguir que les diferents parts d’un ordinador treballin junts.

source: Núcleo o kernel
ca: Nucli o nucli

source: El `núcleo <https://es.wikipedia.org/wiki/N%C3%BAcleo_(inform%C3%A1tica)>`__ de un sistema operativo es el encargado de coordinar todos los recursos de la computadora, tanto los elementos de hardware como los programas de software. Se encarga de transmitir la información entre todos estos elementos de la computadora de manera organizada para coordinarlos entre sí.
ca: El `nucli <https://es.wikipedia.org/wiki/n%C3%Bacleo_ (Informeu%c3%a1tica)>` __ d'un sistema operatiu és responsable de coordinar tots els recursos de l'ordinador, tant els elements de maquinari com els programes de programari. És responsable de transmetre la informació entre tots aquests elements de l’ordinador de manera organitzada per coordinar -los entre ells.

source: Controladores de dispositivos
ca: Controladors de dispositius

source: Los `controladores de dispositivos <https://es.wikipedia.org/wiki/Controlador_de_dispositivo>`__ hacen de intermediarios entre las aplicaciones del usuario y los diferentes periféricos del ordenador tales como tarjetas gráficas, memorias externas, impresoras, cámaras web, etc.
ca: Els "controladors de dispositius <https://ca.wikipedia.org/wiki/Controlador_de_dispositiu>`__ fan intermediaris entre les aplicacions de l'usuari i els diferents perifèrics de l'ordinador com ara targetes gràfiques, memòries externes, impressores, càmeres web, etc.

source: Cuando instalamos un controlador de impresora, todos los programas de aplicación de ese sistema operativo podrán imprimir con esa impresora. Los primeros sistemas operativos, como MS-DOS, no tenían controladores de dispositivos para las impresoras, por lo que cada uno de los programas de aplicación tenía que añadir su propio controlador para todas las impresoras del mercado. El sistema operativo con controladores de dispositivos ahorra recursos y facilita la tarea de programar aplicaciones.
ca: Quan instal·lem un controlador d'impressora, tots els programes d'aplicació d'aquest sistema operatiu poden imprimir amb aquesta impressora. Els primers sistemes operatius, com MS-DOS, no tenien controladors de dispositius per a impressores, de manera que cadascun dels programes d’aplicació havia d’afegir el seu propi controlador per a totes les impressores del mercat. El sistema operatiu amb controladors de dispositius estalvia recursos i facilita la tasca de programar aplicacions.

source: Gestión de procesos
ca: Gestió de processos

source: El sistema de gestión de procesos se encarga de repartir el tiempo del microprocesador entre los diferentes programas que se encuentran en marcha. Gracias a este gestor podemos tener, por ejemplo, 20 programas funcionando a la vez en la computadora y dará la impresión de que todos corren a la vez, aunque solo haya un núcleo de CPU atendiendo a todos.
ca: El sistema de gestió de processos és responsable de distribuir el temps del microprocessador entre els diferents programes que estan en marxa. Gràcies a aquest gestor, podem tenir, per exemple, 20 programes que operen alhora a l’ordinador i donaran la impressió que tothom funciona alhora, tot i que només hi ha un nucli de la CPU que assisteixi a tothom.

source: Gestión de memoria
ca: Gestió de la memòria

source: El sistema de `gestión de la memoria <https://es.wikipedia.org/wiki/Gesti%C3%B3n_de_memoria>`__ se encarga de reservar bloques de memoria RAM para los programas cuando van a comenzar a ejecutarse o cuando necesitan espacio para abrir un nuevo archivo de datos.
ca: El `Sistema de gestió de la memòria <https://es.wikipedia.org/wiki/gesti%C3%B3n_de_memoria>`__ és responsable de reservar blocs de memòria RAM quan començaran a executar -se o quan necessiten espai per obrir un nou fitxer de dades.

source: Otra función del gestor de memoria es realizar la recolección de basura. Se llama así a la tarea que consiste en liberar de la memoria los bloques que ya no se estén usando, para dejar espacio a los nuevos programas que quiera el usuario ejecutar.
ca: Una altra funció del gestor de memòria és fer recollida d'escombraries. Aquest és el cas de la tasca que consisteix a alliberar els blocs que ja no s’utilitzen, per deixar l’espai als nous programes que l’usuari vol executar.

source: Interfaz gráfica de usuario
ca: Interfície gràfica d'usuari

source: La `interfaz gráfica de usuario <https://es.wikipedia.org/wiki/Interfaz_gr%C3%A1fica_de_usuario>`__, también llamada GUI, es un programa del sistema operativo encargado de presentar la información en la pantalla y recoger las acciones que el usuario realiza con el ratón, teclado o con la pantalla táctil.
ca: La "interfície gràfica d'usuari <https://es.wikipedia.org/wiki/interfaz_gr%C3%A1FICA_DE_USUARIO>`__, també anomenada GUI, és un programa del sistema operatiu responsable de presentar la informació a la pantalla i de recopilar les accions que l'usuari realitza amb el ratolí, el teclat o amb la pantalla tàctil.

source: Este sistema es común a todos los programas, con lo que se consigue un aspecto homogéneo para todas las aplicaciones del mismo sistema operativo y simplifica la programación de las aplicaciones porque estas no tienen que encargarse de representar las ventanas, los botones, la barra de scroll, los menús y demás elementos gráficos.
ca: Aquest sistema és comú a tots els programes, que aconsegueix un aspecte homogeni per a totes les aplicacions del mateix sistema operatiu i simplifica la programació de les aplicacions perquè no han de tenir cura de representar les finestres, els botons, la barra de desplaçament, els menús i altres elements gràfics.

source: Gestión de Interrupciones
ca: Gestió de la interrupció

source: Las `interrupciones <https://es.wikipedia.org/wiki/Interrupci%C3%B3n>`__ son señales que envían los periféricos a la computadora para que sean atendidos por esta. Cuando un usuario de ordenador escribe una tecla en el teclado, el carácter aparece inmediatamente en la pantalla. Del mismo modo, cuando un usuario mueve el ratón, el cursor se desplaza inmediatamente por la pantalla. Cada pulsación de tecla y cada movimiento del ratón generan una interrupción que alerta a la computadora para que atienda a los datos que está enviando el periférico.
ca: Les `interrupcions <https://es.wikipedia.org/wiki/interrupci%C3%B3n>`__ són signes que els perifèrics envien a l'ordinador per ser tractats per ell. Quan un usuari de l'ordinador escriu una clau al teclat, el personatge apareix immediatament a la pantalla. De la mateixa manera, quan un usuari mou el ratolí, el cursor es mou immediatament a la pantalla. Cada pulsació clau i cada moviment del ratolí generen una interrupció que alerta a l’ordinador per abordar les dades que el perifèric envia.

source: Gracias a las interrupciones la computadora no tiene que estar continuamente atendiendo a cada periférico para comprobar si ya tienen datos listos para enviar.
ca: Gràcies a les interrupcions, l’ordinador no ha d’assistir contínuament a cada perifèric per comprovar si ja tenen dades a punt per enviar.

source: Sistema de archivos
ca: Sistema de lliures

source: El `sistema de archivos <https://es.wikipedia.org/wiki/Sistema_de_archivos>`__ es un sistema que controla cómo se almacenan y recuperan los datos desde las unidades de almacenamiento como los CD-ROM, las memorias USB o los discos duros. Sin un sistema de archivos, los datos almacenados en un medio de almacenamiento se convertirían en un conjunto de información sin manera de distinguir dónde termina un dato y dónde comienza el siguiente.
ca: El `Sistema de fitxers <https://es.wikipedia.org/wiki/system_de_archivos>` __ És un sistema que controla com es guarden i es recuperen les dades de les unitats d'emmagatzematge com CD-ROM, memòries USB o discos durs. Sense un sistema de fitxers, les dades emmagatzemades en un medi d’emmagatzematge es convertirien en un conjunt d’informació sense distingir allà on s’acaba un fet i on comença el següent.

source: Sus principales funciones son la asignación de espacio a los archivos, la administración del espacio libre y el acceso a los datos guardados.
ca: Les seves funcions principals són l’assignació d’espai als arxius, l’administració de l’espai lliure i l’accés a les dades desades.

source: Sistema de seguridad
ca: Sistema de seguretat

source: Es el sistema encargado de controlar el acceso de los programas o de los usuarios a los recursos del sistema. Este sistema se encarga de tareas como comprobar el usuario y la contraseña correctas para entrar en una sesión del sistema o para realizar una instalación de programas.
ca: És el sistema responsable de controlar l’accés de programes o usuaris als recursos del sistema. Aquest sistema és responsable de tasques com ara comprovar l’usuari i la contrasenya correctes per introduir una sessió del sistema o per dur a terme una instal·lació de programes.

source: Comunicaciones
ca: Comunicacions

source: El sistema de gestión de comunicaciones se encarga de controlar las redes de datos conectadas a la computadora. Es el encargado de gestionar los paquetes de datos que se transmiten por la red local cableada, por la red Wifi o por otras redes de datos como, por ejemplo, Bluetooth.
ca: El sistema de gestió de comunicacions és responsable de controlar les xarxes de dades connectades a l’ordinador. És responsable de la gestió de paquets de dades transmesos per la xarxa local per cable, per la xarxa Wi -FI o altres xarxes de dades com Bluetooth.

source: Programas de sistema
ca: Programes del sistema

source: Son aplicaciones que sirven para gestionar el sistema operativo o para informarse de su estado. Ejemplos de programas del sistema son el explorador de archivos, el panel de control, la consola de comandos, la aplicación de ajustes en Android, etc.
ca: Són aplicacions que serveixen per gestionar el sistema operatiu o per informar -se del seu estat. Exemples de programes del sistema són explorador de fitxers, tauler de control, consola de comandaments, aplicació de configuració d'Android, etc.

source: Sistema Operativo :index:`Windows`
ca: Sistema operatiu: Índex: `Windows '

source: `Windows <https://es.wikipedia.org/wiki/Microsoft_Windows>`__ es un sistema operativo de la empresa Microsoft y es uno de los más populares del mundo. Se utiliza en la mayoría de las computadoras personales de escritorio y portátiles, con una cuota de mercado cercana al `87% de los PC en 2020 <https://en.wikipedia.org/wiki/Usage_share_of_operating_systems#Market_share_by_category>`__.
ca: `Windows <https://es.wikipedia.org/wiki/microsoft_windows>`__ És un sistema operatiu de la companyia de Microsoft i és un dels més populars del món. S'utilitza en la majoria d'ordinadors personals d'escriptori i portàtils, amb una quota de mercat propera al 87% de PC el 2020 <https://en.wikipedia.org/wiki/usage_share_of_opeating_systems#market_share_by_category> `` __.

source: Sus características principales son las siguientes.
ca: Les seves característiques principals són les següents.

source: Interfaz de usuario
ca: Interfície d'usuari

source: Windows tiene una interfaz gráfica de usuario (GUI) intuitiva que está basada en el uso del ratón y el teclado, aunque también permite el uso de una pantalla táctil.
ca: Windows té una interfície d'usuari intuïtiva (GUI) que es basa en l'ús del ratolí i del teclat, tot i que també permet l'ús d'una pantalla tàctil.

source: Compatibilidad con software
ca: Compatibilitat del programari

source: Windows es compatible con una amplia gama de software y aplicaciones. Muchas aplicaciones están diseñadas específicamente para Windows, lo que hace que sea fácil para los usuarios encontrar y utilizar el software que necesitan.
ca: Windows és compatible amb una àmplia gamma de programes i aplicacions. Moltes aplicacions estan dissenyades específicament per a Windows, cosa que facilita als usuaris trobar i utilitzar el programari que necessiten.

source: La gran popularidad de Windows también es la causa de que existan muchos programas maliciosos (malware) especializados en este sistema operativo.
ca: La gran popularitat de Windows és també la causa que hi ha molts programes maliciosos (programari maliciós) especialitzats en aquest sistema operatiu.

source: Facilidad de personalización
ca: Personalització facilitat

source: Windows permite a los usuarios personalizar su experiencia de usuario. Pueden personalizar el fondo de pantalla, la pantalla de inicio, los iconos y los colores según sus preferencias. Sin embargo, los programadores que no trabajen para Microsoft no pueden acceder a su código y no pueden hacer cambios en el sistema operativo.
ca: Windows permet als usuaris personalitzar la seva experiència de l'usuari. Poden personalitzar el fons de pantalla, la pantalla d'inici, les icones i els colors segons les seves preferències. Tanmateix, els programadors que no treballen per a Microsoft no poden accedir al seu codi i no poden fer canvis en el sistema operatiu.

source: Soporte de hardware
ca: Suport del maquinari

source: Windows es compatible con una amplia variedad de hardware, lo que significa que funciona bien con la mayoría de las computadoras y dispositivos periféricos.
ca: Windows és compatible amb una gran varietat de maquinari, cosa que significa que funciona bé amb la majoria d’ordinadors i dispositius perifèrics.

source: Videojuegos
ca: Videojocs

source: Windows es conocido por ser un gran sistema operativo para juegos. Muchos de los juegos más populares del mundo se pueden jugar en una computadora con Windows.
ca: Windows és conegut per ser un gran sistema operatiu per a jocs. Molts dels jocs més populars del món es poden jugar en un ordinador de Windows.

source: Precio
ca: Preu

source: Windows tiene un precio aproximado de 150 Euros en su versión más básica (Windows Home). A los fabricantes de hardware les cuesta aproximadamente 50 Euros instalar un sistema Windows en sus ordenadores.
ca: Windows té un preu aproximat de 150 euros en la seva versió més bàsica (Windows Home). Els fabricants de maquinari costen aproximadament 50 euros per instal·lar un sistema Windows als seus ordinadors.

source: Versiones
ca: Versions

source: Actualmente la única versión que está a la venta por parte de la empresa Microsoft es la versión Windows 11, aunque aún existe una gran base de computadoras con Windows 10 instalado. Las versiones anteriores a Windows 10 son a día de hoy obsoletas y deberían ser actualizadas para evitar problemas de seguridad.
ca: Actualment, l’única versió que es ven per l’empresa Microsoft és la versió de Windows 11, tot i que encara hi ha una gran base d’ordinadors amb Windows 10 instal·lada. Les versions de Windows 10 estan obsoletes avui en dia i s’han d’actualitzar per evitar problemes de seguretat.

source: Windows 11 tiene un total de 7 ediciones muy similares entre sí, aunque las más conocidas son: la edición Home destinada a usuarios domésticos y la edición Pro destinada a usuarios profesionales.
ca: Windows 11 té un total de 7 edicions molt semblants entre si, tot i que els més coneguts són: L’edició domèstica per als usuaris domèstics i la pro edició per als usuaris professionals.

source: Sistema Operativo :index:`Android`
ca: Sistema operatiu: Índex: `Android '

source: `Android <https://es.wikipedia.org/wiki/Android>`__ es un sistema operativo desarrollado por la empresa Google y es uno de los más populares entre los dispositivos móviles, con una cuota de mercado del `71% de los smartphones y tablets en 2020 <https://en.wikipedia.org/wiki/Usage_share_of_operating_systems#Market_share_by_category>`__.
ca: `Android <https://es.wikipedia.org/wiki/android>`__ És un sistema operatiu desenvolupat per la companyia de Google i és un dels més populars entre els dispositius mòbils, amb una quota de mercat de '71% dels telèfons intel·ligents i tauletes el 2020 <https://en.wikipedia.org/wiki/usage_share_of_operating_systems#market_share_by_category> `__.

source: Se utiliza en una amplia variedad de dispositivos móviles, incluyendo teléfonos inteligentes, tabletas, televisores inteligentes, relojes inteligentes o automóviles. Android se basa en el núcleo de Linux, sobre el que se construye el resto del sistema operativo.
ca: S'utilitza en una gran varietat de dispositius mòbils, inclosos telèfons intel·ligents, tauletes, televisors intel·ligents, rellotges intel·ligents o cotxes. Android es basa en el nucli de Linux, sobre el qual es construeix la resta del sistema operatiu.

source: Android tiene una interfaz gráfica de usuario (GUI) basada en la pantalla táctil del dispositivo.
ca: Android té una interfície gràfica d’usuari (GUI) basada en la pantalla tàctil del dispositiu.

source: Android es compatible con una amplia gama de software y aplicaciones, disponibles en su mayoría en la Google Play Store.
ca: Android és compatible amb una àmplia gamma de programes i aplicacions, principalment disponibles a Google Play Store.

source: Android es de código abierto, lo que significa que el código fuente está disponible públicamente y los desarrolladores pueden modificarlo y personalizarlo según sus necesidades.
ca: Android és de codi obert, cosa que significa que el codi font està disponible públicament i els desenvolupadors poden modificar -lo i personalitzar -lo segons les seves necessitats.

source: Android es compatible con una amplia variedad de hardware, lo que significa que funciona bien con la mayoría de los dispositivos móviles y sus periféricos. Además, al ser de código abierto, facilita que los desarrolladores puedan adaptar Android a cualquier nuevo periférico o sistema hardware.
ca: Android és compatible amb una gran varietat de maquinari, cosa que significa que funciona bé amb la majoria de dispositius mòbils i els seus perifèrics. A més, al ser de codi obert, facilita que els desenvolupadors puguin adaptar Android a qualsevol nou sistema perifèric o de maquinari.

source: Android es un sistema operativo gratuito, lo que abarata el precio final de los dispositivos que funcionan con él.
ca: Android és un sistema operatiu gratuït, que redueix el preu final dels dispositius que hi treballen.

source: Android está fuertemente controlado por la empresa Google, por lo que existen pocas versiones de otros desarrolladores. Las últimas versiones de Android son las siguientes:
ca: L’Android està fortament controlat per l’empresa de Google, de manera que hi ha poques versions d’altres desenvolupadors. Les darreres versions d'Android són les següents:

source: Año
ca: Any

source: Versión
ca: Versió

source: Agosto de 2018
ca: Agost de 2018

source: Septiembre de 2019
ca: Setembre de 2019

source: Septiembre de 2020
ca: Setembre de 2020

source: Agosto de 2022
ca: Agost de 2022

source: Sistema Operativo :index:`GNU/Linux`
ca: Sistema operatiu: Índex: `GNU/Linux '
