Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/informatica-ciberseguridad-guias.po
Languages: ca

source: Guías de ciberseguridad
ca: Guies de ciberseguretat

source: Diversas guías sobre ciberseguridad.
ca: Diverses guies sobre ciberseguretat.

source: Guía de navegación segura
ca: Guia de navegació segura

source: Guía para el alumnado sobre una navegación segura por Internet.
ca: Guia per a estudiants en una navegació segura en línia.

source: `Guía para navegación segura. <../_static/document/guia-navegacion-segura.pdf>`__
ca: `Guia per a la navegació segura. <../_ static/document/guia-navegacion-segura.pdf>`__

source: Autor de la guía
ca: Autor de la Guia

source: Directoras: Isabel Serrano Maillo (UCM), Esther Martínez Pastor (URJC).
ca: Directors: Isabel Serrano Maillo (UCM), Esther Martínez Pastor (URJC).

source: Equipo: Isabel Serrano Maillo (UCM), Esther Martínez Pastor (URJC), Ángela Moreno Bobadilla (UCM), Mª Ángeles Blanco Ruiz (URJC), Mª Dolores Serrano Tárraga (UNED), Jorge Abaurrea Velarde (UCM).
ca: Equip: Isabel Serrano Maillo (UCM), Esther Martínez Pastor (URJC), Ángela Moreno Bobadilla (UCM), Mª ángeles Blanco Ruiz (URJC), Mª Dolores serrano Tárraga (UNED), Jorge Abarere Velarde (UCM).

source: © Comunidad de Madrid
ca: © Comunitat de Madrid

source: Sitio web
ca: Lloc web

source: `Revista Digital Educamadrid <https://www.educa2.madrid.org/web/revista-digital/inicio/-/visor/guia-para-el-alumnado-sobre-una-navegacion-segura>`__
ca: `Digital Educamadrid <https://www.educa2.madrid.org/web/revista-digital/inicio/-/visor/guia-para-el-alumnado-sobre-una-navegació-segura>` `` `` `` `` `` `` `` `` `` `` `

source: Guía de ciberataques
ca: Guia de Cyber ​​Attack

source: Guía de ciberataques a nivel usuario.
ca: Guia Cyberat a nivell d’usuari.

source: `Guía de ciberataques. <../_static/document/ciberataques-guia-osi.pdf>`__
ca: `Guia Cyberat. <../_ Static/Document/Ciberates-Guia-Osi.pdf>`__

source: La presente publicación pertenece al Instituto Nacional de Ciberseguridad (INCIBE) y al servicio de la Oficina de Seguridad del Internauta (OSI).
ca: Aquesta publicació pertany a l’Institut Nacional de Ciberseguretat (Inciu) i al servei de l’Oficina de Seguretat d’Internet (OSI).

source: Sitios web
ca: Llocs web

source: Licencia
ca: Llicenciar

source: `Creative Commons Reconocimiento-No comercial-CompartirIgual 4.0 Internacional <https://creativecommons.org/licenses/by-nc-sa/4.0/>`__
ca: `Creative Commons Reconeixement-Comerç-Compartici-Compartyrrigual 4.0 Internacional <https://creativecommons.org/licenses/by-nc-sa/4.0/>` `` `` `` `` `` `` `` ``

source: `Web origen del tutorial <https://www.osi.es/es/guia-ciberataques>`__
ca: `Origen web del tutorial <https://www.osi.es/guia-ciberataques>`__

source: Guía de Privacidad y Seguridad en Internet
ca: Guia de privadesa i seguretat a Internet

source: `Guía de Privacidad y Seguridad en Internet. <../_static/document/guia-privacidad-seguridad-internet.pdf>`__
ca: `Guia de privadesa i seguretat a Internet. <../_ static/document/guia-provacily-seguurity-internet.pdf>`__

source: La presente es una publicación conjunta pertenece a la Agencia Española de Protección de Datos (AEPD) y al Instituto Nacional de Ciberseguridad (INCIBE).
ca: Es tracta d’una publicació conjunta pertany a l’agència espanyola per a la protecció de dades (AEPD) i a l’Institut Nacional de Ciberseguretat (Inciu).

source: `Creative Commons Reconocimiento-No comercial-CompartirIgual 3.0 Internacional <https://creativecommons.org/licenses/by-nc-sa/3.0/>`__
ca: `Creative Commons Reconeixement-Comercial-Compartici-Compartyrrigual 3.0 Internacional <https://creativecommons.org/licenses/by-nc-sa/3.0/>

source: `Agencia Española de Protección de Datos (AEPD) <https://www.aepd.es/es/prensa-y-comunicacion/blog/la-guia-de-privacidad-y-seguridad-en-Internet-de-la-aepd-e-incibe-se>`__
ca: `Agència espanyola per a la protecció de dades (AEPD) <https://www.aepd.es/es/prensa-y-comunicacion/blog/la-guia-de-privecity

source: `Oficina de Seguridad del Internauta (OSI) <https://www.osi.es/es/guia-de-privacidad-y-seguridad-en-Internet>`__
ca: `Internet Safety Office (OSI) <https://www.osi.es/guia-de-privacy-y-seguurity-en-internet>`__
