Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/informatica-writer-ejercicios.po
Languages: ca

source: Ejercicios de Writer
ca: Exercicis d’escriptors

source: Esta sección consta de 30 ejercicios en los que aplicaremos varios de los contenidos tratados en las prácticas guiadas.
ca: Aquesta secció consta de 30 exercicis en què aplicarem diversos continguts tractats en pràctiques guiades.

source: Crea en el ordenador una carpeta con tu nombre en la que guardaremos los documentos generados.
ca: Creeu a l’ordinador una carpeta amb el vostre nom en què desarem els documents generats.

source: Índice de contenidos:
ca: Índex de contingut:

source: Ejercicio 1: Formato de archivo
ca: Exercici 1: Format de fitxer

source: Abre el archivo `Ejercicio_01.odt <../_static/tutorial-writer/writer/cas/Ejercicio_01.odt>`__ y guárdalo en formato **.DOC**, **.DOCX** y expórtalo en formato **.PDF** de modo que obtengas los siguientes archivos:
ca: Obriu el `Exercici_01.odt <../_ Static/Tutorial-Writer/Writer/CAS/Exercici_01.odt>`__ i protegeix-lo en format **. Doc **, **. DOCX ** i exporteu -lo en format **. Pdf ** de manera que obtingueu els fitxers següents:

source: Ejercicio_01_NombreAlumno.doc
ca: Exercici_01_namer.doc

source: Ejercicio_01_NombreAlumno.docx
ca: Exercici_01_namer.docx

source: Ejercicio_01_NombreAlumno.pdf
ca: Exercici_01_namer.pdf

source: Ejercicio 2: Formato de texto
ca: Exercici 2: Format de text

source: Abre el archivo `Ejercicio_01.odt <../_static/tutorial-writer/writer/cas/Ejercicio_01.odt>`__ y modifica el formato del texto tal y como observas en la imagen.
ca: Obriu el `Exercici_01.odt

source: Guarda el archivo resultante como **"Ejercicio_02_NombreAlumno.odt"**.
ca: Deseu el fitxer resultant com a ** \ "Exercici_02_nombrerealumno.odt " **.

source: Ejercicio 3: Subíndices y superíndices
ca: Exercici 3: Subscripcions i Superince

source: En un nuevo documento escribe el siguiente texto en formato Arial, tamaño 16. Dale a los subíndices un tamaño relativo del 75% y a los superíndices del 58%.
ca: En un nou document, escriviu el text següent en format Arial, mida 16. Doneu als subscripcions una mida relativa del 75% i a les enquestes del 58%.

source: Guarda el archivo resultante como **"Ejercicio_03_NombreAlumno.odt"**.
ca: Deseu el fitxer resultant com a ** \ "Exercici_03_nombrerealumno.odt " **.

source: Ejercicio 4: Formato de párrafo
ca: Exercici 4: Format de paràgraf

source: El archivo `Ejercicio_04.odt <../_static/tutorial-writer/writer/cas/Ejercicio_04.odt>`__ contiene cuatro párrafos. Dale a cada párrafo el formato indicado en su enunciado.
ca: El `Exercici_04.odt <../_ estàtic/tutorial-writer/escriptor/cas/exercici_04.odt>`__ conté quatre paràgrafs. Doneu a cada paràgraf el format indicat a la vostra declaració.

source: Necesitarás usar también la imagen `Ejercicio_04.jpg <../_static/tutorial-writer/writer/cas/Ejercicio_04.jpg>`__
ca: També haureu d’utilitzar el `Exercici_04.jpg <../_ static/tutorial-writer/cas/exercici_04.jpg>`__

source: Guarda el archivo resultante como **"Ejercicio_04_NombreAlumno.odt"**.
ca: Deseu el fitxer resultant com a ** \ "Exercici_04_nombrerealumno.odt " **.

source: Ejercicio 5: Comentarios
ca: Exercici 5: comentaris

source: Abre el documento que creaste en el ejercicio anterior **"Ejercicio_04_NombreAlumno.odt"** y añade los siguientes comentarios:
ca: Obriu el document que heu creat l'any anterior ** \ "Exercici_04_name.dt " ** i afegiu els comentaris següents:

source: En el párrafo 1: "Cambiar la fuente Arial por Verdana".
ca: Al paràgraf 1: \ "Canvieu la font Arial per Verdana ".

source: En el párrafo 2: "Debe eliminarse esta imagen de fondo y poner un color".
ca: Al paràgraf 2: \ "Aquesta imatge de fons s'ha d'eliminar i posar un color ".

source: Guarda el archivo resultante como **"Ejercicio_05_NombreAlumno.odt"**.
ca: Deseu el fitxer resultant com a ** \ "Exercici_05_nombrerealumno.odt " **.

source: Ejercicio 6: Formato de página y formas
ca: Exercici 6: Format i formes de pàgina

source: Abre un documento nuevo, dale tamaño A4 y **orientación horizontal**. Ponle **bordes** y un **color de fondo** a la página (usa los valores que quieras).
ca: Obriu un document nou, doneu -li la mida A4 i ** Orientació horitzontal **. Poseu ** vores ** i un ** color de fons ** a la pàgina (utilitzeu els valors que vulgueu).

source: Introduce **cinco formas** de la barra de herramientas de dibujo de distintas categorías. Dales distintos formatos a las formas (relleno, línea, extrusión, ...) y en una de ellas escribe tu **nombre y apellidos**.
ca: Introduïu ** Cinc formes ** de la barra d’eines de dibuix de diferents categories. Diferents formats als formularis (farcit, línia, extrusió, ...) i en un d'ells escriu el nom ** i el cognom **.

source: Guarda el archivo resultante como **"Ejercicio_06_NombreAlumno.odt"**.
ca: Deseu el fitxer resultant com a ** \ "Exercici_06_NOMBREALUMNO.ODT " **.

source: Ejercicio 7: Corrector
ca: Exercici 7: corrector

source: En el documento `Ejercicio_07.odt <../_static/tutorial-writer/writer/cas/Ejercicio_07.odt>`__ hay tres errores ortográficos. Usa la herramienta de **ortografía y gramática** para corregirlos.
ca: Al document `` 07.odt <../_ static/tutorial-writer/escriptor/cas/exercici_07.odt>`__ Hi ha tres errors d’ortografia. Utilitzeu l'ortografia ** ortografia i gramàtica ** per corregir -les.

source: Selecciona las palabras corregidas y cambia su formato a negrita tamaño 14.
ca: Seleccioneu les paraules corregides i canvieu el seu format a la mida negreta 14.

source: Guarda el archivo resultante como **"Ejercicio_07_NombreAlumno.odt"**.
ca: Deseu el fitxer resultant com a ** \ "Exercici_07_nombrerealumno.odt " **.

source: Ejercicio 8: Columnas
ca: Exercici 8: columnes

source: Abre el archivo corregido del ejercicio anterior. Distribuye su texto en columnas con las siguientes características:
ca: Obriu el fitxer corregit de l'exercici anterior. Distribuïu el text en columnes amb les següents característiques:

source: **Primer párrafo:** Dos columnas de igual ancho, espaciadas 1 cm con una línea de separación de 1 punto de ancho y color verde.
ca: ** Primer paràgraf: ** Dues columnes de la mateixa amplada, espaiades 1 cm amb una línia de separació d’1 punt d’amplada i verd.

source: **Segundo párrafo:** Dos columnas, la de la izquierda de 5 cm de ancho y la de la derecha de 11,50 cm con un espacio entre ellas de 0,50 cm.
ca: ** Segon paràgraf: ** Dues columnes, la de l'esquerra de 5 cm d'ample i la de la dreta d'11,50 cm amb un espai entre 0,50 cm.

source: **Tercer párrafo:** Tres columnas de igual ancho con un espacio entre ellas de 0,30 cm.
ca: ** Tercer paràgraf: ** Tres columnes d’amplada igual amb un espai entre 0,30 cm.

source: Guarda el archivo resultante como **"Ejercicio_08_NombreAlumno.odt"**.
ca: Mantingueu el fitxer resultant com a ** \ "Exercici_08_NOMBREALUMNO.ODT " **.

source: Ejercicio 9: Pegado especial
ca: Exercici 9: Stick especial

source: Busca información en Wikipedia sobre un escritor o escritora que te guste. Usando el "pegado especial" copia parte del contenido de la Wikipedia en un nuevo documento de texto, sin que se copien los hiperenlaces ni el formato original.
ca: Busqueu informació sobre Wikipedia sobre un escriptor o escriptor que us agradi. Utilitzant la part de còpia "especial enganxada" del contingut de Wikipedia en un nou document de text, sense fer front a hiperenllaços ni el format original.

source: Guarda el archivo resultante como **"Ejercicio_09_NombreAlumno.odt"**.
ca: Deseu el fitxer resultant com a ** \ "Exercici_09_NOMBREALUMNO.ODT " **.

source: Ejercicio 10: Imágenes e hiperenlaces
ca: Exercici 10: Imatges i hibernlaques

source: Abre el documento de texto del ejercicio anterior. Pega en él la **fotografía** del escritor o escritora que has buscado en Wikipedia y sitúala en la esquina superior derecha de la primera página.
ca: Obriu el document de text de l'any anterior. La ** Fotografia ** de l'escriptor o escriptor que ha buscat a la Viquipèdia i la col·loca a la part superior dreta de la primera pàgina.

source: Al final del documento introduce una forma **"flecha hacia la derecha"** de la barra de herramientas de dibujo e introduce en ella un hiperenlace a la página web de la que has obtenido la información.
ca: Al final del document introdueix un formulari ** \ "Arrow a la dreta " ** de la barra d'eines de dibuix i introdueix un hiperenllaç al lloc web des del qual heu obtingut la informació.

source: Guarda el archivo resultante como **"Ejercicio_10_NombreAlumno.odt"**.
ca: Deseu el fitxer resultant com a ** \ "Exercici_10_NOMBREALUMNO.ODT " **.

source: Ejercicio 11: Curriculum
ca: Exercici 11: Currículum

source: Te han encargado redactar el currículum de una persona.
ca: Heu estat el responsable d’escriure el currículum d’una persona.

source: Sus datos son:
ca: Les vostres dades són:

source: Inserta la imagen `Ejercicio_11.jpg <../_static/tutorial-writer/writer/cas/Ejercicio_11.jpg>`__ en el currículum.
ca: Inseriu la imatge `Exercici_11.jpg <../_ static/tutorial-writer/escriptor/cas/exercici_11.jpg>`__ al currículum.

source: El diseño será libre. Usa los formatos de texto y de párrafo que desees.
ca: El disseny serà gratuït. Utilitzeu els formats de text i paràgraf que vulgueu.

source: Guarda el archivo resultante como **"Ejercicio_11_NombreAlumno.odt"**.
ca: Deseu el fitxer resultant com a ** \ "Exercici_11_nombrerealumno.odt " **.

source: Ejercicio 12: Encabezado y pie de página
ca: Exercici 12: capçalera i peu de pàgina

source: Abre el documento de texto `Ejercicio_12.odt <../_static/tutorial-writer/writer/cas/Ejercicio_12.odt>`__. Inserta en todas sus páginas el siguiente encabezado: **"Preámbulo de la Ley Orgánica 2/2006, de 3 de Mayo, de Educación"**.
ca: Obriu el document de text `Exercici_12.odt <../_ Static/Tutorial-Writer/Writer/Cas/Exercici_12.odt>`__. Inseriu a totes les seves pàgines la capçalera següent: ** \ "Preàmbul de la llei orgànica 2/2006, del 3 de maig, de l'educació " **.

source: Cambia el formato de este encabezado a Arial, tamaño 9, estilo cursiva y alineación derecha.
ca: Canvieu el format d'aquesta capçalera a Arial, mida 9, estil italic i alineació dreta.

source: Inserta en el pie de página **"Página X de Y"** donde X será el campo **"número de página"** e Y será el campo **"total de páginas"**.
ca: Inseriu al peu de la pàgina ** \ "Pàgina x de y " ** on x serà el camp ** \ "Número de pàgina " ** e i serà el camp ** \ "Pàgines totals " **.

source: Guarda el archivo resultante como **"Ejercicio_12_NombreAlumno.odt"**.
ca: Deseu el fitxer resultant com a ** \ "Exercici_12_nombrerealumno.odt " **.

source: Ejercicio 13: Notas al pie y al final
ca: Exercici 13: Notes de peu i al final

source: Abre el documento que creaste en el ejercicio anterior.
ca: Obriu el document que heu creat l'any anterior.

source: Al final del primer párrafo escribe la siguiente nota a pie de página: **"BOE 04 de Mayo de 2006"**.
ca: Al final del primer paràgraf, escriviu la nota de pàgina següent: ** \ "Boe 4 de maig de 2006 " **.

source: Al final del segundo párrafo escribe la siguiente nota a pie de página: **"Puedes acceder al BOE clicando aquí"**. En la palabra "aquí" inserta un hiperenlace a la página web: **"www.boe.es"**.
ca: Al final del segon paràgraf, escriviu la nota de pàgina següent: ** \ "Podeu accedir al Boe fent clic aquí " **. A la paraula \ "aquí " insereix un hiperenllaç al lloc web: ** \ "www.boe.es " **.

source: Guarda el archivo resultante como **"Ejercicio_13_NombreAlumno.odt"**.
ca: Deseu el fitxer resultant com a ** \ "Exercici_13_nombrerealumno.odt " **.

source: Ejercicio 14: Tabuladores
ca: Exercici 14: tabuladors

source: En un nuevo documento crea tabuladores en las posiciones:
ca: En un nou document crea tabuladors en posicions:

source: Con el contenido alineado a la izquierda.
ca: Amb el contingut alineat a l’esquerra.

source: Pulsando la tecla TAB introduce los siguientes campos:
ca: Si premeu la tecla TAB introdueix els camps següents:

source: NOMBRE
ca: Nom

source: LOCALIDAD
ca: Localitat

source: EMAIL
ca: Correu electrònic

source: EDAD
ca: Envellir

source: Debajo modifica los tabuladores para que estén separados por puntitos.
ca: A continuació, modifica els tabuladors perquè estiguin separats per punts.

source: Escribe los datos inventados de cinco personas.
ca: Escriviu les dades inventades de cinc persones.

source: Guarda el archivo resultante como **"Ejercicio_14_NombreAlumno.odt"**.
ca: Deseu el fitxer resultant com a ** \ "Exercici_14_nombrerealumno.odt " **.

source: Ejercicio 15: Buscar y reemplazar
ca: Exercici 15: cerca i substituïu

source: Abre el documento `Ejercicio_15.odt <../_static/tutorial-writer/writer/cas/Ejercicio_15.odt>`__.
ca: Obriu el `Exercici_15.odt <../_ Static/Tutorial-Writer/Writer/Cas/Exercici_15.odt>`__.

source: Con la herramienta **"buscar y reemplazar"** busca todos los términos "Galicia" del documento y sustituye su formato actual por el siguiente:
ca: Amb l'eina ** \ "Cerca i substituïu " ** busqueu tots els termes \ "Galicia " del document i substituïu el seu format actual per les següents:

source: Fuente: Arial
ca: Font: Arial

source: Tamaño: 16
ca: Mida: 16

source: Estilo: Negrita
ca: Estil: atrevit

source: Color: Azul
ca: Color: Blau

source: Guarda el archivo resultante como **"Ejercicio_15_NombreAlumno.odt"**.
ca: Deseu el fitxer resultant com a ** \ "Exercici_15_nombrerealumno.odt " **.

source: Ejercicio 16: Numeración y viñetas
ca: Exercici 16: Número i Viñetas

source: Escribe el nombre de las cuatro provincias gallegas en un nuevo documento.
ca: Escriviu el nom de les quatre províncies Galician en un nou document.

source: Copia y pega debajo dos veces esa lista y usa la herramienta "Numeración y viñetas" para obtener un resultado como el de la siguiente imagen:
ca: Copieu i enganxeu la llista dues vegades i utilitzeu els \ "Numeració i vinyetes " per obtenir un resultat com la imatge següent:

source: Guarda el archivo resultante como **"Ejercicio_16_NombreAlumno.odt"**.
ca: Deseu el fitxer resultant com a ** \ "Exercici_16_NOMBREALUMNO.ODT " **.

source: Ejercicio 17: Tablas
ca: Exercici 17: Taules

source: Crea una tabla como la de la siguiente imagen en un nuevo documento. Puedes usar otros formatos de texto y colores de fondo.
ca: Creeu una taula com la imatge següent en un document nou. Podeu utilitzar altres formats de text i colors de fons.

source: Guarda el archivo resultante como **"Ejercicio_17_NombreAlumno.odt"**.
ca: Deseu el fitxer resultant com a ** \ "Exercici_17_nombrerealumno.odt " **.

source: Ejercicio 18: Tablas (II)
ca: Exercici 18: Taules (II)

source: Crea una tabla con tu horario de clase en un nuevo documento. Usa los formatos que desees.
ca: Creeu una taula amb la vostra programació de classes en un document nou. Utilitzeu els formats que vulgueu.

source: Guarda el archivo resultante como **"Ejercicio_18_NombreAlumno.odt"**.
ca: Mantingueu el fitxer resultant com ** \ "Exercici_18_NOMBREALUMNO.ODT " **.

source: Ejercicio 19: Filtros de imagen
ca: Exercici 19: filtres d’imatges

source: Crea una tabla de dos filas y dos columnas. En cada una de las celdas inserta la imagen `Ejercicio_04.jpg <../_static/tutorial-writer/writer/cas/Ejercicio_04.jpg>`__.
ca: Creeu una taula de dos i dues columnes. A cadascuna de les cel·les inseriu la imatge `` `04.jpg <../_ static/tutorial-writer/escriptor/cas/exercici_04.jpg>`__.

source: Céntralas horizontal y verticalmente y aplícale a cada una un filtro distinto.
ca: Horitzontalment i verticalment els centren i s’apliquen a cadascun d’un filtre diferent.

source: Guarda el archivo resultante como **"Ejercicio_19_NombreAlumno.odt"**.
ca: Deseu el fitxer resultant com a ** \ "Exercici_19_NOMBREALUMNO.ODT " **.

source: Ejercicio 20: Secciones
ca: Exercici 20: seccions

source: Abre el documento `Ejercicio_20.odt <../_static/tutorial-writer/writer/cas/Ejercicio_20.odt>`__.
ca: Obriu el document `Exercici_20.odt <../_ Static/Tutorial-Writer/Writer/Cas/Exercici_20.odt>`__.

source: El documento está compuesto por seis apartados. Inserta saltos de página de modo que cada apartado ocupe solo una página.
ca: El document consta de sis seccions. Inseriu salts de pàgina de manera que cada secció només ocupi una pàgina.

source: A continuación inserta seis secciones y a cada una aplícale un formato de página (orientación, color de fondo, bordes, etc.) distinto del resto.
ca: A continuació, inseriu sis seccions i, apliqueu un format de pàgina (orientació, color de fons, vores, etc.) diferent de la resta.

source: Guarda el archivo resultante como **"Ejercicio_20_NombreAlumno.odt"**.
ca: Deseu el fitxer resultant com ** \ "Exercici_20_namerumno.odt " **.

source: Ejercicio 21: Índice
ca: Exercici 21: Índex

source: Abre el archivo **"Ejercicio_20_NombreAlumno.odt"** que creaste en el ejercicio anterior y añade un índice de los apartados del documento.
ca: Obriu el fitxer ** \ "Exercici_20_namer.

source: Guarda el archivo resultante como **"Ejercicio_21_NombreAlumno.odt"**.
ca: Deseu el fitxer resultant com a ** \ "Exercici_21_namerumno.odt " **.

source: Ejercicio 22: Portada
ca: Exercici 22: coberta

source: Abre el archivo **"Ejercicio_21_NombreAlumno.odt"** que creaste en el ejercicio anterior e introduce una portada. En ella inserta un **"Fontwork"** con el texto: **"Periféricos del ordenador"**. Añade también tu **nombre y apellidos**.
ca: Obriu el fitxer ** \ "Exercici_21_namer. En ell, inseriu un ** " fontwork \ "** amb el text: ** " perifèrics de l'ordinador \ "**. Afegiu el vostre nom ** i cognom **.

source: Guarda el archivo resultante como **"Ejercicio_22_NombreAlumno.odt"**.
ca: Deseu el fitxer resultant com a ** \ "Exercici_22_nombrerealumno.odt " **.

source: Ejercicio 23: Convertir tabla en texto
ca: Exercici 23: Converteix la taula en text

source: Abre el documento `Ejercicio_23.odt <../_static/tutorial-writer/writer/cas/Ejercicio_23.odt>`__.
ca: Obriu el document `Exercici_23.odt <../_ Static/Tutorial-Writer/Writer/CAS/Exercici_23.odt>`__.

source: Convierte la tabla en un texto usando el punto y coma como separador.
ca: Convertiu la taula en un text mitjançant el punt i mengeu com a separador.

source: Guarda el archivo resultante como **"Ejercicio_23_NombreAlumno.odt"**.
ca: Deseu el fitxer resultant com a ** \ "Exercici_23_nombrerealumno.odt " **.

source: Ejercicio 24: Proteger un documento
ca: Exercici 24: protegir un document

source: Abre el archivo **"Ejercicio_23_NombreAlumno.odt"** que creaste en el ejercicio anterior.
ca: Obriu el fitxer ** \ "Exercici_23_namer.odt " ** que heu creat l'any anterior.

source: Guárdalo como **"Ejercicio_24_NombreAlumno.odt"** protegido con la contraseña **12345**.
ca: Guardeu -ho com ** \ "Exercici_24_namer.odt " ** protegit amb contrasenya ** 12345 **.

source: Ejercicio 25: Formulario
ca: Exercici 25: Forma

source: Imagina que un equipo deportivo de tu localidad (fútbol, baloncesto, ...) te encarga diseñar un formulario para recoger los datos de los nuevos socios.
ca: Imagineu -vos que un equip esportiu de la vostra ciutat (futbol, ​​bàsquet, ...) té cura d’un formulari per recollir les dades dels nous socis.

source: Crea un formulario que incluya una imagen del escudo del equipo y varios campos con los datos personales de los socios (nombre, apellidos, domicilio, teléfono, etc.).
ca: Creeu un formulari que inclogui una imatge de l’equip de l’equip i diversos camps amb les dades personals dels socis (nom, cognom, adreça, telèfon, etc.).

source: Introduce tres botones de opción para el pago de la cuota:
ca: Introduïu tres botons d’opció per al pagament de la quota:

source: Los socios solo podrán marcar una de las tres opciones.
ca: Els socis només poden marcar una de les tres opcions.

source: Guarda el archivo resultante como **"Ejercicio_25_NombreAlumno.odt"**.
ca: Deseu el fitxer resultant com a ** \ "Exercici_25_nombrerealumno.odt " **.

source: Ejercicio 26: Formulario (II)
ca: Exercici 26: Forma (II)

source: Abre el archivo **"Ejercicio_25_NombreAlumno.odt"** que creaste en el ejercicio anterior.
ca: Obriu el fitxer ** \ "Exercici_25_namer.odt " ** que vau crear l'any anterior.

source: Protege con la contraseña **12345** todas las partes del formulario salvo los campos que deben ser cubiertos por los socios.
ca: Protegeix amb la contrasenya ** 12345 ** Totes les parts del formulari, excepte els camps que han de ser coberts pels socis.

source: Guarda el archivo resultante como **"Ejercicio_26_NombreAlumno.odt"**.
ca: Mantingueu el fitxer resultant com a ** \ "Exercici_26_nombrerealumno.odt " **.

source: Ejercicio 27: Formulario (III)
ca: Exercici 27: Forma (iii)

source: Abre el archivo **"Ejercicio_26_NombreAlumno.odt"** que creaste en el ejercicio anterior.
ca: Obriu el fitxer ** \ "Exercici_26_namer.

source: Genera un PDF para que los socios puedan rellenarlo e imprimirlo.
ca: Genera un PDF perquè els socis puguin omplir -lo i imprimir -lo.

source: Guarda el archivo resultante como **"Ejercicio_27_NombreAlumno.pdf"**.
ca: Deseu el fitxer resultant com a ** \ "Exercici_27_nombrerealumno.pdf " **.

source: Ejercicio 28: Caracteres especiales y fórmulas
ca: Exercici 28: caràcters i fórmules especials

source: Insertando caracteres especiales y usando el asistente de fórmulas escribe en un nuevo documento las siguientes fórmulas:
ca: Inserir caràcters especials i utilitzar la fórmula assistent escriu en un nou document Les fórmules següents:

source: Guarda el archivo resultante como **"Ejercicio_28_NombreAlumno.odt"**.
ca: Deseu el fitxer resultant com a ** \ "Exercici_28_nombrerealumno.odt " **.

source: Ejercicio 29: Combinar correspondencia
ca: Exercici 29: Combina la correspondència

source: Crea un documento de texto que contenga una carta similar a la de la siguiente imagen, dirigida a todos los clientes que figuran en la hoja de cálculo `Ejercicio_29.ods <../_static/tutorial-writer/writer/cas/Ejercicio_29.ods>`__.
ca: Creeu un document de text que contingui una carta similar a la de la imatge següent, dirigida a tots els clients que figuren al full de càlcul `Exercici

source: Usa los formatos de Fontwork, texto, párrafo y página que quieras.
ca: Utilitzeu els formats de tipus de lletra, el text, el paràgraf i la pàgina que vulgueu.

source: Guarda el archivo resultante como **"Ejercicio_29_NombreAlumno.odt"**.
ca: Deseu el fitxer resultant com a ** \ "Exercici_29_NOMBREALUMNO.ODT " **.

source: Ejercicio 30: Combinar correspondencia (II)
ca: Exercici 30: Combina la correspondència (II)

source: Crea un documento de texto que contenga la misma carta que en el ejercicio anterior, pero dirigida solo a los clientes de la provincia de Pontevedra.
ca: Creeu un document de text que contingui la mateixa carta que l'any anterior, però que només es dirigeixi als clients de la província de Pontevedra.

source: Guarda el archivo resultante como **"Ejercicio_30_NombreAlumno.odt"**.
ca: Deseu el fitxer resultant com a ** \ "Exercici_30_nombrerealumno.odt " **.

source: Créditos
ca: Crèdits

source: Autor de los ejercicios originales: José Manuel Blanco Guimarey
ca: Autor dels exercicis originals: José Manuel Blanco Guimarey

source: Licencia: `Creative Commons BY-NC-SA <https://creativecommons.org/licenses/by-nc-sa/4.0/>`__
ca: Llicència: `Creative Commons By-NC-S

source: Fuente: `Ejercicios propuestos <../_static/tutorial-writer/writer/index.html>`__
ca: Font: `Exercicis proposats <../_ static/tutorial-writer/escriptor/index.html>`__

source: Créditos del tutorial: `Créditos <../_static/tutorial-writer/writer/docs/creditos.html>`__
ca: Crèdits tutorials: `crèdits <../_ static/tutorial-writer/escriptor/docs/creditos.html>`__
