Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/informatica-hardware-auxiliares.po
Languages: ca

source: Elementos auxiliares
ca: Elements auxiliars

source: Fuente de alimentación
ca: Alimentació

source: La `fuente de alimentación <https://www.intel.es/content/www/es/es/gaming/resources/power-supply.html>`__ es el componente que se encarga de alimentar con energía eléctrica de baja tensión y en corriente continua (5V y 12V) a todos los componentes del ordenador.
ca: La "font d'alimentació <https://www.intel.es/content/www/es/es/gaming/resources/power-supply.html>` __ és el component que és responsable de l'alimentació amb baix tensió i corrent continu (5V i 12V) energia elèctrica a tots els components de l'ordinador.

source: La fuente de alimentación debe tener suficiente potencia (vatios) para poder alimentar todos los componentes, pero también debe tener suficiente `corriente <https://www.muycomputer.com/2018/10/14/guia-fuente-de-alimentacion/>`__ (amperios) para poder alimentar la tarjeta gráfica, que suele ser el componente con mayor demanda de corriente.
ca: L’alimentació elèctrica ha de tenir prou potència (watts) per poder alimentar tots els components, però també ha de tenir prou “actual <https://www.muycomputer.com/2018/10/14/guia-fuentee-de-alimentacion/>`__ (AMPS) per poder alimentar la targeta gràfica, que sol ser el component amb la demanda més alta de corrent.

source: En los teléfonos móviles y tabletas la fuente de alimentación suele ser un adaptador para enchufe con salida USB-C. Muchos de estos adaptadores se diseñan para dar una potencia cada vez mayor, por lo que no es extraño encontrar adaptadores desde 18W hasta 80W o más, cuando anteriormente los cargadores USB apenas alcanzaban los 10W.
ca: Als telèfons mòbils i tauletes, l'alimentació sol ser un adaptador per a la sortida USB-C. Molts d’aquests adaptadors estan dissenyats per donar un poder creixent, per la qual cosa no és estrany trobar adaptadors de 18W a 80W o més, quan abans els carregadors USB gairebé no van arribar a 10W.

source: Sistema de alimentación ininterrumpida (SAI)
ca: Sistema d’alimentació ininterrompuda (SAI)

source: Un `sistema de alimentación ininterrumpida o SAI <https://es.wikipedia.org/wiki/Sistema_de_alimentaci%C3%B3n_ininterrumpida>`__ (en inglés UPS) es un dispositivo con una batería recargable en su interior, que puede proporcionar alimentación eléctrica a un ordenador u otros aparatos durante un apagón eléctrico.
ca: Un `sistema d'alimentació ininterromput o Sai <https://es.wikipedia.org/wiki/system_de_alimentaci%C3%B3N_ININTERRUMPIDA>` `__ (en anglès UPS) és un dispositiu amb una bateria recarregable a l'interior, cosa que pot proporcionar energia elèctrica a un ordinador o a un altre dispositiu durant una negre elèctrica.

source: El cambio de funcionamiento durante un apagón es tan rápido que el ordenador no llega a apagarse y puede seguir funcionando durante unos minutos hasta que se restablezca la alimentación eléctrica normal o hasta que se apague el ordenador de manera correcta.
ca: El canvi de funcionament durant un apagament és tan ràpid que l’ordinador no surt i pot continuar funcionant uns minuts fins que es restableixi la potència normal o fins que l’ordinador s’extingeixi correctament.

source: Vista delantera y trasera de un SAI marca APC.
ca: Vista frontal i posterior d’una marca APC.

source: Refrigeración por aire
ca: Refrigeració a l’aire

source: La `refrigeración por aire <https://es.wikipedia.org/wiki/Refrigeraci%C3%B3n_por_aire_(computadoras)>`__ se utiliza en los ordenadores más potentes (por ejemplo, un ordenador portátil o un PC), para extraer fuera de la caja el calor generado por sus circuitos. Normalmente se utilizan ventiladores encima de la CPU, en la tarjeta gráfica y en la fuente de alimentación, aunque puede haber más ventiladores para evacuar el calor de la caja.
ca: El "refrigeració d'aire <https://es.wikipedia.org/wiki/refrigeraci%C3%B3n_por_aire_ (ordinadors)>` __ s'utilitza en els ordinadors més potents (per exemple, un ordinador portàtil o un PC), per extreure la calor generada pels seus circuits fora de la caixa. Normalment els aficionats s’utilitzen per sobre de la CPU, a la targeta gràfica i a la font d’alimentació, tot i que pot haver -hi més fans per evacuar la calor de la caixa.

source: Los ventiladores suelen ser los elementos más ruidosos de un ordenador, razón por la que en algunos ordenadores de menores prestaciones se utilizan sistemas de ventilación por convención (sin ventiladores) para evitar el ruido.
ca: Els aficionats solen ser els elements més forts d’un ordinador, és per això que en alguns ordinadors de baix rendiment, s’utilitzen sistemes de ventilació de convencions (sense fans) per evitar el soroll.

source: Otro sistema que permite retirar grandes cantidades de calor con poco ruido es la refrigeración líquida, aunque su precio es mayor que la refrigeración por aire.
ca: Un altre sistema que permet eliminar grans quantitats de calor amb poc soroll és el refredament de líquids, tot i que el seu preu és superior al refredament de l’aire.

source: Refrigeración líquida
ca: Refrigeració líquida

source: La `refrigeración líquida <https://es.wikipedia.org/wiki/Refrigeraci%C3%B3n_l%C3%ADquida_(inform%C3%A1tica)>`__ es una técnica de enfriamiento que utiliza agua u otro líquido como medio refrigerante. Es mucho más eficaz que la refrigeración por aire y produce menos ruido, aunque tiene el inconveniente de ser mucho más costosa.
ca: El `refrigeració líquida <https://es.wikipedia.org/wiki/refrigeraci%C3%B3N_L%C3%Adquida_ (Informeu%C3%A1tica)>`__ És una tècnica de refrigeració que utilitza aigua o líquid com a medi refrigerant. És molt més eficaç que el refredament de l’aire i produeix menys soroll, tot i que té l’inconvenient de ser molt més car.

source: Interior de un ordenador personal con refrigeración líquida.
ca: Interior d’un ordinador personal amb refrigeració líquida.

source: `Llama roja <https://commons.wikimedia.org/wiki/File:Refrigeraci%C3%B3n_l%C3%ADquida_en_un_computador.jpg>`__, `CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0/deed.en>`__, via Wikimedia Commons.
ca: `Truca a RED <https://commons.wikimedia.org/wiki/file:Refrigeraci%C3%B3N_L%C3%Adquida_en_un_computador.jpg>` __, `cc by-sa 4.0 <https://creativecommons.org/licenses/by-bby/4.0/Deed.en>>`__, via Wikimedia Commons.

source: Caja
ca: Caixa

source: La `caja del ordenador <https://es.wikipedia.org/wiki/Caja_de_computadora>`__ es la estructura metálica o plástica que sirve para albergar, sostener y proteger los diferentes componentes del ordenador.
ca: El `Box Computer <https://es.wikipedia.org/wiki/caja_de_computadora>`__ és l'estructura metàl·lica o plàstica que serveix per allotjar, sostenir i protegir els diferents components de l'ordinador.

source: Existen `multitud de formatos de caja <https://es.wikipedia.org/wiki/Caja_de_computadora#Tipos_de_caja>`__ de varios tamaños y propósitos, desde una caja pequeña tipo *barebone* hasta una gran caja de tipo torre, cajas de tipo *rack* para servidores o carcasas de portátiles o tabletas.
ca: Hi ha una multitud de formats d’efectiu <https://es.wikipedia.org/wiki/caja_de_computadora#tipos_de_caja>`__ de diverses mides i propòsits, a partir d’un tipus de tipus petit * descalç * a una caixa de torre gran, tipus * Rack * per a servidors o laptops de Laptops o tauletes.

source: Pila botón
ca: Botó

source: La pila de la placa base es una pila de tipo botón que se encarga de alimentar el reloj en tiempo real y la `memoria RAM-CMOS que almacena las opciones de la BIOS <https://es.wikipedia.org/wiki/RAM-CMOS>`__ mientras el ordenador está apagado. Suele ser una pila de botón modelo CR-2032.
ca: La bateria de la placa base és una bateria de tipus botó que s’encarrega d’alimentar el rellotge en temps real i la “memòria RAM-CMOS que emmagatzema les opcions del BIOS <https://es.wikipedia.org/wiki/ram-cmos>`__ mentre l’ordinador està desactivat. Normalment és un botó Model CR-2032.

source: Cuando esta pila se desgasta tras varios años de uso, el reloj deja de mantener la hora actual y se restablece a su hora de inicio, además se pierden los ajustes de la BIOS. Todo esto provoca que el ordenador no funcione con normalidad o que no funcione en absoluto.
ca: Quan aquesta bateria es desgasta després de diversos anys d’ús, el rellotge deixa de mantenir l’hora actual i es restableix en el seu moment d’inici, també es perd la configuració de la BIOS. Tot això fa que l’ordinador no funcioni normalment o no funcioni en absolut.

source: La solución a este problema es sencilla porque se puede encontrar una pila de repuesto en cualquier comercio y el reemplazo es relativamente fácil de realizar.
ca: La solució a aquest problema és senzilla perquè podeu trobar una bateria de recanvi en qualsevol comerç i la substitució és relativament fàcil de realitzar.

source: Pila botón CR-2032, la más común en las placas base.
ca: Pila de botons CR-2032, la més comuna a les plaques base.

source: `Krzysztof Woźnica <https://commons.wikimedia.org/wiki/File:Battery-lithium-cr2032.jpg>`__, Public Domain, via Wikimedia Commons.
ca: `Krzysztof Woźnica <https://commons.wikimedia.org/wiki/file:battery-lithium-cr2032.jpg>`__, domini públic, a través de Wikimedia Commons.

source: Reloj en tiempo real
ca: Rellotge en temps real

source: El `RTC o reloj en tiempo real <https://es.wikipedia.org/wiki/Reloj_en_tiempo_real>`__ es un pequeño circuito integrado que actúa como un reloj manteniendo la fecha y la hora actual aunque el ordenador se encuentre apagado. Normalmente va acompañado de una pequeña pila de tipo botón para darle alimentación. Su consumo es muy reducido, por lo que la pila puede durar varios años en funcionamiento.
ca: El `` RTC o rellotge en temps real <https://es.wikipedia.org/wiki/reloj_en_tiempo_real>`__ és un petit circuit integrat que actua com a rellotge mantenint la data i l'hora actual, fins i tot si l'ordinador està desactivat. Normalment s’acompanya d’una petita bateria de tipus de botó per donar menjar. El seu consum és molt petit, de manera que la bateria pot durar diversos anys en funcionament.

source: El reloj de tiempo real se utiliza para asignar a los archivos creados la fecha y la hora actual o para sincronizarse con servicios por Internet
ca: El rellotge en temps real s’utilitza per assignar els fitxers creats la data i l’hora actuals o per sincronitzar -se amb Internet Services

source: El `modding <https://es.wikipedia.org/wiki/Modding>`__ deriva de la palabra inglesa modify (modificar) y es el arte o técnica de modificar la estética de un ordenador personal añadiendo luces, imágenes, paredes transparentes, etc.
ca: El `modding <https://es.wikipedia.org/wiki/modding>`__ deriva de la paraula anglesa modificar (modificar) i és l'art o la tècnica de modificar l'estètica d'un ordinador personal que afegeix llums, imatges, parets transparents, etc.

source: Modificación del chasis con aluminio, acrílico y ledes RGB.
ca: Modificació del xassís amb alumini, acrílic i leds RGB.

source: `Acuantico <https://commons.wikimedia.org/wiki/File:For_the_Horde_Mod_by_Acu%C3%A1ntico_Power.jpg>`__, `CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0/deed.en>`__, via Wikimedia Commons.
ca: `Aquantico <https://commons.wikimedia.org/wiki/file:for_the_horde_mod_by_acure <https://creativecommons.org/licenses/by-sa/4.0/deed.en>`__, a través de commons de Wikimedia.

source: Test de la unidad
ca: Test de prova

source: `Test de elementos auxiliares I. <../test/es-hardware-auxiliares-1.html>`__
ca: `Test d'elements auxiliars I. <../test/es-hardware-auxiliary-1.html>`__ __

source: `Test de elementos auxiliares II. <../test/es-hardware-auxiliares-2.html>`__
ca: `Elements auxiliars II. <../test/es-hardware-auxiliary-2.html>`__
