Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/informatica-ciberseguridad-terminos-tecnicos.po
Languages: ca

source: Términos técnicos
ca: Condicions tècniques

source: En este apartado se muestran varios términos técnicos relacionados con la ciberseguridad.
ca: Aquesta secció mostra diversos termes tècnics relacionats amb la ciberseguretat.

source: Glosario
ca: Glossari

source: `Ancho de banda <https://es.wikipedia.org/wiki/Ancho_de_banda>`__
ca: `Amplada de banda <https://es.wikipedia.org/wiki/ancho_de_banda>`__

source: `Chat en línea <https://es.wikipedia.org/wiki/Chat>`__
ca: `Xat en línia <https://es.wikipedia.org/wiki/chat>`__

source: `DNS (Domain Name System) <https://es.wikipedia.org/wiki/Sistema_de_nombres_de_dominio>`__
ca: `DNS (sistema de nom de domini)

source: `Packet sniffing <https://es.wikipedia.org/wiki/An%C3%A1lisis_web#Packet_sniffing>`__
ca: `Sniffing de paquets <https://es.wikipedia.org/wiki/an%C3%A1lisis_web#packet_sniffing>` `` `` `` `` `

source: `Red social <https://es.wikipedia.org/wiki/Red_social>`__
ca: `Xarxa social <https://es.wikipedia.org/wiki/red_social>`__

source: `Sniffer (analizador de paquetes) <https://es.wikipedia.org/wiki/Analizador_de_paquetes>`__
ca: `Sniffer (analitzador de paquets) <https://es.wikipedia.org/wiki/analizador_de_paquetes>`__

source: `URL (Uniform Resource Locator) <https://es.wikipedia.org/wiki/Localizador_de_recursos_uniforme>`__
ca: `URL (localitzador de recursos uniformes) <https://es.wikipedia.org/wiki/localizador_de_recursos_uniform>`__
