Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/informatica-hardware-placabase.po
Languages: ca

source: Una `placa base <https://es.wikipedia.org/wiki/Placa_base>`__ también conocida como placa madre o motherboard es una tarjeta de circuito impreso que sirve de soporte y de conexión de los componentes internos de un ordenador. Además tiene múltiples conectores estándar para conectar los componentes externos.
ca: Una "placa base <https://es.wikipedia.org/wiki/placa_base>`__ També coneguda com a placa base o moto és una targeta de circuit imprès que serveix de suport i connexió dels components interns d'un ordinador. També té diversos connectors estàndard per connectar components externs.

source: Placa base ASRock A70GXH-128M de 2012.
ca: ASROCK A70GXH-128M Placa base 2012.

source: Elementos típicos de una placa base de PC
ca: Elements típics d'una placa base de PC

source: Conectores PS/2:
ca: Connectors PS/2:

source: 1 - Conector PS/2 verde, para ratón.
ca: 1 - PS/2 Connector verd, per al ratolí.

source: 2 - Conector PS/2 morado, para teclado.
ca: 2 - PS/2 Connector morat, per al teclat.

source: Conectores para Vídeo:
ca: Connectors de vídeo:

source: 3 - Conector VGA para monitor.
ca: 3 - Connector VGA per al monitor.

source: 4 - Conector DVI para monitor.
ca: 4 - Connector DVI per al monitor.

source: 5 - Conector HDMI para monitor.
ca: 5 - Connector HDMI per al monitor.

source: Conector trasero de audio digital:
ca: Connector DIGITAL AUDIO:

source: 6 - Conector `S/PDIF <https://es.wikipedia.org/wiki/Protocolo_S/PDIF>`__ para salida de audio digital.
ca: 6 - Connector `s/pdif <https://es.wikipedia.org/wiki/protocolo_s/pdif>`__ per a la sortida d'àudio digital.

source: Conectores USB y Ethernet:
ca: Connectors USB i Ethernet:

source: 7 - Conector USB 2.0 de tipo A.
ca: 7 - USB 2.0 Connector de tipus A.

source: 9 - Conector USB 3.0 de tipo A.
ca: 9 - USB 3.0 Connector de tipus A.

source: 8 - Conector RJ-45 para conexión Ethernet de área local.
ca: 8 - Connector RJ -45 per a la connexió Ethernet de la zona local.

source: `Conectores traseros de Audio analógico <https://es.wikipedia.org/wiki/Conector_de_audio_anal%C3%B3gico#C%C3%B3digos_de_colores_en_PC_para_conectores_de_audio>`__:
ca: `Connectors posteriors d'àudio analògic <https://es.wikipedia.org/wiki/conector_de_audio_anal%C3%B3Gico#c%C3%B3digos_de_colores_en_pc_para_connectors_de_audio>` __: __:

source: 10 - Salida de audio analógico 7.1. Altavoces laterales, traseros y subwoofer.
ca: 10 - Sortida d'àudio analògic 7.1. Ponents laterals, posteriors i subwoofer.

source: 11 - Entrada analógica para micrófono.
ca: 11 - Entrada analògica per al micròfon.

source: 12 - Salida de audio analógico estéreo. Altavoces frontales.
ca: 12 - Sortida d'àudio analògic estèreo. Altaveus frontals.

source: 13 - Entrada de audio analógico, nivel de línea.
ca: 13 - Entrada d'àudio analògic, nivell de línia.

source: Conectores para tarjetas de expansión:
ca: Connectors de targetes d’expansió:

source: 14 - Conector `PCI Express <https://es.wikipedia.org/wiki/PCI_Express>`__ x16.
ca: 14 - PCI Express Connector <https://es.wikipedia.org/wiki/pci_express>`__ x16.

source: 15 - Pila para la memoria CMOS de la placa base.
ca: 15 - Bateria de memòria CMOS de la placa base.

source: 16 y 18 - Conectores `PCI <https://es.wikipedia.org/wiki/Peripheral_Component_Interconnect>`__ antiguos.
ca: 16 i 18 - Connectors

source: 17 - Conector `PCI Express <https://es.wikipedia.org/wiki/PCI_Express>`__ x1.
ca: 17 - PCI Express Connector <https://es.wikipedia.org/wiki/pci_express>`__ x1.

source: Conectores para la caja y SATA:
ca: Connectors de caixa i SATA:

source: 19 - Conectores para USB de la caja del PC.
ca: 19 - Connectors USB de la caixa de PC.

source: 20 - Conector para el altavoz de la caja del PC.
ca: 20 - Connector d’altaveus de la caixa de PC.

source: 21 - Conectores para los ledes de la caja del PC y pulsador de alimentación.
ca: 21 - Connectors per als LEDs del quadre de PC i el botó d'alimentació.

source: 22 - Conectores SATA para conectar unidades de disco duro, SSD, DVD, etc.
ca: 22 - Connectors SATA per connectar unitats de disc dur, SSD, DVD, etc.

source: Otros conectores:
ca: Altres connectors:

source: 23 - Cuatro conectores para la memoria `RAM DDR4 <https://es.wikipedia.org/wiki/DDR4_SDRAM>`__.
ca: 23 - Quatre connectors per a la memòria `RAM DDR4 <https://es.wikipedia.org/wiki/ddr4_sdram>`__.

source: 24 - Conector de alimentación de la placa base.
ca: 24 - Connector de potència de la placa base.

source: 25 - `Zócalo de conexión de la CPU <https://es.wikipedia.org/wiki/Z%C3%B3calo_de_CPU>`__.
ca: 25 - `CPU Connection Socket <https://es.wikipedia.org/wiki/z%C3%B3calo_de_cpu>`__.

source: 26 - Conector de alimentación de la placa base para la CPU.
ca: 26 - Connector d'alimentació de la placa base CPU.

source: Test de la unidad
ca: Test de prova

source: `Test de la placa base. <../test/es-hardware-placa-base.html>`__
ca: `Prova de la placa base. <../test/Es-Harcware-Placa-Base.html>`__
