Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/informatica-software-imagenes.po
Languages: ca

source: Este formato permite procesar o 'revelar' una imagen para que tenga más o menos luminosidad o más o menos rango dinámico, sin que se pierda calidad en el resultado final.
ca: Aquest format permet processar o revelar una imatge de manera que tingui més o menys lluminositat o més o menys dinàmic, sense qualitat perduda en el resultat final.

source: El inconveniente que presenta este formato es la falta de estandarización, por lo que cada fabricante utiliza su propia versión del formato, lo que puede producir incompatibilidades o que alguna versión del formato RAW no se pueda usar en el futuro.
ca: Les molèsties presentades per aquest format és la manca d’estandardització, de manera que cada fabricant utilitza la seva pròpia versió del format, que pot causar incompatibilitats o que alguna versió del format brut no es pot utilitzar en el futur.

source: Resumen de los formatos de imagen de mapa de bits.
ca: Resum dels formats d'imatge del mapa de bits.

source: Formato
ca: Format

source: Compresión
ca: Compressió

source: Pérdidas
ca: Pèrdues

source: Transparencias
ca: Transparències

source: Movimiento
ca: Moviment

source: Si
ca: Sí

source: RGB 8 bits por tono
ca: RGB 8 bits per to

source: 256 colores
ca: 256 colors

source: RGB + Transparencia
ca: Transparència RGB +

source: Solo 256 Colores
ca: Només 256 colors

source: RGB de 8 bits por tono
ca: 8 -bit RGB per to

source: RGB de 12 a 16 bits por tono
ca: RGB de 12 a 16 bits per to

source: Tipo de imagen
ca: Tipus d'imatge

source: Fotografías.
ca: Fotografies

source: Dibujos.
ca: Dibuixos.

source: Imagenes con movimiento.
ca: Imatges de moviment.

source: Fotografía profesional.
ca: Fotografia professional.

source: Fotografía científica.
ca: Fotografia científica

source: Impresión en papel.
ca: Impressió en paper.

source: Comparativa entre formatos JPEG y PNG
ca: Comparació entre formats JPEG i PNG

source: En las siguientes imágenes podemos comprobar las diferencias y la utilidad de cada uno de los formatos de imagen.
ca: A les imatges següents podem comprovar les diferències i la utilitat de cadascun dels formats d’imatge.

source: A la hora de guardar textos o imágenes de dibujo, siempre será mejor utilizar el formato PNG que ocupará menos tamaño dando mejor calidad.
ca: En desar textos o dibuixar imatges, sempre serà millor utilitzar el format PNG que ocuparà menys mida donant una millor qualitat.

source: Archivo de imagen PNG de 6kb de tamaño, sin errores.
ca: Fitxer d’imatge PNG 6KB, sense errors.

source: Archivo de imagen JPEG de 7kb de tamaño, con "artefactos".
ca: Fitxer d'imatge JPEG 7KB, amb \ "Artifactes ".

source: Archivo de imagen PNG de 210 bytes de tamaño, sin errores.
ca: Fitxer d’imatge PNG de 210 bytes de mida, sense errors.

source: Archivo de imagen JPEG de 11284 bytes de tamaño, con "artefactos".
ca: 11284 Bytes de mida JPEG FILES, amb \ "artefactes ".

source: A la hora de guardar fotografías, siempre será mejor utilizar el formato JPEG que ocupará menos tamaño dando una calidad semejante. En realidad la calidad del formato JPEG será menor, pero no se apreciará a simple vista.
ca: Quan estalvieu fotografies, sempre serà millor utilitzar el format JPEG que ocuparà menys mida donant una qualitat similar. En realitat, la qualitat del format JPEG serà menor, però no s’apreciarà amb l’ull nu.

source: Archivo de imagen PNG de 262kb de tamaño.
ca: Fitxer d’imatge PNG de 262KB.

source: Archivo de imagen JPEG de 52kb de tamaño.
ca: Fitxer d’imatge JPEG de 52KB.

source: Formatos vectoriales
ca: Formats vectorials

source: Los formatos de **imágenes vectoriales** están compuestos por vectores, que son instrucciones matemáticas que se le dan al navegador o a programas de edición de estos gráficos para que se puedan visualizar. Estas imágenes se pueden escalar de manera infinita sin perder resolución o calidad.
ca: Els formats d’imatges ** vectorials ** estan compostos per vectors, que són instruccions matemàtiques que es donen al navegador o als programes d’edició d’aquests gràfics perquè es puguin visualitzar. Aquestes imatges es poden escalar infinitament sense perdre la resolució ni la qualitat.

source: El formato `SVG <https://es.wikipedia.org/wiki/Gr%C3%A1ficos_vectoriales_escalables>`__ (Scalable Vector Graphics) es un estándar abierto publicado por el consorcio W3C en 1999 para distribuir imágenes en la web. Este formato permite definir imágenes vectoriales en dos dimensiones.
ca: El `svg <https://es.wikipedia.org/wiki/gr%C3%A1Ficos_vectorials_escalable>` __ (gràfics vectorials escalables) és un estàndard obert publicat pel consorci W3C el 1999 per distribuir imatges al web. Aquest format permet definir imatges vectorials en dues dimensions.

source: Las imágenes SVG pueden manipularse con JavaScript, que es un lenguaje de programación, para crear animaciones interactivas en los navegadores web.
ca: Les imatges SVG es poden manipular amb JavaScript, que és un llenguatge de programació, per crear animacions interactives als navegadors web.

source: El estándar `PDF <https://es.wikipedia.org/wiki/PDF>`__ (Portable Document Format) es un formato de almacenamiento de documentos digitales diseñado por Adobe para que se pueda visualizar e imprimir fácilmente en cualquier dispositivo.
ca: El estàndard `pdf <https://es.wikipedia.org/wiki/pdf>`__ (format de document portàtil) és un format d’emmagatzematge de documents digitals dissenyat per Adobe de manera que es pugui visualitzar i imprimir fàcilment en qualsevol dispositiu.

source: PDF es un formato estandarizado y abierto a que cualquiera lo utilice libremente.
ca: PDF és un format normalitzat i obert perquè qualsevol ho faci servir lliurement.

source: Los documentos guardados en formato PDF pueden contener texto, hipervínculos, gráficas, dibujos, fotografías y hasta vídeo.
ca: Els documents desats en format PDF poden contenir text, hiperenllaços, gràfics, dibuixos, fotografies i fins i tot vídeo.

source: Este formato tiene la gran ventaja de mantener inalterada la composición de página (márgenes, tamaños de letra, posición de las imágenes, etc.) y de ser un formato ampliamente compatible y estándar para almacenar documentos a largo plazo.
ca: Aquest format té el gran avantatge de mantenir la composició de la pàgina sense canvis (marges, mides de lletres, imatges de les imatges, etc.) i ser un format àmpliament compatible i estàndard per emmagatzemar documents a llarg termini.

source: Como desventaja, el formato PDF se puede editar con dificultad, por lo que es mejor almacenar también el archivo fuente original (.docx).
ca: Com a desavantatge, el format PDF es pot editar amb dificultat, per la qual cosa és millor emmagatzemar el fitxer font original (.docx).

source: Fuentes tipográficas
ca: Fonts tipogràfiques

source: Las fuentes tipográficas vectoriales son conjuntos de símbolos y letras diseñados para su uso en computadoras, tanto para visualizar texto en una pantalla como para imprimir en papel.
ca: Les fonts tipogràfiques vectorials són conjunts de símbols i lletres dissenyades per a ús de l’ordinador, tant per mostrar text en una pantalla com per imprimir en paper.

source: Al ser vectoriales son fácilmente escalables, es decir que las letras y símbolos se pueden representar en cualquier tamaño sin perder calidad.
ca: El fet de ser vectorial és fàcilment escalable, és a dir, les lletres i els símbols es poden representar de qualsevol mida sense perdre la qualitat.

source: Los formatos más utilizados para definir fuentes son los siguientes.
ca: Els formats més utilitzats per definir fonts són els següents.

source: `TrueType (TTF) <https://es.wikipedia.org/wiki/TrueType>`__: Formato desarrollado por Apple y Microsoft a finales de la década de 1980. Es ampliamente compatible y muy utilizado en Windows y macOS.
ca: `Truetype (TTF) <https://es.wikipedia.org/wiki/truetype>`__: format desenvolupat per Apple i Microsoft a finals dels anys 1980. És àmpliament compatible i s’utilitza àmpliament en Windows i MacOS.

source: `PostScript (PS) <https://es.wikipedia.org/wiki/PostScript>`__: Lenguaje desarrollado por Adobe para la impresión con impresoras de alta calidad. Permite definir tipos de letra, aunque tiene muchas más aplicaciones.
ca: `PostScript (PS) <https://es.wikipedia.org/wiki/postScript>`__: llenguatge desenvolupat per Adobe per imprimir amb impressores d'alta qualitat. Permet definir tipus de lletra, tot i que té moltes més aplicacions.

source: `OpenType (OTF) <https://es.wikipedia.org/wiki/OpenType>`__: Formato desarrollado por Microsoft y Adobe en 1996 para mejorar y suceder a los dos formatos anteriores.
ca: `OpenType (OTF) <https://es.wikipedia.org/wiki/opentype>`__: format desenvolupat per Microsoft i Adobe el 1996 per millorar i succeir els dos formats anteriors.

source: Actualmente es un estándar abierto (Open Font Format), disponible de manera pública y gratuita.
ca: Actualment és un estàndard obert (format de lletra obert), disponible públicament i gratuït.

source: `TeX <https://es.wikipedia.org/wiki/TeX>`__: Es un sistema de tipografía escrito por Donald E. Knuth, muy popular en el entorno académico universitario. El sistema **LaTeX** asociado, amplía las capacidades de TeX para composición de textos profesional.
ca: `Tex <https://es.wikipedia.org/wiki/tex>`__: És un sistema de tipografia escrit per Donald E. Knuth, molt popular a l'entorn acadèmic de la universitat. El sistema ** Latex ** Associated, amplia les capacitats TEX per a la composició de text professional.

source: Este sistema es **software libre**, por lo que cualquiera puede utilizarlo sin pagar licencia.
ca: Aquest sistema és ** programari gratuït **, de manera que qualsevol pot utilitzar -lo sense pagar una llicència.

source: Test de la unidad
ca: Test de prova

source: `Test de Formatos de imagen I. <../test/es-software-formatos-imagen-1.html>`__
ca: `Formats d'imatge I. <../test/es-Software-Formats-Image-1.html>`__

source: `Test de Formatos de imagen II. <../test/es-software-formatos-imagen-2.html>`__
ca: `Formats d'imatges II. <../test/es-software-formatos-imagen-2.html>`__

source: `Test de Formatos de imagen III. <../test/es-software-formatos-imagen-3.html>`__
ca: `Formats d'imatges III. <../test/es-software-formatos-imagen-3.html>`__

source: `Test de Formatos de imagen IV. <../test/es-software-formatos-imagen-4.html>`__
ca: `IM FORMATS IMATGE IV. <../test/es-software-formatos-imagen-4.html>`__

source: `Test de Formatos de imagen V. <../test/es-software-formatos-imagen-5.html>`__
ca: `Prova del format d'imatge.

source: `Test de Formatos de imagen VI. <../test/es-software-formatos-imagen-6.html>`__
ca: `Formats d'imatge vi. <../test/es-software-formatos-imagen-6.html>`__
