Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/informatica-hardware-comunicaciones.po
Languages: ca

source: Comunicaciones
ca: Comunicacions

source: Las comunicaciones de los ordenadores permiten el movimiento de los datos entre diferentes dispositivos y componentes del ordenador. Son elementos fundamentales que se encuentran en todos los niveles de la informática, desde las líneas de comunicación interna de un microprocesador hasta las líneas de comunicación de Internet a nivel mundial.
ca: Les comunicacions informàtiques permeten el moviment de dades entre diferents dispositius i components informàtics. Són elements fonamentals que es troben a tots els nivells de la informàtica, des de les línies de comunicació internes d’un microprocessador fins a les línies de comunicació mundials.

source: Índice de contenidos:
ca: Índex de contingut:

source: Clasificación
ca: Classificació

source: Conexiones internas
ca: Connexions internes

source: Buses de placa base
ca: Autobusos de placa base

source: Zócalo para memoria RAM
ca: Zocalo per a la memòria RAM

source: Zócalo para CPU
ca: Zocalo per a la CPU

source: Conexiones externas
ca: Connexions externes

source: Conectores de audio analógico
ca: Connectors d'àudio analògics

source: eSATA
ca: Estata

source: Conexiones de vídeo
ca: Connexions de vídeo

source: Conexiones de red local
ca: Connexions de xarxa local

source: Conexiones inalámbricas
ca: Connexions sense fils

source: Conectores macho y hembra
ca: Connectors masculins i femenins

source: Los conectores sirven para poder unir eléctricamente los cables a los ordenadores y al resto de periféricos.
ca: Els connectors serveixen per unir els cables elèctricament a ordinadors i altres perifèrics.

source: Normalmente los **cables** suelen tener los pines de conexión salientes (conectores de tipo **macho**) y los ordenadores y el resto de equipos electrónicos tienen los agujeros (conectores de tipo **hembra**) donde se conectan los pines de conexión macho.
ca: Normalment els cables ** ** solen tenir els pins de connexió sortint (tipus ** connectors masculins **) i els ordinadors i la resta d’equips electrònics tenen els forats (femella ** Tipus ** Tipus connectors **) on es connecten els pins de connexió masculina.

source: La razón para esta elección es que los pines macho de los cables se pueden romper o doblar con mayor facilidad que los agujeros hembra de los equipos. Si se estropean los pines de un cable, este se puede reemplazar por un costo reducido, mientras que si se estropea el conector de un ordenador o de un periférico sería mucho más costoso de reemplazar.
ca: El motiu d’aquesta elecció és que els pins masculins dels cables es poden trencar o plegar amb més facilitat que els forats femenins de l’equip. Si es trenquen els pins d’un cable, es pot substituir per un cost reduït, mentre que l’ordinador d’un ordinador o d’un perifèric es trenca, seria molt més car substituir -lo.

source: Otros conectores macho y hembra, como los conectores USB, no tienen pines de conexión, sino superficies de contacto y son mucho más robustos que los conectores con pines. Pero la elección de clavija macho para el cable y hembra para el equipo se suele mantener.
ca: Altres connectors masculins i femenins, com els connectors USB, no tenen pins de connexió, sinó que contacten superfícies i són molt més robustes que els connectors de pins. Però normalment es manté l’elecció del tap masculí per al cable i la femella per a l’equip.

source: `Genero de los conectores <https://en.wikipedia.org/wiki/Gender_of_connectors_and_fasteners>`__ en Wikipedia en inglés.
ca: `Gènere dels connectors <https://en.wikipedia.org/wiki/gender_of_connectors_and_fasteners>`__ a Wikipedia en anglès.

source: Son las pistas del circuito impreso que llevan los datos entre la CPU y el resto de los dispositivos conectados a la placa base.
ca: Són les pistes del circuit imprès que transporten les dades entre la CPU i la resta de dispositius connectats a la placa base.

source: Tiene muchas más líneas de datos que cualquier otro cable de comunicación y es el medio de transmisión más rápido con diferencia. Las distancias que recorren las líneas de datos son muy cortas, de pocos centímetros.
ca: Té moltes més línies de dades que qualsevol altre cable de comunicació i és el mitjà de transmissió més ràpid. Les distàncies que recorren les línies de dades són molt curtes, d’uns pocs centímetres.

source: `Chrihern <https://commons.wikimedia.org/wiki/File:Motherboard_bus.jpg>`__, via Wikimedia Commons.
ca: `Chrihern <https://commons.wikimedia.org/wiki/file:motherboard_bus.jpg>`__, a través de Wikimedia Commons.

source: El bus `serial ATA <https://es.wikipedia.org/wiki/Serial_ATA>`__ conecta las unidades de almacenamiento del ordenador (HDD, SSD, discos ópticos) con el procesador. El bus SATA lleva en el mercado desde 2003 y actualmente se encuentra en funcionamiento la versión 3.0.
ca: El `Serial Ata <https://es.wikipedia.org/wiki/serial_ata>`__ Connecta unitats d'emmagatzematge de l'ordinador (HDD, SSD, discos òptics) amb el processador. L’autobús SATA ha estat al mercat des del 2003 i actualment es troba en la versió 3.0 de l’operació.

source: El cable de conexión desde la placa base hasta la unidad de almacenamiento puede llegar a tener hasta 1 metro de longitud, aunque la mayoría de los cables fabricados tienen una longitud menor. Esto es así porque SATA es un estándar pensado para conectar dispositivos dentro de la caja o carcasa del ordenador.
ca: El cable de connexió de la placa base a la unitat d’emmagatzematge pot tenir una longitud de fins a 1 metre, tot i que la majoria dels cables fabricats tenen una longitud inferior. Això es deu al fet que SATA és un estàndard dissenyat per connectar dispositius dins de la caixa de l’ordinador o la carcassa.

source: Versión
ca: Versió

source: Año
ca: Any

source: Velocidad
ca: Velocitat

source: Conectores SATA de datos y de alimentación de dos discos duros.
ca: Dades SATA i connectors d’aliments de dos discs durs.

source: `Dsimic <https://commons.wikimedia.org/wiki/File:2.5-inch_SATA_drive_on_top_of_a_3.5-inch_SATA_drive,_close-up_of_data_and_power_connectors.jpg>`__, `CC BY-SA 3.0 <https://creativecommons.org/licenses/by-sa/3.0/>`__, via Wikimedia Commons.
ca: `Dsimic <https://commons.wikimedia.org/wiki/file:2.5-nch_sata_drive_on_top_of_a_3.5-nch_sata_drive._close-up_of_data_and_power_connectors.jpg>` `` `` `` `` `` `` `` `` `` `` `` `` `` `` ` `` `` `` `` `` `` `` `` `` `` `` <https://creativecommons.org/licenses/by-sa/3.0/>`__, a través de commons de Wikimedia.

source: Cable de SATA de datos.
ca: Dades SATA Cable.

source: `PCI Express <https://es.wikipedia.org/wiki/PCI_Express>`__ abrevidado PCIe o PCI-e es un conjunto de conectores internos de la placa base, que sirve para conectar tarjetas de expansión al ordenador. Estas tarjetas de expansión pueden ser **tarjetas gráficas**, controladoras RAID, tarjetas de red Ethernet, tarjetas de sonido, etc.
ca: `PCI Express <https://es.wikipedia.org/wiki/pci_express>`__ PCIe o PCI-E és un conjunt de connectors interns de la placa base, que serveix per connectar les targetes d'expansió a l'ordinador. Aquestes targetes d’expansió poden ser ** targetes gràfiques **, controladors RAID, targetes de xarxa Ethernet, targetes de so, etc.

source: Existen 4 tamaños de conector dependiendo del número de canales de comunicación que contengan.
ca: Hi ha 4 mides del connector segons el nombre de canals de comunicació que continguin.

source: Pines
ca: Pins

source: Tamaño
ca: Tamany

source: Conectores PCI Express x4, x16, x1, x16.
ca: PCI Express X4, X16, X1, X16.

source: El conector inferior es PCI x32 (no Express, ya obsoleto).
ca: El connector inferior és PCI X32 (sense express, ja obsolet).

source: `Jona <https://commons.wikimedia.org/wiki/File:PCI-E_%26_PCI_slots_on_DFI_LanParty_nF4_SLI-DR_20050531.jpg>`__, `CC BY-SA 3.0 <https://creativecommons.org/licenses/by-sa/3.0/>`__, via Wikimedia Commons.
ca: `Jona <https://commons.wikimedia.org/wiki/file:pci-e_%26_pci_slots_on_dfi_lanparty_nf4_slii-dr_20050531.jpg>`__, `cc per-sa 3.0 <https://creativecommons.org/licenses/by-sa/3.0/>`__, a través de Wikimedia Commons.

source: La velocidad de transferencia depende de la versión de PCI Express (aumenta cada pocos años) y del número de canales de comunicación del conector.
ca: La velocitat de transferència depèn de la versió PCI Express (augmenta cada pocs anys) i del nombre de canals de comunicació del connector.

source: Velocidad x1
ca: Velocitat x1

source: Velocidad x16
ca: Velocitat x16

source: La aplicación más conocida de los conectores PCI-E x16 es la conexión de tarjetas gráficas a la placa base.
ca: L’aplicació més coneguda dels connectors PCI-E X16 és la connexió de les targetes gràfiques a la placa base.

source: Existe un `conector llamado M.2 <https://es.wikipedia.org/wiki/M.2>`__ que está basado en el conector PCI Express 3.0 x4. Se utiliza para conectar unidades SSD muy rápidas y compactas a velocidades muy superiores a las que permite el conector tradicional SATA III.
ca: Hi ha un "connector anomenat m.2 <https://es.wikipedia.org/wiki/m.2>`__ que es basa en el connector PCI Express 3.0 X4. S'utilitza per connectar unitats SSD molt ràpides i compactes a velocitats molt superiors a les permeses pel tradicional connector SATA III.

source: Los ordenadores personales más antiguos no incorporaban en la placa base muchas de las funciones actuales (entrada y salida de sonido, comunicaciones por Ethernet, buses USB, etc) y estas funciones tenían que ser suministradas por tarjetas de expansión especializadas, conectadas a conectores de expansión semejantes al actual PCI.
ca: Els ordinadors personals més antics no van incorporar moltes de les funcions actuals a la placa base (entrada i sortida, comunicacions per Ethernet, autobusos USB, etc.) i aquestes funcions havien de ser subministrades per targetes d’expansió especialitzades, connectades a connectors d’expansió similars a la PCI actual.

source: Zócalo para memoria RAM de tipo DIMM
ca: Tipus DIMM RAM ZÓCALO

source: `DIMM <https://es.wikipedia.org/wiki/DIMM>`__ son las siglas de Dual In-line Memory Module (módulo de memoria de dos líneas) llamado así porque los conectores del módulo tienen dos caras de pines de conexión.
ca: `DIMM <https://es.wikipedia.org/wiki/dimm>`__ són les acrònims del mòdul de memòria en línia doble (mòdul de memòria de dues línies) anomenada perquè els connectors del mòdul tenen dues cares de pins de connexió.

source: Estos zócalos sirven para conectar a la placa base módulos de memoria RAM.
ca: Aquests endolls serveixen per connectar els mòduls de memòria RAM a la placa base.

source: Dependiendo del tipo de ordenador (de tipo caja o portátil) y dependiendo de la versión de la RAM, estos módulos pueden tener diferente número de contactos, diferente tamaño y diferente posición de la ranura central para evitar la conexión por error de módulos no compatibles.
ca: Segons el tipus d’ordinador (caixa o tipus portàtil) i, depenent de la versió RAM, aquests mòduls poden tenir un nombre diferent de contactes, mida diferent i posició diferent de la ranura central per evitar la connexió per error de mòduls no compatibles.

source: Módulo de memoria SO-DIMM DDR3 para portátil.
ca: So-Dimm DDR3 Mòdul de memòria per a ordinadors portàtils.

source: `Tobias B. Köhler <https://commons.wikimedia.org/wiki/File:4GB_DDR3_SO-DIMM.jpg>`__, `CC BY-SA 3.0 <https://creativecommons.org/licenses/by-sa/3.0/>`__, via Wikimedia Commons.
ca: `Tobias B. Köhler <https://commons.wikimedia.org/wiki/file:4gb_ddr3_so-dimm.jpg>`__, `cc by-sa 3.0 <https://creativecommons.org/licenses/by-sa/3.0/>` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` ` `` `` `` `` `` `` `` `

source: Módulo de memoria DIMM DDR y módulo DDR2 con diferente número de pines y distintas ranuras de seguridad.
ca: Mòdul de memòria DDR DDR i mòdul DDR2 amb un nombre diferent de pins i diferents ranures de seguretat.

source: `Wagner51 <https://commons.wikimedia.org/wiki/File:Notch_position_between_DDR_and_DDR2.jpg>`__, `CC BY-SA 3.0 <https://creativecommons.org/licenses/by-sa/3.0/>`__, via Wikimedia Commons.
ca: `Wagner51 <https://commons.wikimedia.org/wiki/file:notch_posion_between_ddr_and_ddr2.jpg>` __, `cc by-sa 3.0 <https://creatcommons.org/licenses/by-sa/3.0/>` `` `` `` `` `` `` `` `` `` `` `` `` `` `` Wikimedia Commons.

source: El `zócalo de CPU <https://es.wikipedia.org/wiki/Z%C3%B3calo_de_CPU>`__ permite conectar el microprocesador o CPU a la placa base. En placas base de alto rendimiento puede haber más de un zócalo para poder conectar varios microprocesadores en una misma placa base.
ca: El `cpu zócalo <https://es.wikipedia.org/wiki/z%C3%B3calo_de_cpu>`__ permet connectar el microprocessador o la CPU a la placa base. En les plaques base de gran rendiment, pot haver -hi més d’un plint per connectar diversos microprocessadors a la mateixa placa base.

source: Cada zócalo de CPU sirve para conectar microprocesadores de una misma familia. Los zócalos cambian de forma y número de conexiones entre familias de microprocesadores y entre fabricantes de CPU (Intel o AMD).
ca: Cada presa de CPU serveix per connectar microprocessadors de la mateixa família. Els socs canvien de forma i nombre de connexions entre famílies de microprocessadors i entre fabricants de CPU (Intel o AMD).

source: El zócalo de CPU permite aumentar la potencia del ordenador cambiando el microprocesador antiguo por otro más potente de una familia compatible con la del microprocesador anterior. Esta operación suele ser sencilla de realizar y cuesta solo una pequeña fracción de lo que costaría comprar un ordenador nuevo.
ca: La presa de CPU permet augmentar la potència de l’ordinador canviant l’antic microprocessador per a un altre més potent d’una família compatible amb la del microprocessador anterior. Aquesta operació sol ser senzilla de realitzar i només costa una petita fracció del que costaria comprar un ordinador nou.

source: Estos son algunos zócalos para ordenadores de escritorio:
ca: Aquests són alguns endolls per a ordinadors d'escriptori:

source: Nombre
ca: Nom

source: Familia
ca: Família

source: Intel Sandy Bridge y Ivy Bridge
ca: Intel Sandy Bridge i Ivy Bridge

source: Intel Haswell y Broadwell
ca: Intel Haswell i Broadwell

source: Intel Skylake y KabyLake
ca: Intel Skylake i Kabylake

source: Intel Comet Lake
ca: Llac Intel Comet

source: `Socket AM4 <https://es.wikipedia.org/wiki/Socket_AM4>`__
ca: `Socket am4 <https://es.wikipedia.org/wiki/sockt_am4>`__

source: AMD Zen+, Zen 2 y Zen 3
ca: Amd Zen+, Zen 2 i Zen 3

source: `Socket AM5 <https://en.wikipedia.org/wiki/Socket_AM5>`__
ca: `Socket am5 <https://en.wikipedia.org/wiki/sockt_am5>`__

source: Zócalo para CPU de tipo LGA 1151, también conocido como `Socket H4 <https://es.wikipedia.org/wiki/LGA_1151>`__.
ca: LGA 1151 Tipus CPU Zócalo, també conegut com a "Socket H4 <https://es.wikipedia.org/wiki/lga_1151>`__.

source: El `USB <https://es.wikipedia.org/wiki/Universal_Serial_Bus>`__ (Universal Serial Bus) es un estándar para dar conexión de datos y alimentación a computadoras, periféricos y dispositivos electrónicos. Comenzó a usarse de forma masiva a partir de 1998.
ca: El `USB <https://es.wikipedia.org/wiki/Universal_Serial_Bus>`__ (bus en sèrie universal) és un estàndard per donar connexió de dades i aliments a ordinadors, perifèrics i dispositius electrònics. Va començar a utilitzar -se massivament des del 1998.

source: Actualmente existen 4 grandes estándares USB con las características que aparecen en la siguiente tabla.
ca: Actualment, hi ha 4 grans estàndards USB amb les característiques que apareixen a la taula següent.

source: Estándar
ca: Estàndard

source: Corriente
ca: Corrent

source: Otros
ca: Altres

source: Solo conectores A y B.
ca: Només els connectors A i B.

source: También conectores
ca: També connectors

source: mini y micro.
ca: Mini i micro.

source: Color azul
ca: Color blau

source: Solo conector C
ca: Només el connector C

source: `Conectores USB <https://en.wikipedia.org/wiki/USB_hardware#Connectors>`__
ca: `Connectors USB <https://en.wikipedia.org/wiki/usb_hardware#connectors>`__ __

source: Conectores USB. Micro tipo B, UC-E6, mini tipo B, hembra tipo A, macho tipo A, macho tipo B.
ca: Connectors USB. Micro tipus B, UC-E6, Mini tipus B, tipus A femení, tipus A masculí, tipus B.

source: `Viljo Viitanen <https://commons.wikimedia.org/wiki/File:Usb_connectors.JPG>`__, via Wikimedia Commons.
ca: `Viljo Viitanen <https://commons.wikimedia.org/wiki/file:usb_connectors.jpg>`__, a través de Wikimedia Commons.

source: `Conector USB C <https://es.wikipedia.org/wiki/USB-C>`__ reversible.
ca: `USB Connector C <https://es.wikipedia.org/wiki/usb-c>`__ reversible.

source: `Author <https://commons.wikimedia.org/wiki/File:USB-C_plug,_focus_stacked.jpg>`__, `CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0/>`__, via Wikimedia Commons.
ca: `Autor <https://commons.wikimedia.org/wiki/file:usb-c_plug,focus_stacked.jpg>`__, `cc by-sa 4.0 <https://creativecommons.org/licenses/by-sa/4.0/>` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` ` `` `` `` `` `` `'

source: El `conector USB C <https://es.wikipedia.org/wiki/USB-C>`__ es el más moderno y el único compatible con la especificación de USB 4. Además de permitir comunicaciones de alta velocidad, con la tecnología Power Delivery puede alimentar dispositivos con una potencia de hasta 100 vatios, mucho mayor que la potencia permitida por los conectores anteriores.
ca: El `connector USB C <https://es.wikipedia.org/wiki/usb-c>`__ és el més modern i l'únic compatible amb la USB 4. Especificació a més de permetre les comunicacions d'alta velocitat, amb la tecnologia de lliurament de potència pot alimentar dispositius amb una potència de fins a 100 watts, molt més gran que la potència permesa pels anteriors connectors.

source: Los `conectores de audio analógicos <https://es.wikipedia.org/wiki/Conector_de_audio_anal%C3%B3gico>`__ se utilizan para conectar micrófonos, auriculares y otros sistemas de audio analógico a dispositivos electrónicos.
ca: Els `connectors d'àudio analògics <https://es.wikipedia.org/wiki/conector_de_audio_anal%C3%B3Gico>`__ s'utilitzen per connectar micròfons, auriculars i altres sistemes d'àudio analògics a dispositius electrònics.

source: Hay conectores de distintas medidas, pero el más popular es el conector de 3,5 mm usado en la mayoría de los ordenadores y teléfonos inteligentes.
ca: Hi ha connectors de diferents mesures, però el més popular és el connector de 3,5 mm que s’utilitza en la majoria d’ordinadors i telèfons intel·ligents.

source: Códigos de colores para conectores de audio de 3,5 mm en ordenadores personales.
ca: Codis de colors per a connectors d’àudio de 3,5 mm en ordinadors personals.

source: Función
ca: Funcionar

source: Verde
ca: Verd

source: Salida de audio. Canales frontales.
ca: Sortida d'àudio. Canals frontals.

source: Azul
ca: Blava

source: Entrada de audio. Nivel de línea.
ca: Entrada d'àudio. Nivell de línia.

source: Rosa/Rojo
ca: Rosa/vermell

source: Entrada de audio. Nivel de micrófono.
ca: Entrada d'àudio. Nivell de micròfon.

source: Negro
ca: Negre

source: Salida de audio. Canales traseros.
ca: Sortida d'àudio. Canals posteriors.

source: Gris
ca: Grisa

source: Salida de audio. Canales laterales.
ca: Sortida d'àudio. Canals laterals.

source: Naranja
ca: Ataronjat

source: Salida de audio. Canal central y Subwoofer.
ca: Sortida d'àudio. Canal central i subwoofer.

source: Conectores de audio analógico de 3.5 mm de un ordenador personal.
ca: Connectors d'àudio analògics de 3,5 mm d'un ordinador personal.

source: `Jud McCranie <https://commons.wikimedia.org/wiki/File:Computer_mike,_audio_out,_and_audio_in_jacks.jpg>`__, `CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0/>`__, via Wikimedia Commons.
ca: `Jud McCranie <https://commons.wikimedia.org/wiki/file:computer nom Wikimedia Commons.

source: El conector `PS/2 <https://es.wikipedia.org/wiki/PS/2>`__ toma su nombre de las computadoras IBM Personal System/2, creada por IBM en 1987. Este conector se emplea para conectar teclados y ratones.
ca: El `ps/2 <https://es.wikipedia.org/wiki/ps/2> __ pren el seu nom de IBM Computers System/2, creat per IBM el 1987. Aquest connector s'utilitza per connectar teclats i ratolins.

source: Actualmente estos conectores están **obsoletos**, pero todavía se siguen incorporando en algunas placas base por motivos de compatibilidad con los teclados y ratones más antiguos. Algunas placas base modernas tienen un solo conector, mitad morado y mitad verde, que sirve para conectar tanto teclados como ratones antiguos.
ca: Actualment, aquests connectors són ** obsolets **, però encara s’incorporen a algunes plaques base per motius de compatibilitat amb els teclats i els ratolins més antics. Algunes plaques base modernes tenen només un connector, morat i mig verd, que serveix per connectar tant els teclats com els ratolins antics.

source: Puertos PS/2 para teclado (morado) y para ratón (verde).
ca: Ports PS/2 per al teclat (morat) i per al ratolí (verd).

source: `Norman Rogers <https://commons.wikimedia.org/wiki/File:Ps-2-ports.jpg>`__, via Wikimedia Commons.
ca: `Norman Rogers <https://commons.wikimedia.org/wiki/file:ps-2-ports.jpg>`__, a través de Wikimedia Commons.

source: El estándar de comunicaciones `RS-232 <https://es.wikipedia.org/wiki/RS-232>`__ es una interfaz para intercambio de datos vía serie de baja velocidad.
ca: El `RS-232 <https://es.wikipedia.org/wiki/rs-232>`__ és una interfície per a l'intercanvi de dades mitjançant sèries de baixa velocitat.

source: Este estándar fue ampliamente utilizado hace años, hasta que se fue reemplazando por el USB a partir de 1998. Actualmente se encuentra obsoleto y no se suele incorporar en las placas base, pero se puede añadir mediante una tarjeta de expansión PCI o mediante un cable conversor de USB a RS-232.
ca: Aquesta norma es va utilitzar àmpliament fa anys, fins que va ser substituïda per la USB a partir del 1998. Actualment està obsoleta i no sol incorporar-se a les plaques base, però es pot afegir amb una targeta d’expansió PCI o mitjançant un convertidor USB a RS-232.

source: Todavía hay equipos antiguos en fábricas, laboratorios y empresas que utilizan el estándar RS-232 y es necesario poder comunicarse con ellos.
ca: Encara hi ha equips antics de fàbriques, laboratoris i empreses que utilitzen la norma RS-232 i és necessari comunicar-se amb elles.

source: No se debe confundir este conector con el conector VGA de vídeo, muy parecido, pero con tres filas de pines de conexión.
ca: Aquest connector no s’ha de confondre amb el connector de vídeo VGA, molt similar, però amb tres files de pins de connexió.

source: Conector RS-232 (DB-9 hembra).
ca: Connector RS-232 (DB-9 femella).

source: Conectores de vídeo
ca: Connectors de vídeo

source: El conector `VGA <https://es.wikipedia.org/wiki/Video_Graphics_Array#Conector_VGA>`__ (Video Graphics Array) es un estándar para comunicar la tarjeta gráfica del ordenador con el monitor de vídeo o con el proyector. Esta conexión utiliza señales analógicas, con peor calidad y menos capacidad de resolución que los conectores digitales actuales (DVI y HDMI).
ca: El `` VGA Connector <https://es.wikipedia.org/wiki/video_graphics_array#conetor_vga>`__ (Video Graphics Array) és un estàndard per comunicar la targeta gràfica de l'ordinador amb el monitor de vídeo o amb el projector. Aquesta connexió utilitza senyals analògics, amb una capacitat de màxima qualitat i menys capacitat de resolució que els connectors digitals actuals (DVI i HDMI).
