Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/informatica-software-licencias.po
Languages: ca

source: Licencias de software
ca: Llicències de programari

source: Las **licencias de software** son acuerdos legales que establecen cómo podemos usar, distribuir y modificar los programas y los contenidos de software.
ca: Les llicències de programari ** ** són acords legals que estableixen com podem utilitzar, distribuir i modificar programes i continguts de programari.

source: Es importante comprender la importancia de respetar las licencias de software y de contenidos para evitar infringir la ley y para poder comportarnos de manera ética.
ca: És important comprendre la importància de respectar les llicències de programari i contingut per evitar violar la llei i comportar -se èticament.

source: Términos de las licencias
ca: Llicencia Termes

source: Los principales derechos que controlan las licencias de software son los siguientes:
ca: Els principals drets que controlen les llicències de programari són els següents:

source: Derecho de uso
ca: Dret d’ús

source: Este es el derecho a usar el programa como desees.
ca: Aquest és el dret a utilitzar el programa com vulgueu.

source: Ejemplos: algunos programas permiten que los instales en varios dispositivos, pero solo puedes utilizar una de las copias instaladas no todas al mismo tiempo por varias personas. Algunos programas privativos pueden establecer que se pague una tarifa por el uso del programa. Las obras y programas libres no tienen ninguna limitación de este derecho y pueden ser usadas como el usuario quiera.
ca: Exemples: Alguns programes permeten instal·lar en diversos dispositius, però només podeu utilitzar una de les còpies instal·lades no totes alhora per diverses persones. Alguns programes privats poden establir que es paga una tarifa per l’ús del programa. Les obres i programes gratuïts no tenen cap limitació d’aquest dret i es poden utilitzar com vol l’usuari.

source: Derecho de distribución
ca: Dret de distribució

source: Trata del derecho a poder realizar copias a otras personas o a poner la obra o el programa a disposición de cualquiera en Internet.
ca: Tracta amb el dret de poder fer còpies a altres persones o posar la feina o programa a disposició de qualsevol persona a Internet.

source: Ejemplos: muchos programas freeware y todos los programas y obras libres permiten que los distribuyas entre tus familiares y amigos o a cualquier persona. Los programas privativos y las obras con copyright no se pueden difundir ni copiar a nadie.
ca: Exemples: Molts programes de Freeware i tots els programes i treballs gratuïts us permeten distribuir -los entre la vostra família i amics o qualsevol persona. Els programes privats i les obres amb drets d'autor no poden difondre ni copiar ningú.

source: Derecho de transformación
ca: Dret de transformació

source: Este derecho controla la posibilidad de realizar cambios en la obra o en el programa y distribuir el resultado a otras personas.
ca: Aquest dret controla la possibilitat de fer canvis en l'obra o en el programa i distribuir el resultat a altres persones.

source: Ejemplos: la mayoría de los libros o programas de pago no permiten realizar modificaciones. Los programas y los contenidos libres permiten realizar modificaciones y distribuirlas. Puedo usar una fotografía que tenga licencia libre para crear un `meme <https://es.wikipedia.org/wiki/Meme_(Internet)>`__ y distribuirlo.
ca: Exemples: la majoria de llibres o programes de pagament no permeten modificacions. Els programes i continguts gratuïts permeten modificacions i distribuir -los. Puc utilitzar una fotografia que tingui una llicència gratuïta per crear un `meme <https://es.wikipedia.org/wiki/meme_ (Internet)>`__ i distribuir -lo.

source: Derechos comerciales
ca: Drets comercials

source: Es el derecho a explotar comercialmente un programa o una obra.
ca: És el dret a explotar comercialment un programa o un treball.

source: Ejemplos: una fotografía libre puedo utilizarla para estampar una camiseta y venderla para ganar dinero. Un sistema operativo libre puedo utilizarlo para vender un equipo informático en el que venga instalado y ganar dinero.
ca: Exemples: una fotografia gratuïta que puc utilitzar per segellar una samarreta i vendre -la per guanyar diners. Un sistema operatiu gratuït pot utilitzar -lo per vendre un equip informàtic en el qual s’instal·la i guanyar diners.

source: Licencias de programas
ca: Programes Llicències

source: Los programas pueden clasificarse en función del dinero que cuestan y en función de las libertades que permiten al usuario.
ca: Els programes es poden classificar segons els diners que costen i segons les llibertats que permetin a l’usuari.

source: Programas propietarios o privativos
ca: Programes de propietat o privats

source: Los programas `propietarios <https://es.wikipedia.org/wiki/Software_propietario>`__ son desarrollados por compañías con ánimo de lucro y se venden al usuario para que pueda utilizarlo con limitaciones. Suelen tener acuerdos legales a medida, creados por la compañía, y limitan todos los derechos de distribución y modificación.
ca: Els `propietaris <https://es.wikipedia.org/wiki/software_propientary>`__ són desenvolupats per empreses de beneficis i l'usuari es ven de manera que el pugui utilitzar amb limitacions. Normalment tenen acords legals a mida, creats per l’empresa i limiten tots els drets de distribució i modificació.

source: Hay varias modalidades de pago. En una de ellas el usuario paga una sola vez por un programa con una versión concreta y no vuelve a pagar ni recibe actualizaciones. Otra modalidad de pago es la suscripción. El usuario paga una cantidad mensual y recibe las actualizaciones del programa mientras paga. Cuando deja de pagar, ya no puede seguir utilizando el programa.
ca: Hi ha diverses modalitats de pagament. En un d’ells l’usuari paga només una vegada per un programa amb una versió específica i no torna a pagar ni rep les actualitzacions. Una altra modalitat de pagament és la subscripció. L’usuari paga una quantitat mensual i rep les actualitzacions del programa mentre paga. Quan deixeu de pagar, ja no podeu utilitzar el programa.

source: Ejemplos de este tipo de programas privativos son la suite ofimática de Microsoft (Word, Excel, Powerpoint), el sistema operativo Windows, el software de diseño AutoCAD o Adobe Photoshop, videojuegos como Minecraft, etc.
ca: Exemples d’aquest tipus de programes privats són la suite d’oficines de Microsoft (Word, Excel, PowerPoint), el sistema operatiu de Windows, AutoCAD o Adobe Photoshop Design, videojocs com Minecraft, etc.

source: Programas freeware
ca: Programes de FreeWare

source: El término `freeware <https://es.wikipedia.org/wiki/Software_gratis>`__ hace referencia a que el programa no tiene costo y se puede descargar y ejecutar sin pagar por él. Este tipo de programas no son libres porque pertenecen a una empresa y puede hacerlos de pago o retirarlos del mercado en cualquier momento.
ca: El terme `Freeware <https://es.wikipedia.org/wiki/software_Gratis>`__ fa referència al programa que el programa no té cap cost i que es pot descarregar i executar sense pagar -lo. Aquest tipus de programes no són gratuïts perquè pertanyen a una empresa i els poden pagar o retirar -los del mercat en qualsevol moment.

source: Ejemplos de programas freeware son el visualizador de PDF Adobe Acrobat Reader, la mayoría de las apps para teléfonos móviles como Whatsapp, videojuegos como Candy Crush o Clash Royale, etc.
ca: Exemples de programes de FreeWare són el PDF Adobe Acrobat Reader Visualizer, la majoria d’aplicacions de telèfons mòbils com WhatsApp, videojocs com Candy Crush o Clash Royale, etc.

source: Programas adware
ca: Programes d’Adware

source: El `adware <https://es.wikipedia.org/wiki/Adware>`__ se refiere a programas que muestran publicidad durante su ejecución. Suelen ser programas gratuitos (freeware) que consiguen dinero para sus desarrolladores a través de la publicidad que muestran al usuario.
ca: El `Adware <https://es.wikipedia.org/wiki/adware>`__ fa referència a programes que mostren publicitat durant la seva execució. Normalment són programes gratuïts (FreeWare) que obtenen diners per als seus desenvolupadors mitjançant la publicitat que mostren l’usuari.

source: No es un tipo de software bien visto y en ocasiones está asociado al malware y a la grabación de la actividad del usuario.
ca: No és un tipus de programari ben vist i de vegades s’associa amb programari maliciós i enregistra l’activitat de l’usuari.

source: Programas de licencia libre
ca: Programes de llicències gratuïtes

source: Los `programas libres <https://es.wikipedia.org/wiki/Software_libre_y_de_c%C3%B3digo_abierto>`__ no solo son gratuitos, sino que su código fuente, las instrucciones del programa, también es libre y cualquiera puede leerlo y modificarlo sin restricciones.
ca: Els `programes gratuïts <https://es.wikipedia.org/wiki/software_libre_y_de_c%C3%B3digo_abiera>`__ no només són gratuïts, sinó que el seu codi font, les instruccions del programa, també són lliures i qualsevol pot llegir -lo i modificar -lo sense restriccions.

source: Este tipo de programas son los que dan mayor libertad y seguridad al usuario:
ca: Aquest tipus de programes són els que donen a l’usuari més llibertat i seguretat:

source: Libertad de **ejecutar** el programa para cualquier propósito.
ca: Freedom of ** Execute ** El programa per a qualsevol propòsit.

source: Libertad para **estudiar** cómo funciona internamente el programa.
ca: Freedom for ** Study ** Com funciona el programa internament.

source: Libertad para **distribuir** el programa.
ca: Freedom for ** distribuir ** el programa.

source: Libertad para **modificar** el programa y distribuir la versión modificada.
ca: Llibertat de ** Modificar ** el programa i distribuir la versió modificada.

source: La desventaja que tienen los programas libres es que en alguna ocasión pueden ser menos capaces que los programas privativos, aunque para un usuario normal no existen muchas diferencias con el software privativo.
ca: L’inconvenient dels programes gratuïts és que en algunes ocasions poden ser menys capaços que els programes privats, tot i que per a un usuari normal no hi ha moltes diferències amb el programari privat.

source: Ejemplos de programas libres son la suite ofimática LibreOffice (Writer, Calc, Impress), el sistema operativo GNU/Linux, el reproductor de vídeo VLC, el navegador Firefox, etc.
ca: Els exemples de programes gratuïts són la Suite Office LibreOffice (escriptor, Calc, Impress), el sistema operatiu GNU/Linux, el reproductor de vídeo VLC, el navegador Firefox, etc.

source: Servicios en la nube
ca: Serveis de núvol

source: Los programas en la nube o `computación en la nube <https://es.wikipedia.org/wiki/Computaci%C3%B3n_en_la_nube>`__ son programas que no ejecuta el usuario en su ordenador, sino que se ejecutan en un servidor web que pertenece a la empresa que ha programado la aplicación. Este tipo de programas pueden ser de pago o gratuitos (freeware).
ca: Programes de núvol o `Cloud Computing <https://es.wikipedia.org/wiki/computaci%C3%B3n_en_la_nube>`__ són programes que l'usuari no s'executa al seu ordinador, però que s'executa en un servidor web que pertany a l'empresa que ha programat l'aplicació. Aquests tipus de programes es poden pagar o gratuïtament (Freeware).

source: Las ventajas que presentan consisten en que el programa estará siempre actualizado a la última versión y que se puede ejecutar sin instalar ningún programa en el ordenador. La desventaja principal consiste en que se pierde el control sobre la aplicación, que puede retirarse en cualquier momento de la red, modificar mucho su comportamiento o cambiar de licencia y pasar a ser de pago, dejándonos sin el servicio esperado.
ca: Els avantatges que presenten són que el programa sempre s’actualitzarà a la versió més recent i que es pot executar sense instal·lar cap programa a l’ordinador. El principal desavantatge és que es perd el control de l’aplicació, que es pot retirar en qualsevol moment de la xarxa, modificar la seva llicència de comportament o canviar i convertir -se en pagament, deixant -nos sense el servei esperat.

source: Muchos programas de Google pertenecen a esta categoría, por ejemplo, el servicio de correo electrónico Gmail, Google Drive, el buscador de Google, la suite ofimática Google Docs, etc.
ca: Molts programes de Google pertanyen a aquesta categoria, per exemple, al servei de correu electrònic de Gmail, a Google Drive, al motor de cerca de Google, a la suite de Google Docs Office, etc.

source: Licencias de contenidos
ca: Llicències de contingut

source: Podemos denominar contenidos a las fotografías, textos, vídeos, audios, presentaciones, dibujos, o cualquier otra creación semejante ya sea artística o técnica.
ca: Podem trucar contingut a fotografies, textos, vídeos, audios, presentacions, dibuixos o qualsevol altra creació, ja siguin artístiques o tècniques.

source: El `copyright <https://es.wikipedia.org/wiki/Copyright>`__ es un término que se refiere al derecho exclusivo que tienen los autores de obras originales para controlar el uso, reproducción, distribución y transformación de sus obras. Es un sistema legal que protege los derechos de propiedad intelectual de los autores y les otorga un control exclusivo sobre la explotación de sus obras, con el fin de incentivar la creación de nuevas obras y fomentar la innovación.
ca: El "Copyright <https://es.wikipedia.org/wiki/copyright>`__ és un terme que fa referència al dret exclusiu que els autors de les obres originals han de controlar l'ús, la reproducció, la distribució i la transformació de les seves obres. És un sistema jurídic que protegeix els drets de propietat intel·lectual dels autors i els proporciona un control exclusiu sobre l'explotació de les seves obres, per tal de fomentar la creació de noves obres i promoure la innovació.

source: Cualquier obra tiene copyright por defecto, a no ser que se especifique lo contrario.
ca: Qualsevol treball té copyright per defecte, tret que s'especifiqui el contrari.

source: Dependiendo del país el copyright tiene una duración distinta, pero las obras suelen estar protegidas hasta 70 años después de la muerte del autor. Después de esa fecha, las obras pasan a ser de dominio público y no tienen ninguna restricción de uso.
ca: Segons el país, els drets d'autor tenen una durada diferent, però les obres se solen protegir fins a 70 anys després de la mort de l'autor. Després d'aquesta data, les obres es converteixen en domini públic i no tenen cap restricció d'ús.

source: Las `Creative Commons <https://es.wikipedia.org/wiki/Creative_Commons>`__ son un conjunto de licencias ofrecidas por una fundación sin ánimo de lucro, que sirven para proteger de otra forma los derechos de autor, fomentando que el conocimiento y la cultura se compartan libremente.
ca: Els `Creative Commons <https://es.wikipedia.org/wiki/creative_commons>`__ són un conjunt de llicències que ofereix una fundació sense ànim de lucre, que serveixen per protegir -se d'una altra manera que els drets d'autor, promovent aquest coneixement i la cultura es compartiran lliurement.

source: De todas ellas, la licencia más conocida y utilizada es la licencia `Creative Commons BY-SA <https://creativecommons.org/licenses/by-sa/3.0/es/>`__ (Creative Commons Atribución-CompartirIgual) que permite que la obra sea utilizada, copiada, distribuida y modificada libremente, siempre y cuando se mantenga la misma licencia en las obras modificadas y se reconozca quién es el autor original.
ca: De tots ells, la llicència més coneguda i coneguda és la `Creative Commons by-Sa i ser reconegut qui és l’autor original.

source: La licencia Creative-Commons BY-SA es la que utiliza la enciclopedia libre y en línea **Wikipedia** para sus artículos y para la mayoría de sus imágenes.
ca: La llicència Creative-Commons By-SA és la que utilitza l’enciclopèdia gratuïta i en línia*Wikipedia ** per als seus articles i per a la majoria de les seves imatges.

source: Estas licencias y otras semejantes se conocen también como licencias `copyleft <https://es.wikipedia.org/wiki/Copyleft>`__. Al contrario que el copyright, que limita todos los derechos, las licencias copyleft permiten casi todos los derechos, pero manteniendo la exigencia de que la obra siga siendo libre.
ca: Aquestes llicències i altres similars també es coneixen com a llicències `COPYLEFT <https://es.wikipedia.org/wiki/copyleft>`__. A diferència dels drets d'autor, que limita tots els drets, les llicències de CopyleFT permeten gairebé tots els drets, però mantenint el requisit que l'obra es mantingui lliure.

source: Dominio público
ca: Domini públic

source: Una licencia de `dominio público <https://es.wikipedia.org/wiki/Dominio_p%C3%BAblico>`__ permite que una obra creativa se pueda usar, copiar, modificar y distribuir sin restricciones por parte de cualquier persona. En otras palabras, el titular de los derechos de autor renuncia a sus derechos y permite que la obra sea utilizada por cualquiera, sin necesidad de obtener permiso o pagar por ella.
ca: Una llicència de domini públic <https://es.wikipedia.org/wiki/domio_p%C3%Bablico>`__ permet utilitzar un treball creatiu, copiar, modificar i distribuir sense restriccions per part de cap persona. És a dir, el cap dels drets de l’autor renuncia als seus drets i permet que l’obra sigui utilitzada per qualsevol, sense necessitat d’obtenir permís ni pagar -lo.

source: Las licencias de dominio público son una herramienta legal que los autores pueden utilizar para permitir que su obra se utilice con fines educativos, de investigación, culturales o de cualquier otro tipo sin restricciones. También pueden ser utilizadas por organizaciones que desean publicar o distribuir obras creativas de manera gratuita y libre.
ca: Les llicències de domini públic són una eina legal que els autors poden utilitzar per permetre que la seva obra s’utilitzi per a tipus educatiu, investigador, cultural o altre sense restriccions. També poden ser utilitzades per organitzacions que desitgin publicar o distribuir obres creatives de forma gratuïta i gratuïta.

source: Las obras con copyright pasan a ser de dominio público unos 70 años (depende del país) después de la muerte del autor.
ca: Les obres de drets d'autor es converteixen en domini públic uns 70 anys (depèn del país) després de la mort de l'autor.

source: En el ámbito de la cultura libre, las licencias de dominio público tienen el inconveniente de que permiten ser usadas para crear otra obra derivada con copyright. Por esa razón, si queremos que una obra siga siendo libre, es preferible utilizar una licencia copyleft como la licencia Creative Commons BY-SA.
ca: En el camp de la cultura lliure, les llicències de domini públic tenen les molèsties que permeten utilitzar -se per crear un altre treball derivat amb drets d’autor. Per això, si volem que una obra es mantingui lliure, és preferible utilitzar una llicència COPYLEFT com a llicència Creative Commons BY-SA.

source: Test de la unidad
ca: Test de prova

source: `Test de licencias de software I. <../test/es-software-licencias-1.html>`__
ca: `Llicències de programari I. <../test/es-Software-Licencia-1.html>`__ __

source: `Test de licencias de software II. <../test/es-software-licencias-2.html>`__
ca: `Llicències de programari II. <../ es-software-licencia-2.html>`__
