Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/ley-intro.po
Languages: ca

source: Legislación estatal
ca: Legislació estatal

source: Ley Orgánica 3/2020, de 29 de diciembre, por la que se modifica la Ley Orgánica 2/2006, de 3 de mayo, de Educación.
ca: Dret orgànic 3/2020, del 29 de desembre, que modifica el dret orgànic 2/2006, del 3 de maig, de l'educació.

source: Ley Orgánica 2/2006, de 3 de mayo, de Educación.
ca: Dret orgànic 2/2006, del 3 de maig, de l’educació.

source: `Real Decreto 217/2022 de enseñanzas mínimas de la ESO <https://www.boe.es/eli/es/rd/2022/03/29/217/con>`__.
ca: `Royal Decret 217/2022 D’ensenyaments mínims d’ESO <https://www.boe.es/eli/es/rd/2022/03/29/217/con>`__.

source: Real Decreto 217/2022, de 29 de marzo, por el que se establece la ordenación y las enseñanzas mínimas de la Educación Secundaria Obligatoria.
ca: Royal Decret 217/2022, del 29 de març, que estableix l’ordenació i els ensenyaments mínims de l’educació secundària obligatòria.

source: `Real Decreto 243/2022 de enseñanzas mínimas de Bachillerato <https://www.boe.es/eli/es/rd/2022/04/05/243/con>`__.
ca: `Royal Decret 243/2022 de les ensenyances mínimes de secundària <https://www.boe.es/eli/es/rd/2022/04/05/243/con>`__.

source: Real Decreto 243/2022, de 5 de abril, por el que se establecen la ordenación y las enseñanzas mínimas del Bachillerato.
ca: Royal Decret 243/2022, del 5 d'abril, que estableix l'ordenació i els ensenyaments mínims del batxillerat.

source: `Orden EDU/3138/2011, Temarios de Secundaria <https://www.boe.es/diario_boe/txt.php?id=BOE-A-2011-18099>`__.
ca: `Orden Edu/3138/2011, agendes de secundària <https://www.boe.es/diario_boe/txt.php?id=boe-A-2011-18099>`__.

source: Orden EDU/3138/2011, de 15 de noviembre, por la que se aprueban los temarios que han de regir en los procedimientos de ingreso, accesos y adquisición de nuevas especialidades de los Cuerpos de Profesores de Enseñanza Secundaria y Profesores Técnicos de Formación Profesional.
ca: Ordre EDU/3138/2011, del 15 de novembre, que aprova els temes que s’han de governar en l’entrada, l’accés i l’adquisició de noves especialitats dels organismes de professors de secundària i professors tècnics de formació professional.

source: Otra legislación estatal
ca: Una altra legislació estatal

source: `Constitución Española <https://www.boe.es/eli/es/c/1978/12/27/(1)/con>`__ Artículo 27.
ca: `Constitució espanyola <https://www.boe.es/eli/es/c/1978/12/27/ (1)/amb>`__ Article 27.

source: `LODE <https://www.boe.es/eli/es/lo/1985/07/03/8/con>`__ Ley Orgánica 8/1985, de 3 de julio, reguladora del Derecho a la Educación.
ca: `Lode <https://www.boe.es/eli/es/lo/1985/07/03/8/con>`__ Dret orgànic 8/1985, del 3 de juliol, regulador del dret a l'educació.

source: `ROC <https://www.boe.es/eli/es/rd/1996/01/26/83/con>`__ Real Decreto 83/1996, de 26 de enero, por el que se aprueba el Reglamento orgánico de los institutos de educación secundaria.
ca: `Roc <https://www.boe.es/eli/es/rd/1996/01/26/83/con>`__ Royal Decret 83/1996, del 26 de gener, que aprova el Reglament Organic dels Instituts d'Educació Secundària.

source: `Real Decreto 562/2017 <https://www.boe.es/eli/es/rd/2017/06/02/562/con>`__, de 2 de junio, por el que se regulan las condiciones para la obtención de los títulos de Graduado en Educación Secundaria Obligatoria y de Bachiller, de acuerdo con lo dispuesto en el Real Decreto-ley 5/2016, de 9 de diciembre, de medidas urgentes para la ampliación del calendario de implantación de la Ley Orgánica 8/2013, de 9 de diciembre, para la mejora de la calidad educativa.
ca: `Royal Decret 562/2017 <https://www.boe.es/eli/es/rd/2017/06/02/562/con>` __, del 2 de juny, que regula les condicions per obtenir els títols de graduats en educació secundària obligatòria i escola secundària, d'acord amb les disposicions de la llei reial 5/2016 de desembre, de urgència urgent, de urgència, de l'expansió de l'expansió de la disputa de la llei reial del 5/2016 Calendari d’implantació del dret orgànic 8/2013, del 9 de desembre, per a la millora de la qualitat educativa.

source: `Real Decreto 270/2022, <https://www.boe.es/eli/es/rd/2022/04/12/270>`__ de 12 de abril, por el que se modifica el Reglamento de ingreso, accesos y adquisición de nuevas especialidades en los cuerpos docentes a que se refiere la Ley Orgánica 2/2006, de 3 de mayo, de Educación, y se regula el régimen transitorio de ingreso a que se refiere la disposición transitoria decimoséptima de la citada ley, aprobado por Real Decreto 276/2007, de 23 de febrero.
ca: `Royal Decret 270/2022, <https://www.boe.es/eli/es/rd/2022/04/1270>`__ de 12 d'abril, que modifica la regulació dels ingressos, l'accés i l'adquisició de noves especialitats en els òrgans docents 276/2007, del 23 de febrer.
