Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/manifiesto.po
Languages: ca

source: Manifiesto
ca: Manifest

source: Una sociedad libre necesita recursos educativos libres.
ca: Una societat lliure necessita recursos educatius lliures.

source: La motivación principal de este sitio web es difundir **recursos educativos libres** a profesores y alumnos de todo el mundo.
ca: La principal motivació d’aquest lloc web és difondre ** recursos educatius gratuïts ** als professors i estudiants de tot el món.

source: Los recursos educativos se deben crear con la idea de conseguir una **buena calidad** en los textos, dibujos, esquemas y resto de contenidos. Los recursos deben estar abiertos a la crítica y a su modificación por parte de la Comunidad Educativa.
ca: Els recursos educatius s’han de crear amb la idea d’obtenir una bona qualitat ** en textos, dibuixos, esquemes i altres continguts. Els recursos han d’estar oberts a les crítiques i a la seva modificació per part de la comunitat educativa.

source: Todos los contenidos generados se distribuirán bajo **licencia libre** `Creative Commons Atribución - Compartir Igual (CC BY-SA) en su versión 4.0 <https://creativecommons.org/licenses/by-sa/4.0/deed.es>`__ o posterior.
ca: Tot el contingut generat es distribuirà sota la llicència gratuïta ** `Creative Commons Attribution-Share Igual (CC by-SA) a la seva versió 4.0 <https://creativecommons.org/licenses/by-sa/4.0/deed.es>`__ o posterior.

source: Esta licencia asegura la compatibilidad con todos los contenidos de Wikipedia y ofrece las máximas garantías para poder difundir el proyecto y para permitir hacer trabajos derivados manteniendo siempre el carácter libre de toda la obra.
ca: Aquesta llicència garanteix la compatibilitat amb tot el contingut de la Viquipèdia i ofereix les màximes garanties per difondre el projecte i permetre que el treball derivat sempre mantingui el caràcter lliure de tota l’obra.

source: Todos los programas de ordenador se distribuirán bajo licencia libre GPL versión 3.0 o posterior.
ca: Tots els programes informàtics es distribuiran sota la versió GPL de llicència gratuïta 3.0 o posterior.

source: Los recursos educativos se crearán en **formatos abiertos**. Los archivos editables se publicarán para que estén a disposición de la Comunidad Educativa.
ca: Els recursos educatius es crearan en formats oberts ** **. Els fitxers editables es publicaran de manera que estiguin disponibles per a la comunitat educativa.

source: Todos los recursos educativos serán editables con herramientas libres, sin necesidad de utilizar software propietario/privativo.
ca: Tots els recursos educatius seran editables amb eines gratuïtes, sense utilitzar programari propietària/privat.

source: La generación del sitio web solo requerirá formatos y herramientas libres y los archivos fuente del sitio web también se publicarán a disposición de la comunidad.
ca: La generació de llocs web només requerirà formats i eines gratuïtes i els fitxers d'origen del lloc web també es publicaran a disposició de la comunitat.

source: No se recopilará información personal ni anónima de las personas que hagan uso del sitio web. Por esa razón **no se usarán cookies** de navegación en el alojamiento principal del sitio web.
ca: La informació personal o anònima de persones que utilitzin el lloc web no es recopilaran. Per aquest motiu ** Sense galetes ** de navegació s’utilitzarà en l’allotjament principal del lloc web.

source: No se añadirán **ni anuncios ni productos patrocinados** a los recursos educativos ni a ninguna otra sección del sitio web.
ca: No afegiu ** ni anuncis ni productes patrocinats ** a recursos educatius ni a cap altra secció del lloc web.

source: Todos los productos y servicios que se anuncien lo harán en base a su utilidad didáctica y no se admitirá ningún tipo de patrocinio.
ca: Tots els productes i serveis que s’anuncien es basaran en la seva utilitat didàctica i no s’admetrà cap patrocini.

source: El sitio web tendrá un **diseño sencillo**, orientado a conseguir la máxima velocidad de navegación y a su posible uso sin conexión a Internet. Por esa razón, y para facilitar el anonimato de los usuarios, se utilizarán **páginas web estáticas**.
ca: El lloc web tindrà un disseny senzill ** **, destinat a obtenir la màxima velocitat de navegació i el seu possible ús inútil a Internet. Per això, i per facilitar l’anonimat de l’usuari, s’utilitzaran llocs web estàtics **.

source: Los contenidos teóricos irán acompañados de **ejercicios prácticos** que permitirán tanto el aprendizaje de la teoría por parte de los alumnos como la autoevaluación y la evaluación por parte del profesor.
ca: Els continguts teòrics aniran acompanyats de ** exercicis pràctics ** que permetran tant l’aprenentatge dels estudiants com l’autoavaluació i l’avaluació del professor.

source: Los recursos seguirán un diseño que plantee, con los mismos contenidos, actividades sencillas, de nivel medio y de nivel avanzado.
ca: Els recursos seguiran un disseny que, amb els mateixos continguts, activitats senzilles, de nivell mitjà i avançat.

source: De esta manera los mismos contenidos deben **atender a la diversidad** normal de un aula y podrán ser utilizados en diferentes niveles educativos como actividades de ampliación, de refuerzo o adaptadas.
ca: D’aquesta manera, els mateixos continguts han de*abordar la diversitat normal ** d’una aula i es pot utilitzar a diferents nivells educatius com ara extensió, reforç o activitats adaptades.

source: El lenguaje utilizado en los recursos tendrá en cuenta que se puedan usar en todo el mundo. De esta forma será preferible utilizar la palabra 'automóvil', más culta y genérica, en vez de usar las palabras 'carro' o 'coche', de uso más local.
ca: El llenguatge utilitzat en els recursos tindrà en compte que es poden utilitzar a tot el món. D’aquesta manera serà preferible utilitzar la paraula “cotxe”, més cultivada i genèrica, en lloc d’utilitzar les paraules “cotxe” o “cotxe”, més ús local.
