Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/material-textiles.po
Languages: ca

source: Los materiales textiles
ca: Materials tèxtils

source: Son materiales que agrupan desde las telas usadas en ropa o muebles, hasta un balón de cuero o la vela de un barco. Aunque su origen es muy diverso, todos tienen en común su gran flexibilidad y los procesos de cosido o pegado que se utilizan en la fabricación de productos terminados.
ca: Són materials que s’agrupen dels teixits utilitzats en roba o mobles, a una bola de cuir o a l’espelma d’un vaixell. Tot i que el seu origen és molt divers, tothom té la seva gran flexibilitat en comú i els processos cosits o enganxats que s’utilitzen en la fabricació de productes acabats.

source: Índice de contenidos:
ca: Índex de contingut:

source: Hilos
ca: Fils

source: Son hebras largas fabricadas a partir del trenzado de fibras cortas de origen animal, vegetal o plástico.
ca: Són fils llargs elaborats amb la trena de fibres curtes d'origen animal, vegetal o plàstic.

source: Fibra de origen animal (gusanos de seda). Es una de las fibras naturales más fuertes.
ca: Fibra d'origen animal (cucs de seda). És una de les fibres naturals més fortes.

source: **Lana**
ca: ** llana **

source: Fibra de origen animal (pelo de oveja).
ca: Fibra d'origen animal (pèl d'ovella).

source: **Algodón**
ca: ** Cotó **

source: Fibra de origen vegetal.
ca: Fibra vegetal.

source: **Lino**
ca: ** Linen **

source: **Poliéster, nailon y otros plásticos**
ca: ** Polyester, niló i altres plàstics **

source: Fibra de origen artificial.
ca: Fibra d’origen artificial.

source: Textiles
ca: Tèxtils

source: Son láminas formadas por hilos unidos de diversas maneras o formadas por piel animal.
ca: Són fulls formats per fils units de diverses maneres o formats per la pell animal.

source: **Fieltro**
ca: ** Felt **

source: Está formado por fibras unidas mediante vapor y presión, sin tejer, por lo que no es muy resistente.
ca: Està format per fibres enganxades per vapor i pressió, sense teixir, per la qual cosa no és gaire resistent.

source: Se utiliza para fabricar sombreros, faldas, chaquetas, alfombras, etc. Necesita en ocasiones un forro para añadir más resistencia mecánica.
ca: S'utilitza per fer barrets, faldilles, jaquetes, catifes, etc. De vegades necessita un revestiment per afegir més resistència mecànica.

source: **Tejidos planos o telas**
ca: ** Teixits o teixits plans **

source: Están formados por varios hilos que se entrecruzan en perpendicular. Se fabrican en telares que entrelazan la trama (2) con la urdimbre (1).
ca: Estan formats per diversos fils que s’entrecreuen en perpendicular. Es fabriquen en telers que entrellacen la trama (2) amb l’ordit (1).

source: Las telas se usan para fabricar todo tipo de ropa, velas, recubrimientos de muebles, etc.
ca: Els teixits s’utilitzen per fabricar tot tipus de roba, espelmes, recobriments de mobles, etc.

source: **Tejido de punto**
ca: ** teixir **

source: Está fabricado haciendo muchos nudos a un único hilo (tricotaje) hasta formar un tejido. El resultado es más elástico que las telas o el fieltro.
ca: Es fabrica fent molts nusos a un sol fil (tricotage) per formar un teixit. El resultat és més elàstic que els teixits o el feltre.

source: Se utiliza en calcetines o jerseys.
ca: S'utilitza en mitjons o samarretes.

source: **Cueros**
ca: ** Cuir **

source: Provienen de la piel curtida de los animales. Los más utilizados son los cueros de vaca, cerdo y oveja.
ca: Provenen de la pell bronzejada dels animals. Els més utilitzats són els amagats de vaca, porc i ovelles.

source: Se utilizan para fabricar zapatos, guantes, cinturones, cazadoras, sillones, recipientes para líquidos, etc.
ca: S’utilitzen per fer sabates, guants, cinturons, jaquetes, butaques, contenidors de fluids, etc.

source: En la antigüedad se utilizó para hacer libros de pergamino que han resistido el paso de los siglos hasta hoy en día.
ca: Antigament s'utilitzava per fer llibres de pergamí que han resistit el pas dels segles fins avui.

source: Cuestionarios
ca: Qüestionaris

source: Cuestionarios de tipo test sobre los materiales textiles.
ca: Test qüestionaris sobre materials tèxtils.

source: `Test de materiales textiles. </test/es-material-textiles.html>`__
ca: `Prova de materials tèxtils. </test/es-material-textils.html>`__
