Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/material-herramientas.po
Languages: ca

source: Herramientas
ca: Eines

source: Las herramientas son instrumentos que sirven para realizar trabajos específicos y con las que se pueden manipular los materiales para fabricar o reparar un producto. Ejemplos de herramientas son las tijeras para cortar, el lápiz para marcar, el martillo para golpear o la regla para medir.
ca: Les eines són instruments que serveixen per realitzar treballs específics i amb els quals es poden manipular els materials per fabricar o reparar un producte. Exemples d’eines són les tisores per tallar, el llapis per marcar, el martell per colpejar o la regla per mesurar.

source: Cada herramienta está especializada en realizar una tarea concreta de forma idónea por lo que no debe ser utilizada para realizar otras tareas.
ca: Cada eina està especialitzada en realitzar una tasca específica idealment, de manera que no s'ha d'utilitzar per realitzar altres tasques.

source: Ejemplos de mala utilización de herramientas son: atornillar con unas tijeras, golpear con el mango de un destornillador, apretar una tuerca con unos alicates, etc.
ca: Exemples de mal ús de les eines són: cargol amb tisores, colpejar amb el mànec d’un tornavís, estrènyer una femella amb alicates, etc.

source: En el taller de tecnología no se permite realizar estas operaciones de mala utilización de las herramientas porque son peligrosas para las personas que lo realizan y porque pueden estropear la propia herramienta o el producto.
ca: Al taller tecnològic, aquestes operacions de mal ús no poden dur a terme les eines perquè són perilloses per a les persones que ho fan i perquè poden fer malbé la seva pròpia eina o producte.

source: Índice de contenidos:
ca: Índex de contingut:

source: Diferencias entre material y herramienta
ca: Diferències entre material i eina

source: Para distinguir las herramientas de los materiales tendremos en cuenta que las herramientas no forman parte del objeto fabricado y se pueden reutilizar en la fabricación de varios productos.
ca: Per distingir les eines dels materials, tindrem en compte que les eines no formen part de l’objecte fabricat i es poden reutilitzar en la fabricació de diversos productes.

source: **Ejemplos de materiales**, que no se consideran herramientas: grapa, clavo, tornillo, pegamento, barra de cola termofusible, celofán, pintura, cables, etc.
ca: ** Exemples de materials **, que no es consideren eines: clip, clau, cargol, cola, barra de cua termofusible, celofan, pintura, cables, etc.

source: Estos materiales no son herramientas porque forman parte del objeto fabricado. Aunque algunos de estos materiales, como la pintura o el celofán, se almacenan en contenedores grandes, la parte del material que se ha utilizado formará parte del objeto fabricado o reparado.
ca: Aquests materials no són eines perquè formen part de l'objecte fabricat. Tot i que alguns d’aquests materials, com la pintura o el celofan, s’emmagatzemen en contenidors grans, la part del material que s’ha utilitzat formarà part de l’objecte fabricat o reparat.

source: **Ejemplos de herramientas**, que no se consideran materiales: lápiz, papel de lija, pistola de cola termofusible, pincel, martillo, destornillador, etc.
ca: ** Exemples d’eines **, que no es consideren materials: llapis, paper de sorra, pistola de cua termofusible, raspall, martell, tornavís, etc.

source: Ninguna de estas herramientas forman parte del objeto fabricado. El papel de lija puede gastarse y no se podrá volver a utilizar en otro producto pero tampoco formará parte de la madera lijada.
ca: Cap d’aquestes eines forma part de l’objecte fabricat. El paper de sorra es pot gastar i no es pot tornar a utilitzar en un altre producte, però no formarà part de la fusta polida.

source: Clasificación de las herramientas
ca: Classificació d’eines

source: Existen diferentes tipos de herramientas dependiendo de la operación a realizar.
ca: Hi ha diferents tipus d’eines en funció de l’operació que s’han de realitzar.

source: Operación
ca: Operació

source: Medición
ca: Mesurament

source: Regla graduada, compás, nivel, cinta métrica, pie de rey, polímetro.
ca: Regla graduada, brúixola, nivell, cinta, peu de rei, un motorista.

source: Trazado
ca: Pla

source: Lápiz, punta de trazar, cordón con tiza, escuadra, cartabón, compás.
ca: Llapis, punta de traça, cordó amb guix, equip, campana, brúixola.

source: Sujeción
ca: Subjecció

source: Alicates, tornillo de banco, sargento, tenazas, cinta de carrocero, alfiler.
ca: Alicates, cargol bancari, sergent, tenazas, cinta de culturisme, pin.

source: Golpeo
ca: Copejar

source: Martillo de bola, martillo de orejas, maza de nylon, maceta.
ca: Martell de boles, martell de les orelles, maça de niló, olla.

source: Corte
ca: Tribunal

source: Sierra, serrucho, sierra de calar, segueta, cutter, tijeras, tijeras de chapa, tijeras de electricista, alicate pelacables, escoplo, formón, gubia, cortafríos, cortadora de vidrio.
ca: Sierra, Serrucho, Sierra de Calar, Seueta, tallador, tisores, tisores de xapa, tisores d’electricistes, alicates pelables, aroma, formon, gouge, cisalles, tallador de vidre.

source: Perforado
ca: Perforat

source: Punzón, barrena, granete, taladro, broca.
ca: Punch, escombrat, granot, perforació, perforació.

source: Unión
ca: Unió

source: Destornillador, pistola de cola termofusible, soldador eléctrico, llave inglesa, llaves fijas de apriete, llave allen, aguja e hilo, agujas de tricotaje.
ca: Cargolador, pistola de cua termofusible, soldador elèctric, clau en anglès, tecles d’ajustament fix, claus Allen, agulla i fil, agulles de tricotage.

source: Acabado
ca: Acabar

source: Papel de lija, lima, escofina, pulidora, brocha, pincel, rodillo de pintura.
ca: Paper de poliment, calç, escapada, polidatge, pinzell, pinzell, corró de pintura.

source: Cuestionarios
ca: Qüestionaris

source: Cuestionarios de tipo test sobre las herramientas.
ca: Prova qüestionaris sobre les eines.

source: `Test de herramientas I <../test/es-material-tools-1.html>`__.
ca: `Teal Test I <../ Test/ ES-Material-Tools-1.html>`__.

source: `Test de herramientas II <../test/es-material-tools-2.html>`__.
ca: `Teal Test II <../ Test/ ES-Material-Tools-2.html>`__.
