Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/material-propiedades.po
Languages: ca

source: Propiedades de los materiales
ca: Propietats de materials

source: Las propiedades de los materiales son las características que tiene cada material y cómo se comporta ante el calor, los esfuerzos, el oxígeno, etc.
ca: Les propietats dels materials són les característiques que té cada material i com es comporta abans que la calor, els esforços, l’oxigen, etc.

source: Cada material será más apropiado para un tipo de aplicación técnica gracias a sus propiedades. Así, por ejemplo, las ollas se fabrican con acero inoxidable porque conduce bien el calor, es resistente y no se oxida. Sin embargo los mangos de las ollas se fabrican con material plástico para que no conduzca el calor y no nos quememos al sujetarla.
ca: Cada material serà més adequat per a un tipus d’aplicació tècnica gràcies a les seves propietats. Així, per exemple, els pots es fabriquen amb acer inoxidable perquè condueix bé la calor, és resistent i no s’oxida. Tot i això, els pots dels pots es fabriquen amb material plàstic de manera que la calor no condueix i no es cremi al subjectar -la.

source: Índice de contenidos:
ca: Índex de contingut:

source: Propiedades mecánicas
ca: Propietats mecàniques

source: Estas propiedades nos dicen cómo se comportará el material frente a los esfuerzos.
ca: Aquestes propietats ens expliquen com es comportarà el material davant dels esforços.

source: Dureza
ca: Duresa

source: Es la propiedad de resistir al rayado de la superficie. Los materiales son **duros** si no se rayan con facilidad (acero) y son **blandos** si se rayan con facilidad (yeso o madera)
ca: És propietat de resistir el rascat superficial. Els materials són ** durs ** si no es rascen fàcilment (acer) i són ** suaus ** si es rascen fàcilment (guix o fusta)

source: Un material duro rayará a un material más blando.
ca: Un material dur es rascarà un material més suau.

source: Otro ensayo de dureza que se realiza con frecuencia consiste en apretar la punta de una pequeña pirámide de diamante sobre el material. cuanta más grande sea la huella que deja el diamante, más blando será el material.
ca: Un altre assaig de duresa que es fa sovint és estrènyer la punta d’una petita piràmide de diamants al material. Com més gran sigui la petjada que surt el diamant, més suau serà el material.

source: Tenacidad
ca: Tenacitat

source: Es la propiedad de soportar golpes sin romperse.
ca: És la propietat de resistir els cops sense trencar -se.

source: Un material que soporta golpes sin romperse se denomina **tenaz**. Un material que no soporta los golpes será **frágil**
ca: Un material que suporta cops sense trencar -se es diu ** tenaz **. Un material que no admet els cops serà ** fràgil **

source: Un bate de béisbol fabricado con madera será muy tenaz porque soporta bien los golpes, pero será también blando porque se raya con facilidad.
ca: Un ratpenat de beisbol fabricat amb fusta serà molt tenaç perquè suporta els cops, però també serà suau perquè es pot passejar fàcilment.

source: Un vaso de vidrio será frágil porque se romperá con facilidad con los golpes, pero será también duro porque no se raya con facilidad.
ca: Un vidre de vidre serà fràgil perquè es trencarà fàcilment amb els cops, però també serà dur perquè no es pot enganxar fàcilment.

source: Elasticidad
ca: Elasticitat

source: Es la propiedad de recuperar su forma original después de deformarse por un esfuerzo. Lo contrario de la elasticidad es la plasticidad.
ca: És propietat de recuperar la seva forma original després de deformar -se per fer un esforç. El contrari de l’elasticitat és la plasticitat.

source: Los materiales como el látex o el caucho son apreciados por ser muy **elásticos**, pero también la madera o el acero pueden ser elásticos en el caso de los mástiles de barcos o en los muelles.
ca: Materials com el làtex o el cautxú s’aprecien per ser molt ** elàstics **, però també la fusta o l’acer poden ser elàstics en el cas dels pals de la nau o als molls.

source: La plastilina es un buen ejemplo de material **plástico** porque se deforma de manera permanente ante los esfuerzos. Los plásticos también toman ese nombre de su capacidad de deformarse con facilidad cuando están calientes.
ca: La plasticina és un bon exemple de material ** plàstic ** perquè es deforma permanentment als esforços. Els plàstics també prenen aquest nom de la seva capacitat de deformar -se fàcilment quan estan calents.

source: Resistencia mecánica
ca: Resistència mecànica

source: Es la capacidad de resistir esfuerzos sin romperse. Cuanto más esfuerzo resista un material antes de romperse, mayor resistencia mecánica tendrá.
ca: És la capacitat de resistir els esforços sense trencar -se. Com més esforç es resisteix a un material abans de trencar -se, més resistència mecànica.

source: Un pequeño listón de madera de un milímetro cuadrado resiste alrededor de 1,5 kilogramos.
ca: Una petita cinta de fusta d’un mil·límetre quadrat es resisteix al voltant d’1,5 quilograms.

source: Un cable de nailon de un milímetro cuadrado resiste 8 kilogramos.
ca: Un cable de niló d’un mil·límetre quadrat resisteix a 8 quilograms.

source: Un cable de acero de un milímetro cuadrado resiste en torno a los 100 kilogramos.
ca: Un cable d’acer d’un mil·límetre quadrat es resisteix al voltant de 100 quilograms.

source: La resistencia mecánica se mide en kg/mm2 es decir, cuántos kilogramos soporta un cable de un milímetro cuadrado de ese material antes de estirarse de forma permanente (límite elástico) o antes de romperse (carga de rotura).
ca: La resistència mecànica es mesura en kg/mm2, és a dir, quants quilograms un mil·límetre quadrat d’aquest material suporta abans d’estirar de manera permanent (límit elàstic) o abans de trencar (càrrega de trencament).

source: Propiedades térmicas y eléctricas
ca: Propietats tèrmiques i elèctriques

source: Estas dos propiedades están relacionadas entre sí. Describen cómo se comportarán los materiales ante el calor y ante la electricidad.
ca: Aquestes dues propietats estan relacionades entre elles. Descriuen com es comportaran els materials davant la calor i l’electricitat.

source: Conductividad térmica
ca: Conductivitat tèrmica

source: Es la propiedad de transportar el calor con facilidad.
ca: És la propietat del transport de calor fàcilment.

source: Materiales con mucha conductividad térmica se utilizarán para fabricar radiadores, utensilios de cocina, etc.
ca: Els materials amb molta conductivitat tèrmica s’utilitzaran per fer radiadors, estris de cuina, etc.

source: Materiales con poca conductividad térmica, también llamados **aislantes**, se utilizarán para aislar las casas de la temperatura exterior o para fabricar mangos de sartenes, cacerolas, etc.
ca: Els materials amb poca conductivitat tèrmica, també anomenades ** aïllant **, s’utilitzaran per aïllar les cases de la temperatura exterior o per fabricar mangues de paelles, paelles, etc.

source: Los materiales aislantes como el plástico o la madera producen una sensación cálida al tacto, mientras que los materiales buenos conductores como el acero producen una sensación fría al tacto.
ca: Els materials aïllants com el plàstic o la fusta produeixen una sensació càlida al tacte, mentre que els bons conductors com l’acer produeixen una sensació de fred al tacte.

source: Dilatación térmica
ca: Dilatació tèrmica

source: Es la propiedad de un material de aumentar de tamaño con la temperatura. Es una propiedad que suele dar problemas en las estructuras tales como edificios, vías de tren, puentes, etc. El problema se resuelve dejando huecos cada cierta distancia para permitir la dilatación de los materiales con el calor del verano sin que se rompan o se deformen.
ca: És la propietat d’un material augmentar amb la temperatura. Es tracta d’una propietat que sol donar problemes en estructures com edificis, pistes de tren, ponts, etc. El problema es resol de deixant buits a cada distància determinada per permetre la dilatació dels materials amb la calor de l’estiu sense que es trenqui ni deformi.

source: Los huecos creados para evitar este problema se denominan **juntas de dilatación**.
ca: Els forats creats per evitar aquest problema s’anomenen ** articulacions de dilatació **.

source: Conductividad eléctrica
ca: Conductivitat elèctrica

source: Es la propiedad de los materiales de permitir el paso de la corriente eléctrica con facilidad.
ca: És propietat dels materials per permetre el pas del corrent elèctric amb facilitat.

source: Los metales son buenos conductores de la electricidad. El cobre, el aluminio, el oro y el acero son los más usados para para fabricar conductores eléctricos o superficies de contacto.
ca: Els metalls són bons conductors d’electricitat. El coure, l’alumini, l’or i l’acer són els més utilitzats per fer conductors elèctrics o superfícies de contacte.

source: Otros materiales muy útiles son los **semiconductores**, porque pueden controlar la conductividad eléctrica. Con estos materiales se fabrican todos los aparatos electrónicos actuales.
ca: Altres materials molt útils són els semiconductors ** **, perquè poden controlar la conductivitat elèctrica. Amb aquests materials es fabriquen tots els dispositius electrònics actuals.

source: Otras propiedades físicas
ca: Altres propietats físiques

source: Densidad
ca: Densitat

source: Es la cantidad de materia que contiene un litro de material.
ca: És la quantitat de matèria que conté un litre de material.

source: Un material como el plomo tiene mucha densidad porque pesa más de 11 kilogramos por cada litro.
ca: Un material com el plom és molt densitat perquè pesa més d’11 quilograms per cada litre.

source: Un material como la madera tiene poca densidad porque pesa aproximadamente 1 kilogramo por cada litro.
ca: Un material com la fusta té poca densitat perquè pesa aproximadament 1 quilogram per cada litre.

source: Con los materiales poco densos como el magnesio, el litio, aluminio, la madera o los plásticos se pueden fabricar productos ligeros.
ca: Amb pocs materials densos com ara magnesi, liti, alumini, fusta o plàstics, es poden fabricar productes lleugers.

source: Respuesta a la luz
ca: Resposta lleuger

source: Los materiales pueden ser transparentes como el vidrio y gracias a eso se pueden fabricar ventanas.
ca: Els materials poden ser transparents com el vidre i gràcies a que podeu fabricar finestres.

source: Otros materiales como los metales son brillantes y reflejan la luz, por lo que se pueden utilizar para fabricar espejos o superficies reflectantes.
ca: Altres materials com els metalls són brillants i reflecteixen la llum, de manera que es poden utilitzar per fer miralls o superfícies reflectants.

source: Las maderas y los cueros son muy apreciados por su aspecto superficial.
ca: La fusta i el cuir són molt apreciats pel seu aspecte superficial.

source: Propiedades de fabricación
ca: Propietats de fabricació

source: Estas propiedades indican cómo se comportará el material durante los procesos de fabricación de objetos y que operaciones se podrán realizar.
ca: Aquestes propietats indiquen com es comportarà el material durant els processos de fabricació d'objectes i quines operacions es poden realitzar.

source: Maleabilidad
ca: Mal·leabilitat

source: Es la propiedad de un material de soportar aplastamiento sin romperse. Los materiales maleables pueden aplastarse entre rodillos para fabricar láminas finas.
ca: És la propietat d’un material per donar suport a l’aixecament sense trencar -se. Els materials malebles es poden aixafar entre els rodets per fer llençols fins.

source: El aluminio es un ejemplo de material muy maleable. Se puede fabricar papel de aluminio por aplastamiento entre rodillos.
ca: L’alumini és un exemple de material molt maleable. Podeu fabricar paper d’alumini aixafant entre rodets.

source: La madera no es maleable porque se rompe al intentar aplastarla. Con madera se pueden hacer láminas finas, pero gracias al corte, como en el caso de un sacapuntas, y no por aplastamiento.
ca: La fusta no és maleable perquè es trenca quan s’intenta aixafar -la. Amb la fusta, podeu fer llençols fins, però gràcies al tall, com en el cas d’un Scaragers, i no per aixafar -se.

source: Ductilidad
ca: Ductilitat

source: Es la propiedad de un material de soportar estiramiento sin romperse. Los materiales dúctiles pueden estirarse a través de agujeros pequeños para fabricar hilos finos con ellos.
ca: És propietat d’un material per suportar l’estirament sense trencar -se. Els materials dúctils es poden estirar a través de petits forats per fer fils fins.

source: El cobre es un ejemplo de material muy dúctil. Se pueden fabricar hilos muy finos por estiramiento para hacer cables. Los plásticos también son muy dúctiles cuando están calientes. Por ejemplo, la pistola de cola termofusible tiende a hacer hilos muy finos y largos cuando se retira después de pegar.
ca: El coure és un exemple de material molt dúctil. Es poden fabricar fils molt fins per estirar per fer cables. Els plàstics també són molt dúctils quan estan calents. Per exemple, la pistola de cua termofusible tendeix a fer fils molt prims i llargs quan s’elimina després de colpejar.

source: El vidrio caliente es otro material muy dúctil. Se puede estirar con facilidad para fabricar todo tipo de objetos.
ca: El vidre calent és un altre material molt dúctil. Es pot estirar fàcilment per fabricar tot tipus d'objectes.

source: Fusibilidad
ca: Fusibilitat

source: Es la propiedad de un material de fundirse con el calor, pasando a estado líquido. Esta propiedad es muy apreciada para fabricar por moldeo, introduciendo en un molde el material fundido para que tome la forma deseada.
ca: És propietat d’un material per fondre’s amb calor, passant a l’estat líquid. Aquesta propietat és molt apreciada per fabricar per motlle, introduint en un motlle el material fos per prendre la forma desitjada.

source: Los plásticos, los metales y el vidrio son ejemplos de materiales fusibles que permiten fabricar con mucha facilidad todo tipo de formas en un molde.
ca: Els plàstics, els metalls i el vidre són exemples de materials de fusibles que permeten fabricar tot tipus de formes en un motlle.

source: Los materiales fusibles son también fácilmente **soldables**, esto significa que se pueden unir entre sí aplicando calor y presión. Esto facilita también la fabricación al poder unir con facilidad piezas entre sí.
ca: Els materials de fusibles també són fàcilment ** soldables **, això vol dir que es poden unir a l'aplicació de calor i pressió. Això també facilita la fabricació per poder unir fàcilment peces.

source: Materiales no fusibles son la madera, las cerámicas, los plásticos termoestables como la baquelita, etc.
ca: Els materials que no són de fusió són fusta, ceràmica, plàstics termostables com la baquelita, etc.

source: Propiedades químicas
ca: Propietats químiques

source: Estas propiedades definen cómo se comporta el material ante productos químicos corrosivos o ante la radiación solar.
ca: Aquestes propietats defineixen com es comporta el material abans de productes químics corrosius o a la radiació solar.

source: Oxidación
ca: Oxidació

source: Es la combinación del oxígeno con los materiales, que produce su deterioro y rotura.
ca: És la combinació d’oxigen amb els materials, que produeix el seu deteriorament i trencament.

source: Muchos metales se oxidan con facilidad, en especial el hierro, que es uno de los metales más usados. Para evitar la oxidación se recubre el hierro con pinturas, con otros metales resistentes a la oxidación como el cromo (cromado) o como el estaño (hojalata).
ca: Molts metalls s’oxiden fàcilment, especialment el ferro, que és un dels metalls més usats. Per evitar l’oxidació, el ferro està cobert de pintures, amb altres metalls resistents a l’oxidació com el crom (crom) o com a estany (estany).

source: Los plásticos, el vidrio, la madera o los cerámicos son materiales que resisten muy bien la oxidación.
ca: Els plàstics, el vidre, la fusta o la ceràmica són materials que resisteixen molt bé a l’oxidació.

source: Resistencia a los ácidos y cáusticos
ca: Resistència a àcids i càustics

source: Al igual que el oxigeno, los ácidos y los productos cáusticos como la lejía pueden estropear los materiales, especialmente en la intemperie o cerca del mar. Los plásticos y el vidrio son materiales utilizados para contener ácidos y cáusticos porque resisten muy bien sus efectos.
ca: Igual que l’oxigen, els àcids i productes càustics com el lleixiu poden fer malbé els materials, especialment a l’obert o a prop del mar. Els plàstics i el vidre són materials utilitzats per contenir àcids i càustics perquè els seus efectes resisteixen molt bé.

source: Resistencia a la radiación del sol
ca: Resistència a la radiació solar

source: La radiación del sol, en especial la radiación ultravioleta (UV), puede descomponer ciertos materiales y degradarlos.
ca: La radiació del sol, especialment la radiació ultraviolada (UV), pot descompondre certs materials i degradar -los.

source: Muchos plásticos que resisten muy bien el resto de las agresiones químicas resisten mal la radiación del sol y terminan rompiéndose y degradándose en la intemperie.
ca: Molts plàstics que resisteixen molt bé la resta de les agressions químiques resisteixen a la radiació del sol i acaben trencant i degradant -se en el clima.

source: Propiedades ecológicas
ca: Propietats ecològiques

source: Estas propiedades describen el impacto de los materiales sobre el medioambientales.
ca: Aquestes propietats descriuen l’impacte dels materials sobre el medi ambient.

source: Materiales renovables
ca: Materials renovables

source: Son aquellos materiales que se pueden restaurar por procesos naturales a una velocidad mayor que la que se consumen. Los materiales no renovables se agotarán antes o después y no podremos seguir utilizándolos.
ca: Són aquells materials que es poden restaurar mitjançant processos naturals a una velocitat més alta que els consumits. Els materials no renovables s’esgotaran tard o d’hora i no podrem continuar utilitzant -los.

source: Para que un material sea renovable tiene que cumplir dos condiciones:
ca: Perquè un material sigui renovable, ha de complir dues condicions:

source: Que el material provenga de una materia prima renovable o que se pueda reciclar sin pérdidas. Por ejemplo, la madera, el algodón, el vidrio o los metales.
ca: Que el material prové d’una matèria primera renovable o que es pot reciclar sense pèrdues. Per exemple, fusta, cotó, vidre o metalls.

source: Que la materia prima se consuma de manera sostenible, es decir, a menor velocidad de la que se produce. Si talamos un bosque más rápido de lo que crecen los árboles, la madera de ese bosque se agotará y no será sostenible.
ca: Que la matèria primera es consumeixi de manera sostenible, és a dir, a una velocitat inferior a la que es produeix. Si tenim un bosc més ràpid que els arbres creixen, la fusta d’aquest bosc s’esgendrà i no serà sostenible.

source: Ejemplos de **materiales renovables**:
ca: Exemples de ** Materials renovables **:

source: Todos los materiales de origen animal y vegetal que se consuman a la misma velocidad con la que se reponen. Madera, papel, cartón, aceite vegetal, cuero, lana, seda, látex.
ca: Tots els materials d’origen animal i vegetal que consumeixen la mateixa velocitat amb què es reomplen. Fusta, paper, cartró, oli vegetal, cuir, llana, seda, làtex.

source: Materiales muy abundantes en el medio ambiente y que se reciclan sin pérdidas, como el hierro, el aluminio o el vidrio.
ca: Materials molt abundants al medi i que es reciclen sense pèrdues, com ferro, alumini o vidre.

source: Ejemplos de **materiales no renovables**:
ca: Exemples de ** Materials no renovables **:

source: La mayoría de los plásticos que provienen del petróleo y del gas natural (que son recursos limitados).
ca: La majoria dels plàstics provenen del petroli i del gas natural (que són recursos limitats).

source: Los plásticos se pueden reciclar, pero el proceso los degenera con rapidez de manera que solo pueden ser reciclados pocas veces antes de ser desechados.
ca: Els plàstics es poden reciclar, però el procés els degenera ràpidament de manera que només es puguin reciclar poques vegades abans de ser descartats.

source: Hay algunos plásticos que se fabrican a partir de materias primas renovables, pero hoy en día son muy pocos.
ca: Hi ha alguns plàstics que es fabriquen a partir de matèries primeres renovables, però avui en dia són molt poques.

source: Materiales tóxicos
ca: Materials tòxics

source: Un material es tóxico si es venenoso y produce efectos negativos para la salud de los seres vivos. Algunos materiales tienen componentes tóxicos y otros se convierten en tóxicos al desecharlos y descomponerse.
ca: Un material és tòxic si és verinós i produeix efectes negatius per a la salut dels éssers vius. Alguns materials tenen components tòxics i d’altres es tornen tòxics descartant i descomposant.

source: Por último algunos materiales no contienen tóxicos, pero generan mucha contaminación al ser fabricados, por lo que terminan contaminando el medioambiente.
ca: Finalment, alguns materials no contenen tòxics, sinó que generen molta contaminació en fabricar -se, de manera que acaben contaminant el medi ambient.

source: Ejemplos de materiales tóxicos:
ca: Exemples de materials tòxics:

source: Los metales pesados como el plomo, cadmio, mercurio, cromo, etc. Se utilizan para fabricar fluorescentes, productos electrónicos pilas o baterías.
ca: Metalls pesants com el plom, el cadmi, el mercuri, el crom, etc. S'utilitzen per fabricar productes electrònics fluorescents, de bateries o bateries.

source: Los plásticos. Algunos emiten gases tóxicos. La mayoría son tóxicos al descomponerse con el sol o al quemarse.
ca: Els plàstics. Alguns emeten gasos tòxics. La majoria són tòxiques a l’hora de descomposar -se amb el sol o la crema.

source: Materiales de construcción como el granito, que desprende un gas radioactivo llamado radón.
ca: Materials de construcció com el granit, que desprèn un gas radioactiu anomenat Radón.

source: Materiales que desprenden polvo cancerígeno, como el amianto, con el que están fabricados muchos materiales de construcción. Hoy en día está prohibida su fabricación y venta en la Unión Europea.
ca: Materials que desprenen pols cancerígens, com l’amiant, amb els quals es fabriquen molts materials de construcció. Avui està prohibida la seva fabricació i venda a la Unió Europea.

source: Materiales que consumen mucha energía al producirse como el aluminio, acero, hormigón no son tóxicos pero emiten CO2 (gas de efecto invernadero) en su fabricación.
ca: Els materials que consumeixen molta energia quan es produeixen com alumini, acer, formigó no són tòxics, sinó que emeten CO2 (gas d’efecte hivernacle) en la seva fabricació.

source: Un material puede no ser tóxico pero producir tóxicos durante su proceso de fabricación. Por ejemplo, la fabricación del papel con blanqueantes de cloro o la fabricación de tela con tintes tóxicos.
ca: Pot ser que un material no sigui tòxic, sinó que produeixi tòxic durant el seu procés de fabricació. Per exemple, la fabricació de paper amb blancs de clor o fabricació de teixits amb colorants tòxics.

source: Ejemplos de materiales no tóxicos:
ca: Exemples de materials no tòxics:

source: El vidrio, la madera o los metales no pesados no son tóxicos.
ca: El vidre, la fusta o els metalls no rebaixats no són tòxics.

source: Materiales reciclables
ca: Materials reciclables

source: Un material reciclable permite volver a fabricar productos nuevos a partir de los productos de desecho.
ca: Un material reciclable permet fabricar nous productes a partir de productes de residus.
