Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/material-plasticos.po
Languages: ca

source: Los materiales plásticos
ca: Materials plàstics

source: Son materiales sintéticos compuestos por polímeros, que se fabrican a partir de gas natural o petróleo refinado. Se caracterizan su capacidad de moldearse fácilmente bajo la acción del calor y la presión.
ca: Són materials sintètics compostos per polímers, que es fabriquen a partir de gas natural o oli refinat. Caracteritzen la seva capacitat de modelar fàcilment sota l’acció de la calor i la pressió.

source: Índice de contenidos:
ca: Índex de contingut:

source: :index:`Polímeros`
ca: :index:`Polímers`

source: Los `polímeros <https://es.wikipedia.org/wiki/Pol%C3%ADmero>`__ son grandes moléculas compuestas por muchas pequeñas moléculas, iguales entre sí, llamadas monómeros.
ca: Els `polímers <https://es.wikipedia.org/wiki/pol%C3%Admero>`__ són grans molècules compostes per moltes molècules petites, igual que les mateixes, anomenades monòmers.

source: Fotografía de un polímero real usando un microscopio de fuerza atómica.
ca: Fotografia d’un polímer real mitjançant un microscopi de força atòmica.

source: Los `monómeros <https://es.wikipedia.org/wiki/Mon%C3%B3mero>`__ son pequeñas moléculas que se unen entre sí en largas cadenas formadas por la unión de hasta de miles de elementos. Estas largas cadenas pueden ser lineales, tener ramificaciones o en forma de red.
ca: Els `monòmers <https://es.wikipedia.org/wiki/mon%C3%B3Mero>`__ són petites molècules que s'uneixen entre elles en cadenes llargues formades per la unió de fins a milers d'elements. Aquestes llargues cadenes poden ser lineals, tenir ramificacions o en forma de xarxa.

source: Los polímeros generalmente son compuestos basados en uniones de átomos de carbono, llamados compuestos orgánicos, aunque también pueden estar basados en uniones de átomos de silicio, llamados siliconas.
ca: Els polímers són generalment compostos basats en àtoms de carboni, anomenats compostos orgànics, tot i que també es poden basar en àtoms de silici, anomenats silicones.

source: Propiedades de los plásticos
ca: Propietats de plàstic

source: Propiedades mecánicas de los plásticos
ca: Propietats mecàniques dels plàstics

source: En general los plásticos son blandos y con una resistencia mecánica media. La tenacidad depende del plástico. Hay plásticos muy resistentes a los golpes como el policarbonato y otros muy frágiles.
ca: En general, els plàstics són suaus i amb resistència mecànica mitjana. La tenacitat depèn del plàstic. Hi ha plàstics molt resistents a cops com el policarbonat i d’altres molt fràgils.

source: Algunos plásticos especiales de altas prestaciones soportan mejor que los demás las altas temperaturas y tienen buena resistencia mecánica. Es el caso del Kevlar que se utiliza en los chalecos antibalas.
ca: Alguns plàstics especials d’alt rendiment admeten temperatures altes millor que d’altres i tenen una bona resistència mecànica. Aquest és el cas del Kevlar que s’utilitza a les armilles a prova de bales.

source: Densidad
ca: Densitat

source: Los plásticos son ligeros, con una densidad parecida a la del agua (1 kg/litro).
ca: Els plàstics són lleugers, amb una densitat similar a la de l’aigua (1 kg/litre).

source: Algunos plásticos se fabrican con pompas de gas en su interior para conseguir que tengan muy baja densidad y sean buenos aislantes térmicos. Por ejemplo, la espuma de poliuretano o el poliestireno expandido (corcho blanco) tienen esta estructura.
ca: Alguns plàstics es fabriquen amb bombolles de gas al seu interior per aconseguir que tinguin una densitat molt baixa i siguin bons aïllants tèrmics. Per exemple, l'escuma de poliuretà o el poliestirè (suro blanc) tenen aquesta estructura.

source: Respuesta a la luz
ca: Resposta lleuger

source: Algunos plásticos como el policarbonato o el metacrilato son muy transparentes y se utilizan para fabricar ventanas, DVDs, faros, etc.
ca: Alguns plàstics com el policarbonat o el metacrilat són molt transparents i s’utilitzen per fer finestres, DVD, fars, etc.

source: Los plásticos desechados en el medio ambiente se degradan con la luz del sol rompiéndose en microplásticos contaminantes y produciendo sustancias tóxicas.
ca: Els plàstics es van descartar en l’entorn degradant -se amb la llum del sol en microplàstic contaminant i produint substàncies tòxiques.

source: Propiedades de fabricación de los plásticos
ca: Propietats de fabricació de plàstics

source: Los plásticos son muy maleables, extremadamente dúctiles y fundibles. Todo esto facilita mucho la realización de soldaduras o la fabricación de láminas finas, hilos, o piezas moldeadas.
ca: Els plàstics són molt malebles, extremadament dúctils i es poden trobar. Tot això facilita molt la soldadura o la fabricació de fulls fins, fils o peces modelada.

source: Conductividad de los plásticos
ca: Conductivitat plàstica

source: Los plásticos tienen poca conductividad térmica y eléctrica, razón por la que se utilizan como aislantes eléctricos y térmicos.
ca: Els plàstics tenen poca conductivitat tèrmica i elèctrica, és per això que s’utilitzen com a aïllants elèctrics i tèrmics.

source: Propiedades químicas de los plásticos
ca: Propietats químiques dels plàstics

source: Resisten muy bien la oxidación, a los ácidos y a los cáusticos. Por esa razón muchos contenedores de sustancias químicas están hechos de plástico.
ca: L’oxidació, els àcids i els càustics resisteixen molt bé. Per això, molts contenidors de substàncies químiques són de plàstic.

source: Propiedades ecológicas de los plásticos
ca: Propietats ecològiques dels plàstics

source: La mayoría de plásticos no son biodegradables, son tóxicos en su fabricación y en el medio ambiente.
ca: La majoria dels plàstics no són biodegradables, són tòxics en la seva fabricació i en el medi ambient.

source: Los microplásticos representan actualmente un gran problema medioambiental porque se incorporan en la cadena trófica como alimento de los animales, que más tarde terminamos comiendo los humanos. Se calcula que actualmente ingerimos en microplásticos el equivalente en peso a una tarjeta de crédito cada año. Los microplásticos emiten sustancias parecidas a las hormonas que afectan negativamente la salud de todos los animales y de las personas.
ca: Actualment, els microplàstics representen un gran problema mediambiental perquè s’incorporen a la cadena tròfica com a menjar animal, que acabem menjant humans més endavant. Es calcula que actualment ingerim l’equivalent en pes a una targeta de crèdit cada any. Els microplàstics emeten substàncies similars a les hormones que afecten negativament la salut de tots els animals i persones.

source: Los plásticos se pueden reciclar un pequeño número de veces porque al reciclarlos se degradan perdiendo sus propiedades originales y no sirven para fabricar el mismo producto.
ca: Els plàstics poden reciclar un nombre reduït de vegades perquè quan els reciclen degraden la pèrdua de les seves propietats originals i no s’utilitzen per fabricar el mateix producte.

source: Se calcula que solo el 14% del plástico se recolecta para su reciclaje.
ca: Es calcula que només el 14% del plàstic es recull per al reciclatge.

source: :index:`Termoplásticos`
ca: :index:`termoplàstic ''

source: Se pueden fundir o derretir a temperaturas no muy altas y vuelven a endurecerse cuando se enfrían.
ca: Es poden fondre o fondre a temperatures no gaire altes i endurir -se quan es refreden.

source: `Tereftalato de polietileno (PET) <https://es.wikipedia.org/wiki/Tereftalato_de_polietileno>`__
ca: `Polietilè tereftalat (PET) <https://es.wikipedia.org/wiki/terefthate_de_popoliethylene>`__

source: Muy usado en envases de bebidas y textiles.
ca: Molt utilitzat en begudes i contenidors tèxtils.

source: Botella de agua mineral, fabricada con PET.
ca: Ampolla d'aigua mineral, feta de mascota.

source: `Polietileno (PE) <https://es.wikipedia.org/wiki/Polietileno>`__
ca: `Polietilè (PE) <https://es.wikipedia.org/wiki/poliethilene>`__

source: Es uno de los plásticos más comunes por su bajo precio. Se usa en bolsas, film transparente, tuberías, envases, etc.
ca: És un dels plàstics més habituals pel seu preu baix. S'utilitza en bosses, pel·lícules transparents, canonades, contenidors, etc.

source: Hay dos grandes tipos de polietileno que se diferencian por su densidad:
ca: Hi ha dos grans tipus de polietilè que difereixen per la seva densitat:

source: Polietileno de alta densidad **PEAD**
ca: Polietilè d’alta densitat ** Pead **

source: Polietileno de baja densidad **PEBD**
ca: Polietilè de baixa densitat ** PEBD **

source: `Cloruro de polivinilo (PVC) <https://es.wikipedia.org/wiki/Cloruro_de_polivinilo>`__
ca: `Clorur de polivinil (PVC) <https://es.wikipedia.org/wiki/cloruro_de_polivinilo>`__

source: PVC rígido: se utiliza en envases, ventanas, tuberías.
ca: PVC rígid: s'utilitza en contenidors, finestres, canonades.

source: PVC flexible: se utiliza para fabricar recubrimiento de cables, juguetes, calzados, suelos, etc.
ca: PVC flexible: s’utilitza per fabricar cable, joguines, calçat, sòl, etc.

source: Tubería y codo de PVC.
ca: PVC Pipe i colze.

source: `Polipropileno (PP) <https://es.wikipedia.org/wiki/Polipropileno>`__
ca: `Polipropilè (pp) <https://es.wikipedia.org/wiki/polipropileno>` `` `

source: Es el plástico más utilizado después del Polietileno.
ca: És el plàstic més utilitzat després del polietilè.

source: Se utiliza para fabricar envases de alimentos, láminas transparentes, tejidos, etc.
ca: S'utilitza per fer contenidors d'aliments, llençols transparents, teixits, etc.

source: Caja de CD hecha de polipropileno.
ca: Caixa de CD feta de polipropilè.

source: `Poliestireno (PS) <https://es.wikipedia.org/wiki/Poliestireno>`__
ca: `Polystyrene (ps) <https://es.wikipedia.org/wiki/poliestireno>`__

source: Este plástico se funde con temperaturas relativamente bajas (100ºC).
ca: Aquest plàstic es fon amb temperatures relativament baixes (100 ºC).

source: Se utiliza para fabricar envases de yogur, maquinillas de afeitar, poliestireno expandido ("corcho blanco" o poliexpan) aislante y de protección.
ca: S'utilitza per fer contenidors de iogurt, navalla, poliestirè ampliat (\ "suro blanc" o poliexpan) aïllant i protecció.

source: Poliestireno expandido o poliexpan, también llamado "corcho blanco".
ca: Poliestirè expandit o poliexpan, també anomenat \ "Cork blanc ".

source: Símbolos de reciclaje
ca: Símbols de reciclatge

source: Los termoplásticos suelen identificarse con un símbolo que indica su composición, para facilitar su reciclaje.
ca: Els termoplàstics se solen identificar amb un símbol que indica la seva composició, per facilitar el seu reciclatge.

source: Símbolos de los diferentes plásticos reciclables.
ca: Símbols dels diferents plàstics reciclables.

source: :index:`Termoplásticos de altas prestaciones`
ca: :index:`Termoplàstic d'alt rendiment`

source: Son termoplásticos con mejores prestaciones mecánicas y de resistencia al calor que los termoplásticos comunes.
ca: Són termoplàstics amb millors beneficis mecànics i de resistència a la calor que el termoplàstic comú.

source: Se usa para hacer hilos muy resistentes como los de las medias, los paracaídas, el interior de los neumáticos, etc. También para fabricar mecanismos como engranajes y cojinetes, cremalleras, etc.
ca: S'utilitza per fer fils molt resistents com els dels mitjans, els paracaigudes, l'interior dels pneumàtics, etc. També per fabricar mecanismes com engranatges i coixinets, cremalleres, etc.

source: Abrazaderas de nailon.
ca: Pinces de niló.

source: `Teflón <https://es.wikipedia.org/wiki/Tefl%C3%B3n>`__
ca: `Teflon <https://es.wikipedia.org/wiki/tefl%C3%B3n>`__

source: El politetrafluoroetileno, más conocido como teflón, es un polímero prácticamente inerte, por lo que no reacciona con otras sustancias. Tiene muy bajo rozamiento, es antiadherente y resiste temperaturas hasta 270ºC.
ca: El potetrafluoroetilè, més conegut com a tefló, és un polímer pràcticament inert, de manera que no reacciona amb altres substàncies. Té una fricció molt baixa, no és punxeguda i resisteix a les temperatures de fins a 270 ºC.

source: Se usa como recubrimiento de sartenes, cintas para evitar fugas de agua en las roscas de grifos, mecanismos que no necesitan lubricación, etc.
ca: S'utilitza com a recobriment de paelles, cintes per evitar fuites d'aigua en aixetes, mecanismes que no necessiten lubricació, etc.

source: Cinta de teflón para prevenir fugas.
ca: Cinta de tefló per evitar fuites.

source: `Policarbonato <https://es.wikipedia.org/wiki/Policarbonato>`__
ca: `Policarbonat <https://es.wikipedia.org/wiki/policarbonat>`__

source: Es muy transparente y muy resistente a los impactos por lo que se utiliza como sustituto del vidrio. Con él se fabrican CD, DVD, ventanas, cristales antibalas, escudos antidisturbios, viseras de casco de motorista, paneles de separación, etc.
ca: És molt transparent i molt resistent als impactes, de manera que s’utilitza com a substitut del vidre. Amb ell, CD, DVD, Windows, Cristalls a prova de bala, escuts antidisturbis, visera de casc motorista, panells de separació, etc.

source: Gafas protectoras de policarbonato.
ca: Gots de protecció de policarbonat.

source: `Metacrilato <https://es.wikipedia.org/wiki/Polimetacrilato_de_metilo>`__
ca: `Metacrilat <https://es.wikipedia.org/wiki/polimetacrylate_de_metilo>` `` `

source: Es todavía más transparente que el policarbonato. De 10 a 20 veces más resistente al impacto que el vidrio, resiste a la intemperie y a la radiación ultravioleta.
ca: És encara més transparent que el policarbonat. De 10 a 20 vegades més resistent a l’impacte que el vidre, resisteix a la radiació ambulatòria i de la radiació ultraviolada.

source: Se utiliza para fabricar fibra óptica, señales, expositores, acuarios, obras de arte, etc.
ca: S'utilitza per fer fibra òptica, senyals, expositors, aquaris, obres d'art, etc.

source: Bromo puro rodeado de un cubo de metacrilato.
ca: Bromo pur envoltat d’una galleda de metacrilat.

source: :index:`Termoestables`
ca: :index:`termostables`

source: No se funden una vez fabricados. Si la temperatura aumenta mucho se degradan sin fundirse, igual que la madera.
ca: No es fonen un cop fabricats. Si la temperatura augmenta molt degradada sense fondre, igual que la fusta.

source: Fue el primer plástico sintético, creado en 1907. Se puede fundir y moldear durante su fabricación, pero una vez solidificada no se podrá fundir de nuevo.
ca: Va ser el primer plàstic sintètic, creat el 1907. Es pot fondre i modelar durant la seva fabricació, però un cop solidificat no es pot fondre de nou.

source: Aún hoy usa para fabricar mangos de sartén y asas para enseres de cocina, terminales eléctricos, etc.
ca: Fins i tot avui utilitzeu per fer pantalles i manipulars per a equips de cuina, terminals elèctrics, etc.

source: Teléfono fabricado con baquelita.
ca: Telèfon fabricat amb Baquelita.

source: `Melamina <https://es.wikipedia.org/wiki/Melamina>`__
ca: `Melamine <https://es.wikipedia.org/wiki/melamina>`__

source: Su uso más conocido es para cubrir la madera aglomerada junto a papel de colores o imitación a madera. A los muebles que utilizan esta técnica se les llama también muebles de melamina.
ca: El seu ús més conegut és cobrir la fusta aglomerada al costat de paper de colors o imitació de fusta. Els mobles que utilitzen aquesta tècnica també s’anomenen mobles de melamina.

source: Tablero de madera recubierto de melamina.
ca: Tauler de fusta recoberta de melaminina.

source: `Resina epoxi <https://es.wikipedia.org/wiki/Epoxi>`__
ca: `Epoxi Resin <https://es.wikipedia.org/wiki/epoxi>`__

source: Se usa para hacer adhesivos de dos componentes muy resistentes con los que se fabrican aviones, automóviles, material deportivo, etc.
ca: S'utilitza per fabricar adhesius de dos components molt resistents amb els quals es fabriquen avions, cotxes, material esportiu, etc.

source: Otro uso muy frecuente es la elaboración de paneles de fibra de vidrio o fibra de carbono, usados para fabricar barcos, carenados de automóviles de carreras, contenedores de vidrio, placas de circuito impreso, etc.
ca: Un altre ús molt freqüent és la preparació de panells de fibra de vidre o fibra de carboni, que s’utilitzen per fabricar vaixells, transport de cotxes de carreres, contenidors de vidre, plaques de circuit impresos, etc.

source: Contenedor de fibra de vidrio con resina epoxi.
ca: Contenidor de fibra de vidre amb resina epoxi.

source: `Poliuretano <https://es.wikipedia.org/wiki/Poliuretano>`__
ca: `Poliuretà <https://es.wikipedia.org/wiki/poliuretano>`__

source: Su uso más conocido es la fabricación de espumas adhesivas que sirven como aislante térmico de paredes o para pegar marcos de puertas y ventanas con gran capacidad de relleno de huecos.
ca: El seu ús més conegut és la fabricació d’escumes adhesives que serveixen com a aïllant de la paret tèrmica o per enganxar marcs de portes i finestres amb farcits grans.

source: Esponja de poliuretano.
ca: Esponja de poliuretà.

source: :index:`Elastómeros`
ca: :index:`Elastomeres`

source: Son polímeros con una gran elasticidad, es decir que se pueden estirar mucho al aplicar fuerza y, al cesar la fuerza, recuperan su tamaño inicial.
ca: Són polímers amb gran elasticitat, és a dir, poden estirar -se molt quan apliquen força i, quan cessa la força, recuperen la mida inicial.

source: `Látex <https://es.wikipedia.org/wiki/L%C3%A1tex>`__
ca: `Latex <https://es.wikipedia.org/wiki/l%C3%A1tex>`__

source: Es de origen natural, una resina que se extrae del árbol siringa (Hevea brasiliensis).
ca: És d’origen natural, una resina que s’extreu de l’arbre Siringa (Hevea brasiliensis).

source: Se usa en guantes, preservativos, colchones, ropa, pelotas, neumáticos, chicles, etc.
ca: S'utilitza en guants, preservatius, matalassos, roba, boles, pneumàtics, geniva, etc.

source: Guante de látex.
ca: Guant de làtex.

source: `Neopreno <https://es.wikipedia.org/wiki/Neopreno>`__
ca: `Neoprè <https://es.wikipedia.org/wiki/neprene>`__

source: Su uso más conocido es la fabricación de ropa y botas para el agua que son aislantes térmicos (trajes de buceo).
ca: El seu ús més conegut és la fabricació de roba i botes d’aigua que són aïllants tèrmics (vestits de busseig).

source: También sirve para hacer cinta adhesiva, fundas protectoras, sacos de dormir, etc.
ca: També serveix per fer cinta adhesiva, cobertes de protecció, sacs de dormir, etc.

source: Traje de neopreno para buzos.
ca: Neoprè vestit per a submarinistes.

source: La mayoría de los polímeros son compuestos orgánicos, porque están basados en largas cadenas de carbono. Por el contrario las siliconas se basan en largas cadenas de silicio, formando polímeros inorgánicos.
ca: La majoria dels polímers són compostos orgànics, perquè es basen en cadenes de carboni llargues. Per contra, les silicones es basen en llargues cadenes de silici, formant polímers inorgànics.

source: Se puede destacar su uso como adhesivo para vidrios de ventana y juntas, moldes de cocina para horno o para hielo, prótesis médicas, etc.
ca: Podeu destacar el seu ús com a adhesiu per a vidres i juntes de finestra, motlles de cuina per a gel o gel, pròtesis mèdiques, etc.

source: Pasta de silicona para sellar.
ca: Pasta de silicona per segellar.

source: Preguntas de la unidad
ca: Preguntes unitàries

source: Unidad en formato imprimible, con preguntas.
ca: Unitat en format imprimible, amb preguntes.

source: :download:`Materiales plásticos. Formato PDF. <material/materiales-plasticos.pdf>`
ca: : Descàrrega: `Materials de plàstic. Format PDF. <Material/Materials-Plastic.pdf>`

source: :download:`Materiales plásticos. Formato DOC. <material/materiales-plasticos.doc>`
ca: : Descàrrega: `Materials de plàstic. Format DOC. <material/materials-plàstics.doc> `

source: Cuestionarios
ca: Qüestionaris

source: Cuestionarios de tipo test sobre los materiales plásticos.
ca: Test qüestionaris sobre materials plàstics.

source: `Materiales plásticos I. <../test/es-material-plastics-1.html>`__
ca: `Materials plàstics I. <../test/ES-Material-Plastics-1.html>`__

source: `Materiales plásticos II. <../test/es-material-plastics-2.html>`__
ca: `Materials plàstics II. <../test/es-material-plàstics-2.html>`__

source: `Materiales plásticos III. <../test/es-material-plastics-3.html>`__
ca: `Materials plàstics III. <../test/es-material-plàstics-3.html>`__
