Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/material-madera.po
Languages: ca

source: La madera y sus derivados
ca: Fusta i els seus derivats

source: La madera es una materia prima que se obtiene del tronco y ramas de los árboles.
ca: La fusta és una matèria primera que s’obté del maleter i de les branques dels arbres.

source: Índice de contenidos:
ca: Índex de contingut:

source: Propiedades de la madera
ca: Propietats de fusta

source: Las maderas de diferentes árboles tienen distintas propiedades, pero hay algunas propiedades comunes a todas ellas.
ca: La fusta de diferents arbres té propietats diferents, però hi ha algunes propietats habituals a totes elles.

source: **Dureza de la madera**
ca: ** duresa de fusta **

source: La dureza varía mucho entre maderas distintas. La madera de balsa es muy blanda y se puede rayar con mucha facilidad. En el otro extremo, la madera de encina es una madera muy dura.
ca: La duresa varia molt entre diferents boscos. La fusta de Balsa és molt suau i es pot ratllar amb molta facilitat. A l’altre extrem, la fusta de roure és una fusta molt dura.

source: La dureza de la mayoría de las maderas cotidianas es relativamente blanda comparada con otros materiales como los pétreos, metales o incluso los plásticos.
ca: La duresa de la majoria de fustes diàries és relativament suau en comparació amb altres materials com ara pedra, metalls o fins i tot plàstics.

source: **Resistencia mecánica de la madera**
ca: ** Resistència a la fusta mecànica **

source: La resistencia mecánica varía mucho dependiendo de la orientación de la madera. En el sentido de las fibras, la madera es mucho más resistente y aguanta alrededor de 1 ó 2 kg por milímetro cuadrado.
ca: La resistència mecànica varia molt segons l’orientació de la fusta. En direcció a les fibres, la fusta és molt més resistent i perdura aproximadament 1 o 2 kg per mil·límetre quadrat.

source: En el sentido perpendicular a las fibras, la madera resiste poco y se separa con relativa facilidad. Por esa razón los tableros laminados se fabrican con las fibras de una lámina en perpendicular a las fibras de la lámina siguiente, para que el tablero tenga resistencia en todos los sentidos.
ca: En el sentit perpendicular a les fibres, la fusta resisteix poc i es separa amb relativa facilitat. Per això, els taulers laminats es fabriquen amb les fibres d’un full en perpendicular a les fibres de la làmina següent, de manera que el tauler té resistència en tots els sentits.

source: Aunque su resistencia es menor que la del acero o el hormigón, con madera se pueden hacer casas, barcos, muebles, suelos, etc. Como dato curioso todos los edificios de Venecia están sostenidos por vigas de madera bajo el agua.
ca: Tot i que la seva resistència és inferior a la de l’acer o el formigó, amb fusta podeu fer cases, vaixells, mobles, terres, etc. Com a fet curiós, tots els edificis de Venècia estan recolzats per bigues de fusta sota l’aigua.

source: **Flexibilidad de la madera**
ca: ** Flexibilitat de la fusta **

source: La madera es un material bastante flexible. Esto la hace muy apropiada para fabricar mástiles de barco, árcos, piezas curvadas, etc.
ca: La fusta és un material força flexible. Això fa que sigui molt adequat fer pals de vaixell, arcs, parts corbes, etc.

source: **Densidad de la madera**
ca: ** Densitat de fusta **

source: La madera tiene una densidad parecida al agua (1kg por litro). La mayoría de las maderas tienen menor densidad y flotan en el agua, pero algunas maderas de mayor dureza y densidad se hunden en el agua.
ca: La fusta té una densitat similar a l’aigua (1kg per litre). La majoria de les fustes tenen una densitat inferior i suren a l’aigua, però alguns boscos i densitat més durs s’enfonsen a l’aigua.

source: La densidad de la madera es ligera, parecida a la de los plásticos. En comparación la densidad de los metales o de los pétreos es mucho mayor.
ca: La densitat de la fusta és lleugera, similar a la dels plàstics. En comparació, la densitat de metalls o pedra és molt més gran.

source: **Conductividad de la madera**
ca: ** Conductivitat de la fusta **

source: La madera es mala conductora del calor y de la electricidad. Esto hace que sea cálida al tacto y que sea un buen aislante.
ca: La fusta és un mal conductor de calor i electricitat. Això fa que sigui càlid per tocar i que és un bon aïllant.

source: **Higroscopicidad de la madera**
ca: ** Hygroscopicity of Wood **

source: Es la capacidad que tiene la madera de absorber agua. Al absorber agua la madera se hincha ocupando más volumen. Esto puede dar lugar a problemas. Por ejemplo, cuando un suelo de parquet se moja las tablas de madera se hinchan y se curvan despegándose.
ca: És la capacitat d’absorbir l’aigua. En absorbir aigua, la fusta s’infla que ocupa més volum. Això pot provocar problemes. Per exemple, quan un terra de parquet es mulla, els taulers de fusta s’inflen i es corben.

source: Vídeo: `Experimento de palillos en forma de estrella + agua. <https://www.youtube-nocookie.com/embed/rnauo1JWI3U>`__
ca: Vídeo: `star -shaped pals Experiment + aigua. <https://www.youtube-nocookie.com/embed/rnaau1jwi3u>`__

source: **Oxidación de la madera**
ca: ** Oxidació de la fusta **

source: Aunque la madera es muy resistente a la oxidación, en condiciones de humedad puede ser atacada por hongos que la degradan como la oxidación degrada a los metales. Para evitarlo se suelen dar tratamientos superficiales con aceites, barnices o resinas.
ca: Tot i que la fusta és molt resistent a l’oxidació, en condicions d’humitat es pot atacar per fongs que la degraden com a oxidació degradada als metalls. Per evitar -ho, se solen donar tractaments superficials amb olis, vernissos o resines.

source: **Propiedades ecológicas de la madera**
ca: ** Propietats ecològiques de la fusta **

source: La madera y sus derivados son reciclables, biodegradables y no tóxicos.
ca: La fusta i els seus derivats són reciclables, biodegradables i no tòxics.

source: No obstante, la fabricación del papel es un proceso muy contaminante debido a los procesos químicos necesarios para separar las fibras de celulosa y blanquearlas.
ca: Tot i això, la fabricació de paper és un procés molt contaminant a causa dels processos químics necessaris per separar les fibres de cel·lulosa i blanquejar -les.

source: **Otras propiedades de la madera**
ca: ** Altres propietats de la fusta **

source: La madera no se puede fundir, ni es maleable ni dúctil. Por lo tanto, la mayoría de los procesos de fabricación se basan en procesos para retirar material: cortar, serrar, taladrar o fresar la madera.
ca: La fusta no es pot fondre, ni és maleable ni dúctil. Per tant, la majoria de processos de fabricació es basen en processos per eliminar el material: tallar, Serra, perforar o remolcar la fusta.

source: Partes del tronco del árbol
ca: Parts del tronc de l'arbre

source: **Corteza**
ca: ** Crosta **

source: Es la parte exterior del tronco. Su función es proteger las capas interiores.
ca: És la part exterior del tronc. La seva funció és protegir les capes interiors.

source: **Albura**
ca: ** Sapwood **

source: Es la madera más exterior del tronco. Es más joven, blanda y de color más claro.
ca: És la fusta més externa del tronc. És més jove, suau i més lleuger.

source: **Duramen**
ca: ** Heartwood **

source: Es la madera más interior del tronco. Es más dura y de color más oscuro.
ca: És la fusta més interior del tronc. És més dur i fosc.

source: Tronco de tejo en el que se distingue bien el duramen de la albura.
ca: Tronc de Tejo en el qual es distingeix el Duramen de la Sapwood.

source: Obtención de la madera
ca: Obtenir fusta

source: Es el proceso de cortar el tronco del árbol. Una vez cortado se eliminan las ramas más pequeñas.
ca: És el procés de tallar el tronc de l’arbre. Un cop tallat les branques més petites s’eliminen.

source: Vídeo: `John Deere 1470G harvester. <https://www.youtube-nocookie.com/embed/tduKbc_51XA>`__
ca: Vídeo: `John Deere 1470G Harvester. <https://www.youtube-nocokie.com/embed/tdukbc_51xa>`__

source: **Transporte**
ca: ** Transport **

source: Los troncos cortados se transportan desde el bosque en camión o por un rio hasta el aserradero.
ca: Els troncs de cordó són transportats des del bosc al camió o per un riu fins a la serradora.

source: **Aserradero**
ca: ** Sawmill **

source: En el aserradero se elimina la corteza del tronco y se sierran en forma de tablas, tablones o listones.
ca: A la serradora s’elimina el còrtex del tronc i serveixen en forma de taules, taulons o llistons.

source: También se pueden laminar los troncos con una cuchilla para obtener chapas de madera.
ca: També podeu laminar els troncs amb una fulla per obtenir plaques de fusta.

source: Vídeo: `Torno Laminador <https://www.youtube-nocookie.com/embed/IN2su7iVmw8>`__
ca: Vídeo: `Torno Laminor <https://www.youtube-nocokie.com/embed/in2su7ivmw8>` __

source: **Replantado**
ca: ** replantejar **

source: Para que la madera sea un recurso renovable, es necesario volver a plantar el mismo número de árboles que se han cortado.
ca: Perquè la fusta sigui un recurs renovable, cal substituir el mateix nombre d’arbres que s’han tallat.

source: En los países con más conciencia ecológica se busca que las plantaciones madederas sean de varias especies para aumentar la resistencia de los bosques frente a las plagas y las sequías consecuencia del cambio climático.
ca: Als països amb més consciència ecològica, es busca que les plantacions de Madderas siguin de diverses espècies per augmentar la resistència dels boscos contra les plagues i les sequeres com a conseqüència del canvi climàtic.

source: Tipos de maderas naturales
ca: Tipus de fustes naturals

source: **Maderas blandas**
ca: ** Fustes tous **

source: Proceden sobre todo de las coníferas.
ca: Provenen principalment de coníferes.

source: Pino, abeto, cedro, chopo, madera de balsa.
ca: Pi, avet, cedre, poppus, fusta de la bassa.

source: **Maderas duras**
ca: ** Woods Hard **

source: Tienen mayor densidad y dureza por lo que son más difíciles de trabajar.
ca: Tenen una major densitat i duresa, per la qual cosa són més difícils de treballar.

source: Roble, haya, castaño, nogal, eucalipto, caoba.
ca: Oak, Beech, Brown, Walnut, Eucalyptus, caoba.

source: Derivados de la madera
ca: Derivats de fusta

source: **Chapa de madera**
ca: ** Full de fusta **

source: La madera se puede laminar cortándola con una cuchilla como hace un sacapuntas.
ca: La fusta la pot laminar tallant -la amb una fulla com si fes un bolígraf.

source: Esas láminas de madera se pueden utilizar para recubrir otros derivados de la madera como el aglomerado y dar la impresión superficial de madera natural.
ca: Aquestes làmines de fusta es poden utilitzar per cobrir altres derivats de fusta com ara aglomerat i donar la impressió superficial de la fusta natural.

source: **Contrachapado**
ca: ** Preportat **

source: Es un tablero de madera fabricado con láminas finas de madera pegadas entre sí como en un sandwich. Las fibras de cada lámina de madera se colocan en perpendicular a la anterior lámina para mejorar su resistencia mecánica y evitar que se combe con la humedad.
ca: És un tauler de fusta feta de rodanxes de fusta fina enganxades les unes a les altres com en un sandvitx. Les fibres de cada xapa de fusta es col·loquen perpendiculars a la làmina anterior per millorar la seva resistència mecànica i evitar que es combini amb la humitat.

source: **Aglomerado**
ca: ** Agglomerate **

source: Está formado por virutas de madera (serrín) pegadas con una cola que las une entre sí.
ca: Està format per xips de fusta (serradures) enganxades amb una cua que les uneix entre ells.

source: La superficie del aglomerado se suele cubrir con láminas de madera natural o con láminas de resina plástica de colores para dar una apariencia de madera natural, granito, color uniforme, etc.
ca: La superfície de l’aglomerat sol estar coberta de làmines de fusta naturals o amb fulls de resina de plàstic de color per donar una aparença de fusta natural, granit, color uniforme, etc.

source: Está formado por fibras de madera prensadas, parecidas a las utilizadas para fabricar cartón, unidas entre sí por un pegamento de resina.
ca: Està format per fibres de fusta premsades, similars a les que s’utilitzen per fer cartró, unides per una cola de resina.

source: El ejemplo más usado en las casas son las láminas traseras de los armarios.
ca: L’exemple més utilitzat a les cases són els fulls posteriors dels armaris.

source: **Corcho**
ca: ** Cork **

source: Es un material que se obtiene de la corteza de un árbol, el alcornoque.
ca: És un material que s’obté de l’escorça d’un arbre, el roure de suro.

source: Se puede utilizar para fabricar paneles que tienen muy buena respuesta al sonido para insonorizar habitaciones. También se utiliza en tapones de botellas, paneles para colgar papeles, etc.
ca: Es pot utilitzar per fer panells que tinguin una resposta molt bona al so a les sales insonoritzades. També s’utilitza en taps d’ampolles, panells de panells, etc.

source: **Papel**
ca: ** Paper **

source: Está formado por fibras muy finas de la madera, blanqueadas con oxígeno o cloro y prensadas en láminas finas.
ca: Està format per fibres molt primes de fusta, blanquejades amb oxigen o clor i pressionades en llençols fins.

source: **Cartón**
ca: ** Cardboard **

source: Su proceso de fabricación es semejante al del papel, pero no se blanquean las fibras. Suele contener papel reciclado.
ca: El seu procés de fabricació és similar al del paper, però les fibres no són blanquejades. Normalment conté paper reciclat.

source: El cartón corrugado está formado por varias láminas de papel pegadas entre sí, con la lámina central ondulada.
ca: El cartró ondulat està format per diverses làmines de paper enganxades les unes a les altres, amb el full central ondulant.

source: Vídeo: `El cartón corrugado. <https://www.youtube-nocookie.com/embed/GeZDRN8PT3c>`__
ca: Vídeo: `El cartró ondulat. <https://www.youtube-nocookie.com/embed/gezdrn8pt3c>`__

source: Formas comerciales
ca: Formes comercials

source: **Madera maciza**
ca: ** Fusta massissa **

source: Se obtienen directamente cortando el tronco del árbol.
ca: S’obtenen directament tallant el tronc de l’arbre.

source: **Listones:** Piezas largas con una sección rectangular o circular de pequeño tamaño.
ca: ** Llistes: ** Peces llargues amb una secció petita o circular de mida petita.

source: **Perfiles y molduras:** piezas largas de sección en L o formas variadas de pequeño tamaño.
ca: ** Perfils i motllures: ** Secció llarga de la secció de les formes variades de mida petita.

source: **Tablones:** piezas de gran superficie y de grosor entre 3mm y 25mm.
ca: ** Talts: ** Parts grans i gruixudes entre 3mm i 25mm.

source: **Chapas:** láminas de madera con grosor menor de 3 milímetros, que sirven para revestir maderas de menor calidad, parte trasera de armarios y fondo de cajones.
ca: ** Passos: ** Fulls de fusta amb un gruix inferior a 3 mil·límetres, que serveixen per cobrir fusta de menor qualitat, part posterior dels armaris i fons de calaix.

source: **Derivados de la madera**
ca: ** derivats de fusta **

source: Se obtienen prensando bloques, láminas, virutas o fibras de madera encolada.
ca: S’obtenen prement blocs, rodanxes, xips o fibres de fusta enganxada.

source: **Tableros** tienen unas dimensiones grandes (120cm x 240cm) y poco grosor. Se pueden cortar en tamaños más pequeños según los planos del cliente. Pueden estar hechos de contrachapado, aglomerado o fibras (MDF).
ca: ** Els taulers ** tenen grans dimensions (120cm x 240cm) i poc gruix. Es poden tallar en mides més petites segons els avions dels clients. Es poden fer de fusta contraplacada, aglomerat o fibres (MDF).

source: **Bobinas de papel y cartón:** están formadas por papel o cartón enrollados en una bobina de gran longitud.
ca: ** Bobines de paper i cartró: ** Estan format per paper o cartró enrotllat en una gran bobina.

source: Cuestionarios
ca: Qüestionaris

source: Cuestionarios de tipo test sobre la madera.
ca: Test qüestionaris sobre fusta.

source: `La madera I. <../test/es-material-wood-1.html>`__
ca: `Wood I. <../test/es-material-fusta-1.html>`__

source: `La madera II. <../test/es-material-wood-2.html>`__
ca: `WOOD II. <../test/es-material-wood-2.html>`__
