Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/material-propiedades.po
Languages: ca

source: Los productos se desechan cuando termina su vida útil. En algunos casos se pueden reutilizar sus materiales para fabricar productos nuevos, pero la mayoría de las veces se desechan en montañas de basura que terminan afectando de forma negativa al medioambiente.
ca: Els productes es descarten quan s’acaba la seva vida útil. En alguns casos, podeu reutilitzar els vostres materials per fabricar nous productes, però la majoria de vegades es descarten en muntanyes d’escombraries que acaben afectant negativament el medi ambient.

source: El vidrio y los metales son muy reciclables porque no pierden sus propiedades ni se degradan en el proceso de reciclado.
ca: El vidre i els metalls són molt reciclables perquè no perden les seves propietats ni es degraden en el procés de reciclatge.

source: Los plásticos o el papel son poco reciclables porque se degradan con mucha facilidad en el proceso de reciclado. Los productos reciclados tienen menor calidad que los originales.
ca: Els plàstics o el paper no són gaire reciclables perquè es degraden molt fàcilment en el procés de reciclatge. Els productes reciclats tenen una qualitat inferior als originals.

source: Materiales biodegradables
ca: Materials biodegradables

source: Un material es biodegradable si se descompone en la naturaleza con relativa facilidad y sin producir productos tóxicos.
ca: Un material és biodegradable si es descompon a la natura amb relativa facilitat i sense produir productes tòxics.

source: La madera y sus derivados como el cartón y papel son muy biodegradables.
ca: La fusta i els seus derivats com el cartró i el paper són molt biodegradables.

source: Los plásticos son muy poco biodegradables.
ca: Els plàstics són molt poc biodegradables.

source: **Otros problemas ecológicos**
ca: ** Altres problemes ecològics **

source: La extracción no sostenible de materiales renovables puede agotar las reservas y provocar graves problemas medioambientales. Por ejemplo, la fabricación en masa de turbinas eólicas puede desertizar zonas de bosque en el caso de tala no controlada de madera de balsa. La producción de hormigón está esquilmando muchos habitats al retirar arenas necesarias para su fabricación.
ca: L’extracció no sostenible de materials renovables pot esgotar les reserves i causar greus problemes ambientals. Per exemple, la fabricació massiva dels aerogeneradors pot desertar les zones forestals en el cas de la tala de fusta balsa no controlada. La producció de formigó porta molts hàbitats eliminant les sorres necessàries per a la seva fabricació.

source: Cuestionarios
ca: Qüestionaris

source: Cuestionarios de tipo test sobre las propiedades de los materiales.
ca: Test qüestionaris sobre propietats materials.

source: `Propiedades de los materiales I <../test/es-material-properties-1.html>`__.
ca: `Propietats dels materials I <../test/ES-Material-Properties-1.html>`__.

source: `Propiedades de los materiales II <../test/es-material-properties-2.html>`__.
ca: `Propietats dels materials II <../test/ES-Material-Properties-2.html>`__.

source: `Propiedades de los materiales III <../test/es-material-properties-3.html>`__.
ca: `Propietats dels materials III <../test/es-material-Properties-3.html>` __.
