Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/material-clasific.po
Languages: ca

source: Clasificación de los materiales
ca: Classificació de materials

source: Los materiales se pueden clasificar según muchos criterios. En esta unidad se estudiarán los materiales según su procesado, según sea el origen de la materia prima, los tipos de materiales y su clasificación según el impacto que tengan en el medio ambiente.
ca: Els materials es poden classificar segons molts criteris. Aquesta unitat estudiarà els materials segons el seu processament, depenent de l’origen de la matèria primera, dels tipus de materials i de la seva classificació segons l’impacte que tenen sobre el medi ambient.

source: Índice de contenidos:
ca: Índex de contingut:

source: Clasificación según el nivel de procesado
ca: Classificació segons el nivell de processament

source: Los materiales siguen un proceso de transformación desde que se extraen hasta que se convierten en un objeto útil.
ca: Els materials segueixen un procés de transformació des de ser extrets fins que es converteixen en un objecte útil.

source: Materia prima
ca: Matèria primera

source: Es un material primario que se encuentra en la naturaleza. La materia prima se puede transformar en materiales técnicos para fabricar productos.
ca: És un material primari que es troba a la natura. La matèria primera es pot transformar en materials tècnics per fabricar productes.

source: Ejemplos de materias primas son: lana, piel, seda, algodón, madera, hierro, cobre, petróleo, arcilla, látex.
ca: Exemples de matèries primeres són: llana, pell, seda, cotó, fusta, ferro, coure, oli, argila, làtex.

source: Material técnico
ca: Material tècnic

source: Estos son los materiales que se obtienen transformando las materias primas. Se utilizan para fabricar productos terminados.
ca: Aquests són els materials obtinguts mitjançant la transformació de les matèries primeres. S'utilitzen per fabricar productes acabats.

source: Algunos ejemplos de materiales técnicos que se obtienen a partir de las materias primas:
ca: Alguns exemples de materials tècnics que s’obtenen de matèries primeres:

source: A partir de la madera se fabrican tablones macizos, listones, serrín, tablones de aglomerado, papel, cartón.
ca: Des de la fusta, es fabriquen taulons sòlids, cintes, serradures, taulons d’aglomerat, paper, cartró.

source: A partir del algodón se fabrican los hilos, cuerdas, telas, fieltros.
ca: Des del cotó els fils, les cordes, els teixits, el feltre.

source: A partir del hierro se fabrican tubos, planchas, ángulos, tornillos, vigas, clavos, alambres.
ca: Des de tubs de ferro, plaques, angles, cargols, bigues, ungles, cables es fabriquen.

source: A partir del plástico se fabrican hilos, telas, cuerdas, láminas.
ca: Des dels fils de plàstic, teixits, cordes, es fabriquen fulls.

source: A partir de la piel se fabrica cuero.
ca: Des de la pell, es fabrica cuir.

source: Producto terminado
ca: Producte acabat

source: Estos son los productos que podemos comprar en las tiendas. Están compuestos de diversos materiales técnicos.
ca: Aquests són els productes que podem comprar a les botigues. Es componen de diversos materials tècnics.

source: Ejemplos de productos terminados y los materiales que utilizan.
ca: Exemples de productes acabats i els materials que utilitzen.

source: Pantalón: fabricado con tela e hilo de algodón, hilos de plástico, remaches y cremallera de latón, etiqueta de cuero.
ca: Pantalons: fabricat amb tela i fil de cotó, fils de plàstic, reblons i cremallera de llautó, etiqueta de cuir.

source: Silla: fabricada con patas y tornillos de hierro, tacos, telas y pinturas de plástico, asiento y respaldo de madera.
ca: Càtedra: fabricat amb potes i cargols de ferro, tacos, teixits i pintures de plàstic, seient i suport de la fusta.

source: Estantería de salón: fabricada con madera aglomerada, vidrio proveniente de la arena, clavos y tornillos de hierro, tiradores de plástico.
ca: Prestatgeria del saló: fabricat amb fusta aglomerada, vidre de la sorra, ungles i cargols de ferro, tiradors de plàstic.

source: Clasificación según el origen de la materia prima
ca: Classificació segons l’origen de la matèria primera

source: Los materiales se pueden clasificar según el origen de la materia prima:
ca: Els materials es poden classificar segons l’origen de la matèria primera:

source: **Materiales de origen vegetal**:
ca: ** Materials d’origen vegetal **:

source: Algodón, lino, madera, aceites vegetales, resinas, cáñamo, caucho, corcho, celulosa.
ca: Cotó, lli, fusta, olis vegetals, resines, cànem, cautxú, suro, cel·lulosa.

source: **Materiales de origen animal**:
ca: ** Materials d’origen animal **:

source: Lana, piel, seda.
ca: Llana, pell, seda.

source: **Materiales de origen mineral**:
ca: ** Materials d'origen mineral **:

source: Mármol, arcilla, metales, petróleo.
ca: Marbre, argila, metalls, oli.

source: Clasificación según el tipo de material
ca: Classificació segons el tipus de material

source: Podemos clasificar los materiales asociando aquellos cuyas propiedades sean semejantes. Por ejemplo, los metales, los materiales plásticos, etc.
ca: Podem classificar els materials que associen aquells que les propietats són similars. Per exemple, metalls, materials plàstics, etc.

source: Según esta clasificación tenemos los siguientes materiales:
ca: Segons aquesta classificació, tenim els materials següents:

source: Provienen de las piedras o arenas de la naturaleza. Se pueden clasificar en los siguientes grupos.
ca: Provenen de les pedres o de les sorres de la natura. Es poden classificar en els grups següents.

source: Naturales: mármol, granito, pizarra, piedra caliza, arenisca.
ca: Natural: marbre, granit, pissarra, pedra calcària, gres.

source: Aglomerantes: yeso, cemento, hormigón.
ca: Barmers: guix, ciment, formigó.

source: Cerámicos: arcilla, loza, gres, porcelana.
ca: Ceràmica: argila, Loza, Gres, porcellana.

source: Vidrio.
ca: Vidre.

source: Están hechos de madera maciza o de derivados de la madera prensados.
ca: Són de fusta massissa o derivats de fusta premsada.

source: Madera cortada: blandas y duras.
ca: Fusta tallada: suau i dura.

source: Madera chapada: Contrachapado, madera laminada.
ca: Chapada Wood: contraplacat, fusta laminada.

source: Madera Aglomerada: aglomerado, DM.
ca: Fusta d’aglomerat: aglomerat, DM.

source: Papel y cartón.
ca: Paper i cartró.

source: :ref:`material-textiles`
ca: : Ref: `Material-Textils`

source: Son materiales que agrupan desde las telas usadas en ropa o muebles, hasta un balón de cuero o la vela de un barco. Aunque su origen es muy distinto, todos tienen en común su gran flexibilidad y los procesos de cosido y pegado que se utilizan en la fabricación.
ca: Són materials que s’agrupen dels teixits utilitzats en roba o mobles, a una bola de cuir o a l’espelma d’un vaixell. Tot i que el seu origen és molt diferent, tothom té la seva gran flexibilitat i els processos cosits i enganxats que s’utilitzen en la fabricació.

source: Hilos: Seda, lana, algodón, poliéster.
ca: Fils: seda, llana, cotó, polièster.

source: Telas: vaqueros, jersey de lana, vela de barco.
ca: Teixits: texans, jersei de llana, espelma de vaixell.

source: Cueros: zapatos, guantes, sillones, cinturones, recipientes para líquidos.
ca: Cuir: sabates, guants, butaques, cinturons, contenidors de fluids.

source: :ref:`material-metales`
ca: : Ref: `Material-metalls`

source: Se extraen calentando óxidos y sulfuros que se encuentran en la naturaleza en forma de rocas. Se pueden clasificar en los siguientes grupos.
ca: S’extreuen per òxids i sulfurs de calefacció que es troben a la natura en forma de roques. Es poden classificar en els grups següents.

source: Basados en hierro: hierro, acero, acero inoxidable.
ca: Ferro -basat: ferro, acer, acer inoxidable.

source: Basados en cobre: cobre, latón, bronce.
ca: Basat en coure: coure, llautó, bronze.

source: Metales ligeros: aluminio, litio, magnesio.
ca: Metalls lleugers: alumini, liti, magnesi.

source: Metales pesados: plomo, cromo, cadmio, mercurio.
ca: Metalls pesants: plom, crom, cadmi, mercuri.

source: Metales preciosos: oro, plata, rodio, platino.
ca: Metalls preciosos: or, plata, rodi, platí.

source: :ref:`material-plasticos`
ca: : Ref: `Material-Platals`

source: Provienen del gas natural o del petróleo refinado. Se pueden clasificar en los siguientes grupos.
ca: Provenen de gas natural o petroli refinat. Es poden classificar en els grups següents.

source: Termoplásticos: PET, polietileno, PVC, polipropileno, poliestireno, nailon, teflón.
ca: Termoplàstic: PET, polietilè, PVC, polipropilè, poliestirè, niló, tefló.

source: Termoestables: baquelita, melamina, resina epoxi.
ca: Termostable: Baquelita, melamina, resina epoxi.

source: Elastómeros: látex, neopreno, siliconas, caucho sintético.
ca: Elastomeres: làtex, neoprè, silicones, cautxú sintètic.

source: Ejercicios
ca: Exercicis

source: Clasifica los siguientes materiales según su origen mineral, vegetal o animal.
ca: Classifiqueu els materials següents segons el seu origen mineral, vegetal o animal.

source: Cinturón de cuero
ca: Cinturó de cuir

source: Calcetines de algodón
ca: Mitjons de cotó

source: Mallas de poliéster
ca: Malles de polièster

source: Tejas y ladrillos
ca: Rajoles i maons

source: Encimera de mármol
ca: Taulell de marbre

source: Mesa de madera
ca: Taula de fusta

source: Jersey de lana
ca: Jersei de llana

source: Puerta de hierro
ca: Porta de ferro

source: Ventana de aluminio
ca: Finestra d'alumini

source: Camisa de lino
ca: Camisa de lli

source: Alpargatas de cáñamo
ca: Espacres de cànem

source: Suelo de terrazo
ca: Terra terratzo

source: Encuentra cinco objetos cotidianos de tu entorno que estén fabricados con cada uno de estos tipos de materiales:
ca: Cerqueu cinc objectes quotidians del vostre entorn fabricats amb cadascun d’aquests tipus de materials:

source: Objetos de metal.
ca: Objectes metàl·lics

source: Objetos de plástico.
ca: Objectes de plàstic

source: Objetos de madera.
ca: Objectes de fusta.

source: Objetos de materiales pétreos.
ca: Materials del ventre.

source: Objetos con materiales de origen animal.
ca: Objectes amb materials d’origen animal.

source: Busca en Internet cinco objetos cotidianos que se encuentren en tu entorno y estén fabricados con materiales tóxicos.
ca: Cerqueu a Internet cinc objectes quotidians que es troben al vostre entorn i que es fabriquen amb materials tòxics.

source: Cuestionarios
ca: Qüestionaris

source: Cuestionarios de tipo test sobre la clasificación de los materiales.
ca: Test qüestionaris sobre la classificació de materials.

source: `Clasificación de los materiales. </test/es-material-classification.html>`__
ca: `Classificació de materials. </test/es-material-classification.html>`__
