Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/material-metales.po
Languages: ca

source: `Materiales metálicos III. <../test/es-material-metals-3.html>`__
ca: `Materials metàl·lics III. <../test/es-material-metalls-3.html>`__

source: `Materiales metálicos IV. <../test/es-material-metals-4.html>`__
ca: `Materials metàl·lics iv. <../test/es-material-metalls-4.html>`__
