Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/material-metales.po
Languages: ca

source: Los materiales metálicos
ca: Materials metàl·lics

source: Son materiales que se obtienen calentando en un horno minerales, generalmente óxidos y sulfuros del metal, obtenidos en las minas.
ca: Són materials que s’obtenen escalfant -se en un forn mineral, normalment òxids i sulfurs metàl·lics, obtinguts a les mines.

source: Índice de contenidos:
ca: Índex de contingut:

source: Propiedades de los metales
ca: Propietats metàl·liques

source: Aunque los diferentes metales presentan unas propiedades muy distintas, hay algunas propiedades comunes a todos ellos.
ca: Tot i que els metalls diferents tenen propietats molt diferents, hi ha algunes propietats comunes a totes elles.

source: Resistencia mecánica
ca: Resistència mecànica

source: La resistencia mecánica de la mayoría de los metales es muy alta. Mejor que el resto de materiales. Esta es la razón por la que se utilizan para fabricar estructuras. Por ejemplo, edificios, aviones, automóviles, barcos, etc.
ca: La resistència mecànica de la majoria de metalls és molt alta. Millor que la resta de materials. Aquesta és la raó per la qual s’utilitzen per fabricar estructures. Per exemple, edificis, avions, cotxes, vaixells, etc.

source: Maleabilidad y Ductilidad
ca: Mal·leabilitat i ductilitat

source: La mayoría de los metales son muy maleables y muy dúctiles, lo que facilita mucho poder fabricar con ellos láminas y cables finos.
ca: La majoria dels metalls són molt malebles i molt dúctils, cosa que facilita molt per fabricar fulls i cables fins.

source: Densidad de los metales
ca: Densitat metàl·lica

source: Es muy variable, pero en general son mucho más densos que el agua.
ca: És molt variable, però en general són molt densos que l’aigua.

source: Densidad (kg/litro)
ca: Densitat (kg/litre)

source: Magnesio
ca: Magnesi

source: Aluminio
ca: Alumini

source: Titanio
ca: Titani

source: Hierro
ca: Planxar

source: Cobre
ca: Coure

source: Plomo
ca: Davantera

source: Mercurio
ca: Mercuri

source: Oro
ca: Or

source: Conductividad
ca: Conductivitat

source: Los metales son buenos conductores del calor y de la electricidad.
ca: Els metalls són bons conductors de calor i electricitat.

source: Oxidación
ca: Oxidació

source: Hay metales, como el hierro, que se oxidan sin parar hasta que la corrosión les deshace por completo.
ca: Hi ha metalls, com el ferro, que s’oxiden sense parar fins que la corrosió els desfés completament.

source: Algunos metales como el aluminio, la plata o el plomo se oxidan superficialmente y pierden su brillo metálico. Esa capa de óxido superficial les protege impidiendo que progrese la oxidación. Así, estos metales son resistentes a la corrosión.
ca: Alguns metalls com l’alumini, la plata o el plom s’oxiden superficialment i perden la seva brillantor metàl·lica. Aquesta capa d’òxid superficial els protegeix prevenir l’oxidació. Així, aquests metalls són resistents a la corrosió.

source: Otros metales como el oro, el platino o el cromo mantienen su brillo metálico sin oxidarse superficialmente.
ca: Altres metalls com l’or, el platí o el crom mantenen la seva brillantor metàl·lica sense oxidar superficialment.

source: Respuesta a la luz
ca: Resposta lleuger

source: Los metales son opacos y, pulidos, reflejan bien la luz. Presentan un brillo característico denominado "metálico".
ca: Els metalls són opacs i, polit, reflecteixen el pou de la llum. Tenen una brillantor característica anomenada \ "Metallic ".

source: Propiedades ecológicas
ca: Propietats ecològiques

source: Los metales son fácilmente reciclables muchas veces sin que se degraden.
ca: Els metalls són fàcilment reciclables moltes vegades sense degradar -se.

source: Muchos metales son inertes y no reaccionan con la naturaleza, oxidándose muy lentamente sin producir tóxicos.
ca: Molts metalls són inerts i no reaccionen amb la natura, oxidant -se molt lentament sense produir tòxics.

source: Los metales pesados son muy tóxicos para el medio ambiente.
ca: Els metalls pesants són molt tòxics per al medi ambient.

source: Otras propiedades
ca: Altres propietats

source: Hay metales líquidos a temperatura ambiente (mercurio y galio) que se pueden utilizar para hacer termómetros, tubos fluorescentes, etc.
ca: Hi ha metalls líquids a temperatura ambient (Mercuri i Gallium) que es poden utilitzar per fer termòmetres, tubs fluorescents, etc.

source: Tabla periódica de los elementos
ca: Taula periòdica dels elements

source: Los metales suponen la mayoría de los elementos representados en la tabla periódica.
ca: Els metalls suposen que la majoria dels elements representats a la taula periòdica.

source: `2012rc <https://commons.wikimedia.org/wiki/File:Periodic_table_large-es-updated-2018.svg>`__, `CC BY 3.0 <https://creativecommons.org/licenses/by/3.0/deed.en>`__, via Wikimedia Commons.
ca: `2012rc <https://commons.wikimedia.org/wiki/file:periodic_lage-es--updated-2018.svg>`__, `cc by `` `` `` `` `` ``

source: Aleaciones
ca: Aliatges

source: Una aleación es una mezcla de un metal con otro elemento. Las aleaciones se fabrican generalmente fundiendo un metal con otros elementos para que se combinen de forma que el resultado tenga mejores propiedades que los productos utilizados.
ca: Un aliatge és una barreja d’un metall amb un altre element. Els aliatges es fabriquen generalment fusionant un metall amb altres elements de manera que es combinen de manera que el resultat tingui millors propietats que els productes utilitzats.

source: Ejemplos de aleaciones son el bronce (cobre y estaño), el latón (cobre y zinc), el acero (hierro y carbono), el acero inoxidable (hierro, carbono y cromo) o el duraluminio (aluminio y cobre).
ca: Exemples d’aliatges són el bronze (coure i estany), llautó (coure i zinc), acer (ferro i carboni), acer inoxidable (ferro, carboni i crom) o duralumina (alumini i coure).

source: La mayoría de los metales no se utilizan en su forma pura, sino que son aleados con otros elementos para mejorar sus propiedades.
ca: La majoria dels metalls no s’utilitzen en la seva forma pura, sinó que s’alien amb altres elements per millorar les seves propietats.

source: Clasificación de los metales
ca: Classificació de metalls

source: **Metales ferrosos:** compuestos principalmente por hierro. Son los más utilizados por su bajo precio.
ca: ** Metalls ferrosos: ** compost principalment de ferro. Són els més utilitzats per al seu preu baix.

source: **Cobre y sus aleaciones:** Cobre, bronce y latón. Son muy apreciados por su buena conductividad, su resistencia mecánica (bronce) y resistencia a la corrosión.
ca: ** El coure i els seus aliatges: ** coure, bronze i llautó. Són molt apreciats per la seva bona conductivitat, la seva resistència mecànica (bronze) i la resistència a la corrosió.

source: **Metales ligeros:** principalmente el aluminio, titanio, magnesio y sus aleaciones. Son muy útiles para fabricar aviones, prótesis, móviles, bicicletas ligeras, etc.
ca: ** Metalls lleugers: ** Principalment alumini, titani, magnesi i els seus aliatges. Són molt útils per fabricar avions, pròtesis, mòbils, bicicletes lleugeres, etc.

source: **Metales pesados:** plomo, mercurio, arsénico, cadmio, cromo, níquel, estaño, cinc. Son muy tóxicos para el medio ambiente.
ca: ** Metalls pesants: ** plom, mercuri, arsènic, cadmi, crom, níquel, llauna, zinc. Són molt tòxics per al medi ambient.

source: **Metales nobles:** son metales con gran resistencia a la corrosión, que no se oxidan. Oro, plata, platino, rodio, iridio, osmio.
ca: ** Metalls nobles: ** Són metalls amb gran resistència a la corrosió, que no s’oxiden. Or, plata, platí, rodi, iridi, Osmio.

source: **Metales de tierras raras:** neodimio, itrio, lantano, cerio Se utilizan para formar aleaciones, productos electrónicos, imanes de alto rendimiento y superconductores.
ca: ** Metalls de terra rara: ** Neodimio, Itrio, Lantano, Ceriio s’utilitzen per formar aliatges, productes electrònics, imants d’alt rendiment i superconductors.

source: Metales ferrosos
ca: Metalls ferrosos

source: Son aquellos que están formados principalmente por hierro. El hierro puro es un metal con malas propiedades mecánicas, por lo que éstas suelen mejorarse por medio de aleaciones.
ca: Són els que es formen principalment per ferro. El ferro pur és un metall amb males propietats mecàniques, de manera que se solen millorar mitjançant aliatges.

source: Su densidad es relativamente alta (7,9 kg/litro).
ca: La seva densitat és relativament alta (7,9 kg/litre).

source: Acero
ca: Acer

source: Es una aleación de hierro con carbono (con un porcentaje menor del `2,1% en peso <https://es.wikipedia.org/wiki/Acero>`__). Es una de las aleaciones metálicas más utilizadas para todo tipo de productos y estructuras por ser el metal más barato, con muy buena resistencia mecánica (carga de rotura de 50 a 100 kg/mm2) y muy tenaz.
ca: És un aliatge de ferro amb carboni (amb un percentatge inferior de `2,1% en pes <https://es.wikipedia.org/wiki/acero>`__). És un dels aliatges metàl·lics més utilitzats per a tot tipus de productes i estructures perquè és el metall més barat, amb una resistència mecànica molt bona (trencament de 50 a 100 kg/mm2) i molt tenaç.

source: Fundición
ca: Fosa

source: Es una aleación de hierro con carbono (con un porcentaje mayor del `2,1% en peso <https://es.wikipedia.org/wiki/Fundici%C3%B3n_de_hierro>`__). Son más frágiles que los aceros y con menor punto de fusión. Son más resistentes a la corrosión y a los cambios de temperatura que los aceros comunes.
ca: ES Una aleAliorn de Hierro con Carbono (al alcalde de Porcentaje Del `2,1%en peso <https://es.wikipedia.org/wiki/fundici%C3%B3n_de_hierro>`__). Són més fràgils que els acers i amb menys punt de fusió. Són més resistents als canvis de corrosió i temperatura que els acers comuns.

source: Se utilizan, por ejemplo, para fabricar tapas de alcantarilla, estufas y chimeneas, carcasas de bombas de agua, etc.
ca: S’utilitzen, per exemple, per fabricar tapes de clavegueram, estufes i xemeneies, carcasses de bombes d’aigua, etc.

source: Acero inoxidable
ca: Acer inoxidable

source: Es una aleación de hierro con cromo (con un porcentaje mayor del 10%). Es muy resistente a la corrosión y se utiliza en utensilios de cocina, cubertería, lavabos, tuberías, etc.
ca: És un aliatge de ferro amb crom (amb un percentatge superior al 10%). És molt resistent a la corrosió i s’utilitza en estris de cuina, coberts, pica, canonades, etc.

source: Está compuesta por `hierro alfa <https://es.wikipedia.org/wiki/Ferrita_(hierro)>`__ puro, de aspecto oscuro. En ocasiones se alea con cobalto, níquel, zinc o manganeso, que mejoran sus propiedades magnéticas.
ca: Està format per `alfa ferro <https://es.wikipedia.org/wiki/ferrita_ (ferro)>` `__ pura i fosca. De vegades està aliat amb cobalt, níquel, zinc o manganès, que milloren les seves propietats magnètiques.

source: La ferrita tiene propiedades magnéticas por lo que se utiliza para fabricar transformadores, imanes, filtros para cables, etc.
ca: La ferrita té propietats magnètiques, de manera que s’utilitza per fer transformadors, imants, filtres de cable, etc.

source: Cobre y sus aleaciones
ca: Coure i els seus aliatges

source: Es un metal rojizo muy buen conductor del calor y la electricidad.
ca: És un molt bon conductor de metall de calor i electricitat.

source: Es muy utilizado para fabricar cables, tuberías, intercambiadores de calor, monedas, pigmentos, etc. Fue el primer metal utilizado en la prehistoria, dando nombre a la `Edad del Cobre <https://es.wikipedia.org/wiki/Edad_del_Cobre>`__.
ca: S'utilitza àmpliament per fabricar cables, canonades, intercanviadors de calor, monedes, pigments, etc. Va ser el primer metall utilitzat en la prehistòria, donant nom a la "edat del coure <https://es.wikipedia.org/wiki/addad_del_cobre>`__.

source: Bronce
ca: Bronze

source: Aleación de cobre y estaño (con un porcentaje entre el 3% y el 20%). Es muy resistente al roce y a la corrosión.
ca: Aliatge de coure i estany (amb un percentatge entre el 3% i el 20%). És molt resistent al fregament i a la corrosió.

source: Se utiliza para construir instrumentos musicales, hélices de barco, o esculturas.
ca: S'utilitza per construir instruments musicals, hèlixs de vaixells o escultures.

source: Fue la primera aleación obtenida por la humanidad y da su nombre a la `Edad del Bronce <https://es.wikipedia.org/wiki/Edad_del_Bronce>`__.
ca: Va ser el primer aliatge obtingut per la humanitat i dóna el seu nom a l’edat de bronze <https://es.wikipedia.org/wiki/dad_del_bronce>`__.

source: Latón
ca: Llautó

source: Es una aleación de cobre y zinc.
ca: És un aliatge de coure i zinc.

source: Tiene un color característico dorado, parecido al oro, por lo que se utiliza mucho en decoración y bisutería. También Se utiliza para fabricar cerraduras, cerrojos, picaportes, grifos, jarrones, etc.
ca: Té un color característic daurat, similar a l’or, de manera que s’utilitza molt en la decoració i les joies. També s’utilitza per fer panys, panys, focus, aixetes, gerros, etc.

source: Metales ligeros
ca: Metalls lleugers

source: Es el metal más utilizado después del acero por ser barato, tener baja densidad (2,8 kg/litro) y muy buena resistencia a la corrosión. En estado puro es muy blando y con baja resistencia mecánica, pero aleado de forma adecuada aumenta mucho su resistencia mecánica de rotura hasta los 40 kg/mm2.
ca: És el metall més utilitzat després de l’acer perquè és barat, amb una densitat baixa (2,8 kg/litre) i una molt bona resistència a la corrosió. En estat pur, és molt suau i amb baixa resistència mecànica, però correctament aliat, la seva resistència mecànica de ruptura augmenta fins a 40 kg/mm2.

source: Es muy dúctil y maleable y se puede extrudir con mucha facilidad.
ca: És molt dúctil i maleable i es pot extreure amb molta facilitat.

source: Se utiliza para fabricar marcos de ventanas, papel metálico, latas, aviones, cables eléctricos, etc.
ca: S'utilitza per fabricar marcs de finestres, paper metàl·lic, llaunes, avions, cables elèctrics, etc.

source: A pesar de ser el metal más abundante de la corteza terrestre durante el siglo XIX su producción era tan costosa que se consideraba un material exótico con un precio enorme, mayor que el del oro.
ca: Tot i ser el metall més abundant de l'escorça terrestre durant el segle XIX, la seva producció era tan cara que es considerava un material exòtic amb un preu enorme, superior al de l'or.

source: A partir de 1900 su producción fue aumentando sin parar hasta la actualidad. Esto se debió a la invención de técnicas químicas (proceso Bayer) y a la aplicación de la dinamo que permite producir la electricidad necesaria para aislar el aluminio por electrólisis.
ca: A partir del 1900, la seva producció va augmentar sense parar fins avui. Això es va deure a la invenció de tècniques químiques (procés de Bayer) i a l’aplicació de Dinamo que permet produir l’electricitat necessària per aïllar l’alumini per electròlisi.

source: Es un metal de color gris, de baja densidad (4,5 kg/litro) muy resistente a la corrosión y con buena resistencia mecánica de rotura, semejante a la del acero.
ca: És un metall gris, baixa densitat (4,5 kg/litre) molt resistent a la corrosió i amb una bona resistència a la ruptura mecànica, similar a la de l’acer.

source: Tiene la mejor relación dureza/densidad de todos los metales. Es casi tan fuerte como los aceros, pero con menor densidad.
ca: Té la millor relació de duresa/densitat de tots els metalls. És gairebé tan fort com els acers, però amb menys densitat.

source: Gracias a sus propiedades es muy apreciado para construir prótesis médicas, maquinaria aeroespacial, transporte de productos químicos, etc. Con el óxido de titanio se fabrican pinturas y plásticos blancos con un color muy puro y muy buena resistencia a la radiación solar.
ca: Gràcies a les seves propietats, és molt apreciat construir pròtesis mèdiques, maquinària aeroespacial, transport químic, etc. Amb òxid de titani, pintures blanques i plàstics es fabriquen amb un color molt pur i una molt bona resistència a la radiació solar.

source: Metales pesados
ca: Metalls pesants

source: Es un metal de color gris oscuro, que se funde con facilidad (327ºC).
ca: És un metall de color gris fosc, que es fusiona fàcilment (327 ºC).

source: Se utiliza en soldadura de componentes electrónicos, baterías de automóvil, blindajes anti-radiaciones, pigmentos, balas, etc.
ca: S'utilitza en soldadura de components electrònics, bateries d'automòbils, escuts anti-radiació, pigments, bales, etc.

source: En la actualidad se tiende a reducir su uso por ser altamente contaminante. Por ejemplo, los productos electrónicos utilizan cada vez más soldaduras y componentes basados en plata para evitar el uso de plomo.
ca: Actualment, el seu ús sol ser molt contaminant. Per exemple, els productes electrònics utilitzen cada vegada més soldadures i components basats en plata per evitar l’ús de plom.

source: Es un metal líquido a temperatura ambiente de color plateado brillante.
ca: És un metall líquid a temperatura ambient de plata brillant.

source: Se está intentando reducir su uso en lo posible para evitar las consecuencias de su toxicidad.
ca: Intenta reduir el seu ús el màxim possible per evitar les conseqüències de la seva toxicitat.

source: Se utiliza para fabricar fluorescentes, termómetros, amalgama para empastes, pilas, etc.
ca: S'utilitza per fabricar fluorescents, termòmetres, amalgama per a fixadors, bateries, etc.

source: Estaño
ca: Llauna

source: Es un metal de color blanco brillante. Es muy blando y no se oxida.
ca: És un metall blanc brillant. És molt suau i no s’oxida.

source: La **hojalata** es acero recubierto de una fina capa de estaño y se utiliza en las latas de conserva. Otros usos del estaño son la soldadura de componentes electrónicos, fabricar bronce y vidrio, pigmentos, sobretapón de las botellas de vino, etc.
ca: El ** llauna ** està recobert d’acer amb una fina capa d’estany i s’utilitza en llaunes en conserva. Altres usos de llauna són la soldadura de components electrònics, la fabricació de bronze i vidre, pigments, excés d’ampolles de vi, etc.

source: Es un metal de color blanco brillante y blando.
ca: És un metall blanc brillant i suau.

source: Se utiliza, aleado con cobre, para producir latón. Puede recubrir piezas de hierro en un proceso llamado **galvanización** que evita su oxidación. También se encuentra en las pilas eléctricas.
ca: S'utilitza, aliatge amb coure, per produir llautó. Podeu cobrir peces de ferro en un procés anomenat ** galvanització ** que impedeixi la seva oxidació. També es troba en bateries elèctriques.

source: Cromo
ca: Cromat

source: Es un metal de color blanco agrisado, duro, frágil y muy resistente a la corrosión.
ca: És un metall de corrosió blanc, dur, fràgil i molt resistent.

source: Se utiliza aleado con acero para fabricar acero inoxidable. El **cromado** consiste en depositar una capa protectora de cromo sobre otro material (plástico, otros metales, etc.) dando un aspecto brillante que no se oxida. Otras aplicaciones son pinturas, curtido de cuero, catalizadores, etc.
ca: L’acer s’utilitza per fabricar acer inoxidable. El cromat ** consisteix a dipositar una capa protectora de crom en un altre material (plàstic, altres metalls, etc.) donant un aspecte brillant que no s’oxida. Altres aplicacions són pintures, cuir bronzejat, catalitzadors, etc.

source: Es un metal color blanco con un ligero tono amarillo.
ca: És un metall blanc amb un lleuger to groc.

source: Se utiliza aleado con acero para fabricar acero inoxidable. Las aleaciones cobre-níquel son muy resistentes a la corrosión y se utilizan para fabricar motores marinos, industria química o acuñar monedas.
ca: L’acer s’utilitza per fabricar acer inoxidable. Els aliatges de níquel de coure són molt resistents a la corrosió i s’utilitzen per fabricar motors marins, indústria química o monedes.

source: Cadmio
ca: Cadmi

source: Es un metal de color blanco azulado.
ca: És un metall blanc blavós.

source: Se utiliza en baterías de Níquel-Cadmio recargables, para fabricar cojinetes con baja fricción y mucha resistencia a la fatiga.
ca: S'utilitza en bateries recarregables de níquel-cadmi, per fer un suport amb baixa fricció i molta resistència a la fatiga.

source: Metales nobles
ca: Metalls nobles

source: Es un metal de color dorado, blando, muy dúctil, muy resistente a la oxidación y muy buen conductor eléctrico.
ca: És un metall daurat, suau i molt dúctil, molt resistent a l’oxidació i molt bon conductor elèctric.

source: La mayor parte del oro (70%) se utiliza en joyería o como inversión. Solo el 10% del oro se utiliza en aplicaciones industriales.
ca: La major part de l’or (70%) s’utilitza en joieria o inversió. Només el 10% de l’or s’utilitza en aplicacions industrials.

source: Se usa para cubrir contactos eléctricos que no se oxidan, cables eléctricos de los chips, reflector de luz en cristales de gafas, etc.
ca: S’utilitza per cobrir contactes elèctrics que no s’oxiden, xips cables elèctrics, reflector de llum en cristalls de gots, etc.

source: Platino
ca: Platí

source: Es un metal blanco grisáceo.
ca: És un metall blanc grisenc.

source: Se emplea en joyería, contactos eléctricos, empastes, y catalizadores.
ca: S'utilitza en joieria, contactes elèctrics, estampats i catalitzadors.

source: Rodio
ca: Rodi

source: Metal de color blanco plateado.
ca: Metall blanc de plata.

source: Se utiliza como catalizador de óxidos nitrosos de los automóviles y no tiene sustituto. Por esa razón su precio se ha elevado tanto que actualmente es el metal precioso más caro, con un precio muy superior al del oro.
ca: S'utilitza com a catalitzador de catalitzadors dels cotxes i no té cap substitut. Per això, el seu preu ha augmentat tant que actualment és el metall preciós més car, amb un preu molt superior al de l’or.

source: Precio de los metales
ca: Preu metàl·lic

source: Hay varias referencias, pero la más prestigiosa es la `bolsa de Londres <https://www.lme.com/>`__. Estos precios corresponden al cierre en bolsa sobre el metal puro a día 5 de junio de 2024.
ca: Hi ha diverses referències, però el més prestigiós és la `London Stock Borsa <https://www.lme.com/>`__. Aquests preus corresponen al tancament del mercat de valors del metall pur el 5 de juny de 2024.

source: Precio €/kg
ca: Preu €/kg

source: Hierro / acero [1]
ca: Ferro / acer [1]

source: Litio
ca: Liti

source: Cobalto
ca: Cobalt

source: [1] Precio medio del acero. Puede variar de 0,42 a 0,65 €/kg.
ca: [1] Preu mitjà de l'acer. Pot variar de 0,42 € a 0,65/kg.

source: `Precio de metales preciosos <https://legor.com/es/cotizaciones/>`__ a 5 de junio de 2024.
ca: `Preu dels metalls preciosos <https://legor.com/es/cotizaciones/>`__ a partir del 5 de juny de 2024.

source: Preguntas de la unidad
ca: Preguntes unitàries

source: Unidad en formato imprimible, con preguntas.
ca: Unitat en format imprimible, amb preguntes.

source: :download:`Materiales metálicos. Formato PDF. <material/materiales-metalicos.pdf>`
ca: : Descàrrega: `Materials metàl·lics. Format PDF. <material/materials metàl·lics.pdf> `

source: :download:`Materiales metálicos. Formato DOC. <material/materiales-metalicos.doc>`
ca: : Descàrrega: `Materials metàl·lics. Format DOC. <Materials-metalicos.doc> '

source: Cuestionarios
ca: Qüestionaris

source: Cuestionarios de tipo test sobre los materiales metálicos.
ca: Test qüestionaris sobre materials metàl·lics.

source: `Materiales metálicos I. <../test/es-material-metals-1.html>`__
ca: `Materials metàl·lics I. <../test/es-material-metalls-1.html>`__

source: `Materiales metálicos II. <../test/es-material-metals-2.html>`__
ca: `Materials metàl·lics ii. <../test/es-material-metals-2.html>`__
