Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/material-petreos.po
Languages: ca

source: Los materiales pétreos
ca: Materials de pedra

source: Son los materiales que provienen de las piedras o arenas de la naturaleza.
ca: Són els materials que provenen de les pedres o les sorres de la natura.

source: Índice de contenidos:
ca: Índex de contingut:

source: Propiedades de los pétreos
ca: Propietats de pestori

source: **Propiedades mecánicas de los pétreos**
ca: ** Propietats mecàniques de la pedra **

source: Son materiales duros, relativamente frágiles, y con suficiente resistencia mecánica para resultar muy prácticos en la construcción de edificios y otras estructuras semejantes.
ca: Són materials durs, relativament fràgils i amb una resistència mecànica suficient per ser molt pràctica en la construcció d’edificis i altres estructures similars.

source: **Densidad**
ca: ** Densitat **

source: En general, es mayor que la del agua y varían desde los 1,5 kg/litro de la arena hasta los 2,8 kg/litro de la pizarra, mármol o granito.
ca: En general, és superior a l’aigua i varia des d’1,5 kg/litre de la sorra fins a 2,8 kg/litre de la pissarra, el marbre o el granit.

source: La piedra pómez o la diatomita son excepciones con una densidad muy baja, menor que la del agua, al ser muy porosas.
ca: La pumice o la pedra diatomita són excepcions amb una densitat molt baixa, inferior a la de l’aigua, sent molt porosa.

source: **Respuesta a la luz**
ca: ** Resposta a la llum **

source: La mayoría de los materiales pétreos son opacos y tienen muy buena resistencia a la radiación del sol.
ca: La majoria de materials de pedra són opacs i tenen una bona resistència a la radiació del Sol.

source: Algunos pétreos como el vidrio utilizado en las ventanas, el cuarzo o el zafiro utilizado en esferas de relojes son muy transparentes.
ca: Alguns cargols de pedra com el vidre que s’utilitzen a les finestres, el quars o el safir que s’utilitzen en esferes de rellotges són molt transparents.

source: Otros pétreos como la porcelana son traslúcidos.
ca: Altres pelades pedregoses són la porcellana són translúcides.

source: **Propiedades de fabricación de los pétreos**
ca: ** Propietats de fabricació de pestori **

source: Los pétreos naturales no son maleables ni dúctiles ni se funden con facilidad. Se pueden cortar y pulir para producir láminas y bloques.
ca: La pedra natural no és maleable ni dúctil ni es fonen fàcilment. Es poden tallar i polir per produir fulls i blocs.

source: Los aglomerantes como el cemento son líquidos cuando se mezclan con agua y pueden moldearse con facilidad antes de que endurezcan.
ca: Els barmers com el ciment són líquids quan es barregen amb aigua i es poden modelar fàcilment abans d’endurir -se.

source: Los materiales cerámicos tienen consistencia de pasta muy maleable aunque poco dúctil. Se pueden moldear con facilidad antes de cocer.
ca: Els materials ceràmics tenen una consistència de pasta molt maleable, però no molt dúctil. Es poden modelar fàcilment abans de cuinar.

source: El vidrio se puede fundir con facilidad y actúa como un material plástico muy maleable y muy dúctil mientras está caliente. Puede formar hilos muy finos que sirven como refuerzo a otros materiales (fibra de vidrio).
ca: El vidre es pot fondre fàcilment i actua com un material de plàstic molt maleable i molt dúctil mentre està calent. Pot formar fils molt fins que serveixen de reforç a altres materials (fibra de vidre).

source: **Conductividad de los pétreos**
ca: ** Conductivitat de pestori **

source: Los materiales pétreos tienen muy poca conductividad térmica y eléctrica y resisten bien las altas tensiones y temperaturas. Por esa razón los vidrios y cerámicas se utilizan como separadores eléctricos en líneas de alta tensión y como material refractario en hornos.
ca: Els materials del ventre tenen molt poca conductivitat tèrmica i elèctrica i resisteixen bé les tensions i les temperatures altes. Per això, el vidre i la ceràmica s’utilitzen com a separadors elèctrics en línies d’alta tensió i com a material refractari als forns.

source: **Propiedades químicas de los pétreos**
ca: ** Propietats químiques de la pedra **

source: Los pétreos son muy estables y resisten bien a los ácidos y cáusticos y a la oxidación y la radiación solar.
ca: Els Stony són molt estables i resisteixen bé als àcids i als càustics i a l’oxidació i a la radiació solar.

source: La excepción a esto son las rocas calizas y el mármol que se ven atacados por los ácidos y se deshacen poco a poco con la lluvia ácida generada por la contaminación.
ca: L’excepció d’això és la pedra calcària i les roques de marbre que són atacades per àcids i desfer -se gradualment de la pluja àcida generada per la contaminació.

source: **Propiedades ecológicas de los pétreos**
ca: ** Propietats ecològiques de les campanes **

source: Los materiales pétreos suelen ser poco reciclables, excepto el vidrio que se puede reciclar muchas veces sin pérdida de calidad.
ca: Els materials de pedra solen ser poc reciclables, tret del vidre que es pot reciclar moltes vegades sense pèrdua de qualitat.

source: No son tóxicos en la naturaleza, aunque la fabricación del cemento produce muchos gases de efecto invernadero. Se calcula que el 8% de todas las emisiones de CO2 provienen de su fabricación.
ca: No són de naturalesa tòxica, tot i que la fabricació de ciment produeix molts gasos d’efecte hivernacle. Es calcula que el 8% de totes les emissions de CO2 provenen de la seva fabricació.

source: El asbesto, también llamado amianto, es altamente cancerígeno por lo que su uso y fabricación se ha prohibido hace años en los países occidentales.
ca: L’amiant, també anomenat amiant, és altament carcinogènic, de manera que el seu ús i fabricació ha estat prohibit fa anys als països occidentals.

source: El granito produce un gas radiactivo y cancerígeno llamado radón. Las zonas habitadas que contienen mucho granito en los alrededores deben tener esto en cuenta en las construcciones y usar buenos sistemas de ventilación.
ca: El granit produeix un gas radioactiu i cancerigen anomenat radó. Les zones habitades que contenen molt de granit als voltants han de tenir -ho en compte a les construccions i utilitzar bons sistemes de ventilació.

source: Pétreos naturales
ca: Stony Natural

source: **Mármol**
ca: ** Marble **

source: Se ha usado desde la antigüedad para construir edificios o tallar esculturas. En la actualidad todavía se usa en la construcción para cubrir suelos o paredes de aspecto lujoso.
ca: S'ha utilitzat des de l'antiguitat per construir edificis o escultures tallades. Actualment, encara s’utilitza en la construcció per cobrir sòls o parets d’aspecte luxós.

source: El mármol está compuesto de caliza cristalizada por lo que no es resistente a los ácidos, que le deshacen.
ca: El marbre està compost per calcàries cristal·litzades, de manera que no és resistent als àcids, que el desfeu.

source: `Lysippos <https://commons.wikimedia.org/wiki/File:Milv.jpg>`__, `CC BY-SA 2.0 DE <https://creativecommons.org/licenses/by-sa/2.0/de/deed.en>`__, via Wikimedia Commons.
ca: `Lysippos <https://commons.wikimedia.org/wiki/file:milv.jpg>`__, `cc by-sa 2.0 de <https://creativecommons.org/licenses/by-s/2.0/deed.en>`__, via wikimedia commons.

source: **Granito**
ca: ** Granit **

source: Se ha utilizado desde la prehistoria para la construcción y es muy apreciado por su gran resistencia a la erosión y a la corrosión.
ca: S'ha utilitzat des de la prehistòria per a la construcció i és molt apreciat per la seva gran resistència a l'erosió i la corrosió.

source: Se ha usado ampliamente como recubrimiento en edificios públicos y monumentos. También se usa en objetos cotidianos como encimeras de cocina.
ca: S'ha utilitzat àmpliament com a recobriment en edificis públics i monuments. També s’utilitza en objectes quotidians com ara taulells de cuina.

source: Al incrementarse la lluvia ácida, el granito está sustituyendo al mármol en construcciones a la intemperie.
ca: Quan la pluja àcida augmenta, el granit substitueix el marbre en temps.

source: `Rojinegro81 <https://commons.wikimedia.org/wiki/File:Roca_Granito.JPG>`__, `CC BY-SA 3.0 <https://creativecommons.org/licenses/by-sa/3.0>`__, via Wikimedia Commons.
ca: `Rojinegro81 <https://commons.wikimedia.org/wiki/file:roca_granito.jpg>`__, `cc by-sa 3.0 <https://creatcommons.org/licenses/by-sa/3.0>`__, via wikimedia commons.

source: **Pizarra**
ca: ** tauler **

source: Está formada por lajas u hojas planas y finas que la hace adecuada para fabricar paneles planos usados para cubrir tejados y, antiguamente, para escribir con tiza.
ca: Està format per lloses o fulles planes i fines que fa que sigui oportú fer que els panells plans s’utilitzin per cobrir les teulades i, antigament, per escriure amb guix.

source: `Dontworry <https://commons.wikimedia.org/wiki/File:St.leonhard-ffm002.jpg>`__, `CC BY-SA 3.0 <https://creativecommons.org/licenses/by-sa/3.0/deed.en>`__, via Wikimedia Commons.
ca: `Dontwury <https://commons.wikimedia.org/wiki/file:st.leonhard-ffm002.jpg>` __, `cc by-sa 3.0 `` `` `` `` `` `` `` `` `` `` `` `` `` `` ``

source: **Piedra caliza**
ca: ** Calcera **

source: Se utiliza desde la antigüedad como elemento de construcción. La catedral de Burgos está construida con piedra caliza.
ca: S'utilitza ja que l'antiguitat com a element de construcció. La catedral de Burgos està construïda amb pedra calcària.

source: Al quemarla en un horno produce cal, un componente fundamental del cemento gris.
ca: En cremar -lo en un forn produeix calç, un component fonamental del ciment gris.

source: La lluvia ácida la disuelve.
ca: La pluja àcida la dissol.

source: Gran Pirámide de Guiza. Recubierta por completo de piedra caliza.
ca: Gran piràmide de Guiza. Completament cobert de pedra calcària.

source: `Berthold Werner <https://commons.wikimedia.org/wiki/File:Gizeh_Cheops_BW_1.jpg>`__, `CC BY-SA 3.0 <https://creativecommons.org/licenses/by-sa/3.0/deed.en>`__, via Wikimedia Commons.
ca: `Berthold Werner <https://commons.wikimedia.org/wiki/file: `` `` `` `` `` ``

source: **Piedra arenisca**
ca: ** Stone Arenisca **

source: Es la roca sedimentaria más común. Está compuesta de granos de cuarzo y otras partículas unidas por un cemento natural (carbonato de calcio u otros).
ca: És la roca sedimentària més comuna. Està compost per grans de quars i altres partícules unides per un ciment natural (carbonat de calci o altres).

source: Se emplea como material de construcción y en piedras de afilar.
ca: S'utilitza com a material de construcció i en pedres afilades.

source: `Sarranpa <https://commons.wikimedia.org/wiki/File:Arenisca.jpg>`__, `CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0/deed.en>`__, via Wikimedia Commons.
ca: `Sarranpa <https://commons.wikimedia.org/wiki/file:arenisca.jpg>`__, `cc by-sa 4.0 <https://creativecommons.org/licenses/by-s/4.0/deed.en>`__, via wikimedia commons.

source: **Grava y arenas**
ca: ** grava i arenes **

source: Son rocas de un tamaño pequeño. Se utilizan junto al cemento para formar hormigón.
ca: Són roques d’una mida petita. S'utilitzen al costat del ciment per formar formigó.

source: Pétreos aglomerantes
ca: Batalers

source: Son materiales técnicos producidos industrialmente. Se presentan en forma de polvo que, mezclado con el agua, produce una pasta que se puede moldear. Poco tiempo después de su mezcla con el agua, endurecen y adoptan una consistencia pétrea.
ca: Són materials tècnics produïts industrialment. Es presenten en forma de pols que, barrejat amb l’aigua, produeix una pasta que es pot modelar. Poc després de barrejar -se amb l’aigua, s’endureixen i adopten una consistència de pedra.

source: **Yeso**
ca: ** I així **

source: Es un aglomerante de color blanco.
ca: És un aglutinant blanc.

source: Se utiliza desde la prehistoria para unir y sellar piedras de construcciones. También se utiliza para revestimiento y decoración de paredes y techos.
ca: S'utilitza des de la prehistòria per unir i segellar pedres de construccions. També s'utilitza per al revestiment i la decoració de parets i sostres.

source: El yeso de grano más fino se denomina **escayola**.
ca: El guix de gra millor s’anomena ** guix **.

source: `Joseph Rose <https://commons.wikimedia.org/wiki/File:Tapestry_Room_from_Croome_Court_MET_DP341270.jpg>`__ `CC0 Public Domain. <https://creativecommons.org/publicdomain/zero/1.0/deed.en>`__
ca: `Joseph Rose <https://commons.wikimedia.org/wiki/file:tapestry_room_from_croome_court_met_dp341270.jpg>` __ `cc0 domini públic. <https://creativecommons.org/publicdomain/zero/1.0/deed.en>`__

source: **Cemento**
ca: ** Ciment **

source: Está formado por piedra caliza y arcillas calcinadas en un horno a las que se añade yeso para mejorar sus propiedades. Generalmente es de color **gris**.
ca: Està format per calcàries i argiles calculades en un forn al qual s’afegeix guix per millorar les seves propietats. Normalment és color ** gris **.

source: Se calcula que la producción anual es de más de 4000 millones de toneladas. Su uso principal es la producción de hormigón.
ca: Es calcula que la producció anual és de més de 4.000 milions de tones. El seu principal ús és la producció de formigó.

source: `Anónimo <https://commons.wikimedia.org/wiki/File:USMC-110806-M-IX060-148.jpg>`__ `CC0 Public Domain. <https://creativecommons.org/publicdomain/zero/1.0/deed.en>`__
ca: `Anonymous <https://commons.wikimedia.org/wiki/file:usmc-110806-m-ix060-148.jpg>`__ `cc0 domini públic. <https://creativecommons.org/publicdomain/zero/1.0/deed.en>`__

source: **Hormigón**
ca: ** Concrete **

source: Está formado por **cemento** mezclado con arena y grava.
ca: Està format per ** ciment ** barrejat amb sorra i grava.

source: El hormigón armado tiene una estructura interna de barras de acero para mejorar su resistencia.
ca: El formigó armat té una estructura interna de barres d’acer per millorar la seva resistència.

source: Se utiliza para hacer pilares y suelos en los edificios, carreteras, puentes, presas, puertos, etc.
ca: S'utilitza per fer pilars i terres en edificis, carreteres, ponts, preses, ports, etc.

source: `Dafran <https://commons.wikimedia.org/wiki/File:Hormigon-autonivelante.png>`__, `CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0/deed.en>`__, via Wikimedia Commons.
ca: `Dafran <https://commons.wikimedia.org/wiki/file:hormigon-autonivel.png>` __, `cc by-sa 4.0 <https://creatcommons.org/licenses/by-sa/4.0/deed.en>` `__, via wikimedia commons.

source: Pétreos cerámicos
ca: Stony Ceràmica

source: Están compuestos de un polvo fino mezclado con agua, con apariencia pastosa. Una vez modelado se hornea para unir entre sí las finas partículas por fusión.
ca: Estan compostos per una pols fina barrejada amb aigua, amb aspecte pastós. Una vegada que el modelat es cou al forn per unir -se a les partícules fines per fusió.

source: **Arcilla**
ca: ** Clay **

source: Es una roca sedimentaria formada por granos muy finos, menores de 0,004mm.
ca: És una roca sedimentària formada per grans molt fins, menys de 0,004 mm.

source: Fue la primera cerámica elaborada por los seres humanos y aún hoy es uno de los materiales más baratos y de más amplio uso.
ca: Va ser la primera ceràmica elaborada pels humans i encara avui és un dels materials més barats i àmpliament utilitzats.

source: Se utiliza para fabricar ladrillos, tejas, recipientes y para producir cemento.
ca: S'utilitza per fer maons, rajoles, contenidors i per produir ciment.

source: **Loza**
ca: ** Crockery **

source: Se fabrica con arcilla mezclada con arena. Es un material poroso igual que la arcilla, por lo que se suele recubrir con un barniz externo, el vidriado, que cristaliza en la cocción haciendo la pieza impermeable.
ca: Es fabrica amb argila barrejada amb sorra. És un material porós com l’argila, de manera que se sol cobrir amb un vernís extern, el vidre, que es cristal·litza en la cuina fent la peça impermeable.

source: Se utiliza para hacer vajillas.
ca: S'utilitza per fer plats.

source: `Lourdes Cardenal <https://commons.wikimedia.org/wiki/File:Cuenco_barro_ceramica_popular_lou.jpg>`__, `CC BY-SA 3.0 <https://creativecommons.org/licenses/by-sa/3.0/deed.en>`__, via Wikimedia Commons.
ca: `Lourdes Cardinal <https://commons.wikimedia.org/wiki/file:cuenco_barro_ceramica_popular_lou.jpg>` __, `cc by-sa 3.0 <https://creativecommns.org/licenses/by-sa/3.0/deed.en>` `` `` `` `` `` `` `` `` ` `` `` `` `` `` Wikimedia Commons.

source: **Gres**
ca: ** CONEWARE **

source: Es una mezcla de arcilla con materiales como el sílice que aportan una mayor resistencia mecánica y a la cocción (desgrasantes).
ca: És una barreja d’argila amb materials com la sílice que proporcionen una major resistència mecànica i cuina (pertorbacions).

source: Es un material muy duro e impermeable. Se utiliza sobre todo en la fabricación de baldosas para suelos.
ca: És un material molt dur i impermeable. S'utilitza principalment en la fabricació de rajoles del sòl.

source: Gres usado en la industria química.
ca: Conjunts utilitzats en la indústria química.

source: **Porcelana**
ca: ** Porellana **

source: Es un material cerámico generalmente blanco, duro, impermeable, translúcido, muy resistente a la corrosión, al choque térmico y mal conductor de la electricidad.
ca: És un material ceràmic generalment blanc, dur, impermeable, translúcid, molt resistent a la corrosió, el xoc tèrmic i el mal conductor de l’electricitat.

source: Formado por polvo de caolín, cuarzo y feldespato es el material cerámico más fino y parecido al vidrio.
ca: Format per pols de caolina, quars i feldspat és el material ceràmic més prim i similar al vidre.

source: Se utiliza para hacer vajillas, jarrones, aisladores eléctricos, inodoros, lavabos, etc.
ca: S'utilitza per fer plats, gerros, aïllants elèctrics, lavabos, lavabos, etc.

source: `Klausbo <https://commons.wikimedia.org/wiki/File:Transparent_porcelain.jpg>`__ Public Domain.
ca: `Klausbo <https://commons.wikimedia.org/wiki/file:transpare_porcelain.jpg>` __ domini públic.

source: Vidrio
ca: Vidre

source: Es un material que se obtiene fundiendo arena de sílice, piedra caliza y carbonato de sodio.
ca: És un material que s’obté fonent la sorra de sílice, la pedra calcària i el carbonat de sodi.

source: Se utiliza para hacer vajillas, botellas, cerramientos de ventanas, parabrisas, espejos, lentes, material de laboratorio, etc.
ca: S'utilitza per fabricar plats, ampolles, finestres, parabrisa, miralls, lents, material de laboratori, etc.

source: Con fibras de vidrio se pueden reforzar otros materiales (planchas de escayola, resinas plásticas, etc.) para que adquieran mayor resistencia mecánica.
ca: Amb fibres de vidre, es poden reforçar altres materials (plaques de guix, resines de plàstic, etc.) per adquirir una major resistència mecànica.

source: `Matthew Bowden. <https://commons.wikimedia.org/wiki/File:Colorful_bottle.jpg>`__ `CC BY-SA 3.0 <https://creativecommons.org/licenses/by-sa/3.0/deed.en>`__, via Wikimedia Commons.
ca: `Matthew Bowden. <https://commons.wikimedia.org/wiki/file:colorful_bottle.jpg>`__` cc by-sa 3.0 <https://creativecommons.org/licenses/by-s/3.0/deed.en>`__, a través de Wikimedia Commons.

source: Cuestionarios
ca: Qüestionaris

source: Cuestionarios de tipo test sobre los materiales pétreos.
ca: Test qüestionaris sobre materials de pedra.

source: `Los materiales pétreos I <../test/es-material-stone-1.html>`__.
ca: `Materials del ventre i <../test/es-material-Stone-1.html>`__.

source: `Los materiales pétreos II <../test/es-material-stone-2.html>`__.
ca: `Materials de Pestori II <../test/ES-Material-Stone-2.html>`__.

source: `Los materiales pétreos III <../test/es-material-stone-3.html>`__.
ca: `Materials de pestori III <../test/ES-Material-Stone-3.html>`__.
