Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/mecan-poleas.po
Languages: ca

source: :index:`Poleas` y :index:`Polipastos`
ca: : Índex: `pulleas` i: Índex:` PolypastOS '

source: Una polea es una máquina simple formada por una rueda acanalada por la que pasa una cuerda.
ca: Una politja és una màquina senzilla formada per una roda ranurada a través de la qual passa una corda.

source: Aplicaciones de las poleas
ca: Aplicacions de politges

source: La **función** de la polea es desviar la dirección y la posición de la cuerda y por lo tanto de la fuerza de tensión aplicada.
ca: La funció ** ** de la politja és desviar la direcció i la posició de la corda i, per tant, de la força de tensió aplicada.

source: De esta manera la cuerda de **un pozo** puede levantar un cubo de agua haciendo fuerza hacia abajo lejos del brocal, lo que significa una ventaja al poder tirar desde una posición más cómoda.
ca: D’aquesta manera, la corda ** Un pou ** pot elevar una galleda d’aigua fent que la força s’allunyi del Brocal, cosa que significa un avantatge per poder llançar d’una posició més còmoda.

source: Unas **cortinas** pueden abrirse y cerrarse tirando de dos cuerdas hacia abajo, al nivel de nuestra mano. La función de las poleas aquí es mover la fuerza desde el nivel de nuestra mano hasta el techo, donde se encuentra el raíl de las cortinas.
ca: Algunes ** cortines ** es poden obrir i tancar tirant dues cordes cap avall, al nivell de la nostra mà. La funció de les politges aquí és moure la força des del nivell de la nostra mà fins al sostre, on es troba el teló Raíl.

source: En todos los casos anteriores las poleas desvían la dirección y la posición de la fuerza, pero no reducen la fuerza necesaria para levantar el peso. Por lo tanto todas estas poleas necesitan que se estire el extremo de la cuerda con una fuerza de 60kgf (60 kilogramos-fuerza) para poder levantar los pesos.
ca: En tots els casos anteriors, les politges desvien la direcció i la posició de la força, però no redueixen la força necessària per aixecar el pes. Per tant, totes aquestes politges necessiten que el final de la corda s’estengui amb una força de 60 kgf (60 quilograms-força) per poder aixecar els pesos.

source: :index:`Polipastos`
ca: : Índex: `Polypastos '

source: Un polipasto está compuesto por al menos una polea móvil, enganchada en el peso que se quiere mover. El polipasto puede levantar pesos con ventaja mecánica, es decir, que podrá levantar un peso mayor que la fuerza aplicada sobre la cuerda.
ca: Un Polypest està format per almenys una politja mòbil, enganxat al pes que voleu moure. El Polypest pot elevar pesos amb avantatge mecànic, és a dir, pot aixecar un pes superior a la força aplicada a la corda.

source: Para calcular la fuerza necesaria para levantar el peso, hay que dividir el peso entre el número de tramos de cuerda que están tirando del peso hacia arriba.
ca: Per calcular la força necessària per augmentar el pes, el pes s’ha de dividir pel nombre de seccions de corda que augmenten el pes.

source: En los siguientes polipastos hay **2 tramos de cuerda** que tiran del peso hacia arriba y por lo tanto la fuerza que hay que realizar para levantar el peso se divide entre los dos tramos, con un resultado de 30kgf.
ca: A la següent facilitat, hi ha ** 2 seccions de corda ** que treuen el pes i, per tant, la força que es pot dur a terme per aixecar el pes està dividida per les dues seccions, amb un resultat de 30 kgf.

source: En los siguientes polipastos hay **3 tramos de cuerda** que tiran del peso hacia arriba y por lo tanto la fuerza que hay que realizar para levantar el peso se divide entre tres, con un resultado de 20kgf.
ca: A la següent facilitat, hi ha ** 3 trams de corda ** que treuen el pes cap amunt i, per tant, la força a dur a terme per aixecar el pes està dividida per tres, amb un resultat de 20kgf.

source: En los siguientes polipastos hay **4 tramos de cuerda** que tiran del peso hacia arriba y por lo tanto la fuerza que hay que realizar para levantar el peso se divide entre cuatro, con un resultado de 15kgf.
ca: En el següent Polypest hi ha ** 4 trams de corda ** que treuen el pes cap amunt i, per tant, la força a dur a terme per aixecar el pes està dividida per quatre, amb un resultat de 15kgf.

source: Hay que tener en cuenta que a veces las poleas de no están enganchadas al peso y por lo tanto no cuentan a la hora de calcular la fuerza con la que hay que tirar de la cuerda.
ca: Tingueu en compte que de vegades les politges no estan enganxades al pes i, per tant, no compten quan calculeu la força amb la qual heu de tirar la corda.

source: En el siguiente polipasto hay **2 tramos de cuerda** que tiran del peso hacia arriba y por lo tanto la fuerza que hay que realizar para levantar el peso se divide entre las dos, con un resultado de 30kgf.
ca: A la següent facilitat, hi ha ** 2 trams de corda ** que treuen el pes cap amunt i, per tant, la força que s’ha de dur a terme per aixecar el pes està dividida pels dos, amb un resultat de 30 kgf.

source: En el siguiente polipasto hay **3 tramos de cuerda** que tiran del peso hacia arriba y por lo tanto la fuerza que hay que realizar para levantar el peso se divide entre tres, con un resultado de 20kgf.
ca: A la següent facilitat, hi ha ** 3 trams de corda ** que treuen el pes cap amunt i, per tant, la força a dur a terme per aixecar el pes està dividida per tres, amb un resultat de 20kgf.

source: Polipastos anidados
ca: Pòlips nidius

source: Un polipasto puede tirar de la cuerda de otro polipasto y en ese caso nos encontramos con un polipasto anidado. Cada uno de los polipastos divide la fuerza que hay que realizar sobre la cuerda.
ca: Un Polypest pot tirar la corda d’una altra facilitat i en aquest cas trobem una polipasta imbricada. Cadascun dels polipastos divideix la força a dur a terme a la corda.

source: En el siguiente polipasto, la polea de abajo divide entre **dos tramos de cuerda** el peso de 60kg, por lo que la primera cuerda tendrá una tensión de solo 30kgf.
ca: En el següent Polypest, la politja inferior es divideix entre ** dos trams de corda ** el pes de 60kg, de manera que la primera corda tindrà una tensió només de 30 kgf.

source: La polea de arriba vuelve a dividir entre **dos tramos de cuerda** la fuerza de la primera cuerda, por lo que la tensión será de 15kgf. Esta será la fuerza F que hay que realizar para subir el peso.
ca: La politja superior es divideix entre ** dos trams de corda ** La força de la primera corda, de manera que la tensió serà de 15 kgf. Aquesta serà la Força F que s’ha de dur a terme per augmentar el pes.

source: Ejercicios
ca: Exercicis

source: Ejercicios de poleas y polipastos para calcular la fuerza con la que debemos tirar de la cuerda para levantar un peso.
ca: Pulleta i exercicis Polypest per calcular la força amb la qual hem de tirar la corda per aixecar un pes.

source: :download:`Ejercicios de poleas y polipastos. Formato PDF. <mecan/mecan-poleas-ejercicios.pdf>`
ca: : Descàrrega: `Pulleta i exercicis Polypest. Format PDF. <Mech/Mechaneas-ejercicios.pdf> '

source: :download:`Ejercicios de poleas y polipastos. Formato editable ODT. <mecan/mecan-poleas-ejercicios.odt>`
ca: : Descàrrega: `Pulleta i exercicis Polypest. Format editable ODT. <Mech/mecanis-ejercicios.odt> '
