Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/mecan-neumatic-pilotaje-neumatico.po
Languages: ca

source: Válvula con pilotaje neumático
ca: Vàlvula amb pilot pneumàtic

source: El pilotaje neumático consiste en mover una válvula de posición gracias a la fuerza del aire a presión.
ca: El pilot pneumàtic consisteix a moure una vàlvula de posició gràcies a la pressió de l’aire sota pressió.

source: A continuación puede verse el símbolo de una válvula con pilotaje neumático:
ca: A continuació, es pot veure el símbol d’una vàlvula amb pilot pneumàtic:

source: Símbolo de la válvula 5/2 con doble pilotaje neumático.
ca: Símbol de vàlvula 5/2 amb pilot pneumàtic doble.

source: El pilotaje neumático tiene dos grandes ventajas:
ca: El pilot pneumàtic té dos grans avantatges:

source: **Permite mover con facilidad grandes válvulas.**
ca: ** Permet moure les vàlvules grans fàcilment. **

source: Una válvula 5/2 para un cilindro grande debe ser también grande y, por lo tanto, difícil de mover manualmente. Gracias al pilotaje neumático una pequeña válvula fácil de manejar puede mover grandes válvulas sin apenas esfuerzo.
ca: Una vàlvula 5/2 per a un cilindre gran també ha de ser gran i, per tant, difícil de moure’s manualment. Gràcies a la pilotació pneumàtica, una vàlvula fàcil de manejar pot moure grans vàlvules sense gairebé cap esforç.

source: Válvula 5/2 grande y pesada con doble pilotaje neumático accionado por pequeñas válvulas 3/2 manuales.
ca: Vàlvula gran i pesada de 5/2 amb un pilot pneumàtic doble per petits manuals de 3/2.

source: **Permite automatizar los movimientos.**
ca: ** Permet els moviments d'automatització. **

source: Gracias al pilotaje neumático la propia instalación neumática puede accionar la válvula del cilindro para producir movimientos automáticos. Por ejemplo, una válvula de final de carrera neumática puede hacer que el vástago de un cilindro vuelva a entrar una vez que ha detectado que ha salido del todo.
ca: Gràcies a la pilota pneumàtica, la instal·lació pneumàtica pot conduir la vàlvula del cilindre per produir moviments automàtics. Per exemple, una vàlvula de córrer pneumàtica pot fer que la vareta d’un cilindre s’integri un cop hagi detectat que hagi sortit completament.

source: Válvula 5/2 con pilotaje neumático automático.
ca: Vàlvula 5/2 amb pilotatge pneumàtic automàtic.

source: Ejercicios
ca: Exercicis

source: Dibuja el símbolo de una válvula 5/2 con doble pilotaje neumático.
ca: Dibuixa el símbol d’una vàlvula 5/2 amb pilotació pneumàtica doble.

source: ¿Qué ventajas tiene el pilotaje neumático de las válvulas?
ca: Quins avantatges té la pilota pneumàtica de les vàlvules?

source: Dibuja el esquema de un cilindro de doble efecto, accionado por una válvula 5/2 de doble pilotaje neumático, que a su vez es pilotada por dos válvulas 3/2 manuales.
ca: Dibuixa l’esquema d’un cilindre d’efecte doble, impulsat per una vàlvula pilot pneumàtica de 5/2, que al seu torn és pilotada per dues vàlvules manuals 3/2.

source: Simula el funcionamiento del circuito anterior.
ca: Simula el funcionament del circuit anterior.

source: `Simulador de neumática. <../_static/flash/simulador-neumatica.html>`__
ca: `Simulador pneumàtic. <../_ static/flash/simulator-neumatica.html>`__

source: Explica el funcionamiento del circuito anterior y sus ventajas.
ca: Expliqueu el funcionament del circuit anterior i els seus avantatges.

source: Dibuja el esquema de un cilindro de doble efecto, accionado por una válvula 5/2 de doble pilotaje neumático, que a su vez es pilotada por una válvula 3/2 manual para que el cilindro salga y por una válvula de rodillo (de final de carrera) para que el cilindro entre.
ca: Dibuixeu l’esquema d’un cilindre de doble efecte, impulsat per una vàlvula pilot pneumàtica de 5/2, que al seu torn és pilotada per una vàlvula manual de 3/2 de manera que el cilindre surti i per una vàlvula de corró (Run -deD) de manera que el cilindre entre.

source: Recuerda utilizar las teclas de flecha derecha y flecha izquierda del teclado para girar los símbolos de las válvulas y de los escapes en el simulador.
ca: No oblideu utilitzar les tecles de fletxa dreta i la fletxa esquerra del teclat per girar els símbols de les vàlvules i escapar al simulador.
