Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/mecan-origami.po
Languages: ca

source: Papiroflexia de nivel inicial
ca: Papiroflexia de nivell inicial

source: Vídeo: `Pajarita de papel. <https://www.youtube-nocookie.com/embed/5zTV6KB_Ojo>`__
ca: Vídeo: `Paper Bow Tie. <https://www.youtube-nocokie.com/embed/5ztv6kb_ojo> `__

source: Vídeo: `Rana de papel. <https://www.youtube-nocookie.com/embed/qN-kqxSCMYA>`__
ca: Vídeo: `Franota de paper. <https://www.youtube-nocokie.com/embed/qn-kqxscmya>`__

source: Vídeo: `Cisne de papel. <https://www.youtube-nocookie.com/embed/74nzymLdanc>`__
ca: VÍDEO: `PAPER SWAN. <https://www.youtube-nocokie.com/embed/74nzymldanc>`__ __

source: Vídeo: `Foca de papel. <https://www.youtube-nocookie.com/embed/xCpSq5BAPXM>`__
ca: Vídeo: `Segell de paper. <https://www.youtube-nocokie.com/embed/xcpsq5bapxm> `__

source: Vídeo: `Pez de papel. <https://www.youtube-nocookie.com/embed/5HC-v-Lpluc>`__
ca: Vídeo: `Peix de paper. <https://www.youtube-nocokie.com/embed/5hc-v-lpluc> `__

source: Vídeo: `Grulla de papel. <https://www.youtube-nocookie.com/embed/LLbWxDWqtQg>`__
ca: Vídeo: `Grua de paper. <https://www.youtube-nocokie.com/embed/llbwxdwqtqg> `__

source: Papiroflexia de nivel medio
ca: Papiroflexia de nivell mitjà

source: Vídeo: `Tortuga de papel. <https://www.youtube-nocookie.com/embed/xbYMe2lNKNs>`__
ca: Vídeo: `Turtle de paper. <https://www.youtube-nocokie.com/embed/xbyme2lnkns> `__

source: Vídeo: `F15 Eagle Jet Fighter Paper Plane. <https://www.youtube-nocookie.com/embed/_WnAsrh3XvQ>`__
ca: VÍDEO: `F15 Eagle Jet Fighter Paper Plain. <https://www.youtube-nocokie.com/embed/_wnasrh3xvq>`__

source: POP-UP de papel
ca: Paper emergent de paper

source: Vídeo: `Pop-Up. Materiales Básico. <https://www.youtube-nocookie.com/embed/pqaJ1EClc2s>`__
ca: Vídeo: `Pop-up. Materials bàsics. <https://www.youtube-nocokie.com/embed/pqaj1eclc2s>`__

source: Vídeo: `Pop-Up. Paralelogramos y Triángulos. <https://www.youtube-nocookie.com/embed/43swfl1vACE>`__
ca: Vídeo: `Pop-up. Paral·lelogrames i triangles. <https://www.youtube-nocookie.com/embed/43swfl1vace>`__

source: Vídeo: `Pop-Up. Plegados en V. <https://www.youtube-nocookie.com/embed/Tgeubei8qzM>`__
ca: Vídeo: `Pop-up. Plegat a V. <https://www.youtube-nocoakie.com/embed/tgeubei8qzm>

source: Vídeo: `Pop-Up. Efecto de profundidad con paralelos. <https://www.youtube-nocookie.com/embed/Y0udGsGCP_0>`__
ca: Vídeo: `Pop-up. Efecte de profunditat amb paral·lels. <https://www.youtube-nocokie.com/embed/y0udgsgcp_0>`__

source: Flying man
ca: Home volador
