Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/mecan-maquinas-intro.po
Languages: ca

source: Introducción a los :index:`Mecanismos`
ca: Introducció a: Índex: `Mecanismes '

source: Se llama mecanismo a los dispositivos que reciben un movimiento de entrada (lineal, circular, alternativo) y lo transforman en otro movimiento de salida con las características deseadas.
ca: Els dispositius que reben un moviment d’entrada (lineal, circular, alternatiu) i el transformen en un altre moviment de sortida amb les característiques desitjades s’anomenen mecanisme.

source: Por ejemplo, la palanca de una cizalla recibe un movimiento de entrada con poca fuerza y mucho recorrido y lo transforma en un movimiento de salida en la tenaza de corte, con mucha fuerza y poco recorrido.
ca: Per exemple, la palanca de cisalla rep un moviment d’entrada amb poca força i molts viatges i el transforma en un moviment de sortida a la tenza tallada, amb gran força i poca ruta.

source: Clasificación de los mecanismos
ca: Classificació dels mecanismes

source: Los mecanismos se pueden clasificar según el tipo de movimiento que realizan de entrada y de salida.
ca: Els mecanismes es poden classificar segons el tipus de moviment que realitzen entrada i sortida.

source: Mecanismos de movimiento lineal
ca: Mecanismes de moviment lineal

source: Poleas y polipastos
ca: Politges i pòlips

source: Plano inclinado
ca: Avió inclinat

source: Palancas
ca: Postes

source: Mecanismos de movimiento giratorio
ca: Mecanismes de moviment rotatiu

source: Engranajes rectos
ca: Engranatges rectes

source: Engranajes cónicos
ca: Engranatges cònics

source: Poleas y correas
ca: Politges i corretges

source: Rueda dentada y cadenas
ca: Roda i cadenes Detada

source: Ruedas de fricción
ca: Rodes de fricció

source: Tornillo sin fin y corona
ca: Cargol i corona interminables

source: Árbol de transmisión y junta cardan
ca: Arbre de transmissió i articulació cardan

source: Mecanismos de movimiento lineal y giratorio
ca: Mecanismes de moviment lineal i rotatiu

source: Piñón y cremallera
ca: Piñón i Zipper

source: Torno
ca: Torn

source: Biela-manivela
ca: Roda de connexió de connexió

source: Cigüeñal
ca: Cigonyal

source: Leva y excéntrica
ca: Càmera i excèntric

source: Tornillo y tuerca
ca: Cargol i femella

source: Mecanismos auxiliares
ca: Mecanismes auxiliars

source: Cojinete y rodamiento
ca: Rodament i rodament

source: Carriles
ca: Vies

source: Junta giratorias
ca: Articulació giratòria

source: Acumulador de energía
ca: Acumulador d’energia

source: Embrague
ca: Aferrar -se

source: Freno
ca: Fre

source: Trinquete
ca: Trinquet
