Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/mecan-palancas.po
Languages: ca

source: :index:`Palancas`
ca: : Índex: `palanques '

source: La **palanca** es una máquina simple formada por una **barra rígida** que gira alrededor de un punto de apoyo llamado **fulcro**.
ca: La palanca ** ** és una màquina senzilla formada per una barra rígida ** ** que gira al voltant d’un punt de suport anomenat ** fulcro **.

source: Las palancas se pueden utilizar para realizar varias funciones:
ca: Les palanques es poden utilitzar per realitzar diverses funcions:

source: **Transmitir una fuerza** o un desplazamiento desde un punto a otro. Es el caso de unas tijeras que transmiten la fuerza y movimiento desde unos dedales adaptados a la mano, hasta la hoja de corte.
ca: ** Transmetre una força ** o un desplaçament d’un punt a un altre. Aquest és el cas de les tisores que transmeten la força i el moviment des d’algun didal adaptats a la mà, a la làmina de tall.

source: **Aumentar la fuerza** ejercida. Es el caso de un cascanueces o unos alicates.
ca: ** Augment de la força ** Exercit. Aquest és el cas d’un trencanous o d’algunes alicates.

source: **Aumentar el desplazamiento** aplicado. Es el caso de un remo o de una caña de pescar.
ca: ** Augmenta el desplaçament ** aplicat. Aquest és el cas d’un rem o d’una barra de pesca.

source: Dependiendo de la situación de la fuerza aplicada (F) de la resistencia a mover (R) y del fulcro (△) podemos distinguir tres tipos de palancas.
ca: Depenent de la situació de la força aplicada (F) de la resistència a moure (R) i al fulcro (△), podem distingir tres tipus de palanques.

source: Palancas de primer género
ca: Primeres palanques de gènere

source: Las palancas de primer género tienen el apoyo en el medio de la barra, entre la fuerza aplicada y la resistencia.
ca: Les primeres palanques de gènere tenen suport al mig de la barra, entre la força aplicada i la resistència.

source: Ejemplos de este tipo de palanca son un balancín, unas tijeras o unos alicates.
ca: Exemples d’aquest tipus de palanca són un balancí, unes tisores o alicates.

source: Palancas de segundo género
ca: Palanques de segon gènere

source: Las palancas de segundo género tienen la resistencia en el medio de la barra, entre el fulcro y la fuerza aplicada. El fulcro se encuentra en un extremo.
ca: El segon gènere les palanques de gènere tenen resistència al mig de la barra, entre el Fulcro i la Força Aplicada. El fulcro és en un extrem.

source: Ejemplos de este tipo de palanca son una carretilla, un cascanueces o un sacacorchos.
ca: Exemples d’aquest tipus de palanca són una carreta de rodes, un trencanous o un llevataps.

source: Palancas de tercer género
ca: Palanques del tercer gènere

source: Las palancas de tercer género tienen la fuerza aplicada en el medio de la barra, entre el fulcro y la resistencia. El fulcro se encuentra en un extremo.
ca: Les palanques del tercer gènere tenen la força aplicada al mig de la barra, entre el fulcro i la resistència. El fulcro és en un extrem.

source: Ejemplos de este tipo de palanca son unas pinzas de depilar, nuestro antebrazo cuando sube la mano o una caña de pescar.
ca: Exemples d’aquest tipus de palanca són les pinces en forma, el nostre avantbraç quan alça la mà o una barra de pesca.

source: Cálculo de fuerzas y distancias
ca: Càlcul de forces i distàncies

source: La fórmula para calcular las fuerzas y distancias involucradas en una palanca iguala los torques producidos por las fuerzas. El torque es el producto de una fuerza por su distancia al punto de apoyo, de manera que la fórmula queda como sigue.
ca: La fórmula per calcular les forces i les distàncies implicades en una palanca és igual als parells produïts per les forces. El parell és el producte d’una força per a la seva distància fins al punt de suport, de manera que la fórmula es manté de la manera següent.

source: Siendo
ca: Ésser

source: F1 = Fuerza aplicada 1
ca: F1 = força aplicada 1

source: d1 = Distancia desde la fuerza 1 hasta el punto de apoyo
ca: D1 = distància de la força 1 al punt de suport

source: F2 = Resistencia o fuerza 2
ca: F2 = resistència o força 2

source: d2 = Distancia desde la fuerza 2 hasta el punto de apoyo
ca: D2 = distància de la força 2 al punt de suport

source: Las distancias pueden medirse en metros, centímetros, milímetros, pulgadas, etc. Pero ambas distancias deben medirse siempre con la misma unidad.
ca: Les distàncies es poden mesurar en metres, centímetres, mil·límetres, polzades, etc. Però les dues distàncies sempre s’han de mesurar amb la mateixa unitat.

source: Las fuerzas pueden medirse en kilogramos-fuerza o en Newtons, siempre que ambas fuerzas se midan con la misma unidad.
ca: Les forces es poden mesurar en quilograms-Fork o en newtons, sempre que ambdues forces es mesurin amb la mateixa unitat.

source: Ejercicio alicates
ca: L’exercici s’alça

source: Como ejemplo, vamos a calcular la fuerza que realizan unos alicates a los que aplicamos una fuerza de 10kgf en el mango, con las siguientes distancias.
ca: Com a exemple, calcularem la força feta per les alicates a les quals apliquem una força de 10kgf al mango, amb les distàncies següents.

source: El primer paso será escribir los datos del problema y traducir los valores de distancia a la misma unidad, por ejemplo, en milímetros.
ca: El primer pas serà escriure les dades del problema i traduir els valors de distància a la mateixa unitat, per exemple, en mil·límetres.

source: A continuación escribimos la fórmula y sustituimos los valores conocidos.
ca: A continuació, escrivim la fórmula i substituïm els valors coneguts.

source: Por último despejamos la ecuación y calculamos el valor de la incógnita con las mismas unidades que tenía la fuerza conocida.
ca: Finalment, esborrem l’equació i calculem el valor del desconegut amb les mateixes unitats que havien conegut la força.

source: Ejercicio carretilla
ca: Exercici de xafarder

source: En este ejercicio vamos a calcular la fuerza que hay que realizar para levantar una carretilla que lleva en su interior un peso de 40kgf. Las dimensiones de la carretilla simplificada son las siguientes.
ca: En aquest exercici, calcularem la força que s’ha de dur a terme per aixecar una carretilla que porta dins d’un pes de 40 kgf. Les dimensions del camió simplificat són les següents.

source: El primer paso será escribir los datos del problema. En este caso no es necesario convertir las unidades de distancia, pues ambas distancias nos las dan en centímetros.
ca: El primer pas serà escriure les dades del problema. En aquest cas, no cal convertir les unitats de distància, ja que ambdues distàncies les donen a centímetres.

source: Como podemos ver, para calcular la distancia desde la fuerza 1 hasta el punto de apoyo es necesario sumar las dos distancias que aparecen en el dibujo.
ca: Com podem veure, per calcular la distància de la força 1 al punt de suport, cal afegir les dues distàncies que apareixen al dibuix.

source: Por último despejamos la ecuación y calculamos el valor de la incógnita (F1) con las mismas unidades que tenía la fuerza conocida, kilogramo-fuerza.
ca: Finalment, esborrem l’equació i calculem el valor de la desconeguda (F1) amb les mateixes unitats que havien conegut la força, la força de quilogram.

source: Ejercicios de palancas
ca: Exercicis de palanques

source: :download:`Ejercicio para identificar palancas de primero, segundo o tercer género. Formato PDF <mecan/mecan-palancas-02.pdf>`
ca: : Descarregueu: `Exercici per identificar palanques de primer, segon o tercer gènere. Format PDF <Mec/Mecan-Panancas-02.pdf> `

source: :download:`Ejercicio para identificar palancas de primero, segundo o tercer género. Formato DOC <mecan/mecan-palancas-02.doc>`
ca: : Descarregueu: `Exercici per identificar palanques de primer, segon o tercer gènere. Format DOC <mech/mecany-palancas-02.doc> '
