Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/mecan-neumatic-intro.po
Languages: ca

source: Introducción a la neumática
ca: Introducció a la pneumàtica

source: La neumática es la tecnología que emplea el aire comprimido como medio de transmisión de energía para mover mecanismos y máquinas.
ca: Pneumatics és la tecnologia que utilitza l’aire comprimit com a mitjà de transmissió d’energia per moure mecanismes i màquines.

source: Simulador de neumática
ca: Simulador pneumàtic

source: Teoría sobre neumática
ca: Teoria pneumàtica

source: Libro del CIDEAD
ca: Llibre Cidead

source: `Neumática e hidráulica I. <../_static/4esotecno/quincena9/pdf/quincena9.pdf>`__
ca: `Pneumàtic i hidràulic I. <../_ estàtic/4 esecto/finden9/pdf/finden9.pdf>` __

source: `Neumática e hidráulica II. <../_static/4esotecno/quincena10/pdf/quincena10.pdf>`__
ca: `Pneumàtic i hidràulica II. <../_ static/4 esecto/findend

source: Web Portal ESO
ca: Portal web eso

source: `Unidad didáctica neumática e hidráulica (PDF). <http://www.portaleso.com/neumatica/unidad_didactica_neumatica_4_v1_c.pdf>`__
ca: `Unitat didàctica pneumàtica i hidràulica (PDF). <http://www.portaleso.com/neumatica/unitat_didactica_neumatica_4_v1_c.pdf> `__

source: `Transparencias de la unidad didáctica neumática e hidráulica (PPT). <http://www.portaleso.com/neumatica/unidad_neumatica_4_v1_c.ppt>`__
ca: `Transparències de la unitat didàctica pneumàtica i hidràulica (PPT). <http://www.portaleso.com/neumatica/unitat_neumatica_4_v1_c.ppt>`__

source: Simulador de neumática Hopsan
ca: Simulador pneumàtic Hopsan

source: `Hopsan <https://liu.se/en/research/hopsan>`__ es una herramienta de simulación de sistemas, open-source, desarrollada por la Universidad de Linköping.
ca: `Hopsan <https://liu.se/en/research/hopsan>`__ És una eina de simulació del sistema, codi obert, desenvolupada per la Universitat de Linköping.

source: Vídeos de circuitos neumáticos
ca: Vídeos de circuit pneumàtic

source: Vídeo: `¿Qué es la NEUMÁTICA? | Documental del AIRE COMPRIMIDO <https://www.youtube-nocookie.com/embed/gu3u5TnuBx0>`__
ca: Vídeo: "Què és la pneumàtica? ; Documental aeri comprimit <https://www.youtube-nocokie.com/embed/gu3u5tnubx0> `` ``

source: Vídeo: `Neumática Industrial, ¿Cómo Trabaja un Sistema Neumático? <https://www.youtube-nocookie.com/embed/Wee85cI6wwQ>`__
ca: Vídeo: `Pneumàtic industrial, com funciona un sistema pneumàtic? <https://www.youtube-nocokie.com/embed/wee85ci6WWQ>`__

source: Vídeo: `Circuitos neumáticos. <https://www.youtube-nocookie.com/embed/PZUS_Eo4dKM>`__
ca: Vídeo: `Circuits pneumàtics. <https://www.youtube-nocoakie.com/embed/pzus_eo4dkm>`__

source: Vídeo: `NEUMÁTICA BÁSICA | INTRODUCCIÓN <https://www.youtube-nocookie.com/embed/gbQ3JBcjHFI>`__
ca: Vídeo: `Pneumàtic bàsic | Introducció <https://www.youtube-nocoakie.com/embed/gbq3jbcjhfi> `` ``
