Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/mecan-calibre.po
Languages: ca

source: El :index:`Calibre`
ca: El: Índex: `calibre '

source: El **calibre**, también llamado **pie de rey**, es un instrumento de medición de mayor precisión que una regla milimetrada.
ca: El calibre ** **, també anomenat ** King's Foot **, és un instrument de mesura de major precisió que una regla mil·límetre.

source: El calibre dispone de varias mordazas y una sonda con las que se pueden medir con facilidad diámetros exteriores, diámetros interiores y profundidades.
ca: El calibre té diverses mandíbules i una sonda amb què es poden mesurar fàcilment diàmetres exteriors, diàmetres i profunditats interiors.

source: Su **nonio** también llamado escala **vernier** es una escala auxiliar que permite la medición de distancias con una precisión desde 0.1 milímetros hasta 0.02 milímetros. Esta precisión mejora 10 veces o más la precisión de una regla milimetrada.
ca: El seu ** nonio ** també es diu escala ** vernier ** és una escala auxiliar que permet la mesura de distàncies amb precisió de 0,1 mil·límetres a 0,02 mil·límetres. Aquesta precisió millora 10 vegades o més la precisió d’una regla mil·límetre.

source: Partes del calibre
ca: Parts del calibre

source: Un calibre está compuesto de las siguientes partes:
ca: Un calibre es compon de les parts següents:

source: Partes de un calibre o pie de rey.
ca: Parts d’un calibre o peu del rei.

source: Mordazas para medir exteriores.
ca: Mesura a l'aire lliure.

source: Mordazas para medir interiores.
ca: Articulacions per mesurar interiors.

source: Sonda para medir profundidades.
ca: Sonda per mesurar les profunditats.

source: Escala principal milimetrada.
ca: Escala Milimetada principal.

source: Nonio para leer fracciones de milímetros.
ca: Nonio per llegir fraccions mil·límetres.

source: Botón de deslizamiento.
ca: Botó lliscant.

source: Tornillo de freno.
ca: Cargol de fre.

source: Corredera (parte móvil del calibre).
ca: Diapositiva (part mòbil del calibre).

source: Regla (parte fija del calibre).
ca: Regla (part fixa del calibre).

source: Corredera de un calibre moviéndose sobre la regla.
ca: Lliscament d’un calibre que avança sobre la regla.

source: Realización de medidas
ca: Realització de mesures

source: En las siguientes imágenes se puede ver cómo se toman medidas de exterior, interior y profundidad de una pieza.
ca: A les imatges següents podeu veure com es prenen les mesures exteriors, interiors i de profunditat d’una peça.

source: Calibre tomando una medida exterior.
ca: Calibre prenent una mesura exterior.

source: Calibre tomando una medida interior.
ca: Calibre prenent una mesura interior.

source: Calibre tomando una medida de profundidad.
ca: Calibre prenent una mesura de profunditat.

source: Medición con el nonio
ca: Mesura amb Nonio

source: La medida en milímetros de un calibre se puede observar en la escala principal, donde coincide con la marca de 0 del nonio.
ca: La mesura en mil·límetres d’un calibre es pot observar a l’escala principal, on coincideix amb la marca 0o del Nonio.

source: La medida en décimas de milímetro se puede observar en el punto donde una de las líneas del nonio coincide exactamente con una línea de la escala principal.
ca: La mesura en mil·límetre es pot observar en el punt on una de les línies noianes coincideix exactament amb una línia d’escala principal.

source: Medición de una distancia de 16,6 milímetros.
ca: Mesura d’una distància de 16,6 mil·límetres.

source: Medición de una distancia de 24,0 milímetros.
ca: Mesura d’una distància de 24,0 mil·límetres.

source: Medición de una distancia de 9,9 milímetros.
ca: Mesura d’una distància de 9,9 mil·límetres.

source: Simulación de un `calibre con precisión de 0.05 milímetros <https://www.stefanelli.eng.br/es/calibre-virtual-simulador-milimetro-05/>`__.
ca: Simulació d’un calibre amb precisió de 0,05 mil·límetres <https://www.stefanelli.eng.br/es/calibre-virtual-simulator-milimetro-05/> `__.

source: Ejercicios de medición
ca: Exercicis de mesurament

source: Lámina con ejercicios para realizar lecturas de distancias con el calibre
ca: Full amb exercicis per realitzar distàncies amb el calibre

source: :download:`Ejercicios de medidas con calibre. Formato PDF. <mecan/mecan-calibre-medidas.pdf>`
ca: : Descàrrega: `Exercicis de mesura amb calibre. Format PDF. <Mechalibre-Measured.pdf> '

source: Test de la unidad
ca: Test de prova

source: `Test online del calibre y sus componentes. <../test/es-mecan-calibre-partes.html>`__
ca: `Prova de calibre en línia i els seus components. <../test/es-Mecan-Calibre-partes.html>`__

source: `Test online de medidas con el calibre. <../test/es-mecan-calibre-medidas.html>`__
ca: `Proves de proves en línia amb calibre. <../test/es-Mecan-Calibre-Medidas.html>`__
