Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/mecan-neumatic-valvula-*.po
Languages: ca

source: La válvula selectora o válvula or
ca: La vàlvula del selector o o de la vàlvula

source: La **válvula selectora** o **válvula or** permite que el aire a presión circule desde cualquiera de las vías de ambos lados hacia la vía superior. Esta válvula no permite el paso del aire a presión desde la vía derecha hacia la vía izquierda o viceversa.
ca: La vàlvula de selecció ** ** o ** o ** permet que l’aire de pressió circuli des de qualsevol de les carreteres del camí superior. Aquesta vàlvula no permet que el pas de l’aire pressió es pretengui des de la pista dreta fins a la pista esquerra o viceversa.

source: El funcionamiento resumido puede explicarse diciendo que la válvula deja pasar el aire a presión cuando le llega aire a presión por la vía izquierda **o** por la vía derecha, de ahí su nombre.
ca: L’operació de resum es pot explicar dient que la vàlvula deixa que l’aire passi a pressió quan l’aire arribi a la pressió sobre la ruta esquerra ** o ** pel camí dret, d’aquí el seu nom.

source: El símbolo en reposo de la válvula selectora o válvula or es el siguiente:
ca: El símbol de repòs del selector o de la vàlvula de la vàlvula és el següent:

source: Válvula selectora o válvula or.
ca: Vàlvula o vàlvula de selecció o.

source: Cuando se inyecta aire a presión por la vía derecha, la bola central se moverá hacia la izquierda, permitiendo el paso del aire hacia la vía superior e impidiendo que el aire se escape por la vía izquierda.
ca: Quan s’injecta l’aire a la via dreta a la dreta, la bola central es desplaçarà a l’esquerra, permetent el pas de l’aire a la pista superior i impedeix que l’aire s’escapi a la ruta esquerra.

source: Válvula selectora con presión en la vía derecha.
ca: Vàlvula de selecció amb pressió sobre el camí correcte.

source: El funcionamiento es semejante cuando se le inyecta aire a presión en la vía izquierda, dejando pasar la presión por la vía superior y no permitiendo que pase aire a presión por la vía derecha.
ca: L’operació és similar quan s’injecta amb pressió a la pista esquerra, deixant que la pressió passi pel camí superior i no permeti que l’aire passi el camí dret.

source: Válvula selectora con presión en la vía izquierda.
ca: Vàlvula del selector amb pressió a la pista esquerra.

source: Cuando se inyecta aire a presión por las vías derecha e izquierda, el aire a presión sale por la vía superior.
ca: Quan s’injecta l’aire a pressió amb la pista dreta i esquerra, l’aire de pressió surt per la ruta superior.

source: Válvula selectora con presión en ambas vías de entrada.
ca: Vàlvula del selector amb pressió a les dues rutes d’entrada.

source: La válvula selectora es distinta a una simple unión de tubos porque impide que el aire a presión se escape por la vía que no tiene presión.
ca: La vàlvula del selector és diferent d’una simple unió de tubs perquè impedeix que l’aire de la pressió s’escapi per la ruta que no té pressió.

source: El funcionamiento de la válvula selectora o válvula or puede resumirse en la siguiente tabla de verdad o tabla lógica:
ca: El funcionament de la vàlvula del selector o de la vàlvula o es pot resumir a la taula de veritat següent o a la taula lògica:

source: Tabla de verdad con el funcionamiento de la válvula selectora o válvula or.
ca: Taula de veritat amb el funcionament de la vàlvula o de la vàlvula del selector.

source: Vía izquierda
ca: Ruta esquerra

source: Vía derecha
ca: Ruta dreta

source: Vía superior
ca: Camí superior

source: Sin presión (0)
ca: Sense pressió (0)

source: Con presión (1)
ca: Amb pressió (1)

source: Cilindro de simple efecto y válvula selectora
ca: Efecte senzill i cilindre de la vàlvula de selecció

source: En este circuito un cilindro de simple efecto es accionado por dos válvulas 3/2 indistintamente. Es decir, al accionar cualquiera de las dos válvulas el vástago del cilindro saldrá hacia fuera.
ca: En aquest circuit, un cilindre d'efecte simple s'activa per dues vàlvules 3/2 indistintament. És a dir, quan actuarà qualsevol de les dues vàlvules, sortirà la vareta del cilindre.

source: Cilindro de simple efecto con válvula selectora.
ca: Cilindre d'efecte senzill amb vàlvula de selecció.

source: En las siguientes figuras se puede ver al cilindro accionado desde la válvula izquierda y desde la válvula derecha.
ca: A les figures següents podeu veure el cilindre activat des de la vàlvula esquerra i des de la vàlvula dreta.

source: Cilindro de simple efecto con válvula selectora con presión por por la izquierda.
ca: Cilindre d'efecte senzill amb vàlvula de selecció amb pressió per l'esquerra.

source: Cilindro de simple efecto con válvula selectora con presión por la derecha.
ca: Cilindre d'efecte senzill amb vàlvula de selecció amb pressió a la dreta.

source: Es interesante comprobar cómo el aire a presión no se pierde a través del escape de las válvulas en reposo, porque la válvula selectora impide que el aire a presión salga por la vía que no tiene presión.
ca: És interessant verificar com no es perd l’aire de pressió a través de l’escapament de les vàlvules de repòs, perquè la vàlvula del selector impedeix que l’aire de la pressió surti per la ruta que no té pressió.

source: En el caso de accionar las dos válvulas, el vástago del cilindro también saldrá hacia fuera.
ca: En el cas d’operar les dues vàlvules, la vareta del cilindre també s’apagarà.

source: Funcionamiento de una unión de tubos
ca: Funcionament d'una unió de tubs

source: El funcionamiento de una unión de tubos neumáticos es algo parecida a la de una válvula selectora, con la diferencia de que la presión de una vía puede escaparse por la otra vía si esta se encuentra sin presión.
ca: El funcionament d’un tubs pneumàtics és una mica similar al d’una vàlvula seleccionista, amb la diferència que la pressió d’un camí es pot escapar d’una altra manera si no té pressió.

source: En el circuito anterior, el aire a presión que viene de la válvula izquierda llega al cilindro y hace salir su vástago, pero también se pierde presión por la válvula derecha que se encuentra conectada al escape.
ca: Al circuit anterior, l’aire de pressió que prové de la vàlvula esquerra arriba al cilindre i fa que la seva descendència s’apagui, però la pressió també es perd per la vàlvula dreta que està connectada a l’escapament.

source: El resultado final es que el aire a presión saldrá todo el tiempo por el escape de la válvula en reposo, haciendo mucho ruido y reduciendo la presión del tubo y la fuerza con la que sale el cilindro de simple efecto.
ca: El resultat final és que l’aire de pressió sortirà tot el temps a causa de la fugida de la vàlvula de descans, fent molt de soroll i reduint la pressió del tub i la força amb què surt el cilindre d’efecte senzill.

source: Unión de válvulas selectoras
ca: Unió de vàlvules de selecció

source: Las válvulas selectoras neumáticas se pueden disponer en cascada para unir más de dos válvulas neumáticas de control en una sola vía de salida de aire.
ca: Les vàlvules de selecció pneumàtica poden estar disponibles a la cascada per unir -se a més de dues vàlvules de control pneumàtic en una única ruta de sortida d'aire.

source: El funcionamiento de las válvulas en cascada es semejante al de una sola válvula. Si cualquiera de las vías laterales recibe aire a presión, este aire a presión se dirige hacia la vía superior.
ca: El funcionament de les vàlvules en cascada és similar al d’una sola vàlvula. Si alguna de les pistes laterals rep aire a pressió, aquest aire de pressió es dirigeix ​​cap al camí superior.

source: Unión de válvulas selectoras en cascada.
ca: Unió de vàlvules de selecció de Cascade.

source: Ejercicios
ca: Exercicis

source: Dibuja el símbolo en reposo de una válvula selectora neumática.
ca: Dibuixa el símbol de repòs d’una vàlvula de selecció pneumàtica.

source: Dibuja el funcionamiento de una válvula selectora neumática cuando recibe aire a presión por la vía derecha.
ca: Dibuixa el funcionament d’una vàlvula de selecció pneumàtica quan rep pressió al camí correcte.

source: Dibuja el funcionamiento de una válvula selectora neumática cuando recibe aire a presión por la vía izquierda.
ca: Dibuixa el funcionament d’una vàlvula de selecció pneumàtica en rebre aire a la pista esquerra.

source: Explica el funcionamiento de la válvula selectora y dibuja su tabla de verdad.
ca: Expliqueu el funcionament de la vàlvula del selector i dibuixeu la vostra taula de veritat.

source: Simula el funcionamiento de un cilindro de simple efecto con un vástago que debe salir al accionar una cualquiera de las **dos válvulas 3/2** de maniobra.
ca: Simula el funcionament d’un cilindre d’efecte senzill amb una vareta que ha d’anar quan actuen qualsevol de les dues vàlvules 3/2 ** maniobra.

source: `Simulador de neumática. <../_static/flash/simulador-neumatica.html>`__
ca: `Simulador pneumàtic. <../_ static/flash/simulator-neumatica.html>`__

source: Dibuja el circuito anterior en papel y explica su funcionamiento.
ca: Dibuixa el circuit de paper anterior i explica el seu funcionament.

source: Simula el funcionamiento de una unión de tubos neumáticos en el `simulador. <../_static/flash/simulador-neumatica.html>`__
ca: Simula el funcionament d’una unió de tubs pneumàtics al simulador. <../_ static/flash/simulator-neumatica.html>`__

source: ¿Qué diferencias hay entre una válvula selectora neumática y una unión de tubos neumáticos?
ca: Quines diferències hi ha entre una vàlvula de selecció pneumàtica i una unió de tubs pneumàtics?

source: ¿Para qué sirve la unión de válvulas selectoras neumáticas en cascada?
ca: Què serveix de les vàlvules del selector pneumàtic a la cascada?

source: Simula un circuito que tenga tres válvulas 3/2 que accionen un cilindro de simple efecto. El vástago del cilindro debe salir fuera cuando se accione cualquiera de las tres válvulas individuales.
ca: Simula un circuit que té tres vàlvules 3/2 que comparteixen un cilindre d’efecte senzill. La tija del cilindre ha de sortir quan qualsevol de les tres vàlvules individuals sigui acció.
