Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/mecan-engranajes.po
Languages: ca

source: :index:`Engranajes`
ca: :index:`Gears`

source: Un engranaje es un mecanismo compuesto por dos o más ruedas dentadas. Sirve para transmitir movimiento circular y para transformar la velocidad y la fuerza de giro.
ca: Un engranatge és un mecanisme format per dues o més rodes dentades. Serveix per transmetre el moviment circular i transformar la velocitat i la força de la rotació.

source: Si las dos ruedas son de distinto tamaño, la rueda mayor se denomina **corona** y la rueda menor se denomina **piñon**.
ca: Si les dues rodes tenen una mida diferent, la roda principal s’anomena ** corona ** i la roda menor s’anomena ** piñon **.

source: Engranaje de corona y piñón con flechas de sentido de giro.
ca: Corona i engranatge de pinyons amb fletxes de gir de gir.

source: Una de las aplicaciones más importantes de los engranajes es la transformación de la velocidad de giro desde un motor, generalmente rápido y con poco par motor, hasta la aplicación que ha de realizar trabajo, generalmente más lenta y con mayor par motor.
ca: Una de les aplicacions d’engranatges més importants és la transformació de la velocitat de rotació d’un motor, generalment ràpid i amb poc parell de motor, a l’aplicació que ha de fer funcionar, generalment més lent i amb un parell més gran.

source: Por ejemplo, con engranajes se transforma la velocidad de giro del motor de un automóvil a una velocidad menor y con mayor par motor de las ruedas del automóvil.
ca: Per exemple, amb els engranatges, la velocitat de rotació del motor d’un cotxe es transforma a una velocitat inferior i amb un parell més gran de les rodes del cotxe.

source: El par motor es equivalente a la 'fuerza' con la que gira un eje. La denominación fuerza de empuje se suele reservar para el caso de una fuerza que actúa en línea recta. En el caso de ejes giratorios, el par motor indica qué fuerza giratoria habría que aplicar a un metro de distancia del eje de giro para producir el mismo efecto.
ca: El parell del motor equival a la "força" amb la qual gira un eix. La força de disseny es reserva generalment en el cas d’una força que actua en línia recta. En el cas dels eixos giratoris, el parell del motor indica quina força rotativa s’ha d’aplicar a un metre de l’eix de rotació per produir el mateix efecte.

source: Por ejemplo, un motor de automóvil utilitario turbo diésel suele tener un par motor aproximado de 250 Newton·metro. Este par motor sería equivalente a empujar un eje giratorio con una palanca de un metro de longitud aplicando en el extremo 250 Newton (unos 25 kilogramos-fuerza).
ca: Per exemple, un motor de cotxe utilitari dièsel turbo sol tenir un motor aproximat de 250 Newton · Metro. Aquest parell motor equivalia a empènyer un eix rotatiu amb una palanca de palanca aplicant 250 Newton (uns 25 quilograms de força).

source: Los engranajes aumentan el par motor (la fuerza de giro) en la misma proporción que reducen la velocidad de giro. En el caso de un engranaje que aumente la velocidad de giro, el par motor se reducirá en la misma proporción. Estas proporciones se dan en todos los mecanismos que transforman movimientos.
ca: Els engranatges augmenten el parell (la força de rotació) en la mateixa proporció que redueix la velocitat de rotació. En el cas d’un engranatge que augmenti la velocitat de rotació, el parell del motor es reduirà en la mateixa proporció. Aquestes proporcions es produeixen en tots els mecanismes que transformen els moviments.

source: Un mecanismo que multiplique la fuerza, a la vez, reducirá la distancia o la velocidad del movimiento.
ca: Un mecanisme que multiplica la força, alhora, reduirà la distància o la velocitat de moviment.

source: Cálculo de engranajes
ca: Càlcul d’engranatges

source: La velocidad de giro de cada rueda dentada de un engranaje depende del número de dientes.
ca: La velocitat de rotació de cada dents d’un engranatge depèn del nombre de dents.

source: La fórmula que relaciona las velocidades de dos ruedas dentadas iguala el producto del número de dientes por la velocidad angular según la siguiente fórmula.
ca: La fórmula que relaciona les velocitats de dues rodes, és igual al nombre de dents del producte a causa de la velocitat angular segons la fórmula següent.

source: Siendo
ca: Ésser

source: Z1 = Dientes de la primera rueda dentada
ca: Z1 = dents de la primera roda dental

source: N1 = Velocidad angular de la primera rueda dentada
ca: N1 = Velocitat angular de la primera roda dental

source: Z2 = Dientes de la segunda rueda dentada
ca: Z2 = dents de la segona roda dental

source: N1 = Velocidad angular de la segunda rueda dentada
ca: N1 = Velocitat angular de la segona roda dental

source: La velocidad angular se suele medir en **revoluciones por minuto** también escrito como **rpm**, que significa el número de vueltas completas que gira la rueda en un minuto. Un motor típico suele tener una velocidad angular en un rango desde 1000 rpm hasta 6000 rpm.
ca: La velocitat angular es mesura generalment en les revolucions ** per minut ** també escrita com a ** rpm **, cosa que significa el nombre de girs complets que gira la roda en un minut. Un motor típic sol tenir una velocitat angular en un rang de 1000 rpm a 6.000 rpm.

source: Ejercicio aerogenerador
ca: Exercici aerogenerador

source: En este caso vamos a calcular un engranaje que sirve para multiplicar la velocidad de giro de un eje.
ca: En aquest cas, calcularem un engranatge que serveixi per multiplicar la velocitat de rotació d’un eix.

source: Un aerogenerador gira sus aspas a una velocidad de 20rpm y debe multiplicar esa velocidad hasta la velocidad del generador que es de 1000rpm. Si el piñón conectado al generador tiene 15 dientes ¿Cuántos dientes tendrá la corona?
ca: Un aerogenerador gira les fulles a una velocitat de 20rpm i ha de multiplicar aquesta velocitat a la velocitat del generador que és de 1000rpm. Si el pinyó connectat al generador té 15 dents. Quantes dents tindrà la corona?

source: El primer paso será escribir los datos del problema.
ca: El primer pas serà escriure les dades del problema.

source: Z_{2} = 15 \: dientes
ca: Z_ {2} = 15 \: dents

source: A continuación escribimos la fórmula y sustituimos los valores conocidos.
ca: A continuació, escrivim la fórmula i substituïm els valors coneguts.

source: Por último despejamos la ecuación y calculamos el valor de la incógnita.
ca: Finalment esborrem l’equació i calculem el valor del desconegut.

source: Z_{1} = 750 \: dientes
ca: Z_ {1} = 750 \: dents

source: En la práctica, cuando la relación entre los dientes es tan grande, se suelen utilizar trenes de engranajes con más de dos ruedas conectadas entre sí para reducir o aumentar la velocidad de giro en varias etapas.
ca: A la pràctica, quan la relació entre les dents és tan gran, els trens d’engranatges amb més de dues rodes connectades entre si se solen utilitzar per reduir o augmentar la velocitat de rotació en diverses etapes.

source: Tren de engranajes que reducen mucho la velocidad de giro del piñón
ca: Train d’engranatges que redueix considerablement la velocitat de gir del pinyó

source: Ejercicio automóvil eléctrico
ca: Exercici d'automòbils elèctrics

source: Un automóvil eléctrico tiene el motor conectado mediante un engranaje reductor a las ruedas. Sabemos que la velocidad máxima del motor es de 9000rpm y que la velocidad máxima de las ruedas es de 1500rpm. Si el número de dientes del engranaje más pequeño debe ser de 8 ó más dientes ¿Cuantos dientes debe tener cada engranaje?
ca: Un cotxe elèctric té el motor connectat mitjançant un equip de reducció a les rodes. Sabem que la velocitat màxima del motor és de 9000rpm i que la velocitat màxima de les rodes és de 1500rpm. Si les dents més petites de l’engranatge haurien de ser 8 o més dents. Quantes dents ha de tenir cada equip?

source: Este ejercicio permite varias soluciones válidas porque no especifica el tamaño del piñón.
ca: Aquest exercici permet diverses solucions vàlides perquè no especifica la mida del pinyó.

source: El primer paso será escribir los datos del problema. El motor estará conectado al primer engranaje y las ruedas al segundo engranaje.
ca: El primer pas serà escriure les dades del problema. El motor estarà connectat al primer engranatge i a les rodes al segon engranatge.

source: El engranaje 1 conectado al motor es el que gira más rápido y, por lo tanto, es el engranaje más pequeño de los dos. Ahora vamos a escoger un tamaño para este engranaje pequeño, que sea igual o mayor de 8 dientes.
ca: L’engranatge 1 connectat al motor és el que gira més ràpidament i, per tant, és l’engranatge més petit dels dos. Ara escollirem una mida per a aquest petit engranatge, que és igual o superior a 8 dents.

source: Z_{1} = 10 \: dientes
ca: Z_ {1} = 10 \: dents

source: Z_{2} = 60 \: dientes
ca: Z_ {2} = 60 \: dents

source: El número de dientes del segundo engranaje conectado a la rueda será de 60 dientes.
ca: El nombre de dents del segon engranatge connectat a la roda serà de 60 dents.
