Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/mecan-termicas.po
Languages: ca

source: Máquinas Térmicas
ca: Màquines tèrmiques

source: Las máquinas térmicas han sido el principal motor que ha revolucionado la sociedad en el siglo XX. En la actualidad todavía se utilizan en automoción y en la generación de electricidad aunque poco a poco se van viendo sustituidas por los motores eléctricos.
ca: Les màquines tèrmiques han estat el principal motor que la societat ha revolucionat al segle XX. Actualment encara s’utilitzen en automoció i en la generació d’electricitat, tot i que a poc a poc són substituïts per motors elèctrics.

source: Máquina de vapor
ca: Motor de vapor

source: Gran motor de vapor moviendo los telares de una fábrica.
ca: Una gran màquina de vapor que trasllada els telers d’una fàbrica.

source: Vídeo: `Big Steam Engine. <https://www.youtube-nocookie.com/embed/ZPWQiAS6kd8>`__
ca: Vídeo: `Big Steam Motor. <https://www.youtube-nocokie.com/embed/zpwqias6kd8> `__

source: Vídeo: `Pequeño motor de vapor de 1890. <https://www.youtube-nocookie.com/embed/TSxTVFHOt4I>`__
ca: Vídeo: `Petit motor de vapor de 1890.

source: Vídeo: `Locomotora de vapor. <https://www.youtube-nocookie.com/embed/MvQJ7Eeu9Ck>`__
ca: Vídeo: `Locomotora de Steam. <https://www.youtube-nocokie.com/embed/mvqj7eu9ck>`__

source: Vídeo: `Exposición de tractores a vapor. <https://www.youtube-nocookie.com/embed/xSl6NaMzfTc>`__
ca: Vídeo: `Exposició de tractors de vapor. <https://www.youtube-nocookie.com/embed/xsl6namzftc>`__

source: Vídeo: `Automóvil a vapor. <https://www.youtube-nocookie.com/embed/GtxA5a9F9QQ>`__
ca: Vídeo: `Carroteó de vapor. <https://www.youtube-nocokie.com/embed/gtxa5a9f9qq>`__

source: Vídeo: `Barco a vapor. <https://www.youtube-nocookie.com/embed/jCWIy15SvUg>`__
ca: VÍDEO: `STEAM Ship. <https://www.youtube-nocokie.com/embed/jcwiy15svug>`__

source: Motor de explosión
ca: Motor d'explosió

source: Vídeo: `Explicación del motor de 4 tiempos. <https://www.youtube-nocookie.com/embed/segzLXBXOFA>`__
ca: VÍDEO: `Explicació del motor de 4 partits. <https://www.youtube-nocokie.com/embed/segzlxbxofo>`__

source: Vídeo: `Principio de motores a gasolina. <https://www.youtube-nocookie.com/embed/CE68N3hSa_Y>`__
ca: Vídeo: `Principi de motors de gasolina. <https://www.youtube-nocoakie.com/embed/ce68n3hsa_y>`__

source: Vídeo: `Motor diésel de barco. <https://www.youtube-nocookie.com/embed/S0CAroqh-IU>`__
ca: Vídeo: `motor dièsel del vaixell. <https://www.youtube-nocoakie.com/embed/s0caroqh-iu>`__

source: Motor a reacción
ca: Motor de reacció

source: Vídeo: `Cómo funciona un motor a reacción. <https://www.youtube-nocookie.com/embed/Y_0Z3xHfUVE>`__
ca: Vídeo: `Com funciona un motor de reacció. <https://www.youtube-nocokie.com/embed/y_0z3xhfuve>`__

source: Vídeo: `¿Cómo funciona un turborreactor? ¿Qué es un turbofan, y postcombustión? <https://www.youtube-nocookie.com/embed/XDkqcTQTCr4>`__
ca: Vídeo: "Com funciona un turboreactor? Què és un turbofan i postcomustió? <https://www.youtube-nocoakie.com/embed/xdkqctqtcr4>`__
