Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/mecan-neumatic-doble-efecto.po
Languages: ca

source: Cilindro de doble efecto
ca: Cilindre d'efecte de doble efecte

source: Un cilindro de **doble efecto** es un cilindro que tiene dos vías de entrada y salida de aire. El vástago puede salir con fuerza cuando se inyecta aire en la parte trasera y puede entrar con fuerza cuando se inyecta aire en la parte delantera.
ca: Un cilindre ** Dual ** ** és un cilindre que té dues vies respiratòries d’entrada i sortida d’aire. La tija pot sortir amb força quan s’injecta l’aire a la part posterior i pot entrar amb força quan s’injecta l’aire a la part davantera.

source: La fuerza de salida del vástago siempre es un poco mayor que la fuerza de entrada porque el aire comprimido no puede hacer presión sobre la zona que ocupa el vástago. Si inyectamos aire a presión en las dos vías del cilindro, este saldrá hacia fuera con poca fuerza.
ca: La força de sortida de la tija sempre és una mica més gran que la força d’entrada perquè l’aire comprimit no pot pressionar la zona ocupada per la descendència. Si injectem aire de pressió a les dues rutes del cilindre, quedarà amb poca força.

source: En el caso de que el cilindro de doble efecto no tenga presión de aire en ninguna de sus dos vías, no tendrá fuerza en ningún sentido y se podrá mover libremente sin esfuerzo, tanto dentro como fuera.
ca: En cas que el cilindre de doble efecte no tingui pressió de l’aire en cap de les seves dues maneres, no tindrà força de cap manera i es pot moure lliurement sense esforç, tant dins com fora.

source: Los cilindros de doble efecto se comandan mediante una **válvula 4/2** o mediante una **válvula 5/2**. Ambas válvulas son semejantes y solo se diferencian en el número de escapes que poseen (un escape la válvula 4/2 y dos escapes la válvula 5/2).
ca: Els cilindres d'efecte doble estan comandats per una vàlvula ** 4/2 ** o per una vàlvula ** 5/2 **. Les dues vàlvules són similars i només difereixen en el nombre d’escapament que posseeixen (una escapada de la 4/2 i dues s’escapa de la vàlvula 5/2).

source: A continuación se muestra el esquema en reposo del cilindro de doble efecto:
ca: A continuació es mostra l’esquema de descans del cilindre d’efecte doble:

source: Cuando accionamos la válvula 5/2, el aire que proviene de la unidad de mantenimiento pasa hacia la vía superior izquierda de la válvula y entra en la parte posterior del cilindro. Como consecuencia, el cilindro se llena de aire en la parte trasera mientras el aire de la parte delantera se escapa a la atmósfera. El resultado es que el vástago del cilindro sale hacia fuera empujando la carga que se encuentre delante.
ca: Quan activem la vàlvula 5/2, l’aire que prové de la unitat de manteniment passa al camí superior esquerre de la vàlvula i entra a la part posterior del cilindre. Com a conseqüència, el cilindre s’omple d’aire a la part posterior mentre que la part frontal s’escapa de l’atmosfera. El resultat és que la vareta del cilindre surt empenyent la càrrega que hi ha al davant.

source: Una vez que el vástago ha salido hasta el tope, nos encontramos con el siguiente esquema:
ca: Una vegada que la descendència hagi estat al capdamunt, trobem el següent esquema:

source: Ejercicios
ca: Exercicis

source: Explica las características principales de un cilindro de doble efecto.
ca: Expliqueu les característiques principals d’un cilindre d’efecte de doble efecte.

source: Dibuja un esquema de un cilindro de doble efecto en reposo, con el vástago dentro, comandado por una válvula 5/2.
ca: Dibuixeu un esquema d’un cilindre d’efecte doble en repòs, amb la tija dins, comandat per una vàlvula 5/2.

source: Dibuja un esquema de un cilindro de doble efecto accionado, con el vástago fuera, comandado por una válvula 5/2.
ca: Dibuixa un esquema d’un cilindre d’efecte doble, amb la tija fora, comandat per una vàlvula 5/2.

source: Simula el funcionamiento de un cilindro de doble efecto comandado por una válvula 5/2.
ca: Simula el funcionament d’un cilindre de doble efecte comandat per una vàlvula 5/2.

source: ¿Qué ocurrirá si quitamos los escapes de la válvula 5/2? Simula el funcionamiento. Explica cómo cambia el funcionamiento al retirar el escape y explica porqué se comporta de esa manera.
ca: Què passarà si traiem les escapades de la vàlvula 5/2? Simula l'operació. Expliqueu com canvia l’operació quan es manté la fugida i explica per què es comporta així.

source: Explica el funcionamiento del circuito:
ca: Expliqueu el funcionament del circuit:

source: ¿Qué puede pasar en el circuito anterior si accionamos las dos válvulas a la vez?
ca: Què pot passar al circuit anterior si activem les dues vàlvules alhora?

source: ¿Qué puede pasar en el circuito anterior si no accionamos ninguna válvula 3/2?
ca: Què pot passar al circuit anterior si no actuem amb cap vàlvula 3/2?
