Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/mecan-tornillos.po
Languages: ca

source: :index:`Tornillos`
ca: : Índex: `cargols '

source: Un tornillo es una máquina simple formada por un plano inclinado que se encuentra enrollado alrededor de un eje cilíndrico.
ca: Un cargol és una màquina senzilla formada per un pla inclinat que s’inscriu al voltant d’un eix cilíndric.

source: Tornillo y tuerca hexagonal.
ca: Cargol i femella hexagonal.

source: `Afrank99 <https://commons.wikimedia.org/wiki/File:M4_Inbusschraube_focusstacked.jpg>`__, `CC BY-SA 3.0 <https://creativecommons.org/licenses/by-sa/3.0/deed.en>`__, via Wikimedia Commons.
ca: `AFRANK99 <https://commons.wikimedia.org/wiki/file:m4_inbusschraube_focusstacked.jpg>` __, `cc by-sa 3.0 <https://creatcommns.org/licenses/by-sa/3.0/deed.en>` `` `` `` `` `` `` `` `` `` `` `` `` `` ` `` `` `` `Wikimedia Commons.

source: Partes de un tornillo
ca: Parts d’un cargol

source: La denominación de las diferentes partes del tornillo es la siguiente.
ca: La denominació de les diferents parts del cargol és la següent.

source: Vástago
ca: Tija

source: Pieza cilíndrica del tornillo donde se tallan los surcos de la rosca.
ca: El tros cilíndric del cargol on estan tallats els rugits del fil.

source: Cuello
ca: Coll

source: Parte del vástago del tornillo sin tallar.
ca: Part de la tija de cargol desconeguda.

source: Rosca
ca: Fil

source: Es el plano inclinado enrollado de forma helicoidal alrededor del vástago.
ca: És el pla inclinat inscrit en forma helicoïdal al voltant de la tija.

source: Cabeza del tornillo
ca: Cargol

source: Es la parte extrema del tornillo, utilizada para girar la rosca. Suele ser de forma cuadrada o hexagonal en tornillos grandes.
ca: És la part extrema del cargol, que s’utilitza per girar el fil. Normalment és quadrat o hexagonal en cargols grans.

source: Filete
ca: Filial

source: Es la parte saliente del surco de la rosca.
ca: És la part sortint de la ranura del fil.

source: Paso
ca: Aprovada

source: Es la distancia que hay entre dos crestas consecutivas de la rosca.
ca: És la distància entre dues crestes consecutives del fil.

source: Tuerca
ca: Nou

source: Es una pieza mecánica con un orificio roscado que se acopla al tornillo. La tuerca suele tener una forma cuadrada o hexagonal para facilitar su giro mediante llaves de apriete.
ca: És una peça mecànica amb un forat roscat que s’uneix al cargol. La femella sol tenir una forma quadrada o hexagonal per facilitar el seu gir a través de les claus d’ajustament.

source: Partes de un tornillo y tuerca hexagonal.
ca: Parts d’un cargol i femella hexagonal.

source: Aplicaciones de los tornillos
ca: Aplicacions de cargol

source: Uniones desmontables
ca: Unions desmuntables

source: Una de las aplicaciones de los tornillos consiste en realizar uniones desmontables.
ca: Una de les aplicacions dels cargols és fer articulacions extraïbles.

source: Por ejemplo la carcasa de un ordenador está unida con tornillos.
ca: Per exemple, una carcassa d’ordinador està enllaçada amb cargols.

source: Mecanismos que avanzan con precisión
ca: Mecanismes que avancen amb precisió

source: Los tornillos permiten realizar movimientos de mucha precisión.
ca: Els cargols permeten moviments de precisió.

source: Por ejemplo un tornillo de un grifo giratorio permite abrir el paso de agua con mucha precisión. Otro ejemplo son las sillas a tornillo que se pueden subir o bajar con precisión dando vueltas al asiento.
ca: Per exemple, un cargol de l’aixeta rotativa permet obrir el pas de l’aigua amb una gran precisió. Un altre exemple són les cadires de cargol que es poden pujar o baixar amb cercle de precisió.

source: Mecanismos para mover con fuerza
ca: Mecanismes per moure’s amb la força

source: Otra gran aplicación de los tornillos es construir mecanismos que avanzan con mucha **fuerza**.
ca: Una altra gran aplicació de cargols és crear mecanismes que avancin amb molta força ** **.

source: Por ejemplo, el mecanismo de un gato mecánico para levantar automóviles está basado en un tornillo que mueve unas tijeras.
ca: Per exemple, el mecanisme d’un gat mecànic per aixecar els cotxes es basa en un cargol que mou les tisores.

source: Gato mecánico para levantar automóviles, con un tornillo que mueve el mecanismo.
ca: Cat mecànic per aixecar els cotxes, amb un cargol que mou el mecanisme.

source: `Interiot <https://commons.wikimedia.org/wiki/File:Jackscrew.gif>`__, Public Domain, via Wikimedia Commons.
ca: `Interiot <https://commons.wikimedia.org/wiki/file:jackscrew.gif>`__, domini públic, a través de Wikimedia Commons.

source: Cálculo de tornillos
ca: Càlcul de cargol

source: Los parámetros de un tornillo son su **paso** o distancia entre dos filetes, el número de vueltas de **giro** y el **avance** lineal que se consigue al girar. La fórmula que relaciona estas variables es la siguiente.
ca: Els paràmetres d’un cargol són el seu ** pas ** o la distància entre dos filets, el nombre de girs de ** gir ** i l’avanç lineal ** ** que s’aconsegueix en girar. La fórmula que relaciona aquestes variables és la següent.

source: Avance = Giro \cdot Paso
ca: Progress = Turn \ CDOT Pas

source: Siendo
ca: Ésser

source: Avance = distancia lineal que recorre el tornillo en milímetros
ca: Progrés = distància lineal que recorre el cargol en mil·límetres

source: Giro = número de vueltas que gira el tornillo
ca: Giro = nombre de girs que gira el cargol

source: Paso = distancia que avanza el tornillo por cada vuelta que gira
ca: Pas = distància que avança el cargol per cada retorn que gira

source: Tanto el **Avance** como el **Paso** deben estar expresados en las mismas unidades de distancia, normalmente milímetros.
ca: Tant el ** Advance ** com el ** pas ** s’han d’expressar a les mateixes unitats de distància, normalment mil·límetres.

source: Ejercicio silla
ca: Exercici de la cadira

source: Una silla de taller se eleva mediante un tornillo con una rosca de paso igual a 4 milímetros por vuelta. Si queremos elevar la silla 6 centímetros ¿Cuántas vueltas será necesario dar al tornillo?
ca: Una cadira de taller s’aixeca amb un cargol amb un fil igual a 4 mil·límetres per volta. Si volem augmentar la cadira 6 centímetres, quantes voltes serà necessari donar el cargol?

source: Para resolver el problema, escribimos primero los datos de los que disponemos, convirtiendo todas las distancias a la misma unidad.
ca: Per solucionar el problema, primer escrivim les dades que tenim, convertint totes les distàncies a la mateixa unitat.

source: Avance = 6 cm = 60 \: mm
ca: Advance = 6 cm = 60 \: mm

source: Paso = 4 \: mm / vuelta
ca: Pas = 4 \: mm / return

source: A continuación escribimos la fórmula y sustituimos las cantidades conocidas.
ca: A continuació, escrivim la fórmula i substituïm les quantitats conegudes.

source: 60 \: mm = Giro \cdot 4 \: mm / vuelta
ca: 60 \: mm = gir \ cdot 4 \: mm / return

source: Para finalizar, despejamos la incógnita para hallar el resultado.
ca: Finalment, esborrem el desconegut de trobar el resultat.

source: Giro = \cfrac{60}{4} = 15 \: vueltas
ca: Turn = \ Cfrac {60} {4} = 15 \: Turna

source: Ejercicio tornillo de banco
ca: Exercici de cargol bancari

source: Un tornillo de banco se abre una distancia de 12 centímetros tras girar la manivela un total de 24 vueltas. ¿Cuál es el paso del tornillo?
ca: Un cargol bancari obre una distància de 12 centímetres després de girar la manivela un total de 24 voltes. Quin és el pas del cargol?

source: Avance = 12 cm = 120 \: mm
ca: Advance = 12 cm = 120 \: mm

source: Giro = 24 \: vueltas
ca: Giro = 24 \: girs

source: 120 \: mm = 24 \: vueltas \cdot Paso
ca: 120 \: mm = 24 \: gira \ cdot pas

source: Paso = \cfrac{120}{24} = 5 \: mm / vuelta
ca: Pas = \ cfrac {120} {24} = 5 \: mm / return

source: Ejercicio tornillo de microscopio
ca: Exercici de cargol del microscopi

source: Un microscopio dispone de un tornillo para subir y bajar la platina y poder enfocar correctamente el objeto a visualizar. Si el paso del tornillo es de 0.5 milímetros y realizamos un giro de 16 vueltas ¿cuánto avanzará la platina?
ca: Un microscopi té un cargol per aixecar i baixar el pla i centrar correctament l’objecte a visualitzar. Si el pas del cargol és de 0,5 mil·límetres i fem un gir de 16 anys, quant avançaran les plaques?

source: Paso = 0.5 \: mm / vuelta
ca: Pas = 0,5 \: mm / return

source: Giro = 16 \: vueltas
ca: Giro = 16 \: gira

source: Avance = 16 \: vueltas \cdot 0.5 \: mm / vuelta
ca: Advance = 16 \: gira \ cdot 0.5 \: mm / return

source: Para finalizar, no hace falta despejar y podemos calcular directamente el resultado.
ca: Finalment, no cal esborrar i podem calcular directament el resultat.

source: Avance = 8 \: mm
ca: Advance = 8 \: mm
