Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/mecan-neumatic-simple-efecto.po
Languages: ca

source: Cilindro de simple efecto
ca: Cilindre d'efecte senzill

source: Un cilindro de **simple efecto** es un cilindro cuyo vástago sale fuera debido al aire comprimido que se inyecta en la parte trasera.
ca: Un cilindre d’efecte ** simple ** és un cilindre que la tija s’apaga a causa de l’aire comprimit que s’injecta a la part posterior.

source: El movimiento de entrada del vástago se realiza gracias a un muelle que dispone de poca fuerza, por lo que no sirve para mover cargas externas.
ca: El moviment d’entrada de tija es fa gràcies a una molla que té poca força, de manera que no serveix per moure les càrregues externes.

source: Este cilindro puede hacer fuerza hacia fuera, pero apenas hace fuerza al moverse hacia dentro.
ca: Aquest cilindre pot fer força, però amb prou feines fa força quan es mou.

source: Los cilindros de simple efecto se comandan mediante una **válvula 3/2** que puede inyectar aire comprimido por una vía o dejar escapar el aire comprimido del cilindro por esa misma vía hacia la atmósfera.
ca: Els cilindres d'efecte simple estan comandats per una vàlvula ** 3/2 ** que pot injectar aire comprimit per una pista o deixar que l'aire comprimit del cilindre s'escapi a través de la mateixa ruta cap a l'atmosfera.

source: A continuación se muestra el esquema en reposo del cilindro de simple efecto:
ca: A continuació es mostra l’esquema de descans del cilindre d’efectes simples:

source: Cuando accionamos la válvula 3/2, el aire que proviene de la unidad de mantenimiento pasa hacia la vía superior de la válvula y entra en la parte posterior del cilindro. Como consecuencia, el cilindro se llena de aire y el pistón sale del cilindro empujando la carga que tenga delante:
ca: Quan activem la vàlvula 3/2, l’aire que prové de la unitat de manteniment passa a la carretera de la vàlvula superior i entra a la part posterior del cilindre. Com a conseqüència, el cilindre s’omple d’aire i el pistó deixa el cilindre pressionant la càrrega al davant:

source: Para finalizar, al llevar a reposo la válvula 3/2, el aire comprimido del interior del cilindro vuelve hacia atrás y sale por la vía de escape de la válvula 3/2:
ca: Finalment, quan es pren la vàlvula 3/2, l’aire comprimit dins del cilindre torna i deixa la ruta d’escapament de la vàlvula 3/2:

source: Ejercicios
ca: Exercicis

source: Explica las características principales de un cilindro de simple efecto.
ca: Expliqueu les característiques principals d’un cilindre d’efecte senzill.

source: Dibuja un esquema de un cilindro de simple efecto en reposo, comandado por una válvula 3/2.
ca: Dibuixa un esquema d’un simple cilindre de repòs, comandat per una vàlvula 3/2.

source: Dibuja un esquema de un cilindro de simple efecto accionado, comandado por una válvula 3/2.
ca: Dibuixa un esquema d’un cilindre d’efecte senzill, comandat per una vàlvula 3/2.

source: Simula el funcionamiento de un cilindro de simple efecto comandado por una válvula 3/2.
ca: Simula el funcionament d’un cilindre d’efecte simple comandat per una vàlvula 3/2.

source: `Simulador de neumática. <../_static/flash/simulador-neumatica.html>`__
ca: `Simulador pneumàtic. <../_ static/flash/simulator-neumatica.html>`__

source: ¿Qué ocurrirá si quitamos el escape de la válvula 3/2? Simula el funcionamiento. Explica cómo cambia el funcionamiento al retirar el escape y explica porqué se comporta de esa manera.
ca: Què passarà si traiem la fugida de la vàlvula 3/2? Simula l'operació. Expliqueu com canvia l’operació quan es manté la fugida i explica per què es comporta així.

source: Escape neumático.
ca: Escapada pneumàtica.

source: Utiliza dos válvulas 3/2 para hacer funcionar un cilindro de simple efecto en el `simulador. <../_static/flash/simulador-neumatica.html>`__ Solo una de las válvulas tendrá escape.
ca: Utilitzeu dues vàlvules 3/2 per operar un cilindre d'efecte senzill al simulador. <../_ static/flash/simulator-neumatica.html>`__ només s'escaparà una de les vàlvules.

source: Explica el funcionamiento del circuito:
ca: Expliqueu el funcionament del circuit:
