Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/mecan-neumatic-valvula-antirretorno.po
Languages: ca

source: La válvula antirretorno
ca: La vàlvula anti -retrobament

source: Una válvula antirretorno, también llamada válvula de retención, tiene la tarea de permitir el paso del aire a presión en un sentido y cortar por completo el paso del aire a presión en el sentido contrario.
ca: Una vàlvula antirretorne, també anomenada vàlvula de retenció, té la tasca de permetre que l’aire pressió en una direcció i tallant completament el pas de la pressió en sentit contrari.

source: Su posición suele ser la que aparece en los siguientes símbolos, por lo que estas válvulas permiten la circulación de aire a presión hacia arriba y cortan el paso del aire a presión hacia abajo:
ca: La seva posició sol ser la que apareix en els símbols següents, de manera que aquestes vàlvules permeten la circulació de l’aire cap a la pressió cap amunt i talleu el pas de l’aire a la pressió cap avall:

source: Símbolos de la válvula antirretorno cerrada y abierta.
ca: Els símbols anti -retrobs tancats i oberts.

source: La construcción interna de estas válvulas puede hacerse con una esfera y un cono como el de un embudo en el que encaja la esfera.
ca: La construcció interna d’aquestes vàlvules es pot fer amb una esfera i un con com el d’un embut en el qual s’ajusta l’esfera.

source: Cuando el aire a presión llega desde arriba, la esfera se enclava en el embudo gracias a la presión del muelle y del propio aire a presión. En esta posición la esfera no permite el paso de aire hacia abajo:
ca: Quan l’aire a pressió arriba des de dalt, l’esfera és enclava a l’embut gràcies a la pressió de la molla i l’aire a la pressió. En aquesta posició, l'esfera no permet el pas de l'aire cap avall:

source: Válvula antirretorno cerrada.
ca: Vàlvula anti -retrobament tancada.

source: Cuando el aire a presión llega desde abajo, la esfera se levanta por la presión del aire (mucho mayor que la fuerza del muelle) permitiendo que circule el aire a presión hacia arriba:
ca: Quan la pressió a la pressió prové de baix, l’esfera s’eleva a través de la pressió de l’aire (molt més gran que la força del moll) permetent l’aire a la pressió per circular cap amunt:

source: Válvula antirretorno abierta.
ca: Obriu la vàlvula anti -retrobament.

source: La válvula estranguladora
ca: La vàlvula estrangativa

source: Esta válvula, también llamada reguladora de caudal, es una válvula que cierra parcialmente el paso al aire a presión para dejar que circule solo una parte de todo el caudal de aire.
ca: Aquesta vàlvula, també anomenada regulació del cabal, és una vàlvula que tanca parcialment el pas aire -air per deixar que només circuli una part de tot el flux d’aire.

source: Su función es la misma que tiene un grifo de agua, que permite controlar el chorro de agua con mayor o menor caudal, pero aplicado al aire a presión.
ca: La seva funció és la mateixa que té una aixeta d’aigua, que permet controlar el raig d’aigua amb un flux més gran o menor, però que s’aplica a l’aire a pressió.

source: Símbolo de una válvula estranguladora o reguladora de caudal.
ca: Símbol d’un estrangalador o vàlvula reguladora de flux.

source: Internamente la válvula está constituida por un tornillo que acerca o aleja un tapón a la abertura del aire a presión. Cuanto más cerca está el tapón de la abertura, menos caudal de aire permitirá pasar.
ca: Internament, la vàlvula està constituïda per un cargol que aporta una tapa a l’obertura de l’aire a pressió. Com més a prop és la tapa d’obertura, menys flux d’aire permetrà passar.

source: Visión interna de una válvula estranguladora o reguladora de caudal.
ca: Visió interna d’una vàlvula estrangativa o reguladora del flux.

source: La válvula estranguladora unidireccional
ca: Vàlvula estranguradora unidireccional

source: Esta válvula está formada por las dos válvulas anteriores en paralelo. Su función es dejar paso libre del aire a presión en un sentido y estrangular el paso del aire a presión en el sentido contrario.
ca: Aquesta vàlvula està formada per les dues vàlvules anteriors en paral·lel. La seva funció és donar un pas lliure d’aire sota pressió en un sentit i estrangular el pas de l’aire a pressió en el sentit contrari.

source: Símbolo de una válvula estranguladora unidireccional.
ca: Símbol d’una vàlvula d’estrànguador unidireccional.

source: Esta válvula se utiliza normalmente para dejar el paso libre del aire a presión que llega desde la válvula hacia el cilindro y para estrangular el escape de aire desde el cilindro hacia la válvula.
ca: Aquesta vàlvula s’utilitza normalment per deixar l’aire a l’aire a pressió que arriba des de la vàlvula fins al cilindre i per estrangular la fugida de l’aire del cilindre a la vàlvula.

source: Pistón de doble efecto con velocidad regulada
ca: Pistó de doble efecte amb velocitat regulada

source: Los pistones neumáticos se suelen mover a velocidades rápidas, la misma velocidad rápida del aire al entrar y salir de las cámaras del pistón.
ca: Els pistons pneumàtics se solen moure a velocitats ràpides, la mateixa velocitat de l’aire ràpida en entrar i deixar les càmeres del pistó.

source: En ocasiones es necesario reducir la velocidad del pistón para evitar accidentes o empujes demasiado agresivos. Por ejemplo el pistón de apertura y cierre de una puerta de autocar debe tener una velocidad lenta para no golpear a ningún pasajero.
ca: De vegades és necessari reduir la velocitat del pistó per evitar accidents o empenta massa agressius. Per exemple, el pistó d’obertura i tancament d’una porta d’autocar ha de tenir una velocitat lenta per no colpejar cap passatger.

source: Para conseguir el efecto de movimiento lento del pistón se pueden seguir dos esquemas distintos:
ca: Per aconseguir l'efecte de moviment lent del pistó, es poden seguir dos esquemes diferents:

source: **Estrangular la entrada de aire al pistón y dejar el escape libre.**
ca: ** Estranyeu l’entrada de l’aire al pistó i deixeu la fugida lliure. **

source: Este esquema da problemas porque el aire va entrando poco a poco en el pistón y va generando presión hasta que el pistón se mueve a trompicones. El movimiento no es fluido y el pistón tiene poca fuerza en su movimiento.
ca: Aquest esquema dóna problemes perquè l’aire s’entra gradualment al pistó i genera pressió fins que el pistó es mogui a les trompetes. El moviment no és fluid i el pistó té poca força en el seu moviment.

source: **Estrangular la salida de aire al escape y dejar entrar aire a presión al pistón sin estrangular.**
ca: ** Estranyeu la sortida d’aire a l’escapament i deixeu que l’aire en pressió al pistó sense estrangulament. **

source: Este es el esquema que se utiliza en la práctica porque consigue que el movimiento del pistón se realice con suavidad, sin dar trompicones y con toda la fuerza del cilindro.
ca: Aquest és l’esquema que s’utilitza a la pràctica perquè fa que el moviment del pistó es realitzi suaument, sense donar trompetes i amb tota la força del cilindre.

source: Pistón de doble efecto con válvulas estranguladoras al escape.
ca: Pistó de doble efecte amb estrangaladors d’escapament.

source: Funcionamiento de la velocidad regulada
ca: Funcionament de velocitat regulat

source: En un primer momento el cilindro se encuentra en reposo con el vástago dentro. La cámara de aire derecha está llena de aire a presión haciendo fuerza para que el vástago permanezca dentro del cilindro.
ca: Al principi, el cilindre està en repòs amb la descendència de dins. La cambra d’aire dreta està plena de resistència a l’aire de pressió de manera que la tija roman dins del cilindre.

source: Pistón de doble efecto con vástago dentro.
ca: Pistó d’efecte doble amb tija a l’interior.

source: A continuación se acciona la válvula 5/2 y comienza a entrar aire a presión en la cámara izquierda del cilindro. Esta entrada de aire no está estrangulada, por lo que entra con toda la velocidad posible.
ca: A continuació, la vàlvula 5/2 està operada i l’aire comença a pressió a la cambra esquerra del cilindre. Aquesta entrada d'aire no s'estranguen, de manera que entra amb tota la velocitat possible.

source: En la cámara derecha del cilindro sigue habiendo aire a presión, que sale hacia el escape a través del estrangulador, por lo que esta cámara se vaciará lentamente.
ca: A la cambra dreta del cilindre, encara hi ha aire -pressió, que surt a l'escapament a través de l'estrany, de manera que aquesta càmera es buidarà lentament.

source: Pistón de doble efecto con vástago saliendo de forma regulada.
ca: Pistó d’efecte de doble efecte amb canya que surt regulada.

source: Este vaciado lento de la cámara derecha es lo que produce un movimiento lento del vástago hacia la derecha.
ca: Aquest lent buidatge de la càmera dreta és el que produeix un moviment lent des de la vareta a la dreta.

source: Al haber presión en ambas cámaras de aire, el pistón se encuentra sin libertad para moverse fuera de la posición que le corresponde. De manera que si intentamos mover el pistón con la mano nos encontraremos que sigue desplazándose lentamente hacia fuera sin alterar su recorrido.
ca: Tenint pressió sobre les dues cambres d’aire, el pistó és sense llibertat de moure’s fora de la posició que correspon. Així que si intentem moure el pistó amb la mà, trobarem que continua movent -se lentament sense alterar la seva ruta.

source: Por último la cámara derecha se vaciará del todo de aire y el vástago saldrá en todo su recorrido.
ca: Finalment, la càmera dreta es buidarà a tot aire i la descendència serà alliberada a tota la seva ruta.

source: Pistón de doble efecto con vástago fuera del cilindro.
ca: Pistó de doble efecte amb vareta fora del cilindre.

source: Ejercicios
ca: Exercicis

source: Dibuja el símbolo de una válvula antirretorno en reposo.
ca: Dibuixa el símbol d’una vàlvula de restauració en repòs.

source: Describe el funcionamiento de una válvula antirretorno.
ca: Descriviu el funcionament d’un anti -retrocés.

source: Dibuja el interior de la válvula cuando deja paso al aire a presión.
ca: Dibuixa l’interior de la vàlvula quan dóna pas a l’aire sota pressió.

source: Dibuja el símbolo de una válvula estranguladora.
ca: Dibuixeu el símbol d’una vàlvula estrangativa.

source: Describe el funcionamiento de una válvula estranguladora. ¿Para qué sirve esta válvula?
ca: Descriviu el funcionament d’una vàlvula estrangativa. Per a què serveix aquesta vàlvula?

source: Dibuja el símbolo de una válvula estranguladora unidireccional.
ca: Dibuixa el símbol d’una vàlvula d’estrànguador unidireccional.

source: Describe el funcionamiento de una válvula estranguladora unidireccional.
ca: Descriviu el funcionament d’una vàlvula d’estrangalador unidireccional.

source: Dibuja el esquema de un cilindro de doble efecto con la velocidad de salida y de entrada del vástago reguladas.
ca: Dibuixa l’esquema d’un cilindre d’efecte doble amb la sortida i la velocitat d’entrada de la tija regulada.

source: Simula el funcionamiento del circuito anterior.
ca: Simula el funcionament del circuit anterior.

source: `Simulador de neumática. <../_static/flash/simulador-neumatica.html>`__
ca: `Simulador pneumàtic. <../_ static/flash/simulator-neumatica.html>`__

source: Explica el funcionamiento del circuito anterior. ¿Por qué se mueve el vástago lentamente?
ca: Expliqueu el funcionament del circuit anterior. Per què la tija es mou lentament?

source: Dibuja un esquema neumático de un cilindro de doble efecto que tenga regulada la velocidad de salida del vástago, pero que deje entrar al vástago a máxima velocidad.
ca: Dibuixa un esquema pneumàtic d’un cilindre de doble efecte que ha regulat la velocitat de sortida de la tija, però deixa que la descendència entri a la velocitat màxima.
