Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/mecan-neumatic-valvula-and.po
Languages: ca

source: La válvula de simultaneidad o válvula and
ca: La simultaneïtat o la vàlvula i la vàlvula de la vàlvula

source: La **válvula de simultaneidad** o **válvula and** permite el paso de aire a presión cuando ambas vías de entrada, derecha e izquierda, reciben aire a presión.
ca: La vàlvula ** de simultaneïtat ** o ** i ** vàlvula permet que el pas de l’aire pressió quan les dues rutes d’entrada, a la dreta i a l’esquerra, rebin aire de pressió.

source: El funcionamiento resumido puede explicarse diciendo que la válvula deja pasar el aire a presión cuando le llega aire a presión por la vía izquierda **y** también le llega aire a presión por la vía derecha, de ahí su nombre.
ca: L’operació resumida es pot explicar dient que la vàlvula deixa que l’aire passi per pressió quan l’aire arribi a la pressió sobre la ruta esquerra ** i ** també arriba a l’aire pel camí correcte, d’aquí el seu nom.

source: El símbolo en reposo de la válvula de simultaneidad es el siguiente:
ca: El símbol de repòs de la vàlvula de simultaneïtat és el següent:

source: Válvula de simultaneidad o válvula and.
ca: Simultaneïtat o vàlvula de vàlvula.

source: Cuando se inyecta aire a presión por la vía derecha, la pieza central se moverá hacia la izquierda, impidiendo el paso de aire.
ca: Quan s’injecta l’aire a la via dreta, la peça central es desplaçarà a l’esquerra, evitant el pas aeri.

source: Válvula de simultaneidad con presión en la vía derecha.
ca: Vàlvula de simultaneïtat amb pressió sobre el camí correcte.

source: Cuando se inyecta aire a presión por la vía izquierda, la pieza central se moverá hacia la derecha, impidiendo también el paso de aire.
ca: Quan s’injecta l’aire a la pista esquerra a l’esquerra, la peça central es desplaçarà a la dreta, impedint també el pas d’aire.

source: Válvula de simultaneidad con presión en la vía izquierda.
ca: Vàlvula de simultaneïtat amb pressió sobre el camí esquerre.

source: Cuando se inyecta aire a presión por las vías derecha e izquierda, la pieza central no puede cerrar las dos vías a la vez, por lo que permite el paso de aire a presión, que saldrá por la vía superior.
ca: Quan s’injecta la pressió amb pressió a les vies dretes i esquerres, l’eix central no pot tancar les dues pistes alhora, de manera que permet que el pas de l’aire pressió, que sortirà per la ruta superior.

source: Válvula de simultaneidad con presión en las vías derecha e izquierda.
ca: Vàlvula de simultaneïtat amb pressió a les pistes dret i esquerre.

source: El funcionamiento de la válvula de simultaneidad puede resumirse en la siguiente tabla de verdad o tabla lógica:
ca: El funcionament de la vàlvula de simultaneïtat es pot resumir a la taula de veritat següent o a la taula lògica:

source: Funcionamiento de la válvula de simultaneidad.
ca: Funcionament de la vàlvula de simultaneïtat.

source: Vía izquierda
ca: Ruta esquerra

source: Vía derecha
ca: Ruta dreta

source: Vía superior
ca: Camí superior

source: Sin presión (0)
ca: Sense pressió (0)

source: Con presión (1)
ca: Amb pressió (1)

source: Cilindro de simple efecto y válvula de simultaneidad
ca: Vàlvula del cilindre i simultaneïtat d'efectes simples

source: En este circuito un cilindro de simple efecto es accionado por dos válvulas 3/2 solo cuando ambas están accionadas.
ca: En aquest circuit, un cilindre d'efecte simple funciona amb dues vàlvules 3/2 només quan es funcionen ambdues.

source: En la siguiente figura se puede ver el circuito en reposo.
ca: A la figura següent podeu veure el circuit de descans.

source: Cilindro de simple efecto con válvula de simultaneidad sin presión.
ca: Cilindre d'efecte simple amb vàlvula de simultaneïtat sense pressió.

source: Cuando accionamos la válvula izquierda, el aire a presión llega a la válvula de simultaneidad, pero esta no deja pasar la presión por la vía superior.
ca: Quan activem la vàlvula esquerra, l’aire de pressió arriba a la vàlvula de simultaneïtat, però no deixa que la pressió passi pel camí superior.

source: Cilindro de simple efecto con válvula de simultaneidad con presión a la izquierda.
ca: Cilindre d'efecte senzill amb vàlvula de simultaneïtat amb pressió esquerra.

source: Cuando accionamos también la válvula derecha, el aire a presión llega a la válvula de simultaneidad por ambos lados y no puede frenar ambos flujos de aire, por lo que deja pasar aire a presión por la vía superior. El vástago del cilindro de simple efecto saldrá hacia fuera.
ca: Quan també activem la vàlvula dreta, l’aire de pressió arriba a la vàlvula de simultaneïtat a banda i banda i no pot aturar els dos fluxos d’aire, de manera que deixa que l’aire passi per la pista superior. La vareta del cilindre d'efectes simples sortirà.

source: Cilindro de simple efecto con válvula de simultaneidad con presión en ambas entradas.
ca: Cilindre d'efecte senzill amb vàlvula de simultaneïtat amb pressió en ambdues entrades.

source: Unión de válvulas
ca: Unió de vàlvules

source: En un circuito neumático podemos unir varias válvulas selectoras y de simultaneidad para conseguir comportamientos complejos.
ca: En un circuit pneumàtic podem unir -nos a diverses vàlvules de selector i simultaneïtat per aconseguir comportaments complexos.

source: En el siguiente circuito podemos ver dos válvulas distintas (una de simultaneidad y otra selectora) que combinan el aire a presión de tres válvulas 3/2 hacia un cilindro de simple efecto.
ca: Al circuit següent podem veure dues vàlvules diferents (una de simultaneïtat i un altre selector) que combinen l’aire de pressió de tres vàlvules 3/2 cap a un cilindre d’efecte senzill.

source: Válvulas de simultaneidad y selectora en cascada.
ca: Vàlvules de simultaneïtat i seleccionador de Cascade.

source: En el circuito anterior el vástago del cilindro saldrá hacia fuera cuando se presione la válvula de la derecha y, a la vez, una de las dos válvulas de la izquierda.
ca: Al circuit anterior, la vareta del cilindre s’apagarà quan es pressioni la vàlvula dreta i, alhora, una de les dues vàlvules de l’esquerra.

source: En el siguiente circuito podemos ver otra combinación distinta de válvulas de simultaneidad y selectora hacia un cilindro de simple efecto.
ca: Al circuit següent podem veure una altra combinació diferent de les vàlvules de simultaneïtat i seleccionador cap a un cilindre d'efecte simple.

source: Válvulas de simultaneidad y selectora en cascada II.
ca: Vàlvules de simultaneïtat i seleccionador a la cascada II.

source: En el circuito anterior el vástago del cilindro saldrá hacia fuera siempre que accionemos la válvula derecha o bien cuando accionemos ambas válvulas de la izquierda.
ca: Al circuit anterior, la vareta del cilindre sortirà sempre que compartim la vàlvula dreta o quan compartim les dues vàlvules a l'esquerra.

source: Ejercicios
ca: Exercicis

source: Dibuja el símbolo en reposo de una válvula de simultaneidad neumática.
ca: Dibuixa el símbol de repòs d’una vàlvula de simultaneïtat pneumàtica.

source: Dibuja el funcionamiento de una válvula de simultaneidad neumática cuando recibe aire a presión por la vía derecha.
ca: Dibuixeu el funcionament d’una vàlvula de simultaneïtat pneumàtica quan rebeu pressió al camí correcte.

source: Dibuja el funcionamiento de una válvula de simultaneidad neumática cuando recibe aire a presión por la vía izquierda.
ca: Dibuixa el funcionament d’una vàlvula de simultaneïtat pneumàtica quan rep aire a la pista esquerra.

source: Explica el funcionamiento de la válvula de simultaneidad neumática y dibuja su tabla de verdad.
ca: Expliqueu el funcionament de la vàlvula de simultaneïtat pneumàtica i dibuixeu la vostra taula de veritat.

source: Simula el funcionamiento de un cilindro de simple efecto con un vástago que debe salir al accionar a la vez las **dos válvulas 3/2** de maniobra.
ca: Simula el funcionament d’un cilindre d’efecte senzill amb una vareta que ha d’anar quan actua al mateix temps les ** dues vàlvules 3/2 ** de maniobra.

source: `Simulador de neumática. <../_static/flash/simulador-neumatica.html>`__
ca: `Simulador pneumàtic. <../_ static/flash/simulator-neumatica.html>`__

source: Dibuja el circuito anterior en papel y explica su funcionamiento.
ca: Dibuixa el circuit de paper anterior i explica el seu funcionament.

source: ¿Para qué sirve la unión de válvulas de simultaneidad y válvulas selectoras en cascada?
ca: Quin és l’ús de les vàlvules de simultaneïtat i les vàlvules del selector de cascada?

source: Simula un circuito que tenga tres válvulas 3/2 que accionen un cilindro de simple efecto.
ca: Simula un circuit que té tres vàlvules 3/2 que comparteixen un cilindre d’efecte senzill.

source: El vástago del cilindro debe salir fuera cuando se accionen cualquiera de las dos válvulas de la izquierda y a la vez se accione la válvula de la derecha.
ca: La tija del cilindre ha de sortir quan s’accedeix a qualsevol de les dues vàlvules de l’esquerra i al mateix temps que s’accedeix a la vàlvula de la dreta.

source: Dibuja la tabla de verdad con el funcionamiento del circuito anterior completando la siguiente tabla.
ca: Dibuixa la taula de veritat amb el funcionament del circuit anterior completant la taula següent.

source: Válvula izquierda 1
ca: Vàlvula esquerra 1

source: Válvula izquierda 2
ca: Vàlvula esquerra 2

source: Válvula derecha
ca: Vàlvula dreta

source: Vástago
ca: Tija

source: No accionada
ca: No operat

source: Dentro
ca: Endins

source: Accionada
ca: Operada
