Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/picuino-uno-key3.po
Languages: ca

source: Pulsadores: Contadores
ca: Farciment: comptables

source: Objetivos
ca: Els pendents

source: Leer los contadores de tiempo y pulsaciones asociados a un pulsador.
ca: Llegiu els comptadors de temps i les pulsacions associades a un botó.

source: Realizar acciones asociadas a los contadores de tiempo.
ca: Realitzeu accions associades als comptadors de temps.

source: La función ``keyCount``
ca: La funció `` keyCount``

source: Esta función devuelve el número de veces que se ha presionado un pulsador. El valor se incrementa en uno inmediatamente después de presionar el pulsador. Si se mantiene el pulsador pulsado medio segundo, el valor se incrementa a razón de 5 pulsaciones por segundo. Si el pulsador se mantiene presionado durante dos segundos, el valore de pulsaciones se incrementa a razón de 20 pulsaciones por segundo.
ca: Aquesta funció retorna el nombre de vegades que s'ha premut un botó. El valor augmenta un immediatament després de prémer el botó. Si es manté el botó mig segon, el valor augmenta a un ritme de 5 pulsacions per segon. Si es prem el botó durant dos segons, el valor de les pulsacions augmenta a una velocitat de 20 pulsacions per segon.

source: La función ``keyTimeOn``
ca: La funció `` keytimon``

source: Esta función devuelve el tiempo que ha estado presionado el pulsador. El tiempo se mide contando 250 pasos por segundo.
ca: Aquesta funció retorna el temps en què s'ha premut el botó. El temps es mesura comptant 250 passos per segon.

source: La función ``keyTimeOff``
ca: El `` keytimoff ''`

source: Esta función devuelve el tiempo que ha estado sin presionar el pulsador. El tiempo se mide contando 250 pasos por segundo.
ca: Aquesta funció retorna el temps que ha estat sense prémer el botó. El temps es mesura comptant 250 passos per segon.

source: Ejercicios
ca: Exercicis

source: Programa el código necesario para resolver los siguientes problemas.
ca: Programa el codi necessari per resoldre els problemes següents.

source: El siguiente programa mueve hacia la derecha un led cuando se presiona el pulsador 2. Modificar el programa para que el led se mueva hacia la izquierda al pulsar el pulsador 1.
ca: El programa següent mou un LED a la dreta quan es prem el botó. Modifiqueu el programa de manera que el LED es mogui a l'esquerra prement el botó 1.

source: El siguiente programa es un juego para comprobar la habilidad de contar tiempo. Se debe esperar a que el pulsador 1 no esté presionado. En ese momento se medirá el tiempo que ha estado presionado. Cuanto más se parezca el tiempo presionado a 3 segundos, más puntuación se obtendrá. **Modificar** el programa para que antes de comenzar el juego, el led D1 parpadee una vez por segundo. Una vez presionado el pulsador 1, el parpadeo debe apagarse para no dar pistas sobre el tiempo que debe estar encendido.
ca: El següent programa és un joc per comprovar la capacitat de dir -ho. Haureu d’esperar que no es premeu el botó 1. En aquell moment, es mesurarà el moment en què se us ha pressionat. Com més temps es pressioni durant 3 segons, més puntuació s’obtindrà. ** Modifiqueu ** el programa de manera que abans de començar el joc, el LED D1 parpelleja una vegada per segon. Un cop premut el botó 1, s’ha d’extingir el parpelleig per no donar pistes sobre el temps que ha d’estar encès.

source: Modificar el programa que aparece a continuación, parecido al anterior. En este juego la puntuación será más alta si se presiona un pulsador el mismo tiempo dos veces consecutivas. Primero el programa debe medir el tiempo que ha estado presionado el pulsador 1, después debe esperar a que no esté presionado. Finalmente se medirá el segundo tiempo que el pulsador esté presionado.
ca: Modifiqueu el programa que apareix a continuació, similar al anterior. En aquest joc, la puntuació serà més alta si es prem un botó el mateix temps dues vegades consecutiu. Primer, el programa ha de mesurar el temps que s'ha pressionat el botó, i haureu d'esperar que no es pressioni. Finalment, es mesurarà la segona meitat que es prem el botó.
