Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/prog-lang-edu.po
Languages: ca

source: Lenguajes de programación
ca: Llenguatges de programació

source: Comparativa de diferentes lenguajes de programación para la enseñanza.
ca: Comparació de diferents llenguatges de programació per a l'ensenyament.

source: Programación por bloques
ca: Bloqueig de la programació

source: Cursos Code
ca: Cursos de codi

source: Website: `Code Studio <https://studio.code.org/courses>`__
ca: Lloc web: `Code Studio <https://studio.code.org/courses>`__

source: Desarrollador: code.org
ca: Desenvolupador: Code.org

source: Programación: por bloques (basado en `Blockly <https://developers.google.com/blockly/>`__)
ca: Programació: Blocs (basats en `Blockly <https://develers.google.com/blockly/>`__)

source: Gratuita. Multiplataforma (PC, Apple, Android) .
ca: Lliure. Multiplataforma (PC, Apple, Android).

source: Cursos guiados de diferentes niveles, desde 4 hasta 16 años, y de diferentes duraciones, desde 1 hasta 24 horas.
ca: Cursos guiats de diferents nivells, de 4 a 16 anys, i de diferents durades, d’1 a 24 hores.

source: Enseñan los fundamentos de la programación imperativa y estructurada. Secuencias, bucles, condicionales, variables, funciones y parámetros.
ca: Ensenyen els fonaments de la programació imperativa i estructurada. Seqüències, bucles, condicionats, variables, funcions i paràmetres.

source: Scratch
ca: Esgarrapar

source: Website: `Scratch <https://scratch.mit.edu/>`__
ca: Lloc web: `Scratch <https://scratch.mit.edu/>`__

source: Desarrollador: MIT
ca: Desenvolupador: MIT

source: Programación: por bloques
ca: Programació: per blocs

source: Para programar: en navegador y PC
ca: Per programar: al navegador i al PC

source: Multitarea
ca: Multitasca

source: Software libre (con acceso al código). Mutiplataforma.
ca: Programari gratuït (amb accés al codi). Multiplataforma.

source: Proyecto del MIT para enseñar programación a los niños en un entorno creativo. La web tiene multitud de proyectos compartidos que se pueden estudiar y reutilizar.
ca: Projecte MIT per ensenyar la programació infantil en un entorn creatiu. La web té multitud de projectes compartits que es poden estudiar i reutilitzar.

source: Tutoriales scratch: :ref:`scratch-index`
ca: Tutorials de Scratch :: ref: `scratch-índex`

source: Website: `mBlock <https://www.makeblock.com>`__
ca: Lloc web: `mBlock <https://www.makeblock.com>`__

source: Desarrollador: Makeblock, basado en Scratch
ca: Desenvolupador: MakeBlock, basat en Scratch

source: Para programar: PC y Arduino
ca: Al programa: PC i Arduino

source: Software libre. Mutiplataforma.
ca: Programari lliure. Multiplataforma.

source: Proyecto basado en Scratch offline, que incluye instrucciones para Arduino y para los robots de Makeblock basados en Arduino.
ca: Projecte basat en Scratch Offline, que inclou instruccions per a robots Arduino i MakeBlock basats en Arduino.

source: Se puede programar en Scratch y también se pueden hacer programas con bloques para Arduino. Una vez descargados a Arduino, los programas son independientes y funcionan sin conexión al PC.
ca: Es pot programar a Scratch i també podeu fer programes amb blocs per a Arduino. Un cop descarregat a Arduino, els programes són independents i funcionen sense connexió amb el PC.

source: Programación de Smartphones
ca: Programació dels telèfons intel·ligents

source: Los smartphones Android, los más extendidos, se programan con el lenguaje Java. Existen alternativas más sencillas orientadas a la educación.
ca: Els telèfons intel·ligents Android, els més estesos, estan programats amb el llenguatge Java. Hi ha alternatives més senzilles orientades a l’educació.

source: AppLab
ca: Poma

source: Website: `AppLab <https://code.org/educate/applab>`__
ca: Lloc web: `Apple <https://code.org/educate/applab>`__

source: Programación: por bloques o en texto JavaScript
ca: Programació: per blocs o en text de JavaScript

source: Gratuita y multiplataforma
ca: Gratuït i multiplataforma

source: Requiere crear una cuenta
ca: Requereix crear un compte

source: Las apps se ejecutan en cualquier **smartphone** a través del navegador
ca: Les aplicacions s’executen en qualsevol smartphone ** ** a través del navegador

source: Website: `AppInventor <http://appinventor.mit.edu>`__
ca: Lloc web: `AppInventor <http://appinventor.mit.edu>`__

source: Para programar: smartphones
ca: Per programar: telèfons intel·ligents

source: Programación en texto
ca: Programació de text

source: Estos lenguajes tienen un nivel de dificultad más alto al programarse escribiendo código en formato texto. Requiere aprender una gramática que es más complicada que el simple movimiento de bloques. Como ventaja, son mucho más potentes y flexibles.
ca: Aquests llenguatges tenen un nivell més elevat de dificultat a l’hora de programar el codi d’escriptura en format de text. Requereix aprendre una gramàtica més complicada que un simple moviment de blocs. Com a avantatge, són molt més potents i flexibles.

source: Website: `Arduino <https://www.arduino.cc/>`__
ca: Lloc web: `Arduino <https://www.arduino.cc/>`__

source: Desarrollador: Arduino
ca: Desenvolupador: Arduino

source: Programación: texto, basado en lenguaje C
ca: Programació: text, basat en el llenguatge C

source: Para programar: placas electrónicas Arduino y similares
ca: Al programa: Arduino Electronic Plats i similars

source: Software libre
ca: Programari gratuït

source: Gran cantidad de tutoriales de diversos niveles y calidad, orientados a proyectos DIY
ca: Un gran nombre de tutorials de diversos nivells i qualitat, orientats als projectes de bricolatge

source: Arduino se programa en lenguaje C con añadidos para hacerlo más sencillo. Está dirigido a la programación de circuitos electrónicos, montajes Maker y robots. Su objetivo es acercar la programación de los microcontroladores a los estudiantes sin preparación técnica.
ca: Arduino està programat en llenguatge C amb addicions per facilitar -ho. Està dirigit a la programació de circuits electrònics, muntatges de fabricants i robots. El seu objectiu és portar la programació de microcontroladors als estudiants sense preparació tècnica.

source: Website: `Python <https://www.python.org>`__
ca: Lloc web: `Python <https://www.python.org>`__

source: Desarrollador: Python foundation
ca: Desenvolupador: Python Foundation

source: Programación: texto
ca: Programació: text

source: Para programar: PC
ca: Al programa: PC

source: Software libre. Mutiplataforma
ca: Programari lliure. Multiplataforma

source: Muchos Tutoriales de muchos niveles, también en castellano.
ca: Molts tutorials de molts nivells, també en castellà.

source: Tutoriales:
ca: Tutorials:

source: `Learn Python <http://www.learnpython.org/>`__
ca: `Aprendre python <http://www.renpython.org/>`__

source: Lenguaje multiparadigma, muy sencillo de programar y de entender. Es el lenguaje preferido por muchos colegios y universidades de todo el mundo [1]_ para enseñar a programar. Con este lenguaje se pueden programar proyectos desde cero con gran rapidez y sencillez.
ca: Llenguatge multiparadigma, molt senzill de programar i comprendre. És l’idioma preferit per moltes escoles i universitats del món [1] _ ensenyar al programa. Amb aquest idioma, podeu programar projectes des de zero amb una gran velocitat i senzillesa.

source: Python es uno de los lenguajes más usados y más populares en la actualidad [2]_. Está apoyado por Google y es el lenguaje seleccionado para desarrollar sus aplicaciones de inteligencia artificial y Machine Learning, el futuro de la informática.
ca: Python és un dels idiomes més utilitzats i més populars actuals [2] _. Està recolzat per Google i és el llenguatge seleccionat per desenvolupar les seves aplicacions d’intel·ligència artificial i d’aprenentatge automàtic, el futur de la informàtica.

source: Tiene multitud de tutoriales de todo tipo, de todos los niveles, en inglés y en español y en formato libre y gratuito.
ca: Té multitud de tutorials de tot tipus, de tots els nivells, en anglès i en castellà i en format gratuït i lliure.

source: El entorno `Pygame <https://www.pygame.org/tags/all>`__ facilita mucho la tarea de programar entornos gráficos y juegos para ordenador y ofrece multitud de ejemplos didácticos y prácticos de programas creados por diferentes autores.
ca: El `pygame <https://www.pygame.org/tags/all>`__ facilita molt la tasca de programar entorns gràfics i jocs d'ordinador i ofereix una multitud d'exemples didàctics i pràctics de programes creats per diferents autors.

source: A su vez, el entorno `Python Turtle <https://docs.python.org/3.3/library/turtle.html>`__ emula al entorno del lenguaje LOGO, creado por `Seymour Papert <https://es.wikipedia.org/wiki/Seymour_Papert>`__ en el MIT para enseñar a los niños a programar.
ca: Al seu torn, l’entorn de la tortuga python <https://docs.python.org/3.3/libry/turtle.html>`__ emula l’entorn de l’idioma de logotip, creat per` Seymour papert <https://es.wikipèdia.org/wiki/seymour_ppert> `` `` `` `` `` `` `` `` `` `` `` `` `` `` ` `` `` `` `` `` `` `Mit per ensenyar als nens a programar.

source: Processing
ca: Preparació

source: Website: `Processing <https://processing.org/>`__
ca: Lloc web: `Processament <https://protsing.org/>`__

source: Desarrollador: Processing foundation
ca: Desenvolupador: Processing Foundation

source: Programación: texto. Basado en lenguaje Java
ca: Programació: text. Basat en el llenguatge Java

source: Para programar: PC y smartphones
ca: Per programar: PC i telèfons intel·ligents

source: Grandes posibilidades gráficas
ca: Grans possibilitats gràfiques

source: Tutoriales solo en ingles y con nivel Bachillerato.
ca: Tutorials només en anglès i a nivell de secundària.

source: `Tutoriales oficiales <https://processing.org/tutorials/>`__
ca: `Tutorials oficials <https://protssing.org/torials/>`__

source: `Hour of code <http://hello.processing.org/editor/>`__
ca: `Hora del codi <http://hello.processing.org/editor/>`__

source: Processing es un entorno de programación en Java que ofrece muchas facilidades para acercar la programación a los artistas permitiendo desarrollar aplicaciones visuales con dibujos e imágenes en pantalla.
ca: El processament és un entorn de programació Java que ofereix moltes instal·lacions per apropar la programació als artistes que permeten aplicacions visuals amb dibuixos i imatges a la pantalla.

source: Al programar en Java, las aplicaciones se pueden subir a los smartphones y tablets basadas en Android.
ca: Quan es programen a Java, es poden penjar aplicacions a telèfons intel·ligents i tauletes basades en Android.

source: La desventaja de este lenguaje consiste en que los tutoriales se encuentran en inglés y tienen un nivel relativamente alto, de Bachillerato. Por otro lado, con este lenguaje resulta complicado iniciarse en el aprendizaje de la programación.
ca: L’inconvenient d’aquest idioma és que els tutorials es troben en anglès i tenen un nivell relativament alt de secundària. D'altra banda, amb aquest idioma és difícil començar a la programació d'aprenentatge.

source: Machine Learning
ca: Aprenentatge automàtic

source: El Machine Learning o aprendizaje automático es una rama de la inteligencia artificial, muy de moda últimamente, que es capaz de generar modelos que pueden predecir y clasificar datos a partir de un aprendizaje guiado o autónomo.
ca: L’aprenentatge automàtic o l’aprenentatge automàtic és una branca de la intel·ligència artificial, molt de moda darrerament, que és capaç de generar models que puguin predir i classificar dades d’un aprenentatge guiat o autònom.

source: En la página de `LearningML <https://web.learningml.org/>`__ se puede leer una explicación más exhaustiva y se puede jugar con modelos sencillos y fácilmente entrenables de Machine Learning para identificar textos e imágenes.
ca: A la pàgina 'LearningMl <https://web.learningml.org/> __, podeu llegir una explicació més exhaustiva i podeu jugar amb models d'aprenentatge de màquines senzilles i fàcilment formades per identificar textos i imatges.

source: El lenguaje de programación utilizado es Scratch 3 con el añadido de las instrucciones necesarias para utilizar los modelos ML una vez entrenados.
ca: El llenguatge de programació utilitzat és Scratch 3 amb l’addició de les instruccions necessàries per utilitzar els models ML un cop formats.

source: Otros recursos en Internet
ca: Altres recursos a Internet

source: `Lenguajes de programación educativa. <https://www.educaciontrespuntocero.com/recursos/programacion/lenguajes-programacion-educativa-alternativas-a-scratch/35925.html>`__
ca: `Llenguatges de programació educativa. <https://www.educntrepuntocero.com/recursos/programacion/leguajes-programacion-educiva-alternativos-a-cratch/35925.html> `` `` `` `` `` `` `` `

source: `Schools using Python <https://wiki.python.org/moin/SchoolsUsingPython>`__
ca: `Les escoles que utilitzen Python <https://wiki.python.org/Moin/schoolsusingpython>`__

source: `Índice Tiobe de lenguajes de programación <https://www.tiobe.com/tiobe-index/>`__
ca: `Índex tiobe de llenguatges de programació <https://www.tiobe.com/tiobe-index/>`__
