Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/prog-codeorg.po
Languages: ca

source: Tutoriales Code
ca: Tutorials de codi

source: Code.org es una página que dispone de múltiples tutoriales para aprender a programar, desde un nivel preescolar, hasta los últimos cursos de secundaria. Los cursos y tutoriales presentan problemas que se deben resolver programando con bloques la solución.
ca: Code.org és una pàgina que té diversos tutorials per aprendre a programar, des d’un nivell d’educació infantil fins als darrers cursos de secundària. Els cursos i els tutorials tenen problemes que s’han de resoldre programant la solució amb blocs.

source: La web permite realizar los ejercicios sin registrarse. En el caso de querer registrarse, la página solo pide un e-mail, que no tiene que ser real, y se almacenarán los resultados de una sesión a otra.
ca: El lloc web us permet realitzar els exercicis sense registrar -vos. En el cas de voler registrar-se, la pàgina només demana un correu electrònic, que no ha de ser real, i els resultats es guardaran d’una sessió a una altra.

source: Cursos Code
ca: Cursos de codi

source: Listado de cursos largos para aprender a programar. Cada una de las etapas tiene un tiempo aproximado de realización de 40 minutos.
ca: Llista de cursos llargs per aprendre a programar. Cadascuna de les etapes té un temps aproximat de 40 minuts.

source: **Cursos modernos**
ca: ** Cursos moderns **

source: Curso
ca: Direcció

source: Edades
ca: Edats

source: Etapas y ejercicios
ca: Etapes i exercicis

source: De 6 a 10 años
ca: De 6 a 10 anys

source: 10 etapas con 111 ejercicios.
ca: 10 etapes amb 111 exercicis.

source: De 7 a 11 años
ca: De 7 a 11 anys

source: 12 etapas con 139 ejercicios.
ca: 12 etapes amb 139 exercicis.

source: De 8 a 12 años
ca: De 8 a 12 anys

source: 11 etapas con 130 ejercicios y proyecto final.
ca: 11 etapes amb 130 exercicis i projecte final.

source: De 9 a 13 años
ca: De 9 a 13 anys

source: 14 etapas con 104 ejercicios y proyecto final.
ca: 14 etapes amb 104 exercicis i projecte final.

source: De 9 a 18 años
ca: De 9 a 18 anys

source: 27 etapas largas con 318 ejercicios y proyecto.
ca: 27 etapes llargues amb 318 exercicis i projectes.

source: Hora del código
ca: Temps de codi

source: *Hora del código* son pequeños tutoriales temáticos que se pueden realizar en menos de una hora.
ca: * Temps de codi* són petits tutorials temàtics que es poden fer en menys d’una hora.

source: Número
ca: Nombre

source: Ejercicios
ca: Exercicis

source: `Fiesta de baile <https://studio.code.org/s/dance/stage/1/puzzle/1>`__
ca: `Festa de ball <https://studio.code.org/s/dance/stage/1/puzzle/1>` `` `

source: `¡Sigue bailando! <https://studio.code.org/s/dance-extras-2019/stage/1/puzzle/2>`__
ca: 'Segueix ballant! <https://studio.code.org/s/dance-extras-2019/stage/1/puzzle/2> `` `` ``

source: `Viaje acuático de Minecraft <https://studio.code.org/s/aquatic/lessons/1/levels/1>`__
ca: `Minecraft Aquatic Trip <https://studio.code.org/s/aquatic/lessons/1/levels/1>`__

source: `Viaje del héroe de Minecraft <https://studio.code.org/s/hero/stage/1/puzzle/1>`__
ca: `Minecraft Hero's Trip <https://studio.code.org/s/hero/stage/1/puzzle/1>`__ __

source: `Aventurero de Minecraft <https://studio.code.org/s/mc/lessons/1/levels/1>`__
ca: `Minecraft Adventurer <https://studio.code.org/s/mc/less/1/levels/1>

source: `Diseñador Minecraft <https://studio.code.org/s/minecraft/stage/1/puzzle/1>`__
ca: `Minecraft Designer <https://studio.code.org/s/minecraft/stage/1/puzzle/1>` __

source: `Código Flappy <https://studio.code.org/flappy/1>`__
ca: `Codi Flappy <https://studio.code.org/flappy/1>`__

source: `Hola Mundo <https://code.org/helloworld>`__
ca: `Hola Mundo <https://code.org/helegorld>`__

source: `Compute it <https://compute-it.toxicode.fr/>`__
ca: `Computar-ho <https://compute-it.toxicode.fr/>`__

source: `Arte del Poema <https://studio.code.org/s/poem-art-2021/lessons/1/levels/1>`__
ca: `Poem Art <https://studio.code.org/s/poem-art-2021/lessons/1/levels/1>`__ __

source: `AI para océanos <https://studio.code.org/s/oceans/lessons/1/levels/1>`__
ca: `Ai per als oceans <https://studio.code.org/s/oceans/lessons/1/levels/1>` `` `

source: `Laberinto Angry Birds <https://studio.code.org/hoc/1>`__
ca: `Labyrinth Angry Birds <https://studio.code.org/hoc/1>`__

source: `Frozen <https://studio.code.org/s/frozen/lessons/1/levels/1>`__
ca: `Frozen <https://studio.code.org/s/frozen/lesons/1/levels/1>` `` ``

source: `Simulador de epidemias <https://studio.code.org/s/outbreak/lessons/1/levels/1>`__
ca: `Simulador Epidemias <https://studio.code.org/s/outbreak/lessons/1/levels/1>`__

source: `Artista <https://studio.code.org/s/artist/lessons/1/levels/1>`__
ca: `Artista <https://studio.code.org/s/artist/less/1/levels/1>` `` `

source: `Juego de baloncesto <https://studio.code.org/s/basketball/lessons/1/levels/1>`__
ca: `Joc de bàsquet <https://studio.code.org/s/basketball/lessons/1/levels/1>` __

source: `Juego multideporte <https://studio.code.org/s/sports/lessons/1/levels/1>`__
ca: `Joc multiide <https://studio.code.org/s/sports/less/1/levels/1>` `` `

source: `Laboratorio de juegos clásico <https://studio.code.org/s/playlab/lessons/1/levels/1>`__
ca: `Laboratori de jocs clàssics <https://studio.code.org/s/playlab/lessons/1/levels/1>` `` `

source: `Laboratorio de juegos Ice Age <https://studio.code.org/s/iceage/lessons/1/levels/1>`__
ca: `Laboratori de jocs de glaç

source: `Laboratorio de juegos Disney <https://studio.code.org/s/infinity/lessons/1/levels/1>`__
ca: `Disney Games Laboratory <https://studio.code.org/s/infinity/ssons/1/levels/1>`__

source: `Laboratorio de juegos Gumball <https://studio.code.org/s/gumball/lessons/1/levels/1>`__
ca: `Gumball Games Laboratory <https://studio.code.org/s/guumball/lessons/1/levels/1>`__

source: Más ejercicios de `hora del código <https://code.org/learn>`__
ca: Més exercicis de temps de codi <https://code.org/learn>`__

source: Laboratorio de Apps
ca: Laboratori d'aplicacions

source: Los laboratorios de programación de Apps permiten programar en lenguaje java aplicaciones para smartphones.
ca: Els laboratoris de programació d'aplicacions permeten aplicacions de telèfons intel·ligents en llenguatge Java.
