Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/prog-recursos.po
Languages: ca

source: Recursos para programación
ca: Recursos per a la programació

source: Antonio García el niño programador
ca: Antonio García El programador infantil

source: Vídeo: `El niño de 11 años que ha inventado más de 100 videojuegos propios - El Hormiguero 3.0. <https://www.youtube-nocookie.com/embed/a7SsRuA1KDU>`__
ca: Vídeo: `El noi de 11 anys que ha inventat més de 100 videojocs propis -El Hormiguero 3.0. <https://www.youtube-nocokie.com/embed/a7ssrua1kdu>`__

source: Retos de programación con Scratch
ca: Reptes de programació amb ratllat

source: `Retos de programación con Scratch de la web robotix.es <https://www.robotix.es/es/actividades-scratch>`__
ca: `Reptes de programació amb Scratch of the Web Robotix.es <https://www.robotix.es/es/activities-scratch>`__

source: Curso de introducción a la programación
ca: Introducció a la programació

source: `Curso de de introducción a la programación <https://www.luisllamas.es/curso-programacion/>`__ de Luis Llamas con orientación multilenguaje.
ca: `Introducció del curs a la programació <https://www.luisllamas.es/curso-crogramacion/>`__ de Luis Llamas amb orientació multilengage.

source: Refactorización
ca: Refactorització

source: La refactorización (del inglés refactoring) es una técnica de la ingeniería de software para modificar un código fuente o programa sin cambiar su comportamiento externo.
ca: La refactorització (Refractoring English) és una tècnica d’enginyeria de programari per modificar un codi o un programa font sense canviar el seu comportament extern.

source: El objetivo de la refactorización es *limpiar el código* para que sea más comprensible y más consistente.
ca: L’objectiu de la refactorització és * netejar el codi * per fer -lo més comprensible i coherent.

source: El objetivo no es cambiar el comportamiento del código ni arreglar errores. Después de refactorizar, el código debe comportarse de la misma manera.
ca: L’objectiu no és canviar el comportament del codi o solucionar els errors. Després de la refactorització, el codi ha de comportar -se de la mateixa manera.

source: `Refactorización en Wikipedia <https://es.wikipedia.org/wiki/Refactorizaci%C3%B3n>`__
ca: `Refactorització a Wikipedia <https://es.wikipedia.org/wiki/refactorizaci%C3%B3n>`__

source: Patrones de diseño
ca: Patrons de disseny

source: Los **patrones de diseño** son unas técnicas para resolver problemas comunes en el desarrollo de software y otros ámbitos referentes al diseño de interfaces.
ca: Els patrons de disseny ** ** són tècniques per resoldre problemes comuns en el desenvolupament de programari i altres àrees relacionades amb el disseny de la interfície.

source: Cada patrón es como un plano que se puede personalizar para resolver un problema de diseño particular de tu código.
ca: Cada patró és com un pla que es pot personalitzar per resoldre un problema de disseny particular del vostre codi.

source: `Patrones de diseño en Refactoring Gurú <https://refactoring.guru/es/design-patterns>`__
ca: `Patrons de disseny en el guru de refactorització <https://refactoring.guru/esign-patterns>`__

source: `Patrones de diseño en Wikipedia <https://es.wikipedia.org/wiki/Patr%C3%B3n_de_dise%C3%B1o>`__
ca: `Patrons de disseny de Wikipedia <https://es.wikipedia.org/wiki/pat%C3%B3n_de_dise%C3%B1o>`__
