Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/prog-flowchart.po
Languages: ca

source: Diagramas de flujo
ca: Diagrames de flux

source: Un diagrama de flujo es un dibujo que representa un proceso detallando sus tareas y decisiones. Su finalidad es expresar de manera simple y visual lo que ocurre en un proceso o en un programa, de manera que sea fácil de comprender.
ca: Un diagrama de flux és un dibuix que representa un procés que detalla les seves tasques i decisions. El seu propòsit és expressar de manera senzilla i visual el que passa en un procés o en un programa, de manera que sigui fàcil d’entendre.

source: Los diagramas de flujo se pueden presentar al programador para que éste comprenda mejor lo que el cliente quiere realizar. Posteriormente el programador desarrolla el programa basándose en los diagramas de flujo.
ca: Els diagrames de flux es poden presentar al programador de manera que entengui millor el que el client vol realitzar. Posteriorment, el programador desenvolupa el programa basat en els diagrames de flux.

source: También se dibujan diagramas de flujo para documentar un programa de ordenador una vez terminado, para comunicar lo que hace el programa de una manera visual y comprensible.
ca: Els diagrames de flux també es dibuixen per documentar un programa informàtic un cop acabat, per comunicar el que fa el programa de manera visual i comprensible.

source: Los diagramas de flujo no se limitan a representar el funcionamiento de los programas, también pueden informarnos de las tareas que debemos realizar en una situación determinada.
ca: Els diagrames de flux no es limiten a representar el funcionament dels programes, també ens poden informar de les tasques que hem de realitzar en una situació determinada.

source: Este es el aspecto que tiene un diagrama de flujo:
ca: Aquesta és l’aparició d’un diagrama de flux:

source: Símbolos
ca: Símbols

source: A continuación se presentan los principales símbolos utilizados para dibujar diagramas de flujo.
ca: A continuació, es presenten els símbols principals que s’utilitzen per dibuixar diagrames de flux.

source: **Comienzo y final**
ca: ** Start i Final **

source: Todos los diagramas de flujo deben tener un símbolo de comienzo y un símbolo de finalización, que se representan con rectángulos redondeados en los extremos.
ca: Tots els diagrames de flux han de tenir un símbol d’inici i un símbol de finalització, que es representen amb rectangles arrodonits als extrems.

source: Símbolos de comienzo y finalización del programa.
ca: Els símbols d’inici i finalització del programa.

source: **Tareas**
ca: ** Tasques **

source: Las tareas que realiza el programa se representan con rectángulos. Dentro del rectángulo se debe escribir en qué consiste la tarea. Por ejemplo, sumar dos números o enviar un mensaje.
ca: Les tasques realitzades pel programa estan representades amb rectangles. Dins del rectangle heu d’escriure en què consisteix la tasca. Per exemple, afegiu dos números o envieu un missatge.

source: Símbolo de tarea.
ca: Símbol de la tasca.

source: **Entrada y salida de datos**
ca: ** Entrada i sortida de dades **

source: Cuando la tarea consiste en una entrada o salida de datos tal como escribir en la pantalla, pedir que el usuario escriba un texto, imprimir una hoja de papel, etc. En ese caso la tarea tendrá una forma de rectángulo inclinado.
ca: Quan la tasca consisteix en una entrada o sortida de dades, com ara escriure a la pantalla, demanant que l’usuari escrigui un text, imprimeixi un full de paper, etc. En aquest cas, la tasca tindrà un formulari de rectangle inclinat.

source: Símbolo de entrada y de salida.
ca: Símbol d’entrada i sortida.

source: **Decisiones**
ca: ** Decisions **

source: Un símbolo muy especial es el símbolo de decisión. Con este símbolo el programa puede seguir dos caminos distintos, dependiendo de que la condición se cumpla o que no se cumpla.
ca: Un símbol molt especial és el símbol de la decisió. Amb aquest símbol, el programa pot seguir dos camins diferents, depenent de si la condició es compleix o no es compleix.

source: Símbolo de decisión. El camino a seguir depende de la condición.
ca: Símbol de decisió. La manera de seguir depèn de la condició.

source: **Flechas de flujo**
ca: ** fletxes de flux **

source: Todos los símbolos deben ir enlazados entre sí por flechas que indican cómo se realiza la secuencia. Las flechas indican el camino o flujo que sigue el ordenador desde el comienzo hasta la finalización del programa, a través de todas las tareas.
ca: Tots els símbols s’han d’enllaçar entre ells per fletxes que indiquen com es realitza la seqüència. Les fletxes indiquen la ruta o el flux que segueix l’ordinador des del principi fins a la finalització del programa, a través de totes les tasques.

source: Flecha de unión de las tareas.
ca: Fletxa de les tasques de la Unió.

source: **Conectores de flechas**
ca: ** Connectors de fletxa **

source: Cuando las dos tareas a unir están demasiado lejos o cuando resulta confuso cruzar muchas flechas, entonces se utilizan dos círculos con un mismo número, para indicar el comienzo y el final de la flecha:
ca: Quan les dues tasques que s’han de sumar són massa lluny o quan es confonen creuar moltes fletxes, s’utilitzen dos cercles amb el mateix nombre, per indicar l’inici i el final de la fletxa:

source: Cada flecha debe tener un número diferente, de forma que debe haber solo 2 círculos con un mismo número: un círculo de comienzo y otro de finalización.
ca: Cada fletxa ha de tenir un nombre diferent, de manera que només hi ha d’haver dos cercles amb el mateix número: un inici i un altre cercle de terminació.

source: Flecha larga, separada por conectores circulares.
ca: Fletxa llarga, separada per connectors circulars.

source: **Otros símbolos**
ca: ** Altres símbols **

source: Hasta ahora hemos visto los símbolos más importantes. Con ellos se pueden representar todos los diagramas con los que vamos a trabajar. También existen otros símbolos especializados que permiten representar tareas con más detalle, pero utilizarlos solo complicaría más los diagramas, de manera que no los usaremos.
ca: Fins ara hem vist els símbols més importants. Amb ells podeu representar tots els diagrames amb els quals anem a treballar. També hi ha altres símbols especialitzats que permeten representar les tasques amb més detall, però utilitzar -les només complicaria els diagrames, de manera que no els utilitzarem.

source: Diagramas de ejemplo
ca: Exemple Diagrames

source: **Diagrama secuencial**
ca: ** Diagrama seqüencial **

source: En este diagrama las tareas se suceden una a otra, sin ninguna decisión. Este tipo de diagrama es útil para conocer el orden en el que hay que realizar una tarea.
ca: En aquest diagrama, les tasques es segueixen sense cap decisió. Aquest tipus de diagrama és útil per conèixer l’ordre en què s’ha de realitzar una tasca.

source: Diagrama de flujo que describe cómo hacer un huevo frito.
ca: Diagrama de flux que descriu com fer un ou fregit.

source: **Diagrama con condiciones**
ca: ** Diagrama amb condicions **

source: En este tipo de diagrama, el flujo de la tarea no es secuencial y se desvía dependiendo de las condiciones que se cumplan.
ca: En aquest tipus de diagrama, el flux de la tasca no és seqüencial i es desvia en funció de les condicions que es compleixen.

source: Cómo mover un personaje con el teclado.
ca: Com moure un personatge amb el teclat.

source: Web para dibujar diagramas de flujo online:
ca: Web per dibuixar diagrames de fluxos en línia:

source: Ejercicios
ca: Exercicis

source: Dibuja un diagrama de flujo que describa las tareas más importantes que tienes que realizar por las mañanas desde que te despiertas hasta que llegas al instituto. Debe haber entre 5 y 8 tareas.
ca: Dibuixeu un diagrama de flux que descrigui les tasques més importants que heu de realitzar al matí des que us desperteu fins que arribeu a l’institut. Hi ha d’haver entre 5 i 8 tasques.

source: Dibuja el diagrama de flujo de un semáforo que enciende una luz verde 10 segundos, luego apaga la luz verde y enciende una luz ámbar dos segundos, luego apaga la luz ámbar y enciende una luz roja 10 segundos. Por último apaga la luz roja y vuelve a comenzar el ciclo.
ca: Dibuixa el diagrama de flux d’un semàfor que encén una llum verda 10 segons, després apaga la llum verda i s’encén una llum ambre dos segons, després apaga la llum ambre i envia una llum vermella 10 segons. Finalment, apagueu la llum vermella i torneu a començar el cicle.

source: Dibuja un diagrama de flujo que explique cómo arreglar una lámpara. Primero debes comprobar si hay luz en la casa. Después comprobarás si la lámpara está conectada. Por último comprobarás que la bombilla no está fundida. Se debe dar solución a cada una de las situaciones anteriores. Si no se da ninguna de las situaciones anteriores, llamarás al servicio de reparación.
ca: Dibuixeu un diagrama de flux que expliqui com arreglar una làmpada. Primer heu de comprovar si hi ha llum a la casa. Aleshores comprovarà si la làmpada està connectada. Finalment, veureu que la bombeta no és fos. S'ha de donar solució a cadascuna de les situacions anteriors. Si es dóna alguna de les situacions anteriors, trucareu al servei de reparació.

source: Dibuja un diagrama de flujo que describa un método para ordenar cartas numeradas, de menor a mayor.
ca: Dibuixeu un diagrama de flux que descrigui un mètode per ordenar lletres numerades, de menys a més gran.

source: Hay dos montones de cartas, uno desordenado y otro ordenado. Primero hay que tomar una carta del montón desordenado. A continuación, se compara con la primera carta del montón ordenado. Si la nueva carta es más pequeña, se coloca sobre el montón ordenado.
ca: Hi ha dues cartes, una desordenada i una ordenada. Primer heu de prendre una carta de la pila desordenada. A continuació, es compara amb la primera lletra de la pila ordenada. Si la nova lletra és més petita, es col·loca a la pila ordenada.

source: Si la nueva carta es mayor que la primera carta ordenada, buscamos la siguiente carta del montón ordenado y volvemos a comparar qué carta es mayor. Repetimos esto hasta que la nueva carta esté colocada en su sitio.
ca: Si la nova lletra és superior a la primera lletra ordenada, busquem la carta següent de la pila ordenada i comparem quina carta és més gran. Ho repetim fins que la nova lletra es posi al seu lloc.

source: Una vez colocada la nueva carta, volvemos a tomar otra carta del montón desordenado.
ca: Un cop col·locada la nova carta, agafem una altra carta de la pila desordenada.

source: Cuando se termine el montón de cartas desordenadas, el programa termina.
ca: Quan s’acaba la pila de cartes desordenades, el programa s’acaba.

source: Dibuja un diagrama de flujo con ayuda del ordenador y con el programa Libre Office Draw. En la siguiente sección puedes descargar una plantilla de Libre Office Draw para dibujar diagramas de flujo.
ca: Dibuixa un diagrama de flux amb ajuda informàtica i amb el programa de dibuix gratuït. A la secció següent podeu descarregar una plantilla de sorteig d’oficina gratuïta per dibuixar diagrames de flux.

source: Descargas
ca: Descàrregues

source: :download:`Plantilla para realizar diagramas de flujo. Formato Libre Office Draw. <prog/prog-flowcharts-template.odg>`
ca: : Descarregueu: `Plantilla per a diagrames de flux. Dibuix d’oficina de format gratuït. <Prog/Prog-FlowCharts-Template.odg>`

source: :download:`Diagramas de flujo. Formato Libre Office Draw. <prog/prog-flowcharts.odg>`
ca: : Descàrrega: `Diagrames de flux. Dibuix d’oficina de format gratuït. <Prog/Prog-FlowCharts.odg>`

source: :download:`Tema diagramas de flujo en formato Microsoft Word. <prog/prog-diagramas-de-flujo.doc>`
ca: : Descarregueu: `Theme Flow Sharts en format Microsoft Word. <Prog/Prog-Diagrams-Flujo.doc>`

source: :download:`Tema diagramas de flujo en formato PDF. <prog/prog-diagramas-de-flujo.pdf>`
ca: : Descarregueu: `Diagrames de flux de temes en format PDF. <Prog/Prog-Diagrams-Flujo.pdf>`
