Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/prog-unplugged.po
Languages: ca

source: Actividades desenchufadas
ca: Activitats desconnectades

source: En este apartado se verán varios recursos para aprender a programar sin utilizar el ordenador. Es lo que se denomina **actividades desenchufadas** o actividades unplugged.
ca: En aquesta secció es veuran diversos recursos per aprendre a programar sense utilitzar l’ordinador. És el que s’anomena ** activitats desconnectades ** o activitats desconnectades.

source: CS Unplugged
ca: Cs desconnectat

source: Computer Science Unplugged es una colección de material didáctico gratuito que enseña informática a través de interesantes juegos y puzles con la ayuda de cartas, cuerdas, lápices de colores y mucha actividad física.
ca: La informàtica Unplugged és una col·lecció de material didàctic gratuït que ensenya la informàtica a través de jocs i trencaclosques interessants amb l’ajuda de cartes, cadenes, llapis de colors i molta activitat física.

source: `Libro en español de Computer Science Unplugged. <../_static/document/prog-cs-unplugged.pdf>`__
ca: `Llibre espanyol de la informàtica desconnectada. <../_ Static/Document/Prog-CS-Unplugged.pdf>`__

source: Web de CS Unplugged:
ca: CS Desconnectat Lloc web:

source: `Página de inicio <https://www.csunplugged.org/es/>`__
ca: `Pàgina d'inici <https://www.csunplugged.org/es/>`__

source: `¿Qué es la informática? <https://www.csunplugged.org/es/what-is-computer-science/>`__
ca: `Què és la informàtica? <https://www.csunplugged.org/es/what-is-putry-science/> `` `` `

source: `¿Cómo enseño CS Unplugged? <https://www.csunplugged.org/es/how-do-i-teach-cs-unplugged/>`__
ca: "Com puc ensenyar a CS desconnectat? <https://www.csunplugged.org/es/how-do

source: `Temas en español y en inglés <https://www.csunplugged.org/es/topics/>`__
ca: `Assumptes en castellà i anglès <https://www.csunplugged.org/es/topics/>`__ __

source: Para imprimir:
ca: Per imprimir:

source: `Binario a alfabeto <https://www.csunplugged.org/es/resources/binary-to-alphabet/>`__
ca: `Binari a alfabet <https://www.csunplugged.org/es/resources/binary-to-alphabet/>`__

source: `Búsqueda de cartas <https://www.csunplugged.org/es/resources/searching-cards/>`__
ca: `Cerqueu targetes <https://www.csunplugged.org/es/resources/searching-desd/>` `` ``

source: `Cartas binarias <https://www.csunplugged.org/es/resources/binary-cards/>`__
ca: `Lletres binàries <https://www.csunplugged.org/es/resources/binary-ards/>` `` ``

source: `Cartas binarias (pequeñas) <https://www.csunplugged.org/es/resources/binary-cards-small/>`__
ca: `Lletres binàries (petites) <https://www.csunplugged.org/es/resources/binary-des-small/>`__

source: `Cartas de paridad <https://www.csunplugged.org/es/resources/parity-cards/>`__
ca: `Parity Letters <https://www.csunplugged.org/es/resources/parity-ards/>` `` `

source: `Cartas derecha e izquierda <https://www.csunplugged.org/es/resources/left-right-cards/>`__
ca: `Lletres dretes i esquerres <https://www.csunplugged.org/es/resources/left-right-cards/>`__

source: `Cartas de red de ordenamiento <https://www.csunplugged.org/es/resources/sorting-network-cards/>`__
ca: "Ordena les cartes de xarxa <https://www.csunplugged.org/es/resources/sorting-network-ards/>`__

source: `Cartel de la suma de comprobación del código de barras <https://www.csunplugged.org/es/resources/barcode-checksum-poster/>`__
ca: `Poster de la verificació de la barra.

source: `Caza de números <https://www.csunplugged.org/es/resources/number-hunt/>`__
ca: `Números de caça <https://www.csunplugged.org/es/resources/number-hunt/>` `` ``

source: `Cuadrícula <https://www.csunplugged.org/es/resources/grid/>`__
ca: `Grid <https://www.csunplugged.org/es/resources/grid/>`__

source: `Estaciones de tren <https://www.csunplugged.org/es/resources/train-stations/>`__
ca: `Estacions de tren <https://www.csunplugged.org/es/resources/train-stations/>` `` ``

source: `Flechas <https://www.csunplugged.org/es/resources/arrows/>`__
ca: `Fletxes <https://www.csunplugged.org/es/resources/arrows/>` `` `` ``

source: `Insignias de trabajo <https://www.csunplugged.org/es/resources/job-badges/>`__
ca: `Work Badges <https://www.csunplugged.org/es/resources/job-badges/>` `` ``

source: `Isla del Tesoro <https://www.csunplugged.org/es/resources/treasure-island/>`__
ca: `Illa del Tresor <https://www.csunplugged.org/es/reources/reasure-island/>` `` ``

source: `Módulo reloj <https://www.csunplugged.org/es/resources/modulo-clock/>`__
ca: `Mòdul de rellotge <https://www.csunplugged.org/es/resources/modulo-lock/>` `` ``

source: `Pintor de píxeles <https://www.csunplugged.org/es/resources/pixel-painter/>`__
ca: `Píxel pintor <https://www.csunplugged.org/es/resources/pixel-pinter/>`__ __

source: `Red de ordenamiento <https://www.csunplugged.org/es/resources/sorting-network/>`__
ca: `Network Ordening <https://www.csunplugged.org/es/resources/sorting-network/>` `` `` `

source: `Teclas de piano <https://www.csunplugged.org/es/resources/piano-keys/>`__
ca: `Piano Keys <https://www.csunplugged.org/es/resources/piano-keys/>` ``

source: `Ventanas binarias <https://www.csunplugged.org/es/resources/binary-windows/>`__
ca: `Windows binaris <https://www.csunplugged.org/es/resources/binary-windows/>` `` `` `

source: Bebras
ca: Nadons

source: Bebras es una iniciativa internacional, impulsada por la fundación Raspberry Pi, dedicada a promover la informática y el pensamiento computacional entre los estudiantes de todas las edades.
ca: Babras és una iniciativa internacional, promoguda per la Raspberry Pi Foundation, dedicada a promoure la informàtica i el pensament computacional entre estudiants de totes les edats.

source: `Estrategias para resolver problemas. <../_static/document/prog-bebras-estrategias.pdf>`__
ca: `Estratègies per resoldre problemes. <../_ static/document/prog-bebras-strategias.pdf>`__

source: `Tarjetas de desafío. Tanda 1. <../_static/document/prog-bebras-desafio-tanda-1.pdf>`__
ca: `Targetes de desafiament. Tanda 1. <../_ Static/Document/Prog-Bebras-DeSafio-Tandanda-1.pdf>`__

source: `Tarjetas de desafío. Tanda 1. <../_static/document/prog-bebras-desafio-tanda-2.pdf>`__
ca: `Targetes de desafiament. Tanda 1. <../_ Static/Document/Prog-Bebras-Disafio-Tanda-2.pdf>`__

source: `Tarjetas Bebras versión 2. <../_static/document/prog-bebras-tarjetas-v2.pdf>`__
ca: `Targetes Brat Versió 2.

source: `Tarjetas Bebras versión 2. Respuestas. <../_static/document/prog-bebras-tarjetas-v2-respuestas.pdf>`__
ca: `BROPS CARTS Versió 2. Respostes. <../_ Static/Document/Prog-Bebebras-Tarjetas-V2-ANSTITES.PDF>`__

source: `Actividades desenchufadas de code.org <https://code.org/curriculum/unplugged>`__
ca: `Activitats desconnectades de code.org <https://code.org/curriculum/unplugged>`__

source: `A3. Mapas Felices. <https://studio.code.org/s/coursea-2022/lessons/3?lang=es-ES>`__
ca: `A3. Maps feliços. <https://studio.code.org/s/coursea-2022/ssons/3?lang=es-es> `` ``

source: `A7. Bucles felices. <https://studio.code.org/s/coursea-2022/lessons/7?lang=es-ES>`__
ca: `A7. Bucles feliços. <https://studio.code.org/s/coursea-2022/less/7?lang=es-are> `` `` ``

source: `A11. El Gran Evento Jr. <https://studio.code.org/s/coursea-2022/lessons/11?lang=es-ES>`__
ca: `A11. El gran esdeveniment Jr.

source: `B2. Muévelo, Muévelo. <https://studio.code.org/s/courseb-2022/lessons/2?lang=es-ES>`__
ca: `B2. Mou -ho, mou -lo. <https://studio.code.org/s/courseb-2022/less/2?lang=es-es>`__

source: `B6. Bucleandose. <https://studio.code.org/s/courseb-2022/lessons/6?lang=es-ES>`__
ca: `B6. Bucle. <https://studio.code.org/s/courseb-2022/less/6lang=es-are> `` `` ``

source: `B10. La aplicación correcta. <https://studio.code.org/s/courseb-2022/lessons/10?lang=es-ES>`__
ca: `B10. L’aplicació correcta. <https://studio.code.org/s/courseb-2022/less/10?lang=es-are> `` `` `

source: `C2. Mis amigos robóticos Jr. <https://studio.code.org/s/coursec-2022/lessons/2?lang=es-ES>`__
ca: `C2. Els meus amics robòtics Jr.

source: `C7. Mis amigos robóticos y repetitivos Jr. <https://studio.code.org/s/coursec-2022/lessons/7?lang=es-ES>`__
ca: `C7. Els meus amics robòtics i repetitius Jr.

source: `C11. El Gran Evento <https://studio.code.org/s/coursec-2022/lessons/11?lang=es-ES>`__
ca: `C11. El gran esdeveniment <https://studio.code.org/s/coursec-2022/less/11?lang=es-are> `` ``

source: `C15. Pulseras Binarias. <https://studio.code.org/s/coursec-2022/lessons/15?lang=es-ES>`__
ca: `C15. Polseres binàries. <https://studio.code.org/s/coursec-2022/less/15?lang=es-are> `` ``

source: `D2. Programación en papel cuadriculado. <https://studio.code.org/s/coursed-2022/lessons/2?lang=es-ES>`__
ca: `D2. Programació de paper de campament. <https://studio.code.org/s/coursed-2022/less/2! Lang = es -are> `` `` `` `

source: `D4. Programación de Relevos. <https://studio.code.org/s/coursed-2022/lessons/4?lang=es-ES>`__
ca: `D4. Programació de relé. <https://studio.code.org/s/coursed-2022/lesons/4?lang=en-are> `` `` ``

source: `D12. Condicionales con tarjetas. <https://studio.code.org/s/coursed-2022/lessons/12?lang=es-ES>`__
ca: `D12. Condicional amb cartes. <https://studio.code.org/s/coursed-2022/ssons/12ung=es-es> `` `` `

source: `E9. Composición Musical <https://studio.code.org/s/coursee-2022/lessons/9?lang=es-ES>`__
ca: `E9. Composició musical <https://studio.code.org/s/coursee-2022/ssons/9?lang=es-es>`__

source: `E15. Diseñar con la accesibilidad en mente. <https://studio.code.org/s/coursee-2022/lessons/15?lang=es-ES>`__
ca: `E15. Disseny tenint en compte l’accessibilitat. <https://studio.code.org/s/coursee-2022/less/15?lang=es-are> `` `` `

source: `E16. Colaboración digital <https://studio.code.org/s/coursee-2022/lessons/16?lang=es-ES>`__
ca: `E16. Col·laboració digital <https://studio.code.org/s/coursee-2022/plens/16?lang=es-es>`__

source: `F6: Historias del espacio en blanco. <https://studio.code.org/s/coursef-2022/lessons/6?lang=es-ES>`__
ca: `F6: històries d'espai en blanc. <https://studio.code.org/s/coursef-2022/less/6lang=es-es>`__

source: `F13: Diversión con bucles Para. <https://studio.code.org/s/coursef-2021/lessons/13?lang=es-ES>`__
ca: `F13: diversió amb bucles per a. <https://studio.code.org/s/coursef-2021/ssons/13?lang=es-es> `` ``

source: `F15: Internet. <https://studio.code.org/s/coursef-2022/lessons/15?lang=es-ES>`__
ca: `F15: Internet. <https://studio.code.org/s/coursef-2022/less/15?lang=es-are> `` `` `

source: Programamos.es
ca: Programem.es

source: `Actividades desenchufadas de Programamos.es. <https://programamos.es/recopilacion-de-actividades-desenchufadas-para-trabajar-el-pensamiento-computacional/>`__
ca: `Activitats del programa desconnectades. •

source: `Divide y vencerás. <../_static/document/programamos-es-1-divide-y-venceras.pdf>`__
ca: `Divideix i guanya. <../_ estàtic/document/programació

source: `Programando robots... ¡humanos! <../_static/document/programamos-es-2-programando-robots-humanos.pdf>`__
ca: "Robots de programació ... humans! <../_ estàtic/document/programació

source: `Bailando en bucle. <../_static/document/programamos-es-3-bailando-en-bucle.pdf>`__
ca: `Ballar en bucle. <../_ Static/Document/Programmos-es-3- Bailando-en-bucle.pdf>`__

source: `Mi propio mando a distancia. <../_static/document/programamos-es-4-mando-a-distancia.pdf>`__
ca: `El meu propi control remot. <../_ Static/Document/Programmos-es-4-Mando-a-Distancia.pdf>`__

source: `Cartas lógicas. <../_static/document/programamos-es-5-cartas-logicas.pdf>`__
ca: `Lletres lògiques. <../_ Static/Document/Programmos-es-5-LoGAS-Logicas.pdf> `__

source: `Sobres variables. <../_static/document/programamos-es-6-sobres-variables.pdf>`__
ca: `Sobres variables. <../_ Static/Document/Programmos-es-6-Sobres-Variable.pdf>`__

source: Varios
ca: Alguns

source: `Alphabot de Lobotic. <https://github.com/lobotic/GuiasEducativas/tree/main/Alphabot>`__
ca: `Alfòtics alfòtics. <https://github.com/lobotic/guiaseducativas/tree/main/alphabot>`__

source: `Cody & Roby <https://www.codeweek.it/cody-roby-en/>`__
ca: `Cody & Roby <https://www.codeeweek.it/cody-roby-en/>`__

source: `Computación en Educación Básica (en portugués). <https://www.computacional.com.br/>`__
ca: `Informàtica en educació bàsica (en portuguès). <https://www.computacional.com.br/>`__
