Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/python-listas-metodos.po
Languages: ca

source: Métodos de listas
ca: Llista de mètodes

source: Los `métodos de las listas <https://docs.python.org/es/3/tutorial/datastructures.html#more-on-lists>`__ son funciones asociadas a las listas que se pueden utilizar para manejarlas. Se llaman añadiendo un punto y el nombre del método::
ca: Els `LLISTA MÈTODES <https://docs.python.org/es/3/torma/datasructures.html#more-on-listes>`__ són funcions associades a les llistes que es poden utilitzar per gestionar-les. Es diuen afegir un punt i el nom del mètode ::

source: Funciones con listas
ca: Funcions amb llistes

source: La función ``max(lista)`` devuelve el elemento con mayor valor de todos los elementos de la lista::
ca: La funció `` max (llista) retorna l'element amb el valor més alt de tots els elements de la llista ::

source: La función ``min(lista)`` devuelve el elemento con menor valor de todos los elementos de la lista::
ca: La funció `` min (llista) retorna l'element amb el valor més baix de tots els elements de la llista ::

source: La función ``sum(lista)`` devuelve la suma de todos los números que contiene una lista::
ca: La funció `som (llista) retorna la suma de tots els números que conté una llista ::

source: La función ``len(lista)`` devuelve el número de elementos que contiene una lista::
ca: La funció `` len (llista) retorna el nombre d'elements que contenen una llista ::

source: La función ``sorted(lista)`` devuelve otra lista ordenada de menor a mayor::
ca: El `` ordenat (llista) `` retorna una altra llista més gran a la llista ::

source: Convierte un iterable en una lista::
ca: Converteix un iterable en una llista ::

source: Ejercicios
ca: Exercicis

source: Escribe una función que calcule el promedio de una lista de números. El promedio es igual a la suma de los elementos dividido entre el número de elementos.
ca: Escriviu una funció que calculi la mitjana d’una llista de números. La mitjana és igual a la suma dels elements dividits pel nombre d’elements.

source: Llama a la función para calcular el promedio de las siguientes listas::
ca: Truqueu a la funció per calcular la mitjana de les llistes següents ::

source: Escribe una función que acepte una lista como argumento y que retorne otra lista que contenga solo los números pares.
ca: Escriviu una funció que accepti una llista com a argument i retorna una altra llista que només conté números parells.

source: Debes crear una nueva lista vacía y añadirle los números pares de la lista pasada como argumento.
ca: Heu de crear una nova llista buida i afegir els números uniformes de la darrera llista com a argument.

source: Llama a la función con las siguientes listas como argumentos::
ca: Truqueu a la funció amb les llistes següents com a arguments ::

source: Escribe una función que acepte una lista como argumento y que retorne otra lista con el elemento menor, el elemento mayor, el número de elementos y la suma de todos los elementos.
ca: Escriviu una funció que accepti una llista com a argument i retorna una altra llista amb l’element menor, l’element principal, el nombre d’elements i la suma de tots els elements.

source: Llama a la función con las siguientes listas como argumento::
ca: Truqueu a la funció amb les llistes següents com a argument ::
