Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/python-listas-iteracion.po
Languages: ca

source: Iteración de listas
ca: Iteració de llistes

source: Iterar una lista significa recorrer cada uno de los elementos de la lista uno a uno para realizar alguna acción con cada elemento. Esta técnica permite manipular datos de manera repetitiva sin tener que escribir el código varias veces.
ca: Iterar una llista significa viatjar cadascun dels elements de la llista un per un per realitzar alguna acció amb cada element. Aquesta tècnica us permet manipular de forma repetitiva les dades sense haver d’escriure el codi diverses vegades.

source: Las listas se pueden iterar con un bucle ``for``.
ca: Les llistes poden beepo amb un bucle `` per ''.

source: Ejemplo::
ca: Exemple ::

source: Salida::
ca: Sortida ::

source: Función ``len()``
ca: Funció `` len ()`

source: La función ``len()`` devuelve el número de elementos que contiene una lista. Es útil para realizar iteraciones con el **índice** en el que se encuentra cada elemento::
ca: La funció `` len () retorna el nombre d'elements que conté una llista. És útil per a iteracions amb l’índex ** ** en què es troba cada element ::

source: Función ``list()``
ca: `` Llista () ```

source: La función ``list()`` permite crear una lista a partir de varios elementos o convertir un iterable como ``range()`` en una lista::
ca: La `` llista () `` `us permet crear una llista de diversos elements o convertir un iterable com a '` Rage () `` en una llista ::

source: Comprensión de listas
ca: Enumereu la comprensió

source: La comprensión de listas es un método escueto y rápido de generar listas. Utiliza el bucle ``for`` dentro de dos corchetes ``[ ]``
ca: La comprensió de la llista és un mètode breu i ràpid de generar llistes. Utilitzeu el bucle `` `` dins de dos claudàtors `` [] `` `

source: Es equivalente a este otro código, más lento y largo de escribir::
ca: És equivalent a aquest altre codi, més lent i llarg per escriure ::

source: Ejercicios
ca: Exercicis

source: Escribe un programa que defina una lista de nombres y a continuación imprima en pantalla el nombre y la letra por la que comienza con el siguiente formato::
ca: Escriviu un programa que defineixi una llista de noms i després s’imprimeixi a la pantalla el nom i les lletres pel qual comença amb el format següent ::

source: Escribe un programa que pida una frase por la entrada de teclado. El programa debe convertir la frase en una lista de caracteres.
ca: Escriviu un programa que demani una frase per a l’entrada del teclat. El programa ha de convertir la frase en una llista de personatges.

source: A continuación el programa debe imprimir la frase al revés, comenzando por la última letra y terminando por la primera letra.
ca: Aleshores, el programa ha d’imprimir la frase cap enrere, a partir de l’última lletra i acabant per a la primera lletra.

source: Pista: para ir desde el final hasta el principio se puede utilizar un índice con la función ``for i in range(len(lista)-1, -1, -1):``.
ca: Pista: anar del final al començament, es pot utilitzar un índex amb el `` per a la gamma (len (llista) -1, -1, -1): ``.

source: Escribe un programa que genere una lista de los números impares hasta el 99. El programa debe sumar todos los números de la lista e imprimir el resultado, que debe ser igual a 2500.
ca: Escriviu un programa que generi una llista de números imparells fins al 99. El programa ha d’afegir tots els números a la llista i imprimir el resultat, que ha de ser igual a 2500.

source: Escribe un programa que defina la siguiente lista de elementos::
ca: Escriviu un programa que defineixi la llista següent d’elements ::

source: El programa debe generar una nueva lista que contenga todos los elementos de la primera excepto los que están duplicados::
ca: El programa ha de generar una nova llista que contingui tots els elements del primer, excepte els que es dupliquen ::

source: Pista: recorre todos los elementos de la lista_1 y si no están en la lista_2, los añades a la lista_2.
ca: Pista: recorre tots els elements de la llista_1 i si no són a la llista_2, els afegiu a la llista_2.

source: Escribe un programa que lea una frase desde el teclado y la cifre con el siguiente algoritmo.
ca: Escriviu un programa que llegeixi una frase del teclat i del kifre amb l'algoritme següent.

source: El programa debe dividir la frase en letras con la función ``list(frase)``.
ca: El programa ha de dividir la frase en lletres amb la `` llista (frase) ``.

source: A continuación el programa debe generar una nueva lista con las letras con índice par.
ca: A continuació, el programa ha de generar una nova llista amb les lletres amb un par.

source: A esa nueva lista se deben añadir al final las letras con índice impar.
ca: A aquesta llista nova, les lletres amb un índex estrany s’han d’afegir al final.

source: Por último se imprimirán todas las letras de la nueva lista juntas.
ca: Finalment, s’imprimiran totes les cartes de la nova llista.

source: Escribe un programa que descifre el código producido por el anterior programa.
ca: Escriviu un programa que desxifiqui el codi produït pel programa anterior.
