Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/python-textos-metodos.po
Languages: ca

source: Métodos de cadenas de texto
ca: Mètodes de la cadena de text

source: Los `métodos de las cadenas de texto <https://docs.python.org/es/3/library/stdtypes.html#string-methods>`__ son funciones que trabajan asociadas a las cadenas de texto, que se usan como argumento.
ca: Els mètodes de "cadenes de text <ds <https://docs.python.org/es/3/libry/stdtypes.html#sting-methods>`__ són funcions que funcionen associades a cadenes de text, que s'utilitzen com a argument.

source: Al estar asociadas a las cadenas de texto, se las llama añadiendo un punto y el nombre detrás de la cadena de texto o detrás de la variable que contiene la cadena de texto. El argumento de la función será la cadena de texto que precede al punto.
ca: Associats a les cadenes de text, s’anomenen afegint un punt i el nom que hi ha darrere de la cadena de text o darrere de la variable que conté la cadena de text. L’argument de la funció serà la cadena de text que precedeix el punt.

source: Esta es una nueva forma de usar funciones, que se estudiará con mayor profundidad en el apartado dedicado a las Clases en Python y a la programación orientada a objetos.
ca: Aquesta és una nova manera d’utilitzar funcions, que s’estudiarà amb més profunditat de la secció dedicada a les classes en programació orientada a Python i Object.

source: Ejemplos::
ca: Exemples ::

source: Hay muchos más métodos de cadena de texto, pero por ahora con estos que se han listado podremos hacer la mayoría de las operaciones que necesitamos.
ca: Hi ha molts més mètodes de cadena de text, però de moment amb aquests que s’han enumerat podem fer la major part de les operacions que necessitem.

source: Sentencia ``in``
ca: Judici `` in ''

source: La sentencia ``in`` sirve para conocer si un texto se encuentra dentro de otro texto::
ca: El judici `` in '' serveix per saber si un text es troba dins d'un altre text ::

source: La sentencia es sensible a mayúsculas y minúsculas, por lo que a veces puede ser interesante utilizar el método ``.lower()`` para transformar todas las frases a minúsculas y que las cadenas de texto coincidan::
ca: La frase és sensible a la part superior i minúscula, de manera que de vegades pot ser interessant utilitzar el `` `` `

source: Ejercicios
ca: Exercicis

source: Escribe una función que acepte una cadena de texto como argumento y que retorne la cadena de texto en mayúsculas y en minúsculas alternas. La primera letra debe ser mayúscula, la segunda minúscula la tercera mayúscula, la cuarta minúscula y seguir así la secuencia hasta el final del texto.
ca: Escriviu una funció que accepti una cadena de text com a argument i retorna la cadena de text en majúscules i en minúscules alternatives. La primera lletra s’ha de capitalitzar, la segona minúscula del tercer capital, la quarta minúscula i, per tant, seguir la seqüència fins al final del text.

source: Ejemplo::
ca: Exemple ::

source: La variable 'mayuscula' debe cambiar de valor de True a False y viceversa cada vez que se añada una nueva letra a la variable 'texto_nuevo'.
ca: La variable `` il·legal 'ha de canviar el valor de veritable a fals i viceversa cada vegada que s'afegeix una nova lletra a la variable' Reefuevo '.

source: Modifica el programa anterior para que solo sean mayúsculas la primera letra y las letras que estén en un índice múltiplo de 3.
ca: Modifiqueu el programa anterior de manera que només la primera lletra i les cartes que es troben en un índex múltiple de 3 siguin capital.

source: Escribe un programa que pida una frase al usuario que describa a Lionel Messi sin escribir en esa frase ninguna palabra tabú.
ca: Escriviu un programa que demani una frase a l’usuari que descrigui Lionel Messi sense escriure en aquesta frase cap paraula tabú.

source: Las palabras tabú son Argentina, Barcelona, futbol.
ca: Les paraules tabú són Argentina, Barcelona, ​​Futbol.

source: El programa debe detectar si se ha escrito alguna palabra tabú independientemente de las mayúsculas o minúsculas.
ca: El programa ha de detectar si s'ha escrit una paraula tabú independentment de la part superior o inferior.

source: Escribe una función que acepte una cadena de texto como argumento y que imprima la cadena de texto con todas las vocales reemplazadas por otra vocal que establezcamos en el segundo argumento. Llama a la función con varias frases de ejemplo para probar su funcionamiento.
ca: Escriviu una funció que accepti una cadena de text com a argument i imprimeix la cadena de text amb totes les vocals substituïdes per una altra vocal que establim en el segon argument. Truqueu a la funció amb diverses frases d’exemple per provar el seu funcionament.

source: Por defecto la vocal de reemplazo será la 'e'.
ca: De manera predeterminada, la vocal de substitució serà la "e".

source: Para facilitar el programa transformaremos el texto a minúsculas.
ca: Per facilitar el programa, transformarem el text en minúscules.
