Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/python-for-anidados.po
Languages: ca

source: Sentencias ``for`` anidadas
ca: Judicis `` `` anity

source: Una estructura de programación se dice que está anidada cuando se encuentra dentro de otra.
ca: Es diu que una estructura de programació està nidificada quan es troba dins d'una altra.

source: Cada nivel extra con otra instrucción ``for`` habrá que escribir el código con sangría, es decir, con espacios a la izquierda.
ca: Cada nivell addicional amb una altra instrucció `` per '' El codi amb sagnat haurà d'escriure, és a dir, amb espais a l'esquerra.

source: Este es un ejemplo con la instrucción ``for`` anidada en dos niveles que genera una tabla de multiplicar::
ca: Aquest és un exemple amb la instrucció `` `` nidificada en dos nivells que genera una taula de multiplicació ::

source: Resultado::
ca: Resultat ::

source: El carácter '\\t' significa tabulación y sirve para separar dos números en 8 caracteres.
ca: El personatge '\\ t' significa tabulació i serveix per separar dos números en 8 caràcters.

source: Ejercicios
ca: Exercicis

source: Escribe un programa que pida un número y te responda si ese número es el resultado de multiplicar dos números en el rango del 1 al 10.
ca: Escriviu un programa que sol·liciti un número i respon si aquest número és el resultat de multiplicar dos números en el rang d’1 a 10.

source: Escribe un programa que genere un triángulo de asteriscos gracias a un bucle anidado. En la primera línea debe dibujar un asterisco. En la segunda línea debe dibujar dos asteriscos. Seguirá así hasta dibujar diez asteriscos en la décima línea
ca: Escriviu un programa que generi un triangle asteriscs gràcies a un bucle imbricat. A la primera línia, heu de dibuixar un asterisc. A la segona línia, heu de dibuixar dos asteriscs. Continuarà traient deu asteriscs a la desena línia

source: Salida::
ca: Sortida ::

source: Modifica el programa anterior para que imprima un triángulo de números como se muestra a continuación::
ca: Modifica el programa anterior per imprimir un triangle de números com es mostra a continuació ::

source: Dibuja un triángulo invertido que comience con 10 asteriscos y termine con un solo asterisco.
ca: Dibuixa un triangle invertit que comença amb 10 asteriscs i acaba amb un sol asterisc.

source: Escribe un programa que dibuje un ajedrez de asteriscos con un bucle anidado que imprima un asterisco cuando la suma de las dos coordenadas sea divisible por 2. En caso contrario debe imprimir un espacio.
ca: Escriviu un programa que dibuixi un escacs d’asteriscs amb un bucle imbricat que imprimeix un asterisc quan la suma de les dues coordenades és divisible per 2. En cas contrari, heu d’imprimir un espai.

source: El tamaño de la cuadrícula será de 10 filas por 10 columnas.
ca: La mida de la graella serà de 10 files per a 10 columnes.

source: Recuerda que al final de cada línea se debe imprimir una nueva línea con la instrucción ``print()``.
ca: Recordeu que al final de cada línia s’ha d’imprimir una nova línia amb el `` imprimir () `.

source: Modifica el programa anterior para que dibuje otro patrón de puntos. Cada punto aparecerá cuando la suma de sus coordenadas sea divisible por 3.
ca: Modifiqueu el programa anterior per dibuixar un altre patró de punts. Cada punt apareixerà quan la suma de les seves coordenades sigui divisible per 3.
