Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/python-variables.po
Languages: ca

source: Las variables
ca: Les variables

source: Las variables en un lenguaje de programación son contenedores que sirven para almacenar información con un nombre descriptivo. La forma de asignar un valor a una variable es escribir el nombre de la variable, un igual y el valor asignado::
ca: Les variables d’un llenguatge de programació són contenidors que serveixen per emmagatzemar informació amb un nom descriptiu. La manera d’assignar un valor a una variable és escriure el nom de la variable, un igual i el valor assignat ::

source: El valor de una variable se puede mantener igual a lo largo del programa o puede cambiar::
ca: El valor d’una variable es pot mantenir igual a tot el programa o pot canviar ::

source: Números mágicos
ca: Nombres màgics

source: Lo más correcto a la hora de escribir un programa es almacenar todos los números dentro de variables y utilizar a continuación solo las variables. Esto evita utilizar los llamados números mágicos, que son indeseables.
ca: El més correcte a l’hora d’escriure un programa és emmagatzemar tots els números dins de les variables i utilitzar només les variables. Això evita utilitzar els nombres màgics, que no són desitjables.

source: Los números que aparecen en un programa y no están dentro de una variable se llaman números mágicos. El programador comprende estos números en el momento de escribir el código, pero es frecuente que otras personas no puedan entender su significado. Incluso el propio programador, con el paso del tiempo, puede olvidar el significado de un número concreto que escribió en el código.
ca: Els números que apareixen en un programa i no es troben dins d’una variable s’anomenen nombres màgics. El programador entén aquests números en el moment d’escriure el codi, però és habitual que altres persones entenguin el seu significat. Fins i tot el propi programador, amb el pas del temps, pot oblidar el significat d’un número específic que va escriure al codi.

source: Las variables nos permiten dar un nombre significativo a un número, lo que facilita la lectura y la comprensión del código, evitando así los números mágicos.
ca: Les variables ens permeten donar un nom significatiu a un número, que facilita la lectura i la comprensió del codi, evitant així nombres màgics.

source: Por ejemplo, en lugar de tener que escribir en cada ocasión el número π (3.1416), debemos almacenarlo en una variable que se llame 'pi', de manera que el código sea más comprensible.
ca: Per exemple, en lloc d’haver d’escriure en cada ocasió el número π (3.1416), l’hem d’emmagatzemar en una variable anomenada “pi”, de manera que el codi sigui més comprensible.

source: Si algún día queremos cambiar el valor de esta constante, por ejemplo, para darle más dígitos de precisión (3.141592653589793), solo se tendrá que cambiar una línea de todo el código, en la definición de pi.
ca: Si un dia volem canviar el valor d’aquesta constant, per exemple, per donar més dígits de precisió (3.141592653589793), només haureu de canviar una línia de tot el codi, en la definició de PI.

source: En definitiva, las variables son una herramienta esencial en la programación ya que nos permiten almacenar y acceder a información de manera organizada y fácil de entender.
ca: En resum, les variables són una eina essencial en la programació, ja que ens permeten emmagatzemar i accedir a la informació en un organitzat i fàcil d’entendre.

source: Nombrar variables
ca: Nom de variables

source: A la hora de buscar un nombre para las variables es importante seguir algunas reglas para asegurar que el código sea fácil de entender y fácil de modificar posteriormente.
ca: Quan busqueu un nom per a les variables, és important seguir algunes regles per assegurar -vos que el codi sigui fàcil d’entendre i fàcil de modificar més endavant.

source: **Utiliza nombres significativos**
ca: ** Utilitzeu noms significatius **

source: El nombre de una variable debe reflejar su contenido o su propósito en el código. Por ejemplo, en lugar de usar una variable llamada "x" o "temp", es mejor usar un nombre como "calificaciones" o "promedio".
ca: El nom d’una variable ha de reflectir el seu contingut o el seu propòsit en el codi. Per exemple, en lloc d’utilitzar una variable anomenada \ "x " o \ "temp ", és millor utilitzar un nom com a \ "qualificacions " o \ "mitjà ".

source: **Utiliza nombres cortos pero descriptivos**
ca: ** Utilitzeu noms curts però descriptius **

source: Aunque es importante usar nombres significativos, también es importante evitar nombres demasiado largos o complejos. Un nombre corto pero descriptivo es más fácil de leer y escribir.
ca: Tot i que és important utilitzar noms significatius, també és important evitar noms massa llargs o complexos. Un nom curt però descriptiu és més fàcil de llegir i escriure.

source: **No utilices caracteres especiales**
ca: ** No utilitzeu caràcters especials **

source: **Usa la notación snake_case**
ca: ** Utilitzeu Snake_Case Notation **

source: Este es un estilo de escritura en el cual las palabras en el nombre de la variable están separadas por el carácter subrayado "_". Ejemplos de esta notación son "numero_de_alumnos", "longitud_de_piscina", etc.
ca: Es tracta d’un estil d’escriptura en què les paraules del nom de la variable estan separades pel caràcter subratllat \ "_ ". Exemples d'aquesta notació són \ "number_de_alumnos ", \ "longitud_piscina ", etc.

source: Si vamos a crear varias variables relacionadas, es preferible que su primera palabra coincida en todas ellas::
ca: Si anem a crear diverses variables relacionades, és preferible que la vostra primera paraula coincideixi en totes elles ::

source: **No utilices palabras reservadas**
ca: ** No utilitzeu paraules reservades **

source: Las palabras reservadas del lenguaje como "print", "input", "for", "while", "break", "continue", "True", "False", etc. no deben utilizarse como nombres de variable.
ca: Les paraules de llenguatge reservades com \ "imprimir ", \ "input ", \ "per ", \ "mentre ", \ "rupte ", \ "Continuar ", \ "true ", \ "fals ", etc. No s'han d'utilitzar com a names variables.

source: Siguiendo estas reglas, podrás nombrar tus variables de manera clara y organizada, lo que te ayudará a escribir un código más fácil de entender y mantener.
ca: Seguint aquestes regles, podeu anomenar les vostres variables clarament i organitzades, cosa que us ajudarà a escriure un codi fàcil per comprendre i mantenir.

source: Ejercicios
ca: Exercicis

source: Escribe un programa o macro para cada ejercicio propuesto. Guarda los programas con los nombres propuestos en los ejercicios.
ca: Escriviu un programa o macro per a cada exercici proposat. Deseu els programes amb els noms proposats als exercicis.

source: Realiza un programa para calcular el perímetro de un círculo. El programa debe pedir al usuario que ingrese el radio del círculo, y luego calcular el perímetro utilizando la fórmula "2 * pi * radio". Nombra las variables para almacenar el radio, el número pi y el perímetro del círculo.
ca: Feu un programa per calcular el perímetre d’un cercle. El programa ha de demanar a l'usuari que introdueixi el radi del cercle i, a continuació, calculeu el perímetre mitjançant la fórmula \ "2 * PI * Radio ". Poseu un nom a les variables per emmagatzemar el radi, el número PI i el perímetre del cercle.

source: Imprime el resultado en la pantalla.
ca: Imprimiu el resultat a la pantalla.

source: Recuerda convertir a float() todos los números ingresados por el teclado.
ca: No oblideu fer tots els números introduïts pel teclat per flotar.

source: Recuerda nombrar las variables con estilo snake_case.
ca: No oblideu anomenar les variables amb estil Snake_case.

source: Solución al ejercicio::
ca: Solució d'exercici ::

source: Guarda el programa con el nombre ``tema_03_ejercicio_01.py``
ca: Deseu el programa amb el nom `` subjecte_03_ejercio_01.py```

source: Observa que el número 2.0 que aparece en el programa es un número mágico. Se ha mantenido así porque es parte de la fórmula del perímetro, conocida por todos.
ca: Tingueu en compte que el número 2.0 que apareix al programa és un número màgic. Ha estat així perquè forma part de la fórmula perimetral, coneguda per tots.

source: Escribe un programa para calcular el sueldo de un empleado. El programa debe pedir al usuario que escriba las horas trabajadas. El sueldo por hora será de 15 Euros y se debe almacenar en una variable. Calcular el sueldo total multiplicando las horas por el sueldo por hora.
ca: Escriviu un programa per calcular el sou d’un empleat. El programa ha de demanar a l'usuari que escrigui les hores treballades. El sou per hora serà de 15 euros i s’ha d’emmagatzemar en una variable. Calculeu el sou total multiplicant les hores pel sou per hora.

source: Pista: utiliza el programa anterior como modelo, cambiando el nombre de las variables y los valores numéricos.
ca: Pista: utilitzeu el programa anterior com a model, canviant el nom de les variables i els valors numèrics.

source: Guarda el programa con el nombre ``tema_03_ejercicio_02.py``
ca: Deseu el programa amb el nom `` subjecte_03_ejercio_02.py```

source: Escribe un programa para calcular el volumen de un cubo. El programa debe pedir al usuario que escriba la longitud de un lado. El volumen del cubo se calculará elevando a la tercera potencia (** 3) la longitud del lado.
ca: Escriviu un programa per calcular el volum d’un cub. El programa ha de demanar a l'usuari que escrigui la longitud d'un costat. El volum del cub es calcularà augmentant la tercera potència (** 3) la longitud del costat.

source: Guarda el programa con el nombre ``tema_03_ejercicio_03.py``
ca: Deseu el programa amb el nom `` subjecte_03_ejercio_03.py```

source: Realiza un programa para calcular el cambio de una compra. El programa debe pedir al usuario que escriba el costo total de la compra y el dinero recibido. Calcular a continuación el cambio que se debe devolver realizando una resta.
ca: Feu un programa per calcular el canvi de compra. El programa ha de demanar a l’usuari que escrigui el cost total de la compra i els diners rebuts. Calculeu per sota del canvi que s’ha de retornar fent una resta.

source: Guarda el programa con el nombre ``tema_03_ejercicio_04.py``
ca: Deseu el programa amb el nom `` subjecte_03_ejercio_04.py```

source: Realiza un programa para calcular el precio final de un producto con descuento del 25%.
ca: Feu un programa per calcular el preu final d’un producte de descompte del 25%.

source: El porcentaje de descuento se debe almacenar en una variable.
ca: El percentatge de descompte s’ha d’emmagatzemar en una variable.

source: El programa debe pedir al usuario que escriba el costo del producto. Calcular a continuación el precio con descuento con la siguiente fórmula::
ca: El programa ha de demanar a l'usuari que escrigui el cost del producte. A continuació, calculeu el preu del descompte amb la fórmula següent ::

source: Guarda el programa con el nombre ``tema_03_ejercicio_05.py``
ca: Deseu el programa amb el nom `` subjecte_03_ejercio_05.py```
