Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/python-for-continue.po
Languages: ca

source: Sentencia ``continue``
ca: Judici "Continua"

source: La sentencia ``continue`` dentro de un bucle ``for`` salta al comienzo del bucle y fuerza a continuar con el siguiente elemento del bucle.
ca: El judici continua "dins d'un bucle" `` `salta al començament del bucle i la força per continuar el següent element del bucle.

source: Esta sentencia sirve para evitar que se ejecute el código dentro del bucle for que se encuentra a continuación de la sentencia ``continue``.
ca: Aquesta frase serveix per evitar que el codi s’executi dins del bucle per al qual es troba després que la sentència continuï.

source: Ejemplo que imprime todos los números del 1 al 20, excepto los múltiplos de 3::
ca: Exemple que imprimeix tots els números d’1 a 20, excepte els múltiples de 3 ::

source: Ejercicios
ca: Exercicis

source: Escribe un programa que imprima todos los números desde el 1 hasta el 20, excepto los múltiplos de 5.
ca: Escriviu un programa que imprimeixi tots els números d’1 a 20, excepte els múltiples de 5.

source: Escribe un programa que imprima todos los números desde el 1 hasta el 10, excepto el 4 y el 7.
ca: Escriviu un programa que imprimeixi tots els números d’1 a 10, excepte 4 i 7.

source: Escribe un programa que sume todos los números desde el 1 hasta el 100, excepto los múltiplos de 3. Utiliza la sentencia continue. El resultado debe ser 3367.
ca: Escriviu un programa que afegeixi tots els números d’1 a 100, excepte els múltiples de 3. Utilitzeu la frase continuada. El resultat ha de ser 3367.

source: Escribe un programa que cuente la cantidad de números que hay desde el 1 hasta el 100 si quitamos los múltiplos de 3 y los múltiplos de 7. El resultado debe ser 57.
ca: Escriviu un programa que indiqui el nombre de números d’1 a 100 si eliminem els múltiples de 3 i els múltiples de 7. El resultat ha de ser 57.

source: Escribe un programa que imprima todos los años no bisiestos desde 1600 hasta 2400.
ca: Escriviu un programa que imprimeixi cada any que no salti de 1600 a 2400.

source: Condición para saber si un año es bisiesto::
ca: Condició de saber si un any és salt ::

source: Escribe un programa que cambie todos los espacios ' ' de una frase por el símbolo barra baja '_'.
ca: Escriviu un programa que canviï tots els '' espais d'una frase per al símbol de barra baixa '_'.

source: Programa que imprime todas las letras de una frase::
ca: Programa que imprimeix totes les lletres d'una frase ::

source: Escribe un programa que imprima todas las letras de una frase cambiando todas las vocales por la letra 'a'.
ca: Escriviu un programa que imprimeixi totes les lletres d'una frase canviant totes les vocals per la lletra "A".

source: Condición para saber si una letra es una vocal::
ca: Condició de saber si una lletra és una vocal ::
