Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/python-listas-indices.po
Languages: ca

source: Índices de listas
ca: Llista dels índexs

source: Para obtener y manejar los datos de una lista se pueden utilizar índices y rebanadas igual que se utilizaban con las cadenas de texto::
ca: Per obtenir i gestionar les dades d’una llista, podeu utilitzar índexs i rodanxes tal i com s’utilitzaven amb les cadenes de text ::

source: Este esquema puede ayudar a entender la posición de los índices::
ca: Aquest esquema pot ajudar a comprendre la posició dels índexs ::

source: Los índices entre corchetes devuelven el elemento que se encuentra en esa posición de la lista, comenzando por la primera posición en el índice cero.
ca: Els índexs dels claudàtors quadrats retornen l’element que es troba en aquesta posició a la llista, a partir de la primera posició a l’índex zero.

source: Rebanadas
ca: Rodanons

source: Por su parte las rebanadas devuelven otra lista compuesta por los elementos que se encuentren entre dos índices::
ca: D'altra banda, les llesques retornen una altra llista composta pels elements que es troben entre dos índexs ::

source: Modificación de elementos
ca: Modificació dels elements

source: Al contrario que con las cadenas de texto, en las listas si que se pueden modificar sus elementos cambiándolos por otro valor::
ca: A diferència de les cadenes de text, a les llistes si poden modificar els seus elements canviant -los per un altre valor ::

source: Sentencia ``del``
ca: Judici `` de ''

source: La sentencia ``del`` (palabra que proviene de delete) elimina un elemento de la lista que se encuentre en una posición determinada::
ca: El judici `` de '' (paraula que prové de DeLete) elimina un element de la llista que es troba en una posició determinada ::

source: También se pueden utilizar rebanadas con la sentencia ``del``::
ca: També podeu utilitzar llesques amb el judici "de" ::

source: Ejercicios
ca: Exercicis

source: Escribe un programa que defina una lista con los 10 primeros números primos. A continuación debe imprimir el primer número primo, el tercero y el séptimo.
ca: Escriviu un programa que defineixi una llista amb els primers 10 números primers. Aleshores heu d’imprimir el primer cosí, el tercer i el setè.

source: Modifica el programa anterior para que imprima la suma de los 4 primeros números primos. Debes programar un bucle que cuente desde 0 hasta 3 y utilizar estos números como índices para recuperar los números primos de la lista.
ca: Modifiqueu el programa anterior per imprimir la suma dels primers 4 números primers. Heu de programar un bucle que compti de 0 a 3 i utilitzar aquests números com a índexs per recuperar els números principals de la llista.

source: Escribe un programa que defina una lista con tres nombres. El programa debe imprimir la lista, modificar el segundo nombre y volver a imprimir la lista modificada.
ca: Escriviu un programa que defineixi una llista amb tres noms. El programa ha d’imprimir la llista, modificar el segon nom i imprimir la llista modificada.

source: Escribe un programa que defina una lista con las primeras 6 letras del abecedario en mayúsculas.
ca: Escriviu un programa que defineixi una llista amb les 6 primeres lletres de l’alfabet en majúscules.

source: Imprime una sublista desde la 'B' hasta la 'D'.
ca: Imprimeix un sublista de "B" a la "D".

source: Imprime una sublista desde la 'C' hasta el final.
ca: Imprimiu un sublista des de "C" fins al final.

source: Modifica el programa anterior para que borre las posiciones pares de la lista y que luego imprima la lista resultante::
ca: Modifica el programa anterior per eliminar les posicions uniformes de la llista i, a continuació, imprimir la llista resultant ::

source: Ten en cuenta que a medida que se borran elementos de la lista, los elementos posteriores cambian de posición.
ca: Tingueu en compte que a mesura que s’esborren elements de la llista, els elements posteriors canvien la posició.

source: Escribe un programa que defina una lista con las primeras 6 letras del abecedario en mayúsculas. A continuación un bucle ``for`` debe cambiar cada una de las letras por su valor en minúsculas gracias al método ``.lower()```.
ca: Escriviu un programa que defineixi una llista amb les 6 primeres lletres de l’alfabet en majúscules. A continuació, es mostra un `` `` `` ha de canviar cadascuna de les lletres pel seu valor més baix gràcies al `` `` `` ``.

source: El bucle for debe medir la longitud de la lista con la función ``len()``.
ca: El bucle FOR ha de mesurar la longitud de la llista amb la funció `len ()`.
