Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/python-input.po
Languages: ca

source: La función :py:func:`input`
ca: La funció: py: funció: `entrada '

source: La función `input(prompt) <https://docs.python.org/es/3/library/functions.html#input>`__ imprime en pantalla el mensaje 'prompt' y devuelve una línea de texto escrita por el usuario con el teclado.
ca: La "Funció d'entrada (PROMDI) <https://docs.python.org/es/3/libry/funcctions.html#Input>`__ Imprimeix a la pantalla el missatge 'Prompra' i retorna una línia de text escrita per l'usuari amb el teclat.

source: Esta función se puede utilizar para detener la marcha del programa hasta que se pulse la tecla 'Enter' o la tecla 'Return'.
ca: Aquesta funció es pot utilitzar per aturar el programa de març fins que es prement la tecla "Enter" o la tecla "Retorn".

source: Ejemplos::
ca: Exemples ::

source: Observa cómo el número introducido es una cadena de texto, por lo que no podemos realizar cálculos con él. Para convertir el texto en un número hay que utilizar alguna de las siguientes funciones:
ca: Observeu com el número introduït és una cadena de text, de manera que no podem realitzar càlculs amb ell. Per convertir el text en un número, heu d'utilitzar qualsevol de les funcions següents:

source: ``int('')`` convierte una cadena de texto en un número entero (sin decimales)
ca: `` int ('') `` Converteix una cadena de text en un nombre enter (sense decimals)

source: ``float('')`` convierte una cadena de texto en un número en coma flotante.
ca: `` Float ('') `` Converteix una cadena de text en un número de coma flotant.

source: Ejercicios
ca: Exercicis

source: Escribe un programa que pida dos números por pantalla y luego imprima la suma de los dos.
ca: Escriviu un programa que demani dos números a la pantalla i, a continuació, imprimeix la suma dels dos.

source: Escribe un programa que pida tu nombre por pantalla y luego imprima un saludo personalizado con tu nombre.
ca: Escriviu un programa que demani el vostre nom per pantalla i, a continuació, imprimeix una salutació personalitzada amb el vostre nom.

source: Escribe un programa que pida dos números por pantalla y luego imprima el Máximo Común Divisor de los dos números.
ca: Escriviu un programa que demani dos números a la pantalla i, a continuació, imprimeix el màxim divisor comú dels dos números.

source: Escribe un programa que pida dos números por pantalla y luego imprima el Mínimo Común Múltiplo de los dos números.
ca: Escriviu un programa que demani dos números a la pantalla i, a continuació, imprimeix el múltiple mínim comú dels dos números.
