Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/python-datos-numeros.po
Languages: ca

source: Datos numéricos
ca: Dades numèriques

source: En Python existen diferentes tipos de datos numéricos que se pueden utilizar para trabajar con números. Los principales tipos de datos numéricos son los enteros (int), los números de punto flotante (float) y los números complejos (complex) que, por ahora, no vamos a tratar.
ca: A Python hi ha diferents tipus de dades numèriques que es poden utilitzar per funcionar amb números. Els principals tipus de dades numèriques són els nombres enters (int), els números de punts flotants (float) i els nombres complexos (complexos) que, de moment, no tractarem.

source: Enteros
ca: Nombres enters

source: Los enteros son números enteros, positivos o negativos sin decimales. Por ejemplo: 1, -2 y 100
ca: Els nombres enters són nombres sencers, positius o negatius sense decimals. Per exemple: 1, -2 i 100

source: Punto flotante
ca: Punt flotant

source: Los números de punto flotante son números con decimales. Por ejemplo: 1.5, 3.14 y -0.75
ca: Els números de punts flotants són nombres amb decimals. Per exemple: 1.5, 3.14 i -0,75

source: En Python los decimales se separan con un punto. En español no es la forma correcta de separar los decimales, puesto que se utiliza la coma, pero los decimales en Python no se traducen del estándar anglosajón al estándar español porque esto daría lugar a errores en el código.
ca: A Python els decimals es separen amb un punt. En castellà no és la manera correcta de separar els decimals, ja que s’utilitza la coma, però els decimals de Python no es tradueixen de l’estàndard anglosaxó a la norma espanyola perquè això comportaria errors en el codi.

source: En Python es fácil trabajar con estos tipos de datos numéricos utilizando operadores matemáticos comunes como la suma, la resta, la multiplicación, la división o la potencia. También es posible realizar operaciones más avanzadas como el cálculo del módulo, redondeo, truncamiento, funciones trigonométricas, etc. utilizando funciones especiales.
ca: A Python és fàcil treballar amb aquests tipus de dades numèrics mitjançant operadors matemàtics comuns com la suma, la resta, la multiplicació, la divisió o la potència. També és possible realitzar operacions més avançades com ara el càlcul del mòdul, l’arrodoniment, el truncament, les funcions trigonomètriques, etc. mitjançant funcions especials.

source: Operaciones con números enteros
ca: Operacions amb números sencers

source: Los números enteros son números sin decimales. Las operaciones básicas que se pueden aplicar a los números enteros son las siguientes:
ca: Els nombres sencers són nombres sense decimals. Les operacions bàsiques que es poden aplicar a tots els números són les següents:

source: Símbolo
ca: Símbol

source: Operación
ca: Operació

source: Suma
ca: Addició

source: Resta
ca: Sostracció

source: Multiplicación
ca: Multiplicació

source: División entera (sin calcular decimales)
ca: Divisió sencera (sense calcular decimals)

source: Resto de una división
ca: Resta d’una divisió

source: Potencia (elevado a un número)
ca: Potència (elevat a un número)

source: Copia los siguientes ejemplos en el entorno IDLE para comprobar que funcionan correctamente:
ca: Copieu els exemples següents a l’entorn inactiu per verificar que funcionen correctament:

source: Los números enteros en Python pueden ser muy grandes y tener muchísimas cifras de precisión:
ca: El nombre sencer en Python pot ser molt gran i tenir moltes xifres de precisió:

source: Operaciones con números en coma flotante
ca: Operacions amb números de coma flotants

source: Los números en coma flotante son números con decimales.
ca: Els números de coma flotant són nombres amb decimals.

source: Los números en coma flotante pierden la gran precisión que tienen los números enteros y almacenan solo 16 cifras de precisión. El tamaño máximo de un número de coma flotante también es más reducido (10^307) que el tamaño máximo de un número entero (10^4300).
ca: Els números de coma flotant perden la gran precisió que tenen els números sencers i només emmagatzemen 16 xifres de precisió. La mida màxima d’un nombre de coma flotant també és menor (10^307) que la mida màxima d’un nombre enter (10^4300).

source: El número entero 2 en coma flotante se verá como 2.0, con un cero añadido después del punto decimal.
ca: El número 2 complet de coma flotant es veurà com a 2.0, amb un zero afegit després del punt decimal.

source: Las operaciones básicas que se pueden aplicar a los números en coma flotante son las siguientes:
ca: Les operacions bàsiques que es poden aplicar als números de coma flotants són les següents:

source: División con decimales
ca: Divisió amb decimals

source: ``round(number, digits)``
ca: `` Rodó (número, dígits)`

source: Redondea un número en coma flotante a ``digits`` decimales.
ca: Arrodoneix una coma flotant a `` dígits 'decimals.

source: Errores decimales en coma flotante
ca: Errors decimals en coma flotant

source: Los números en coma flotante se almacenan dentro del ordenador como números binarios (compuestos por ceros y unos) y no como números decimales. La representación de estos números en la pantalla se realiza convirtiendo los números binarios en números en formato decimal. Esto hace que se produzcan errores a la hora de almacenar y de realizar cálculos con decimales. Un ejemplo práctico es la siguiente suma:
ca: Els números de coma flotant s’emmagatzemen dins de l’ordinador com a números binaris (compostos de zeros i alguns) i no com a nombres decimals. La representació d’aquests números a la pantalla es fa convertint els números binaris en nombres en format decimal. Això fa que els errors es produeixin a l’hora d’emmagatzemar i realitzar càlculs amb decimals. Un exemple pràctic és la suma següent:

source: Los números decimales se almacenan con un pequeño error que no es visible en la pantalla. Sin embargo la suma de los dos números decimales da como resultado un número con un pequeño error que sí es visible en el decimal número 17.
ca: Els números decimals s’emmagatzemen amb un petit error que no és visible a la pantalla. Tanmateix, la suma dels dos nombres decimals dóna lloc a un nombre amb un petit error visible en el número 17 decimal.

source: Estos errores de redondeo se producen solo con la parte decimal de los números en coma flotante y no se producen con los números enteros, aunque los almacenemos en formato de coma flotante:
ca: Aquests errors d’arrodoniment només es produeixen amb la part decimal dels números de coma flotant i no es produeixen amb nombres sencers, tot i que els emmagatzemem en format coma flotant:

source: Conversión de tipos
ca: Tipus de conversió

source: Hay varios casos en los que se pueden convertir datos de números enteros a coma flotante o viceversa.
ca: Hi ha diversos casos en què es poden convertir les dades de nombres sencers en coma flotant o viceversa.

source: División de dos números enteros
ca: Divisió de dos números sencers

source: La operación división con decimales ``/`` aplicada a números enteros puede dar como resultado un número con decimales, que se almacenará como un número en coma flotante.
ca: L’operació de divisió amb decimals `/` `aplicat a nombres sencers pot donar lloc a un nombre amb decimals, que s’emmagatzemaran com a número de coma flotant.

source: Operaciones mixtas entre enteros y flotantes
ca: Operacions mixtes entre nombres enters i flotants

source: Una operación cualquiera entre un número entero y un número en coma flotante dará como resultado un número en coma flotante.
ca: Una operació entre un nombre enter i un número de coma flotant donarà lloc a un número de coma flotant.

source: Forzar la conversión de tipos
ca: Conversió del tipus de força

source: Se puede forzar que un número se convierta de un tipo a otro tipo con las siguientes funciones:
ca: Es pot veure obligat a fer un número d’un tipus a un altre amb les funcions següents:

source: ``int(n)`` Convierte n en un número entero eliminando la parte decimal.
ca: `` Int (n) `convertir -se en un nombre enter eliminant la part decimal.

source: ``float(n)`` Convierte n en un número en coma flotante.
ca: `` float (n) `` es converteix en un número de coma flotant.

source: Ejemplos de conversiones (también llamadas cast):
ca: Exemples de conversions (també anomenades repartiment):

source: Otras operaciones matemáticas
ca: Altres operacions matemàtiques

source: Para realizar más operaciones matemáticas con números enteros o con números en coma flotante, es necesario importar la librería `math <https://docs.python.org/es/3/library/math.html>`__ que da acceso a multitud de operaciones matemáticas avanzadas.
ca: Per realitzar més operacions matemàtiques amb nombres sencers o amb números de coma flotants, cal importar les matemàtiques <https://docs.python.org/es/3/library/math.html>`__ que dóna accés a multitud d’operacions matemàtiques avançades.

source: Antes de utilizar la librería 'math' es necesario importarla dentro de nuestro programa. La palabra clave ``import`` se utiliza para importar cualquier librería de Python, que dará acceso a muchas funciones extras.
ca: Abans d'utilitzar la llibreria "Math", cal importar -la dins del nostre programa. La paraula clau `` importació 's'utilitza per importar qualsevol llibreria Python, que donarà accés a moltes funcions addicionals.

source: Este es un ejemplo:
ca: Aquest és un exemple:

source: En este ejemplo se ha utilizado la función ``math.gcd()`` que devuelve el máximo común divisor (greatest common divisor) de varios números.
ca: En aquest exemple, s'ha utilitzat la funció "matemàtica.gcd ()` `que retorna el màxim divisor comú (més gran divisor comú) de diversos números.

source: Se pueden ver todas las funciones de la librería ``math`` en la `documentación oficial del lenguaje Python <https://docs.python.org/es/3/library/math.html>`__.
ca: Podeu veure totes les funcions de la biblioteca de matemàtiques a la documentació oficial de la llengua Python <https://docs.python.org/es/3/library/math.html>`__.

source: Ejercicios
ca: Exercicis

source: Calcula la suma de las siguientes distancias: 100m, 15m, 50m, 80m
ca: Calculeu la suma de les distàncies següents: 100m, 15m, 50m, 80m

source: Calcula el cuadrado de 55 sabiendo que el cuadrado de un número es equivalente a elevar ese número a 2.
ca: Calculeu els 55 quadrats sabent que el quadrat d’un nombre equival a augmentar aquest nombre a 2.

source: El resultado debe dar 3025
ca: El resultat ha de donar 3025

source: Calcula la media de estas notas: 6, 7, 6, 8
ca: Calculeu la mitjana d’aquestes notes: 6, 7, 6, 8

source: Se deben sumar todos los números y dividir el resultado entre cuatro. Utiliza paréntesis para que la operación funcione bien. (6 + 7 + 6 + 8) / 4
ca: Tots els números s’han d’afegir i dividir el resultat per quatre. Utilitzeu parèntesis perquè l'operació funcioni bé. (6 + 7 + 6 + 8) / 4

source: El resultado debe dar 6.75
ca: El resultat ha de donar 6,75

source: Redondea el resultado anterior a un solo decimal.
ca: Arrodoneix el resultat abans d’un sol decimal.

source: El resultado debe dar 6.8
ca: El resultat ha de donar 6,8

source: Calcula el resto de dividir 53 entre 7.
ca: Calculeu la resta de divisions 53 per 7.

source: El resultado debe dar 4
ca: El resultat ha de donar 4

source: Calcula el siguiente número a 80 que dividido entre 7 da como resto cero.
ca: Calculeu el número següent a 80 que dividit per 7 dóna com a descans zero.

source: Debes utilizar el operador resto de una división ``% 7`` con cada uno de los números 80, 81, 82, 83, etc. hasta que el resto valga cero.
ca: Heu d’utilitzar el descans de l’operador d’una divisió ``% 7` amb cadascun dels números 80, 81, 82, 83, etc. fins que la resta valgui zero.
