Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/python-if-else.po
Languages: ca

source: Sentencia ``if`` ``else``
ca: Judici `` si '' `` else ''

source: La sentencia ``if`` ``else`` sirve para ejecutar un bloque de código si se cumple una condición y otro bloque de código distinto si no se cumple la condición.
ca: El judici `` si '' '`else' 'serveix per executar un bloc de codi si es compleix una condició i un altre bloc de codi diferent si no es compleix la condició.

source: Esta es una sentencia de **control de flujo**, es decir, que controla el orden en el que se ejecutan las instrucciones del programa.
ca: Es tracta d’un judici de ** control de flux **, és a dir, que controla l’ordre en què s’executen les instruccions del programa.

source: Ejemplo::
ca: Exemple ::

source: En este ejemplo, si la variable "edad" es mayor o igual a 18, se imprimirá "Eres mayor de edad". De lo contrario, se imprimirá "Eres menor de edad".
ca: En aquest exemple, si la variable \ "edat " és superior o igual a 18, s'imprimirà \ "Ets d'edat legal ". En cas contrari, us imprimireu \ "Ets un menor ".

source: Sangría de código
ca: Sagnat de codi

source: En Python las instrucciones que pertenecen al bloque ``if`` deben escribirse con un desplazamiento hacia la derecha llamado sangría.
ca: A Python, les instruccions que pertanyen al `` si '`s'han d'escriure amb un desplaçament dret anomenat sagnat.

source: Esta sangría, por convención, es de 4 espacios. Se puede desplazar el código otra cantidad diferente de espacios y funcionará, pero es conveniente acatar esta costumbre porque es lo que hace la mayoría de programadores de Python.
ca: Aquest sagnat, per convenció, és de 4 espais. El codi es pot desplaçar una altra quantitat diferent d’espais i funcionarà, però és convenient complir aquest costum perquè és el que fa la majoria dels programadors de Python.

source: Todas las instrucciones que estén desplazadas se ejecutarán dependiendo de si la sentencia ``if`` se cumple. Las órdenes que se encuentren sin desplazar se ejecutarán siempre::
ca: Totes les instruccions desplaçades s’executaran en funció de si es compleix el judici `` si es compleix. Les comandes que no tenen desplaçament sempre s’executaran ::

source: En otros lenguajes de programación también hay que desplazar el código a la derecha para mejorar la visualización de la estructura del programa, pero no es obligatorio, ya que existen sentencias o caracteres que definen con precisión el inicio y el final de cada bloque.
ca: En altres llenguatges de programació, el codi també s’ha de desplaçar al dret de millorar la visualització de l’estructura del programa, però no és obligatori, ja que hi ha frases o caràcters que defineixen amb precisió l’inici i el final de cada bloc.

source: En Python, en cambio, es obligatorio realizar el sangrado del código para que el programa pueda funcionar sin problemas.
ca: A Python, en canvi, és obligatori fer l’hemorràgia del codi perquè el programa pugui funcionar sense problemes.

source: Si el desplazamiento de las líneas de código no es regular, también se producirá un error::
ca: Si el desplaçament de les línies de codi no és regular, també es produirà un error ::

source: Más adelante veremos cómo este desplazamiento o sangría se utiliza en todas las instrucciones de Python que terminan con dos puntos ':' y que tienen bloques de código subordinados, tales como los bucles, las funciones, las clases, etc.
ca: Més endavant veurem com s’utilitza aquest desplaçament o sagnat en totes les instruccions de Python que acaben amb dos punts: “I que tenen blocs de codi subordinats, com ara bucles, funcions, classes, etc.

source: Ejercicios
ca: Exercicis

source: Escribe un programa que compruebe si un número es positivo o negativo y que imprima en pantalla el resultado.
ca: Escriviu un programa que comprovi si un número és positiu o negatiu i que imprimeix el resultat a la pantalla.

source: Escribe un programa que compruebe si un número es par o impar.
ca: Escriviu un programa que comprovi si un número és encara o estrany.

source: Para saber si un número es par (divisible por dos) es necesario calcular el resto de la división por dos. Si el resto vale cero significa que el número es divisible por dos y es par.
ca: Per saber si un nombre és uniforme (divisible per dos), cal calcular la resta de la divisió per dos. Si la resta val zero, vol dir que el nombre és divisible per dos i és uniforme.

source: Escribe un programa que pida dos números y escriba cuál de los dos es mayor que el otro.
ca: Escriviu un programa que demani dos números i escriviu quin dels dos és més gran que l’altre.

source: Escribe un programa que compruebe si una condición es verdadera o es falsa. Comprueba que el programa funciona tanto si la condición es verdadera (True) como si es falsa (False).
ca: Escriviu un programa que comprovi si una condició és certa o falsa. Comproveu que el programa funcioni, si la condició és certa (veritable) com si fos fals (fals).

source: Escribe un programa que pida una nota y compruebe si la nota está aprobada o suspensa.
ca: Escriviu un programa que demani una nota i comproveu si la nota està aprovada o suspesa.

source: Escribe un programa que pida una contraseña y compruebe si la contraseña es igual a la palabra 'secreto'. En caso afirmativo debe escribir en pantalla 'contraseña correcta'. En caso contrario debe escribir en pantalla 'contraseña incorrecta'.
ca: Escriviu un programa que demani una contrasenya i comproveu si la contrasenya és igual a la paraula "secret". En cas afirmatiu, heu d’escriure a la pantalla “contrasenya correcta”. En cas contrari, heu d'escriure a la pantalla "contrasenya incorrecta".
