Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/python-booleanos.po
Languages: ca

source: El tipo Booleano
ca: El tipus booleà

source: El tipo de dato booleano se utiliza para representar dos valores: Verdadero (True) y Falso (False). Estos valores booleanos son fundamentales en la programación, ya que se utilizan para realizar decisiones y controlar el flujo de un programa.
ca: El tipus de dades booleanes s’utilitza per representar dos valors: true (true) i fals (fals). Aquests valors booleans són fonamentals en la programació, ja que s’utilitzen per prendre decisions i controlar el flux d’un programa.

source: La palabra **True** representa el valor verdadero, mientras que la palabra **False** representa el valor falso. Ambas palabras deben escribirse con la primera letra en mayúscula y las demás en minúscula, ya que Python distingue entre mayúsculas y minúsculas (es Case Sensitive).
ca: La paraula ** true ** representa el valor real, mentre que la paraula ** fals ** representa el valor fals. Ambdues paraules s’han d’escriure amb la primera lletra majúscula i les altres en minúscules, ja que Python distingeix entre la part superior i la minúscula (és un cas sensible).

source: Los valores booleanos son el resultado de operaciones de comparación o evaluaciones lógicas. Por ejemplo, si queremos comparar si dos variables son iguales, podemos utilizar el operador de igualdad "==". Si la comparación es verdadera, el resultado será True; de lo contrario, será False.
ca: Els valors booleans són el resultat d’operacions de comparació o avaluacions lògiques. Per exemple, si volem comparar si dues variables són iguals, podem utilitzar l’operador d’igualtat \ "== ". Si la comparació és certa, el resultat serà cert; En cas contrari, serà fals.

source: Operadores de comparación
ca: Operadors de comparació

source: Estos operadores se utilizan para comparar dos valores. El resultado siempre será un valor booleano, True o False.
ca: Aquests operadors s’utilitzen per comparar dos valors. El resultat sempre serà un valor booleà, cert o fals.

source: Operador
ca: Telefonista

source: Nombre
ca: Nom

source: Descripción
ca: Descripció

source: **True** si el operando de la izquierda es igual que el de la derecha.
ca: ** True ** Si l’obertura a l’esquerra és la mateixa que la de la dreta.

source: **False** en caso contrario.
ca: ** Fals ** En cas contrari.

source: Distinto
ca: Diferent

source: **True** si el operando de la izquierda es distinto que el de la derecha.
ca: ** True ** Si l’obertura de l’esquerra és diferent de la de la dreta.

source: Mayor que
ca: Més gran que

source: **True** si el operando de la izquierda es mayor que el de la derecha.
ca: ** True ** Si l’obertura a l’esquerra és més gran que la de la dreta.

source: True si el operando de la izquierda es menor que el de la derecha. False en caso contrario.
ca: És cert si l’obertura a l’esquerra és inferior a la de la dreta. FALSE El contrari.

source: Mayor o igual que
ca: Més gran o igual

source: **True** si el operando de la izquierda es mayor o igual que el de la derecha.
ca: ** True ** Si l’obertura a l’esquerra és superior o igual a la de la dreta.

source: Menor o igual que
ca: Menys o igual com

source: **True** si el operando de la izquierda es menor o igual que el de la derecha.
ca: ** True ** Si l’obertura a l’esquerra és inferior o igual a la de la dreta.

source: Ejemplos::
ca: Exemples ::

source: Operadores lógicos
ca: Operadors lògics

source: Los operadores booleanos se utilizan para realizar operaciones lógicas entre valores booleanos (True y False) o expresiones que se pueden evaluar como booleanas.
ca: Els operadors booleans s’utilitzen per realitzar operacions lògiques entre valors booleans (veritables i falsos) o expressions que es poden avaluar com a booleanes.

source: a and b
ca: a i b

source: Si 'a' es falso, devuelve 'a'. Si 'a' es verdadero, devuelve 'b'.
ca: Si "a" és fals, torna "a". Si "A" és cert, torna "B".

source: Solo es verdadero si 'a' y 'b' son verdaderos.
ca: Només és cert si "A" i "B" són certs.

source: a or b
ca: A b

source: Es verdadero si 'a' ó 'b' son verdaderos.
ca: És cert si "A" o "B" són certs.

source: Si 'a' es falso, devuelve verdadero (True).
ca: Si "a" és fals, torna a ser cert (veritable).

source: Si 'a' es verdadero, devuelve falso (False).
ca: Si "A" és cert, torna fals (fals).

source: Si 'a' es cero o vacío, devuelve falso (False).
ca: Si "a" és zero o buit, torna fals (fals).

source: En caso contrario, devuelve verdadero (True)
ca: En cas contrari, torneu True (True)
