Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/python-while.po
Languages: ca

source: Sentencia ``while``
ca: Judici `` mentre ''

source: La sentencia ``while`` permite ejecutar un bloque de código varias veces mientras se cumple una condición.
ca: El judici `mentre '' us permet executar un bloc de codi diverses vegades mentre es compleix una condició.

source: Es un tipo de bucle con condición. Se utiliza cuando no sabemos exactamente cuántas veces se requiere ejecutar un bloque de código, pero si que sabemos que condición se tiene que cumplir.
ca: És un tipus de bucle amb condició. S'utilitza quan no sabem exactament quantes vegades cal executar un bloc de codi, però sabem quina condició s'ha de complir.

source: Ejemplo de programa que suma precios mientras que el total sea menor de 1000::
ca: Exemple de programa que afegeix preus mentre que el total és inferior a 1000 ::

source: Sentencia ``while True``
ca: Judici `` Wheeture True ''

source: También se puede utilizar la sentencia ``while`` con una condición siempre verdadera para hacer un bucle que se ejecute para siempre::
ca: També podeu utilitzar el `` `'

source: Para poder parar el funcionamiento de este programa hay que presionar las teclas [Control] + [C].
ca: Per aturar el funcionament d’aquest programa, heu de prémer les tecles [Control] + [C].

source: El programa anterior es poco funcional porque no tiene una condición para poder detenerse. Ahora veremos otro ejemplo con la sentencia ``while`` que se detiene gracias a una sentencia ``break`` después de escribir la palabra 'fin'::
ca: El programa anterior no és gaire funcional perquè no té condicions per aturar -se. Ara veurem un altre exemple amb el judici `mentre '' que s'atura gràcies a una frase '' break '' després d'escriure la paraula 'final' ::

source: Esta construcción es equivalente a decir que se ejecute un bloque de instrucciones **hasta que** se cumpla una condición.
ca: Aquesta construcció equival a dir que s’executa un bloc d’instruccions ** fins que es compleix una condició.

source: Ejercicios
ca: Exercicis

source: Escribe un programa con la sentencia ``while`` que vaya imprimiendo todos los números desde el 0 hasta el 10.
ca: Escriviu un programa amb el judici `` while '' que imprimeix tots els números de 0 a 10.

source: Modifica el programa anterior para que imprima todos los números desde el 10 hasta el 0.
ca: Modifiqueu el programa anterior per imprimir tots els números de 10 a 0.

source: Escribe un programa que sume todos los números enteros desde el 1 y que se detenga cuando la suma sea mayor o igual a 1000.
ca: Escriviu un programa que afegeixi tots els números sencers a partir d’1 i s’aturi quan la suma és superior o igual a 1000.

source: Al final debe escribir desde qué número hasta qué número ha sumado y cuánto vale la suma.
ca: Al final, heu d’escriure de quin número ha afegit el número i quant és la suma.

source: Escribe un programa que se repita continuamente hasta que se introduzca por el teclado la letra 'n' a la pregunta '¿Quieres continuar? (S/n)'.
ca: Escriviu un programa que es repeteixi repetidament fins que la lletra "n" s'introdueixi a la pregunta "a la pregunta" Voleu continuar? (S/n) '.

source: Escribe un programa que imprima la `sucesión de Fibonacci <https://es.wikipedia.org/wiki/Sucesi%C3%B3n_de_Fibonacci>`__ hasta el número 1000.
ca: Escriviu un programa que imprimeixi la successió de Fibonacci <https://es.wikipedia.org/wiki/sucesi%C3%B3n_de_fibonacci>`__ al número 1000.

source: Escribe un programa que juegue con el usuario a adivinar un número. Si el número introducido es más alto que el número secreto, debe imprimir una pista diciendo 'Demasiado alto'. Igualmente debe imprimir una pista 'Demasiado bajo' para los números menores que el número secreto.
ca: Escriviu un programa que reprodueixi amb l'usuari per endevinar un número. Si el nombre introduït és superior al número secret, heu d'imprimir una pista dient "massa alta". També heu d'imprimir una pista "massa baixa" per a números més petita que el número secret.

source: Cuando el usuario acierte el número secreto, el programa debe imprimir 'Acertaste' y detenerse.
ca: Quan l'usuari continua el número secret, el programa ha d'imprimir "lluita" i aturar -se.
