Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/python-busqueda-binaria.po
Languages: ca

source: Búsqueda binaria
ca: Cerca binària

source: El algoritmo de búsqueda binaria es más rápido que el algoritmo de búsqueda lineal estudiado en la unidad anterior.
ca: L’algoritme de cerca binària és més ràpid que l’algoritme de cerca lineal estudiat a la unitat anterior.

source: Este algoritmo aprovecha que una lista ya está ordenada para encontrar el elemento buscado con mayor rapidez. Estos son los pasos del algoritmo:
ca: Aquest algoritme aprofita que una llista ja està ordenada per trobar l’element buscat més ràpidament. Aquests són els passos de l'algorisme:

source: Repite todo mientras haya lista en la que buscar.
ca: Repetiu -ho tot mentre estigui a punt per cercar.

source: Buscamos el elemento en la mitad de la lista.
ca: Busquem l’element al mig de la llista.

source: Si se encuentra el elemento, devuelve la posición del elemento encontrado.
ca: Si es troba l’element, retorna la posició de l’element que es troba.

source: Si el elemento buscado es **mayor** que el elemento de la mitad de la lista, dividimos la lista en dos y solo buscaremos en la mitad superior de la lista.
ca: Si l’element buscat és ** major ** que l’element mig de la llista, dividim la llista en dos i només buscarem a la meitat superior de la llista.

source: En caso de que el elemento buscado sea **menor** que el elemento de la mitad de la lista, dividimos la lista en dos y solo buscaremos en la mitad inferior de la lista.
ca: En cas que l’element buscat sigui ** més petit ** que l’element mig de la llista, dividim la llista en dos i només buscarem a la meitat inferior de la llista.

source: Si no se ha encontrado el elemento, devuelve ``None``
ca: Si no s'ha trobat l'element, retorna `` cap '' '

source: Ejemplo de búsqueda binaria
ca: Exemple de cerca binària

source: Este es un ejemplo de lista para buscar un elemento, con las posiciones de los números::
ca: Aquest és un exemple de llista per trobar un element, amb les posicions dels números ::

source: Vamos a buscar el elemento 89 en esta lista con búsqueda binaria.
ca: Anem a buscar l’element 89 d’aquesta llista amb la cerca binària.

source: Primero buscamos en la mitad de la lista, posición 9, lo que nos devuelve el número 46. Como 46 es menor que 89, sabemos que el elemento buscado solo puede estar en la mitad superior de la lista::
ca: Primer mirem al mig de la llista, la posició 9, que retorna el número 46. Com a 46 és inferior a 89, sabem que l’element buscat només pot estar a la meitat superior de la llista ::

source: Ahora buscamos en la mitad de la parte superior de la lista, en la posición 14, lo que nos devuelve el número 75. Como 75 es menor que 87, sabemos que el elemento buscado solo pude estar en la mitad superior de la lista::
ca: Ara mirem a la meitat de la part superior de la llista, a la posició 14, que retorna el número 75. Com a 75 és inferior a 87, sabem que l’element buscat només podria estar a la meitat superior de la llista ::

source: Volvemos a buscar en la mitad de la parte de la lista superior, en la posición 17, lo que nos devuelve el número 89. Este es el elemento buscado, por lo que podemos devolver la posición 17.
ca: Mirem enrere al mig de la llista superior, a la posició 17, que retorna el número 89. Aquest és l’element buscat, de manera que podem tornar la posició 17.

source: Como podemos comprobar, con solo 3 comparaciones se ha encontrado el elemento buscado en la posición 17. Una búsqueda lineal habría requerido 18 comparaciones en total.
ca: Com podem verificar, amb només 3 comparacions s'ha trobat l'element cercat a la posició 17. Una cerca lineal hauria requerit 18 comparacions en total.

source: La búsqueda binaria, por lo tanto, es mucho más rápida que la búsqueda lineal, sobre todo en listas muy grandes de elementos, con la desventaja de que necesita buscar en una lista que ya esté ordenada.
ca: La cerca binària, per tant, és molt més ràpida que la cerca lineal, sobretot en llistes d’elements molt grans, amb l’inconvenient que heu de cercar en una llista que ja està ordenada.

source: Programa de búsqueda binaria
ca: Programa de cerca binària

source: El programa para realizar una búsqueda binaria tendrá dos índices, ``inicio`` y ``final``. Uno apunta al comienzo de la lista y otro al final de la lista. Estos índices se actualizarán a medida que conozcamos qué parte de la lista puede contener al elemento buscado::
ca: El programa per dur a terme una cerca binària tindrà dos índexs, `` Home '' i `` Final``. Un apunta al començament de la llista i un altre al final de la llista. Aquests índexs s’actualitzaran ja que sabem quina part de la llista pot contenir l’element buscat ::

source: Ejercicios
ca: Exercicis

source: Programa una función de búsqueda binaria que devuelva la posición en la que se debería colocar un nuevo elemento para que quede ordenado dentro de una lista de números ya ordenados.
ca: Programa una funció de cerca binària que retorna la posició en què s’ha de col·locar un nou element de manera que s’ordeni dins d’una llista de números ja ordenats.

source: Salida::
ca: Sortida ::

source: Prueba el programa con los números 7, 25, 48 y 100.
ca: Proveu el programa amb els números 7, 25, 48 i 100.

source: Los resultados correctos son las posiciones 0, 4, 10 y 20.
ca: Els resultats correctes són les posicions 0, 4, 10 i 20.
