Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/python-sort-insercion.po
Languages: ca

source: Ordenación por inserción
ca: Gestió d'inserció

source: Este algoritmo de ordenación tiene la ventaja de que permite que la lista se modifique mientras se está produciendo la ordenación. La parte de la lista no ordenada puede crecer añadiendo elementos y la parte de la lista que ya está ordenada puede disminuir eliminando elementos. Esto hace que sea un algoritmo flexible.
ca: Aquest algorisme de gestió té l’avantatge que permet a la llista modificar mentre s’està produint l’ordenació. La part de la llista no ordenada pot créixer afegint elements i la part de la llista que ja està ordenada pot disminuir eliminant elements. Això el converteix en un algorisme flexible.

source: Este algoritmo se suele utilizar cuando el número de elementos a ordenar es pequeño (menos de 100 elementos). Para conjuntos de datos mayores hay algoritmos más rápidos y eficientes, como la ordenación por mezcla, por montículo o la ordenación rápida.
ca: Aquest algorisme s’utilitza normalment quan el nombre d’elements que s’han d’ordenar és petit (menys de 100 elements). Per a conjunts de dades més grans, hi ha algoritmes més ràpids i eficients, com ara la barreja, per Mound o Fast Management.

source: Explicación del algoritmo
ca: Explicació de l'algoritme

source: Al comienzo vamos a suponer que el primer elemento de la lista ya está ordenado, mientras que todos los demás están desordenados.
ca: Al principi, suposarem que el primer element de la llista ja està ordenat, mentre que tots els altres són desordenats.

source: A continuación tomaremos el segundo elemento de la lista. Si este elemento es menor que el primer elemento de la lista, cambiaremos sus posiciones. En este punto ya tenemos dos elementos de la lista ordenados.
ca: A continuació, agafarem el segon element de la llista. Si aquest element és inferior al primer element de la llista, canviarem les vostres posicions. En aquest moment ja tenim dos elements de la llista ordenats.

source: Continuaremos con el tercer elemento de la lista. Mientras sea menor le iremos intercambiando con el segundo y con el primer elemento de la lista, hasta que quede ordenado.
ca: Continuarem amb el tercer element de la llista. Com més baix intercanviarem amb el segon i amb el primer element de la llista, fins que s’ordeni.

source: El algoritmo continúa ordenando el resto de los elementos uno a uno hasta que coloca el último elemento de la lista en su sitio, momento en el que la ordenación de la lista ha terminado.
ca: L’algoritme continua ordenant la resta d’elements un per un fins que situi l’últim element de la llista al seu lloc, moment en què s’acaba l’ordenació de la llista.

source: Programa de ordenación
ca: Programa de planificació

source: El programa completo de ordenación de elementos de una lista según el algoritmo de inserción será el siguiente::
ca: El programa complet de gestió de programes segons l'algoritme d'inserció serà el següent ::

source: Salida::
ca: Sortida ::

source: Inserción binaria
ca: Inserció binària

source: El algoritmo de inserción permite una mejora que consiste en realizar la búsqueda del lugar de inserción correcto mediante búsqueda binaria, que ya se estudió en una unidad anterior.
ca: L’algoritme d’inserció permet una millora que consisteix a cercar el lloc d’inserció correcte per cerca binària, que ja s’ha estudiat en una unitat anterior.

source: El algoritmo mejorado de inserción binaria es el siguiente::
ca: L’algoritme d’inserció binari millorat és el següent ::

source: Ejercicios
ca: Exercicis

source: Escribe una función que ordene una lista de tres elementos por el algoritmo de inserción, sin utilizar bucles de ningún tipo, solo con sentencias ``if``.
ca: Escriviu una funció que ordeni una llista de tres elements per l'algoritme d'inserció, sense utilitzar bucles de cap tipus, només amb frases `` si ''.

source: Llama a la función con el siguiente código para comprobar que la función ``ordena()`` funciona correctamente::
ca: Truqueu a la funció amb el codi següent per verificar que el `` ordre () `` funciona correctament ::

source: Reescribe el programa de ordenación para que ordene los elementos en sentido contrario, de mayor a menor. Deberás cambiar los nombres de las funciones y de las variables para que se adapten a la nueva función que estén realizando.
ca: Reescriviu el programa de gestió per ordenar els elements en sentit contrari, de més alt a més baix. Heu de canviar els noms de les funcions i variables per adaptar -se a la nova funció que estan fent.

source: Reescribe el programa de ordenación para que realice la ordenación de la lista en una sola función, sin separar el código en dos funciones distintas. Recuerda cambiar el nombre de las variables de la función ``inserta_elemento`` para que no sean los mismos.
ca: Reescriviu el programa de gestió per dur a terme la comanda de la llista en una sola funció, sense separar el codi en dues funcions diferents. No oblideu canviar el nom de les variables de la `` inserir_emento`` `` de manera que no siguin les mateixes.

source: Escribe un algoritmo de ordenación por inserción que ordene las cadenas de texto por longitud de cadena, de manera que al comienzo se coloquen las palabras más cortas y al final las más largas::
ca: Escriviu un algorisme de gestió d’inserció que ordena les cadenes de text per longitud de la cadena, de manera que al principi es col·loquen les paraules més curtes i al final el més llarg ::
