Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/python-if-anidados.po
Languages: ca

source: Sentencias ``if`` anidadas
ca: Judicis `si '' nided

source: Una estructura de programación se dice que está anidada cuando se encuentra dentro de otra.
ca: Es diu que una estructura de programació està nidificada quan es troba dins d'una altra.

source: Cada nivel extra con otra instrucción ``if`` habrá que escribir el código con sangría, es decir, con espacios a la izquierda.
ca: Cada nivell addicional amb una altra instrucció `` si '' s'han d'escriure el codi amb sagnat, és a dir, amb espais a l'esquerra.

source: Este es un ejemplo con la instrucción ``if`` anidada en dos niveles::
ca: Aquest és un exemple amb la instrucció `` si '`nidificada en dos nivells ::

source: Anidar condiciones ``if`` puede ser útil, pero hay que intentar que no se aniden muchos niveles para facilitar la lectura del código.
ca: Les condicions de NIDAR `` si '' pot ser útil, però heu d'intentar no nidificar molts nivells per facilitar la lectura del codi.

source: Este es otro ejemplo de ``if`` anidado en dos niveles::
ca: Aquest és un altre exemple de `` si '' niding a dos nivells ::

source: Ejercicios
ca: Exercicis

source: Escribe un programa que calcule el precio en la entrada de un cine dependiendo de la edad.
ca: Escriviu un programa que calculi el preu a l’entrada d’un cinema en funció de l’edat.

source: El precio normal de la entrada es de 10 Euros.
ca: El preu normal del bitllet és de 10 euros.

source: Si el cliente tiene una edad de 60 o más años, solo pagará 2 Euros.
ca: Si el client té una edat de 60 o més, només pagarà 2 euros.

source: Si el cliente tiene una edad de 12 o menos años, solo pagará 4 Euros.
ca: Si el client té una edat de 12 o menys, només pagarà 4 euros.

source: Escribe un programa para comprobar si una persona puede subir a las atracciones de un parque.
ca: Escriviu un programa per comprovar si una persona pot pujar a les atraccions d’un parc.

source: Si la altura es menor de 140, no puedes subir a las atracciones
ca: Si l'alçada és inferior a 140, no podeu pujar les atraccions

source: En caso contrario:
ca: En cas contrari:

source: Si la edad es menor de 12 años, puedes subir a las atracciones para niños.
ca: Si l’edat té menys de 12 anys, podeu pujar a les atraccions dels nens.

source: Si la edad es mayor o igual a 12 años, puedes subir a todas las atracciones.
ca: Si l’edat és superior o igual a 12, podeu pujar a totes les atraccions.

source: Escribe un programa que pregunte la nota obtenida y que responda según las siguientes condiciones:
ca: Escriviu un programa que demanés la nota obtinguda i respondeu segons les condicions següents:

source: Si la nota es mayor o igual a 5 -> Has aprobado
ca: Si la nota és superior o igual a 5 -> Heu aprovat

source: Si la nota es mayor que 6 -> Has aprobado con buena nota
ca: Si la nota és superior a 6 -> heu aprovat amb una bona nota

source: Si la nota es menor que 5 -> Has suspendido
ca: Si la nota és inferior a 5 -> Heu suspès

source: Si la nota es menor que 4 -> Has suspendido con mala nota
ca: Si la nota és inferior a 4 -> Heu suspès amb una mala nota

source: Escribe un programa de ayuda para reparar objetos.
ca: Escriviu un programa d’ajuda per reparar objectes.

source: El programa primero debe preguntar si el objeto se mueve. Después debe preguntar si el objeto debería moverse. A continuación el programa debe imprimir un mensaje en pantalla dependiendo de las opciones introducidas:
ca: El programa primer s’ha de preguntar si l’objecte es mou. Aleshores, heu de preguntar si l’objecte s’ha de moure. Aleshores, el programa ha d’imprimir un missatge a la pantalla segons les opcions introduïdes:

source: Si el objeto se mueve y debería moverse -> No hace falta reparar.
ca: Si l'objecte es mou i s'ha de moure -> no cal reparar.

source: Si el objeto se mueve y no debería moverse -> Utilizar cinta americana.
ca: Si l'objecte es mou i no s'ha de moure -> Utilitzeu cinta americana.

source: Si el objeto no se mueve y no debería moverse -> No hace falta reparar.
ca: Si l'objecte no es mou i no s'ha de moure -> no cal reparar.

source: Si el objeto no se mueve y debería moverse -> Utilizar aceite 3 en 1.
ca: Si l'objecte no es mou i s'ha de moure -> Utilitzeu l'oli 3 en 1.

source: Escribe un programa para identificar personajes del cómic Astérix y Obélix.
ca: Escriviu un programa per identificar personatges del còmic Astérix i Obélix.

source: Si el personaje es protagonista principal:
ca: Si el personatge és el protagonista principal:

source: Si el personaje levanta menhires: es Obélix.
ca: Si el personatge aixeca Menhires: és Obélix.

source: En caso contrario: es Astérix.
ca: En cas contrari: és Astérix.

source: Si el personaje prepara pociones: es Panorámix.
ca: Si el personatge prepara pocions: és Panoramix.

source: Si el personaje canta mal: es Asuracentúrix.
ca: Si el personatge canta malament: és asurancetúrix.

source: En caso contrario: el personaje no está identificado.
ca: En cas contrari: el personatge no s’identifica.

source: Escribe un programa que pregunte el usuario y luego la contraseña. Si el usuario es igual a 'admin' entonces comprueba la contraseña, que debe ser igual a 'secreta'. En caso de escribir la contraseña correcta se debe imprimir 'inicio de sesión correcto'.
ca: Escriviu un programa que l'usuari va preguntar i després la contrasenya. Si l'usuari és igual a "administrador", comproveu la contrasenya, que ha de ser igual a "secret". En cas d’escriure la contrasenya correcta, heu d’imprimir “Inici de sessió correcte”.

source: Si la contraseña está equivocada se debe escribir 'Contraseña incorrecta'
ca: Si la contrasenya està equivocada, s'ha d'escriure "contrasenya incorrecta"

source: Si el usuario no es 'admin' se debe escribir 'Usuario incorrecto'
ca: Si l'usuari no és "administrador", s'ha d'escriure l'usuari incorrecte

source: Escribe un programa para clasificar triángulos.
ca: Escriviu un programa per classificar els triangles.

source: Primero se deben definir en el programa las longitudes de los lados::
ca: En primer lloc, les longituds dels costats s’han de definir al programa ::

source: A continuación se deben comprobar las longitudes de los lados e imprimir en pantalla el tipo de triángulo:
ca: A continuació, cal comprovar les longituds dels costats i el tipus de triangle a la pantalla:

source: Si lado1 == lado2 and si lado2 == lado3: es equilátero
ca: Si el costat1 == side2 i si side2 == costat3: és equilàter

source: Si lado1 == lado2 or lado1 == lado3 or lado2 == lado3: es isósceles
ca: Si el costat1 == costat2 o lateral1 == costat3 o costat2 == costat3: és isosceles

source: En caso contrario: es escaleno.
ca: En cas contrari: és Scalene.

source: Escribe un programa que verifique si un año es bisiesto. Un año es bisiesto si es divisible por 4 (year % 4 == 0).
ca: Escriviu un programa que verifica si un any fa un salt. Un any es fa un salt si és divisible per 4 (any % 4 == 0).

source: De estos años bisiestos hay que eliminar los que son divisibles por 100 y añadir los que son divisibles por 400.
ca: D’aquests anys del salt, els que són divisibles per cada 100 s’han d’eliminar i afegir els que són divisibles per 400.

source: La lista de años bisiestos entre 1600 y 2400 es::
ca: La llista dels anys de salt entre el 1600 i el 2400 és ::

source: En la lista no deben salir los años 1700, 1800, 1900, 2100, 2200, 2300 porque son divisibles por 100.
ca: A la llista no haurien de sortir dels anys 1700, 1800, 1900, 2100, 2200, 2300 perquè són divisibles per cada 100.

source: En la lista sí deben salir los años 1600, 2000 y 2400 porque, aunque son divisibles por 100, también son divisibles por 400.
ca: A la llista han de deixar els 1600, 2000 i 2400 anys perquè, tot i que són divisibles per cada 100, també són divisibles per 400.
