Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/python-print.po
Languages: ca

source: La función :py:func:`print`
ca: La funció: py: funció: `imprimir '

source: La función `print() <https://docs.python.org/es/3/library/functions.html#print>`__ sirve para imprimir textos, números y otros objetos en la pantalla.
ca: El `print () <https://docs.python.org/es/3/libry/funcctions.html#print>`__ serveix per imprimir textos, números i altres objectes a la pantalla.

source: Es una herramienta muy útil a la hora de encontrar errores de programación y para informar del desarrollo del programa.
ca: És una eina molt útil a l’hora de trobar errors de programació i informar el desenvolupament del programa.

source: El parámetro **sep** indica qué carácter se va a utilizar para separar los distintos objetos que se imprimirán en la pantalla. Por defecto es el espacio en blanco.
ca: El paràmetre ** sep ** indica quin caràcter s'utilitzarà per separar els diferents objectes que s'imprimiran a la pantalla. De manera predeterminada és l’espai en blanc.

source: El parámetro **end** indica qué carácter se va a utilizar al finalizar la impresión. Por defecto es una nueva línea '\\n', pero se puede sustituir por una cadena vacía '' para que sucesivos ``print`` impriman en la misma línea.
ca: El paràmetre ** End ** indica quin caràcter s'utilitzarà al final de la impressió. De manera predeterminada, és una nova línia '\\ n', però es pot substituir per una cadena buida `` `imprimir '' imprimir a la mateixa línia.

source: Ejemplos::
ca: Exemples ::

source: Ejercicios
ca: Exercicis

source: Escribe un programa que imprima varios números separados por punto y coma gracias al argumento ``sep``.
ca: Escriviu un programa que imprimeixi diversos números separats per Point i Coma gràcies a l'argument `` Sep``.

source: Escribe un programa que imprima en una sola línea dos palabras juntas. La primera y la segunda palabra se deben imprimir con dos órdenes ``print()`` separadas.
ca: Escriviu un programa que s’imprimeixi en una sola línia dues paraules. La primera i la segona paraula s’han d’imprimir amb dues comandes `` imprimir () `` separades.

source: Escribe un programa que calcule e imprima la media de tres notas: 5, 8, 9.
ca: Escriviu un programa que calculi i imprimi la mitjana de tres notes: 5, 8, 9.

source: Pista: deberás sumar todas las notas dentro de un paréntesis y después dividir el resultado entre 3.
ca: Pista: heu d’afegir totes les notes dins d’un parèntesi i després dividir el resultat per 3.

source: Escribe un programa que imprima 'Hola, mundo' en dos líneas distintas con una sola orden ``print()``.
ca: Escriviu un programa que imprimeixi "Hola, món" en dues línies diferents amb una sola comanda `` imprimir () `.

source: Pista: el caracter '\\n' sirve para añadir una nueva línea dentro de una cadena de texto.
ca: Pista: el personatge '\\ n' serveix per afegir una nova línia dins d'una cadena de text.

source: Escribe un programa que asigne un valor a una variable y que luego imprima el valor de la variable en pantalla.
ca: Escriviu un programa que assigna un valor a una variable i, a continuació, imprimeix el valor de la variable de la pantalla.

source: Salida::
ca: Sortida ::

source: Escribe un programa que asigne dos valores a dos variables y que luego imprima sus valores y el valor de la suma.
ca: Escriviu un programa que assigna dos valors a dues variables i, a continuació, imprimeix els seus valors i el valor de la suma.
