Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/python-if-and-*-not.po
Languages: ca

source: Operadores ``and``, ``or``, ``not``
ca: Operadors `` `,` ``, `` no ''

source: Estos operadores sirven para hacer condiciones más complejas en una sentencia ``if``.
ca: Aquests operadors serveixen per fer condicions més complexes en un judici `` si ''.

source: Ejemplo para calcular si una persona puede subir a una montaña rusa. Solo podrá subir si su altura en centímetros es mayor o igual a 150 **y también** debe ser menor o igual a 200::
ca: Exemple per calcular si una persona pot pujar una muntanya russa. Només podeu pujar si la vostra alçada en centímetres és superior o igual a 150 ** i també ** ha de ser inferior o igual a 200 ::

source: Ejemplo para calcular si un año es bisiesto::
ca: Exemple per calcular si un any és salt ::

source: Aunque los paréntesis no son obligatorios, es recomendable usarlos para que se pueda entender mejor el código.
ca: Tot i que els parèntesis no són obligatoris, és recomanable utilitzar -los perquè el codi es pugui entendre millor.

source: Ejercicios
ca: Exercicis

source: Escribe un programa que pida el nombre del mes en el que estamos y compruebe si estamos o no en primavera.
ca: Escriviu un programa que demani el nom del mes en què estem i comproveu si som o no a la primavera.

source: Para simplificar diremos que abril, mayo y junio son los meses de primavera.
ca: Per simplificar, direm que els mesos de primavera abril, maig i juny són els mesos de primavera.

source: El siguiente programa comprueba si un número es par. Modifica el programa utilizando el operador ``not`` para que compruebe si el número es impar::
ca: El programa següent comprova si un número és uniforme. Modifiqueu el programa mitjançant l'operador "No" per comprovar si el número és estrany ::

source: Escribe un programa que utilice el operador ``and`` para comprobar si un nombre tiene una longitud entre 4 y 6 letras.
ca: Escriviu un programa que utilitzi el `` `` `` `per comprovar si un nom té una longitud entre 4 i 6 lletres.

source: La longitud de una cadena de texto se mide con la función len()::
ca: La longitud d’una cadena de text es mesura amb el len () ::

source: Escribe un programa que responda que tienes que conectar el riego por goteo siempre que sea de noche (no de día) y que esté el suelo seco (no está lloviendo).
ca: Escriviu un programa que respongui que heu de connectar el reg de goteig sempre que sigui nit (no el dia) i que el sòl sec (no plou).

source: Prueba el programa con las cuatro combinaciones posibles en los sensores. Solo debe funcionar cuando el sensor de lluvia valga cero y el sensor de día valga cero.
ca: Proveu el programa amb les quatre combinacions possibles als sensors. Només hauria de funcionar quan el sensor de pluja val zero i el sensor de tanca zero.

source: Escribe un programa que imprima un mensaje cuando un número sea positivo y no sea divisible por 3. En caso contrario no imprime ningún mensaje.
ca: Escriviu un programa que imprimeixi un missatge quan un número sigui positiu i no sigui divisible per 3. En cas contrari, no imprimeix cap missatge.
