Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/python-funciones-argumentos.po
Languages: ca

source: Parámetros con valores por omisión
ca: Paràmetres amb valors d’omissió

source: Las funciones pueden tener **parámetros**, que son variables que se utilizan en el interior de la función. Al llamar a la función asignamos **argumentos** (datos) a los parámetros de la función.
ca: Les funcions poden tenir ** paràmetres **, que són variables que s’utilitzen dins de la funció. Truqueu a la funció assignem ** Arguments ** (dades) als paràmetres de la funció.

source: Los parámetros pueden tener valores por defecto y en ese caso se puede omitir el argumento en la llamada a la función. Estos parámetros con valores por omisión deben colocarse a la derecha de los demás parámetros.
ca: Els paràmetres poden tenir valors predeterminats i en aquest cas es pot ometre l'argument a la trucada a la funció. Aquests paràmetres amb valors d’omissió s’han de situar a la dreta dels altres paràmetres.

source: Ejemplo::
ca: Exemple ::

source: Salida::
ca: Sortida ::

source: Como se puede ver, cuando llamamos a la función sin ningún argumento, se utiliza el valor por omisión, que en este caso es 'María'.
ca: Com podeu veure, quan anomenem la funció sense cap argument, s’utilitza el valor d’omissió, que en aquest cas és “María”.

source: Ejercicios
ca: Exercicis

source: Escribe una función que cuente los números divisibles por 'divisor' que haya en todos los números desde el 1 hasta el número 'tope'.
ca: Escriviu una funció que indiqui els números divisibles per "divisor" en tots els números d'1 al número "Stop".

source: Modifica la función anterior para que el último parámetro tenga un valor por defecto de 100.
ca: Modifiqueu la funció anterior de manera que l'últim paràmetre tingui un valor predeterminat de 100.

source: Escribe una función que cuente las vocales de una cadena de texto.
ca: Escriviu una funció que indiqui les vocals d’una cadena de text.

source: Escribe una función que imprima el número más pequeño de tres números que le pasemos como argumentos.
ca: Escriviu una funció que imprimeixi el menor nombre de tres números que gastem com a arguments.

source: Escribe una función que retorne 'True' si tres números que le pasemos como argumentos están ordenados de menor a mayor. En caso contrario, debe retornar 'False'
ca: Escriviu una funció que retorna "veritable" si tres números que tenim com a arguments estan ordenats de mínim al màxim. En cas contrari, heu de tornar "fals"

source: Escribe una función que imprima tres números que le pasemos como argumentos, después de ordenarlos. Utiliza la función del ejercicio anterior para saber si los números están ordenados.
ca: Escriviu una funció que imprimeixi tres números que tinguem com a arguments després de demanar -los. Utilitzeu la funció de l'exercici anterior per saber si els números estan ordenats.
