Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/python-recursividad.po
Languages: ca

source: Recursividad
ca: Recursió

source: La recursividad es una técnica de programación que consiste en que una función se llame a sí misma para resolver un problema. Esta técnica permite dividir un problema original en subproblemas semejantes pero más sencillos de solucionar.
ca: La recursivitat és una tècnica de programació que consisteix en una funció que es diu per resoldre un problema. Aquesta tècnica permet dividir un problema original en subproblemes similars però més simples.

source: Una función recursiva se compone de dos partes:
ca: Una funció recursiva consta de dues parts:

source: Solución del caso más sencillo o caso base.
ca: Solució de la caixa més senzilla o del cas base.

source: Si la función tiene como argumento un problema sencillo de resolver, se resuelve y se devuelve la solución. En este caso la función no se llama a sí misma.
ca: Si la funció discuteix un problema senzill a resoldre, la solució es resol i es torna. En aquest cas, la funció no es diu.

source: Solución del caso más elaborado.
ca: Solució del cas més elaborat.

source: Si la función tiene como argumento un problema difícil de resolver, el problema se divide en problemas más pequeños y sencillos y se llama a sí misma para resolverlos.
ca: Si la funció té com a argument un problema difícil de resoldre, el problema es divideix en problemes més petits i senzills i es crida a solucionar -los.

source: Ejemplo de función recursiva para calcular el factorial de un número. El factorial de un número es la multiplicación de todos los números desde el 1 hasta el número deseado. Por ejemplo, el factorial de 6 es la multiplicación de 1 x 2 x 3 x 4 x 5 x 6.
ca: Exemple de funció recursiva per calcular el factorial d’un nombre. El factorial d’un nombre és la multiplicació de tots els números d’1 al número desitjat. Per exemple, el factorial de 6 és la multiplicació d’1 x 2 x 3 x 4 x 5 x 6.

source: El siguiente programa calcula el factorial de un número de forma recursiva::
ca: El programa següent calcula el factorial d’un número recursiu ::

source: El siguiente programa devuelve una cadena de texto invertida de forma recursiva::
ca: El programa següent retorna recursivament una cadena de text invertida ::

source: Salida::
ca: Sortida ::

source: A la hora de programar una función recursiva es importante definir los casos más sencillos o casos base y asegurarse de que cada llamada recursiva se acerque al caso base para evitar bucles infinitos.
ca: Quan es programi una funció recursiva, és important definir els casos o casos base més simples i assegurar -se que cada trucada recursiva s’acosta al cas base per evitar bucles infinits.

source: Algunas estructuras de datos, como las listas enlazadas, los árboles, o los directorios del disco duro, se pueden definir y manipular de forma recursiva de manera más simple.
ca: Algunes estructures de dades, com ara llistes enllaçades, arbres o directoris de disc dur, es poden definir i manipular recursivament més senzillament.

source: Ejercicios
ca: Exercicis

source: Define una función recursiva que convierta una lista de letras en una cadena de texto única::
ca: Definiu una funció recursiva que converteixi una llista de lletres en una sola cadena de text ::

source: Define una función recursiva que cuente hacia atrás desde el número que se le pase como argumento.
ca: Definiu una funció recursiva que compta del número que passa com a argument.

source: Define una función recursiva llamada replicar que reciba dos argumentos ``veces`` y ``numero``. La función debe devolver una lista en la que aparezca ``numero`` tantas veces como diga la variable ``veces``.
ca: Definiu una funció recursiva anomenada Replicing que rebeu dos arguments `` Times's` i `` número ''. La funció ha de retornar una llista que aparegui `` number '' tantes vegades com diu la variable '`« temps' '.

source: Define una función recursiva que invierta el orden de los dígitos de un número sin convertirlo en una cadena.
ca: Definiu una funció recursiva que inverteixi l’ordre dels dígits d’un número sense convertir -la en una cadena.

source: Para obtener el último dígito de un número se puede calcular el módulo 10 del número. Por ejemplo, 1234 % 10 será igual a 4, el último dígito del número 1234.
ca: Per obtenir l'últim dígit d'un número, podeu calcular el mòdul 10 del número. Per exemple, el 1234 % 10 serà igual a 4, l’últim dígit del número 1234.
