Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/python-recursos.po
Languages: ca

source: Documentación, cursos, libros, etc. sobre el lenguaje Python.
ca: Documentació, cursos, llibres, etc. sobre la llengua Python.

source: Documentación oficial
ca: Documentació oficial

source: `Tutorial de Python 3 <https://docs.python.org/es/3/tutorial/>`__.
ca: `Python Tutorial 3 <https://docs.python.org/es/3/torma/>`__.

source: `Documentación oficial de Python 3 <https://docs.python.org/es/3/>`__.
ca: `Documentació oficial de Python 3 <https://docs.python.org/es/3/>`__.

source: Piensa como un informático con Python
ca: Penseu com un informàtic amb Python

source: El objetivo de este libro es enseñarte a pensar como un informático. Para ello utiliza el lenguaje de programación Python en su versión 3. Versión traducida por Jorge Espinoza, del libro de Allen Downey **Think Python** en su versión 2.4.
ca: L’objectiu d’aquest llibre és ensenyar -vos a pensar com a informàtic. Per fer -ho, utilitzeu el llenguatge de programació Python a la seva versió 3. Versió traduïda per Jorge Espinoza, del llibre d’Allen Downey ** Think Python ** a la seva versió 2.4.

source: :download:`Aprende a pensar como un informático con Python 3. Versión 2.4 en formato PDF. <python/thinkpython2-spanish.pdf>`
ca: : Descarregueu: `Apreneu a pensar com a informàtic amb Python 3. Versió 2.4 en format PDF. <python/thinkpython2-spanish.pdf>`

source: :download:`Aprende a pensar como un informático con Python 3. Versión 2.4 en formato EPUB. <python/thinkpython2-spanish.epub>`
ca: : Descarregueu: `Apreneu a pensar com a informàtic amb Python 3. Versió 2.4 en format EPUB. <python/thinkpython2-spanish.epub>`

source: `Repositorio del libro en GitHub. <https://github.com/picuino/ThinkPython2>`__
ca: `Dipòsit de llibres a GitHub. <https://github.com/picuino/thinkpython2>`__

source: `Tercera edición del libro en inglés. <https://greenteapress.com/wp/think-python-3rd-edition/>`__
ca: `Tercera edició del llibre en anglès. <https://greenteapress.com/wp/think-python-3rd-edition/>`__

source: Otros libros de Python
ca: Altres llibres de Python

source: `Python para Principiantes <https://www.amazon.es/Python-para-Principiantes-Programaci%C3%B3n-principiantes/dp/B087SG2H2X>`__.
ca: `Python per a principiants <https://www.amazon.es/python-para-principiantes-programming cc3%b3n-principigantes/dp/b087sg2h2x>`__.

source: `Pythonbooks, books for kids <https://pythonbooks.org/for-kids/>`__.
ca: `PythonBooks, Llibres per a nens <https://pythonbook.org/for-kids/>`__.

source: Cursos de Python en línea
ca: Cursos de Python en línia

source: `Aprende Python <https://aprendepython.es/>`__.
ca: `Aprèn Python <https://aprendepython.es/>`__.

source: `Python tutorial <https://www.w3schools.com/python/default.asp>`__ in w3schools.com webpage.
ca: `Python Tutorial <https://www.w3schools.com/python/default.asp>`__ a W3schools.com Ppage web.

source: `The legend of Python <https://www.codedex.io/python>`__ in codedex.io webpage.
ca: `The Legend of Python <https://www.codeedex.io/python>`__ a la pàgina web de codedex.io.

source: Vídeo: `Python tutorial on YouTube <https://www.youtube.com/watch?v=YYXdXT2l-Gg&list=PL-osiE80TeTt2d9bfVyTiXJA-UTHn6WwU>`__.
ca: Vídeo: `Tutorial de Python a YouTube <https://www.youtube.com/watch?v=yyxdxt2l-gg&list=pl-osie80tett2d9bfvytixja-uthn6wwu>`__.

source: Ejercicios de Python
ca: Exercicis de Python

source: `Codewars website <https://www.codewars.com/kata/search/python?q=&r%5B%5D=-8&r%5B%5D=-7&r%5B%5D=-6&r%5B%5D=-5&order_by=popularity%20desc>`__
ca: `Lloc web de CodeWars <https://www.codewars.com/kata/search/python?q=&r%5B%5D=-8&r%5B%5D=-7&r%5B%5D=-6&r%5B%5D=-5&order_by=popularity%20Desc>` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` ``

source: :ref:`Codewars. Katas ordenados por dificultad <python-codewars>`.
ca: : Ref: `CodeWars. Katas ordenat per dificultat <Python-codewars> `.

source: Code Combat
ca: Combat amb codi

source: `Esports Bootcamp: AI League <https://codecombat.com/play/ai-league-hoc?hour_of_code=true>`__.
ca: `ESports bootcamp: AI League <https://codecombat.com/play/aiaague-hoc?hour_of_code=true>`__.

source: `Escape the Dungeon <https://codecombat.com/play/dungeon-hoc?hour_of_code=true>`__.
ca: `Escapa del Dungeon <https://codecombat.com/play/dungeon-hoc?hour_of_code=true>`__.

source: `Game Development <https://codecombat.com/play/game-dev-hoc?hour_of_code=true>`__.
ca: `Desenvolupament de jocs <https://codecombat.com/play/game-dev-hoc?hour_of_code=true>`__.

source: `Game Development 2 <https://codecombat.com/play/game-dev-hoc-2?hour_of_code=true>`__.
ca: `Desenvolupament del joc 2 <https://codecombat.com/play/game-dev-hoc-2?hour_of_code=true>`__.

source: `Codédex.io <https://www.codedex.io/>`__
ca: `Coddex.io <https://www.codedex.io/>`__

source: `Challenges <https://www.codedex.io/challenges>`__
ca: `Reptes <https://www.codedex.io/challenges>`__

source: Intérpretes de Python online
ca: Intèrprets en línia de Python

source: `Intérprete de Python <https://www.programiz.com/python-programming/online-compiler/>`__ online en programiz.com.
ca: `Intèrpret de Python <https://www.programiz.com/python-programming/online-compiler/>`__ en línia a programitzitzadors.com.

source: `Intérprete avanzado de Python <https://programiz.pro/learn/python/online-compiler/>`__ online en programiz.com.
ca: `Python Advanced Intèrpret <https://programz.pro/learn/python/online-compiler/>`__ en línia a Programiz.com.

source: Instalador de Python
ca: Instal·lador de Python

source: `Descarga Python <https://www.python.org/downloads/>`__ desde la página web oficial.
ca: `Descarregueu Python <https://www.python.org/downloads/>`__ del lloc web oficial.

source: `Gestor Conda para Python y paquetes de utilidades <https://conda.io/projects/conda/en/latest/user-guide/install/>`__.
ca: `Gestor de conductes per a paquets de Python i Utilities <https://conda.io/projects/conda/en/latest/user-guide/install/>`__.
