Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/python-for.po
Languages: ca

source: Sentencia ``for``
ca: Judici `` per ''

source: La sentencia ``for`` nos permite repetir un bloque de código varias veces mientras que una variable va cambiando de valor.
ca: El judici `` `` ens permet repetir un bloc de codi diverses vegades mentre una variable canvia el valor.

source: Este bloque de código que se repite varias veces se denomina **bucle**.
ca: Aquest bloc de codi que es repeteix diverses vegades es diu ** Loop **.

source: Ejemplo::
ca: Exemple ::

source: Este ejemplo imprimirá en pantalla todos los números desde el 1 hasta el 9.
ca: Aquest exemple imprimirà tots els números de l'1 al 9.

source: La variable del bucle se llama 'num' y va tomando todos los valores en el rango desde 1 hasta 10 (no incluído).
ca: La variable de bucle s’anomena “num” i està prenent tots els valors de l’interval d’1 a 10 (no inclòs).

source: La variable del bucle se llama 'nombre' y va tomando todos los valores de la lista de nombres.
ca: La variable de bucle s'anomena "nom" i està prenent tots els valors de la llista de noms.

source: Ejercicios
ca: Exercicis

source: Realiza un programa que imprima la tabla del 6::
ca: Feu un programa que imprimeixi la taula de 6 ::

source: Escribe un programa que pida un número y que luego sume todos los números entre el 1 y el número introducido.
ca: Escriviu un programa que demani un número i després afegeixi tots els números entre 1 i el número introduït.

source: Ejemplo 1::
ca: Exemple 1 ::

source: Ejemplo 2::
ca: Exemple 2 ::

source: Escribe un programa que pida un número y que luego multiplique todos los números entre el 1 y el número introducido. Esta operación se llama factorial.
ca: Escriviu un programa que sol·liciti un número i, a continuació, multipliqui tots els números entre 1 i el nombre introduït. Aquesta operació s’anomena factorial.

source: Escribe un programa que imprima en pantalla todas las edades desde el 15 hasta el 20 y, al lado, que imprima si es mayor o menor de edad::
ca: Escriviu un programa que imprimeixi totes les edats de 15 a 20 anys i, al costat dels 20

source: Escribe un programa que pida un número y luego imprima si es divisible por algún número entre 2 y 20.
ca: Escriviu un programa que sol·liciti un número i, a continuació, s’imprimeixi si és divisible amb algun nombre entre 2 i 20.

source: Ten en cuenta que un número 'num' es divisible por 5 si su resto al dividir por 5 es igual a cero::
ca: Tingueu en compte que un nombre de "num" és divisible per 5 si el seu descans dividint per 5 és igual a zero ::

source: Escribe un programa que imprima todos los números del 1 al 100. Los números divisibles por 3 deben sustituirse por la palabra 'choco'. Los números divisibles por 5 deben sustituirse por la palabra 'late'. Los números divisibles por 3 y por 5 deben sustituirse por la palabra 'chocolate'::
ca: Escriviu un programa que imprimeixi tots els números d’1 a 100. Els números divisibles per 3 s’han de substituir per la paraula “xoco”. Els números divisibles per 5 han de ser substituïts per la paraula "ritme". Els números divisibles per 3 i 5 han de ser substituïts per la paraula "xocolata" ::

source: Ten en cuenta que un número 'num' es divisible por 3 si su resto al dividir por 3 es igual a cero::
ca: Tingueu en compte que un nombre de "num" és divisible per 3 si el seu descans dividint per 3 és igual a zero ::
