Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/python-funciones-scope.po
Languages: ca

source: Alcance de las variables
ca: Àmbit

source: Ahora que se han visto las variables y los bloques de programa, tanto las funciones como los bucles, se puede estudiar el alcance de las variables.
ca: Ara que s’han vist les variables i els blocs de programes, tant funcions com bucles, podeu estudiar l’abast de les variables.

source: Las variables externas se pueden utilizar dentro de los bloques pero no al revés. Las variables internas de un bloque no se pueden utilizar fuera del bloque.
ca: Les variables externes es poden utilitzar dins dels blocs, però no viceversa. Les variables internes d’un bloc no es poden utilitzar fora del bloc.

source: Veremos algunos ejemplos del alcance de las variables, es decir, dónde se pueden utilizar y dónde no.
ca: Veurem alguns exemples de l’abast de les variables, és a dir, on es poden utilitzar i on no.

source: Sentencia ``global``
ca: Judici `` Global ''

source: Las variables globales son las que se definen en el cuerpo del programa no dentro de bucles o de funciones.
ca: Les variables globals són les que es defineixen al cos del programa no dins de bucles o funcions.

source: Ejemplo de variable global::
ca: Exemple de variable global ::

source: Salida::
ca: Sortida ::

source: En el caso anterior, la variable global 'numero' se puede leer en el interior de la función 'mensaje()'.
ca: En el cas anterior, la variable global "número" es pot llegir dins de la funció "Missatge ()".

source: Sin embargo, si intentamos actualizar la variable 'numero' dentro de la función 'mensaje()' no funcionará porque estamos creando dos variables. Una variable será la variable **global** 'numero' y otra será la variable **local** 'numero', que se llaman igual, pero son distintas.
ca: Tanmateix, si intentem actualitzar la variable "número" dins del "missatge ()" no funcionarà perquè estem creant dues variables. Una variable serà la variable ** global ** "número" i una altra serà la variable ** local ** "número", que s'anomenen iguals, però són diferents.

source: Ejemplo de variable global y variable local del mismo nombre que generan un error::
ca: Exemple d'una variable global i local del mateix nom que generen un error ::

source: Para arreglar el problema tenemos que utilizar la sentencia ``global`` que declara 'numero' como variable global, no local.
ca: Per solucionar el problema, hem d’utilitzar el judici `` global '' que declara "número" com a variable global i no local.

source: Ejemplo de variable global sin error::
ca: Exemple de variable global sense error ::
