Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/python-funciones.po
Languages: ca

source: Definición de funciones
ca: Definició de funcions

source: Las funciones son bloques de código que realizan una tarea determinada que deseamos ejecutar una o varias veces. También se utilizan las funciones para agrupar instrucciones con un nombre descriptivo.
ca: Les funcions són blocs de codi que realitzen una tasca determinada que volem executar una o diverses vegades. Les funcions també s’utilitzen per agrupar instruccions amb un nom descriptiu.

source: Gracias a las funciones podemos dividir un programa largo en muchos bloques pequeños. Esto facilita mucho la programación y la lectura del código por parte de otras personas.
ca: Gràcies a les funcions, podem dividir un programa llarg en molts petits blocs. Això facilita molt la programació i la lectura del codi per part d’altres persones.

source: Ejemplo de definición y llamada a una función::
ca: Exemple de definició i trucada a una funció ::

source: La definición de la función no hace nada por si sola. Es necesario **llamar** a la función ``mensaje()`` para que se ejecute el código que se encuentra dentro de ella.
ca: La definició de la funció no fa res per si mateix. Cal ** trucar ** al `` message () `` per executar el codi dins d'aquest.

source: Parámetros y argumentos
ca: Paràmetres i arguments

source: Los **parámetros** son las variables que se declaran entre paréntesis en la definición de la función.
ca: Els paràmetres ** ** són les variables que es declaren entre parèntesis en la definició de la funció.

source: Los **argumentos** son los valores que utilizamos para llamar a la función. Los argumentos permiten personalizar el comportamiento de una función y pueden ser de diferentes tipos (booleano, números, cadenas de texto, etc).
ca: Els ** arguments ** són els valors que utilitzem per trucar a la funció. Els arguments permeten personalitzar el comportament d’una funció i poden ser de diferents tipus (boolean, números, cadenes de text, etc.).

source: Ejemplo de definición de una función con un parámetro (nombre)::
ca: Exemple de definició d’una funció amb un paràmetre (nom) ::

source: Llamada a la función con dos argumentos distintos ('Javier' y 'Sara')::
ca: Truqueu a la funció amb dos arguments diferents ("Javier" i "Sara") ::

source: Resultado::
ca: Resultat ::

source: Sentencia ``return``
ca: Judici `` tornar ''

source: La sentencia ``return`` se utiliza para devolver un dato desde la función.
ca: El judici `return`` s’utilitza per retornar un fet de la funció.

source: También se puede utilizar para terminar la función en ese punto, con un comportamiento semejante a la sentencia ``break`` de un bucle.
ca: També es pot utilitzar per acabar la funció en aquest punt, amb un comportament similar al judici `` rupte '' d'un bucle.

source: Ejemplo de definición de una función con ``return``::
ca: Exemple de definició d’una funció amb `` return`` ::

source: Ejercicios
ca: Exercicis

source: Escribe una función que calcule si un número es par o impar e imprima por la pantalla el resultado.
ca: Escriviu una funció que calculi si un número és encara o estrany i imprimeix el resultat.

source: Escribe también en el programa varias llamadas a la función con varios números para comprobar que funciona correctamente.
ca: Escriviu també al programa diverses trucades a la funció amb diversos números per comprovar que funciona correctament.

source: Escribe la definición de una función llamada 'mayor(a, b)' a la que le pasemos dos números como argumentos y que retorne el mayor de los dos.
ca: Escriviu la definició d'una funció anomenada "major (a, b)" a la qual tenim dos números com a arguments i això retorna el major dels dos.

source: Escribe también en el programa varias llamadas a la función con varias parejas de números, para probar que funciona correctamente.
ca: També escriu al programa diverses trucades a la funció amb diverses parelles de números, per demostrar que funciona correctament.

source: Escribe la definición de una función que transforme grados celsius a grados fahrenheit sabiendo que::
ca: Escriviu la definició d’una funció que transforma els graus Celsius en graus Fahrenheit sabent que ::

source: Escribe la definición de una función que retorne el factorial de un número.
ca: Escriviu la definició d’una funció que retorna el factorial d’un número.

source: El factorial es el resultado de multiplicar todos los números desde el 1 hasta el número deseado.
ca: El factorial és el resultat de multiplicar tots els números de 1 al número desitjat.

source: Imprime el factorial de 5, 8 y 12.
ca: Imprimeix el factorial de 5, 8 i 12.

source: Escribe la definición de una función que imprima una fila de n asteriscos en pantalla.
ca: Escriviu la definició d’una funció que imprimeix una fila de N asteriscs a la pantalla.

source: Llama a esa función varias veces para imprimir un triángulo de asteriscos que comience por 1 asterisco y termine con 10 asteriscos.
ca: Truqueu a aquesta funció diverses vegades per imprimir un triangle d’asteriscs que comença per 1 asterisc i acaba amb 10 asteriscs.

source: Escribe la definición de una función que imprima la tabla de multiplicar de un número.
ca: Escriviu la definició d’una funció que imprimeix la taula de multiplicació d’un número.

source: Utiliza esta función para imprimir la tabla del 3 y la tabla del 5.
ca: Utilitzeu aquesta funció per imprimir la taula de 3 i la taula de 5.
