Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/python-palabras-reservadas.po
Languages: ca

source: Palabras reservadas
ca: Paraules reservades

source: Las palabras reservadas de un lenguaje de programación son un conjunto de palabras que tienen un significado especial y están reservadas para ser utilizadas para el lenguaje. Cada una de estas palabras tienen un propósito específico y no se pueden usar como nombres de variables ni como nombres de funciones.
ca: Les paraules reservades d’un llenguatge de programació són un conjunt de paraules que tenen un significat especial i que es reserven per utilitzar -se per al llenguatge. Cadascuna d’aquestes paraules té un propòsit específic i no es pot utilitzar com a noms de variables o com a noms de funcions.

source: Estas son las 33 palabras reservadas en Python:
ca: Aquestes són les 33 paraules reservades a Python:

source: `False <https://docs.python.org/es/3/library/constants.html>`__
ca: `Fals

source: `None <https://docs.python.org/es/3/library/constants.html>`__
ca: `Cap <https://docs.python.org/es/3/library/constants.html>`__

source: `and <https://www.w3schools.com/python/ref_keyword_and.asp>`__
ca: `i <https://www.w3schools.com/python/ref_keyword_and.asp>`__

source: `as <https://www.w3schools.com/python/ref_keyword_as.asp>`__
ca: `Com <https://www.w3schools.com/python/ref_keyword_as.asp>`__

source: `class <https://www.w3schools.com/python/ref_keyword_class.asp>`__
ca: `Classe <https://www.w3schools.com/python/ref_keyword_class.asp>`__

source: `continue <https://www.w3schools.com/python/ref_keyword_continue.asp>`__
ca: `Continua <https://www.w3schools.com/python/ref_keyword_continue.asp>

source: `del <https://www.w3schools.com/python/ref_keyword_del.asp>`__
ca: `de <https://www.w3schools.com/python/ref_keyword_del.asp>`__

source: `except <https://www.w3schools.com/python/ref_keyword_except.asp>`__
ca: `Excepte <https://www.w3schools.com/python/ref_keyword_except.asp>`__

source: `finally <https://www.w3schools.com/python/ref_keyword_finally.asp>`__
ca: `Finalment <https://www.w3schools.com/python/ref_keyword_fininly.asp>`__

source: `for <https://www.w3schools.com/python/ref_keyword_for.asp>`__
ca: `per a <https://www.w3schools.com/python/ref_keyword_for.asp>`__

source: `from <https://www.w3schools.com/python/ref_keyword_from.asp>`__
ca: `De <https://www.w3schools.com/python/ref_keyword_from.asp>`__

source: `if <https://www.w3schools.com/python/ref_keyword_if.asp>`__
ca: `Si <https://www.w3schools.com/python/ref_keyword_if.asp>`__

source: `import <https://www.w3schools.com/python/ref_keyword_import.asp>`__
ca: `Importa <https://www.w3schools.com/python/ref_keyword_import.asp>`__

source: `in <https://www.w3schools.com/python/ref_keyword_in.asp>`__
ca: `a <https://www.w3schools.com/python/ref_keyword_in.asp>`__

source: `is <https://www.w3schools.com/python/ref_keyword_is.asp>`__
ca: `És <https://www.w3schools.com/python/ref_keyword_is.asp>`__

source: `not <https://www.w3schools.com/python/ref_keyword_not.asp>`__
ca: `No <https://www.w3schools.com/python/ref_keyword_not.asp>`__

source: `or <https://www.w3schools.com/python/ref_keyword_or.asp>`__
ca: `O <https://www.w3schools.com/python/ref_keyword_or.asp>`__

source: `try <https://www.w3schools.com/python/ref_keyword_try.asp>`__
ca: `Proveu <https://www.w3schools.com/python/ref_keyword_try.asp>

source: `while <https://www.w3schools.com/python/ref_keyword_while.asp>`__
ca: `Mentre que <https://www.w3schools.com/python/ref_keyword_while.asp>`__

source: with
ca: amb

source: yield
ca: Produir

source: Cuando se escribe código con un editor con **resaltado de sintaxis** las palabras reservadas se colorean para distinguirlas del resto. Por ejemplo, en el editor IDLE de Python, las palabras reservadas se colorean con color naranja.
ca: Quan el codi s’escriu amb un editor amb ** ressaltat de la sintaxi ** Les paraules reservades es coloren per distingir -les de la resta. Per exemple, a l’editor oci de Python, va reservar les paraules Colo amb taronja.

source: Funciones integradas
ca: Funcions integrades

source: Python tiene una serie de funciones y tipos incluidos en el lenguaje que siempre están disponibles sin necesidad de importar ningún módulo.
ca: Python té una sèrie de funcions i tipus inclosos en l’idioma que sempre estan disponibles sense importar cap mòdul.

source: Estas funciones no son palabras reservadas del lenguaje, pero igualmente hay que evitar utilizarlas como nombre de nuestras variables o funciones.
ca: Aquestes funcions no són paraules de llenguatge reservades, però hem d’evitar utilitzar -les com a nom de les nostres variables o funcions.

source: `abs() <https://docs.python.org/es/3/library/functions.html#abs>`__
ca: `ABS () <https://docs.python.org/es/3/library/funcations.html#abs>`__

source: `aiter() <https://docs.python.org/es/3/library/functions.html#aiter>`__
ca: `Aiter () <https://docs.python.org/es/3/libry/functs.html#aiter>`__

source: `all() <https://docs.python.org/es/3/library/functions.html#all>`__
ca: `All () <https://docs.python.org/es/3/libry/funcctions.html#all>`__

source: `any() <https://docs.python.org/es/3/library/functions.html#any>`__
ca: `Qualsevol () <https://docs.python.org/es/3/libry/funcations.html#any>`__ __

source: `anext() <https://docs.python.org/es/3/library/functions.html#anext>`__
ca: `Anext () <https://docs.python.org/es/3/libry/funnsions.html#anext>`__ __

source: `ascii() <https://docs.python.org/es/3/library/functions.html#ascii>`__
ca: `Ascii () <https://docs.python.org/es/3/libry/funcctions.html#ascii>`__

source: `bin() <https://docs.python.org/es/3/library/functions.html#bin>`__
ca: `bin () <https://docs.python.org/es/3/libry/functs.html#bin>`__

source: `bool() <https://docs.python.org/es/3/library/functions.html#bool>`__
ca: `Bool () <https://docs.python.org/es/3/libry/funnsions.html#bool>`__

source: `breakpoint() <https://docs.python.org/es/3/library/functions.html#breakpoint>`__
ca: `breakpoint() <https://docs.python.org/es/3/library/funcctions.html#breakpoint>`__

source: `bytearray() <https://docs.python.org/es/3/library/functions.html#func-bytearray>`__
ca: `bytearray () <https://docs.python.org/es/3/library/funcctions.html#func-byteraray>`__

source: `bytes() <https://docs.python.org/es/3/library/functions.html#func-bytes>`__
ca: `bytes () <https://docs.python.org/es/3/libry/funcctions.html#func-bytes>`__

source: `callable() <https://docs.python.org/es/3/library/functions.html#callable>`__
ca: `Qualable () <https://docs.python.org/es/3/libry/funcctions.html#callable>`__

source: `chr() <https://docs.python.org/es/3/library/functions.html#chr>`__
ca: `chr () <https://docs.python.org/es/3/libry/functs.html#chr>`__

source: `classmethod() <https://docs.python.org/es/3/library/functions.html#classmethod>`__
ca: `classmethod () <https://docs.python.org/es/3/libry/funcations.html#classMethod>`__

source: `compile() <https://docs.python.org/es/3/library/functions.html#compile>`__
ca: `Compile () <https://docs.python.org/es/3/libry/funcctions.html#compile>`__

source: `complex() <https://docs.python.org/es/3/library/functions.html#complex>`__
ca: `Complex () <https://docs.python.org/es/3/libry/funnsions.html#complex>`__

source: `delattr() <https://docs.python.org/es/3/library/functions.html#delattr>`__
ca: `Deattr () <https://docs.python.org/es/3/libry/funcctions.html#delattr>`__

source: `dict() <https://docs.python.org/es/3/library/functions.html#func-dict>`__
ca: `Dict () <https://docs.python.org/es/3/libry/funcctions.html#func-ict>`__

source: `dir() <https://docs.python.org/es/3/library/functions.html#dir>`__
ca: `dir () <https://docs.python.org/es/3/library/funcations.html#dir>`__

source: `divmod() <https://docs.python.org/es/3/library/functions.html#divmod>`__
ca: `Ddmod () <https://docs.python.org/es/3/libry/funnsions.html#divMod>`__

source: `enumerate() <https://docs.python.org/es/3/library/functions.html#enumerate>`__
ca: `Histle

source: `eval() <https://docs.python.org/es/3/library/functions.html#eval>`__
ca: `Aval () <https://docs.python.org/es/3/libry/funcctions.html#eval>`__

source: `exec() <https://docs.python.org/es/3/library/functions.html#exec>`__
ca: `Exec () <https://docs.python.org/es/3/libry/funcations.html#exec>`__

source: `filter() <https://docs.python.org/es/3/library/functions.html#filter>`__
ca: `Filter () <https://docs.python.org/es/3/libry/funnsions.html#filter>`__

source: `float() <https://docs.python.org/es/3/library/functions.html#float>`__
ca: `Float () <https://docs.python.org/es/3/libry/funnsions.html#float>`__

source: `format() <https://docs.python.org/es/3/library/functions.html#format>`__
ca: `Format () <https://docs.python.org/es/3/libry/funnsions.html#format>`__

source: `frozenset() <https://docs.python.org/es/3/library/functions.html#func-frozenset>`__
ca: `Frozenset () <https://docs.python.org/es/3/library/funcions.html#func-frozenset>`__

source: `getattr() <https://docs.python.org/es/3/library/functions.html#getattr>`__
ca: `GetAttr () <https://docs.python.org/es/3/libry/funcions.html#gettr>`__

source: `globals() <https://docs.python.org/es/3/library/functions.html#globals>`__
ca: `Globals () <https://docs.python.org/es/3/libry/funnsions.html#globals>`__

source: `hasattr() <https://docs.python.org/es/3/library/functions.html#hasattr>`__
ca: `Hasattr ()

source: `hash() <https://docs.python.org/es/3/library/functions.html#hash>`__
ca: `hash () <https://docs.python.org/es/3/libry/functs.html#hash>`__

source: `help() <https://docs.python.org/es/3/library/functions.html#help>`__
ca: `Help () <https://docs.python.org/es/3/libry/functs.html#help>`__

source: `hex() <https://docs.python.org/es/3/library/functions.html#hex>`__
ca: `Hex () <https://docs.python.org/es/3/libry/functs.html#hex>`__

source: `id() <https://docs.python.org/es/3/library/functions.html#id>`__
ca: `Id () <https://docs.python.org/es/3/library/funcations.html#id>`__

source: `input() <https://docs.python.org/es/3/library/functions.html#input>`__
ca: `entrada () <https://docs.python.org/es/3/libry/funcctions.html#input>`__

source: `int() <https://docs.python.org/es/3/library/functions.html#int>`__
ca: `Int () <https://docs.python.org/es/3/library/funnsions.html#int>`__

source: `isinstance() <https://docs.python.org/es/3/library/functions.html#isinstance>`__
ca: `IsInstance () <https://docs.python.org/es/3/libry/funcctions.html#isinstance>`__

source: `issubclass() <https://docs.python.org/es/3/library/functions.html#issubclass>`__
ca: `IssubClass () <https://docs.python.org/es/3/libry/funcations.html#issubclass>`__

source: `iter() <https://docs.python.org/es/3/library/functions.html#iter>`__
ca: `Iter ()

source: `len() <https://docs.python.org/es/3/library/functions.html#len>`__
ca: `Len

source: `list() <https://docs.python.org/es/3/library/functions.html#func-list>`__
ca: `Llista () <https://docs.python.org/es/3/libry/funnsions.html#func--list>`__

source: `locals() <https://docs.python.org/es/3/library/functions.html#locals>`__
ca: `Locals () <https://docs.python.org/es/3/libry/funnsions.html#locals>`__

source: `map() <https://docs.python.org/es/3/library/functions.html#map>`__
ca: `Mapa () <https://docs.python.org/es/3/libry/funcctions.html#map>`__

source: `max() <https://docs.python.org/es/3/library/functions.html#max>`__
ca: `Max () <https://docs.python.org/es/3/libry/funnsions.html#max>`__

source: `memoryview() <https://docs.python.org/es/3/library/functions.html#func-memoryview>`__
ca: `MemoryView () <https://docs.python.org/es/3/libry/funcctions.html#func-memoryView>` `` `` `` `` `` `` ``

source: `min() <https://docs.python.org/es/3/library/functions.html#min>`__
ca: `min () <https://docs.python.org/es/3/library/funcations.html#min>`__

source: `next() <https://docs.python.org/es/3/library/functions.html#next>`__
ca: `Següent ()

source: `object() <https://docs.python.org/es/3/library/functions.html#object>`__
ca: `Objecte () <https://docs.python.org/es/3/libry/functions.html#object>`__

source: `oct() <https://docs.python.org/es/3/library/functions.html#oct>`__
ca: `Oct () <https://docs.python.org/es/3/library/funcations.html#oct>`__

source: `open() <https://docs.python.org/es/3/library/functions.html#open>`__
ca: `Open () <https://docs.python.org/es/3/libry/funcctions.html#open>`__

source: `ord() <https://docs.python.org/es/3/library/functions.html#ord>`__
ca: `Ord () <https://docs.python.org/es/3/library/funcctions.html#ord>`__

source: `pow() <https://docs.python.org/es/3/library/functions.html#pow>`__
ca: `POW () <https://docs.python.org/es/3/libry/functs.html#pow>`__

source: `print() <https://docs.python.org/es/3/library/functions.html#print>`__
ca: `imprimir () <https://docs.python.org/es/3/libry/functs.html#print>`__

source: `property() <https://docs.python.org/es/3/library/functions.html#property>`__
ca: `Propietat () <https://docs.python.org/es/3/libry/funcctions.html#property>` __

source: `range() <https://docs.python.org/es/3/library/functions.html#func-range>`__
ca: `Range () <https://docs.python.org/es/3/libry/funcations.html#func-range>`

source: `repr() <https://docs.python.org/es/3/library/functions.html#repr>`__
ca: `repres () <https://docs.python.org/es/3/libry/functs.html#repr>`__

source: `reversed() <https://docs.python.org/es/3/library/functions.html#reversed>`__
ca: `Venerat () <https://docs.python.org/es/3/libry/funcctions.html#rented>`__

source: `round() <https://docs.python.org/es/3/library/functions.html#round>`__
ca: `rodó

source: `set() <https://docs.python.org/es/3/library/functions.html#func-set>`__
ca: `Set () <https://docs.python.org/es/3/libry/funnsions.html#func-set>`__

source: `setattr() <https://docs.python.org/es/3/library/functions.html#setattr>`__
ca: `SetAttr () <https://docs.python.org/es/3/libry/functions.html#settr>`__

source: `slice() <https://docs.python.org/es/3/library/functions.html#slice>`__
ca: `Slice () <https://docs.python.org/es/3/libry/funnsions.html#sice>`__

source: `sorted() <https://docs.python.org/es/3/library/functions.html#sorted>`__
ca: `Ordenat () <https://docs.python.org/es/3/libry/funcctions.html#sorted>`__

source: `staticmethod() <https://docs.python.org/es/3/library/functions.html#staticmethod>`__
ca: `staticMethod () <https://docs.python.org/es/3/libry/funcctions.html#staticMethod>`__

source: `str() <https://docs.python.org/es/3/library/functions.html#func-str>`__
ca: `Str () <https://docs.python.org/es/3/libry/functs.html#func-str>`__

source: `sum() <https://docs.python.org/es/3/library/functions.html#sum>`__
ca: `Sum () <https://docs.python.org/es/3/library/funcions.html#sum>`__

source: `super() <https://docs.python.org/es/3/library/functions.html#super>`__
ca: `Super () <https://docs.python.org/es/3/library/funcations.html#super>`__

source: `tuple() <https://docs.python.org/es/3/library/functions.html#func-tuple>`__
ca: `Tuple () <https://docs.python.org/es/3/libry/funnsions.html#func-tuple>`__

source: `type() <https://docs.python.org/es/3/library/functions.html#type>`__
ca: `type() <https://docs.python.org/es/3/libry/funcctions.html#type>`__

source: `vars() <https://docs.python.org/es/3/library/functions.html#vars>`__
ca: `vars() <https://docs.python.org/es/3/libry/functs.html#vars>`__

source: `zip() <https://docs.python.org/es/3/library/functions.html#zip>`__
ca: `zip() <https://docs.python.org/es/3/libry/funcations.html#zip>`__

source: Cuando se escribe código con un editor con **resaltado de sintaxis** las funciones integradas se colorean para distinguirlas del resto. Por ejemplo, en el editor IDLE de Python, las funciones integradas se colorean con color morado.
ca: Quan el codi està escrit amb un editor amb ** ressaltat de la sintaxi ** Les funcions integrades es coloren per distingir -les de la resta. Per exemple, a l’editor inactiu de Python, les funcions integrades es coloren amb color morat.

source: Mayúsculas y minúsculas
ca: Superior i minúscula

source: Las palabras en Python se dice que son **Case Sensitive**, que significa que son diferentes si se escriben en mayúsculas que si se escriben en minúsculas.
ca: Es diu que les paraules de Python són ** sensibles al cas **, cosa que significa que són diferents si estan escrites en majúscules escrites en minúscules.

source: De esta forma la palabra `False` será distinta a la palabra `false`. Hay que tener en cuenta esto para no cometer un error a la hora de escribir la palabra correcta, que es `False`.
ca: D’aquesta manera, la paraula “falsa” serà diferent de la paraula `fals”. Heu de tenir en compte això per no equivocar -vos quan escriviu la paraula correcta, que és "falsa".

source: Hay que evitar utilizar esta característica de Python para nombrar dos variables distintas con el mismo nombre, una en mayúsculas y otra en minúsculas. El resultado sería válido y funcionarían como dos variables distintas, pero no se debe programar de esta manera porque puede dar lugar a fallos difíciles de encontrar.
ca: Heu d’evitar utilitzar aquesta funció Python per anomenar dues variables diferents amb el mateix nom, una de majúscules i una altra en minúscules. El resultat seria vàlid i funcionaria com a dues variables diferents, però no s’hauria de programar d’aquesta manera perquè pot provocar fallades difícils.

source: Ejercicios
ca: Exercicis

source: Nombra cuatro variables para que contengan la edad, la altura, el peso y el nombre de una persona. Ninguno de estos nombres de variable debe coincidir con las palabras reservadas ni con las funciones integradas.
ca: Poseu un nom a quatre variables per contenir l’edat, l’alçada, el pes i el nom d’una persona. Cap d’aquests noms variables ha de coincidir amb les paraules reservades ni les funcions integrades.

source: Investiga para qué sirven las siguientes funciones integradas:
ca: Investigueu per a quines són les funcions integrades següents:
