Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/python-intro.po
Languages: ca

source: Introducción al lenguaje Python
ca: Introducció a la llengua de Python

source: Los lenguajes de programación son una forma de decirle a un ordenador o computadora qué debe hacer. Es como darle órdenes a un robot, pero en lugar de usar palabras, usamos un lenguaje especial llamado código. Los lenguajes de programación tienen sus propias reglas y sintaxis, y cada uno es adecuado para diferentes propósitos.
ca: Els llenguatges de programació són una manera de dir a un ordinador o ordinador què heu de fer. És com donar comandes a un robot, però en lloc d’utilitzar paraules, utilitzem un llenguatge especial anomenat codi. Els llenguatges de programació tenen les seves pròpies regles i sintaxi, i cadascun és adequat per a propòsits diferents.

source: Los programadores escriben código para hacer cosas como crear videojuegos, aplicaciones de escritorio, apps móviles o páginas web. Incluso pueden usar lenguajes de programación para analizar grandes cantidades de datos y hacer predicciones.
ca: Els programadors escriuen codi per fer coses com crear videojocs, aplicacions d’escriptori, aplicacions mòbils o pàgines web. Fins i tot poden utilitzar llenguatges de programació per analitzar grans quantitats de dades i fer prediccions.

source: Los lenguajes de programación se utilizan en una amplia variedad de campos, desde la ciencia de la computación y la ingeniería hasta la financiación y el análisis de datos. El conocimiento de un lenguaje de programación es una habilidad valiosa para cualquier persona que desee trabajar en el campo de la tecnología.
ca: Els llenguatges de programació s’utilitzen en una gran varietat de camps, des de la ciència de la informàtica i l’enginyeria fins al finançament i l’anàlisi de dades. El coneixement d’un llenguatge de programació és una valuosa habilitat per a qualsevol persona que desitgi treballar en el camp de la tecnologia.

source: En este curso aprenderemos a programar en lenguaje Python. Python es un lenguaje de programación muy popular y muy potente. Se utiliza para hacer muchas cosas diferentes, como crear aplicaciones web, analizar datos, crear programas de inteligencia artificial y hasta para controlar robots. Es un lenguaje muy fácil de aprender y tiene una sintaxis clara y sencilla, lo que significa que es fácil de leer y escribir.
ca: En aquest curs aprendrem a programar en llengua Python. Python és un llenguatge de programació molt popular i molt potent. S'utilitza per fer moltes coses diferents, com ara crear aplicacions web, analitzar dades, crear programes d'intel·ligència artificial i fins i tot controlar els robots. És un idioma molt fàcil d’aprendre i té una sintaxi clara i senzilla, cosa que significa que és fàcil de llegir i escriure.

source: Además, hay mucha información y recursos disponibles en línea para aprender Python, lo que lo hace aún más accesible. Puedes encontrar tutoriales, libros y vídeos que te ayudarán a empezar a programar en Python.
ca: A més, hi ha molta informació i recursos disponibles en línia per aprendre Python, cosa que la fa encara més accessible. Podeu trobar tutorials, llibres i vídeos que us ajudaran a començar la programació a Python.

source: ¿Te gustaría ser programador en el futuro? ¡Aprender Python es un gran comienzo! Con dedicación y práctica, puedes hacer muchas cosas increíbles con este lenguaje. ¡Buena suerte en tu viaje de aprendizaje de Python!
ca: Voleu ser programador en el futur? L’aprenentatge de Python és un gran començament! Amb dedicació i pràctica, podeu fer moltes coses increïbles amb aquest idioma. Bona sort al vostre viatge d’aprenentatge de Python!

source: El entorno IDLE de Python
ca: Entorn oci de Python

source: Para empezar a programar vamos a abrir el entorno de programación estándar de Python, llamado IDLE. Pincha en el icono de Windows y escribe la palabra IDLE. A continuación pincha sobre el icono de IDLE.
ca: Per iniciar la programació, obrirem l’entorn de programació de Python estàndard, anomenat Idle. Feu clic a la icona de Windows i escriviu la paraula inactiu. A continuació, feu clic a la icona del ralentí.

source: Si no aparece el icono de IDLE, entonces es necesario instalar primero el lenguaje Python en el ordenador. `Descarga Python <https://www.python.org/downloads/>`__ desde la página web oficial y ejecuta el instalador. Después de instalar Python vuelve al punto anterior.
ca: Si la icona inactiva no apareix, cal instal·lar primer el llenguatge Python a l’ordinador. `Descarregueu Python <https://www.python.org/downloads/>`__ del lloc web oficial i executeu l'instal·lador. Després d’instal·lar Python torna al punt anterior.

source: Aparecerá un entorno de programación como el que puedes ver en la siguiente imagen:
ca: Un entorn de programació apareixerà com el que podeu veure a la imatge següent:

source: Ahora, para comenzar, escribiremos una simple cuenta: 5 + 16 y pulsaremos enter (o return) al final. La pantalla mostrará el resultado en la línea siguiente:
ca: Ara, per començar, escriurem un compte senzill: 5 + 16 i premeu ENTER (o torneu) al final. La pantalla mostrarà el resultat a la línia següent:

source: Podemos escribir cualquier operación sencilla u operaciones más complejas. Este entorno se denomina **entorno interactivo**, porque Python recibe órdenes escritas y devuelve respuestas inmediatamente.
ca: Podem escriure qualsevol operació senzilla o operacions més complexes. Aquest entorn s’anomena ** entorn interactiu **, perquè Python rep comandes escrites i retorna respostes immediatament.

source: Las macros de Python
ca: Macros Python

source: Otra forma de programar es crear archivos de órdenes que se ejecutarán más tarde cuando queramos. Esta otra forma de programar tiene la desventaja de no ser interactiva, no recibimos respuesta a cada orden que escribimos. La ventaja de escribir macros consiste en que podemos tener escritas muchas órdenes para ejecutarlas cuando queramos y todas las veces que queramos.
ca: Una altra manera de programar és crear fitxers de comandes que s’executaran més endavant quan vulguem. Aquesta altra manera de programar té l’inconvenient de no ser interactiu, no rebem resposta a cada ordre que escrivim. L’avantatge d’escriure macros és que podem tenir moltes comandes escrites per executar -les quan vulguem i totes les vegades que vulguem.

source: Para crear una nueva macro pincha dentro de IDLE en la opción ``File`` y luego en ``New File``.
ca: Per crear un nou clic macro al ralentí al `` file '' i, a continuació, a 'nou fitxer'`.

source: Se abrirá una nueva ventana donde podemos escribir órdenes, pero sin recibir respuestas. Ya no se podrá ver el cursor con tres símbolos ``>>>``. Escribiremos dentro de esta ventana las órdenes que se pueden ver a continuación:
ca: S'obrirà una nova finestra on podem escriure comandes, però sense rebre respostes. Ja no podeu veure el cursor amb tres símbols `` >>> `. Escriurem dins d'aquesta finestra les comandes que es poden veure a continuació:

source: Cuando terminemos, vamos a guardar este ejercicio en la carpeta `Python` del disco de datos D:
ca: Quan acabem, estalviarem aquest exercici a la carpeta `python` del disc de dades D:

source: ``D:\Python\Ejercicio01.py``
ca: `` D: \ python \ exercici01.py``

source: Ahora podemos ejecutar el programa pinchando en el menú ``Run`` o pulsando la tecla de función ``F5``. El resultado será el siguiente:
ca: Ara podem executar el programa fent clic a la `` `` `o prement la tecla de funció '` f5``. El resultat serà el següent:

source: Debes responder al programa escribiendo los números que pide y presionando ``Enter`` después de cada número.
ca: Heu de respondre al programa escrivint els números que demaneu i prement `` Enter '' després de cada número.

source: Podemos ejecutar este programa tantas veces como queramos y podemos añadir al programa todas las órdenes que queramos.
ca: Podem executar aquest programa tantes vegades com vulguem i podem afegir al programa totes les comandes que desitgem.

source: Para volver a abrir el programa una vez cerrado, debes pinchar sobre el icono de tu archivo de Python guardado y, presionando el botón derecho del ratón, escoger la opción **"Edit with IDLE"**.
ca: Per reobrir el programa un cop tancat, heu de fer clic a la icona del fitxer emmagatzemat Python i, prement el botó dret del ratolí, trieu l’opció ** \ "Edita amb Idle " **.
