Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/python-sort-mezcla.po
Languages: ca

source: Ordenación por mezcla
ca: Barrejant l’ordenació

source: El algoritmo de ordenación por mezcla (merge sort en inglés) es un algoritmo recursivo basado en la técnica divide y vencerás.
ca: L’algoritme de gestió de la barreja (tipus de combinació en anglès) és un algorisme recursiu basat en les divisions de la tècnica i guanyarà.

source: Fue desarrollado en 1945 por Jonh Von Neumann y se adapta muy bien a la ordenación de gran cantidad de datos secuenciales por ser muy rápido y trabajar fácilmente con datos a los que solo se puede acceder de uno en uno.
ca: Va ser desenvolupat el 1945 per Jonh von Neumann i s’adapta molt bé a l’ordenació d’una gran quantitat de dades seqüencials per ser molt ràpida i treballar fàcilment amb dades a les quals només es pot accedir d’un a un.

source: Descripción del algoritmo
ca: Descripció de l'algoritme

source: El algoritmo de ordenación por mezcla se basa en dividir recursivamente la lista de datos a ordenar en dos sublistas de la mitad de tamaño cada una que la original, para poder ordenarlas con mayor facilidad.
ca: L’algoritme de gestió de la barreja es basa en dividir recursivament la llista de dades a ordenar dos sublistes de la meitat de la mida de cadascun que l’original, per tal d’ordenar -les amb més facilitat.

source: Cuando la lista es de tamaño 0 ó 1 ya estará ordenada.
ca: Quan la llista sigui de 0 o 1, s’ordenarà.

source: Una vez ordenadas las dos sublistas, se aplica un algoritmo que mezcla las dos sublistas ordenadas en una sola lista ordenada de tamaño doble.
ca: Un cop ordenats els dos sublistes, s’aplica un algorisme que barreja els dos sublistes ordenats en un sol conjunt ordenat de doble mida.

source: De esta manera se van mezclando sublistas de tamaño cada vez mayor hasta que toda la lista original se encuentra ordenada.
ca: D’aquesta manera, els sublistes de mida creixent es barregen fins que s’ordena tota la llista original.

source: Algoritmo de ordenación por mezcla.
ca: Algoritme de gestió de mescla.

source: `Swfung8 <https://commons.wikimedia.org/wiki/File:Merge-sort-example-300px.gif>`__, `CC BY-SA 3.0 Unported <https://creativecommons.org/licenses/by-sa/3.0/deed.en>`__, via Wikimedia Commons.
ca: `Swfung8 <https://commons.wikimedia.org/wiki/file:Merge-sort-example-300px.gif>`__, `cc by-sa 3.0 Unported <https://creativecommons.org/licenses/by-sa/3.0/deed.en>` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` `` Wikimedia Commons.

source: Programa de ordenación
ca: Programa de planificació

source: A continuación aparece el código de ordenación de elementos de una lista según el algoritmo de mezcla::
ca: A continuació, apareix el codi de gestió d'una llista segons l'algorisme de la barreja ::

source: Salida::
ca: Sortida ::

source: Ejercicios
ca: Exercicis
