Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/python-listas.po
Languages: ca

source: Listas
ca: Llistes

source: Una lista es un conjunto de datos ordenado en secuencia. Las listas se construyen encerrando entre corchetes ``[ ]`` varios elementos separados por comas::
ca: Una llista és un conjunt de dades ordenat per seqüència. Les llistes es construeixen tancant entre claudàtors `[]` `diversos elements separats per comes ::

source: Como puede observarse, los datos de una lista pueden ser de cualquier tipo. Incluso se pueden hacer listas con varios tipos de datos o una lista de listas::
ca: Com es pot veure, les dades d’una llista poden ser de qualsevol tipus. Fins i tot podeu fer llistes amb diversos tipus de dades o una llista de llistes ::

source: Las listas son una herramienta muy versátil para almacenar los datos de un programa y trabajar con ellos.
ca: Les llistes són una eina molt versàtil per emmagatzemar les dades d’un programa i treballar amb elles.

source: Listas multilínea
ca: Llistes multilínies

source: Las listas con muchos elementos o con una estructura compleja se pueden escribir separando los elementos en líneas consecutivas para que el resultado sea más legible::
ca: Les llistes amb molts elements o amb una estructura complexa es poden escriure separant els elements en línies consecutives de manera que el resultat sigui més llegible ::

source: Operaciones con listas
ca: Enumereu les operacions

source: Las listas se pueden sumar y multiplicar por un número, igual que las cadenas de texto::
ca: Les llistes es poden afegir i multiplicar per un número, igual que les cadenes de text ::

source: Sentencia ``in``
ca: Judici `` in ''

source: La sentencia ``in`` retorna un valor ``True`` o ``False`` y permite conocer si un dato se encuentra dentro de una lista::
ca: El judici `` in '' retorna un valor `` `` o `` fals '' i permet saber si un fet es troba dins d'una llista ::

source: La sentencia ``not in`` es la contraria a la sentencia ``in`` y devuelve verdadero si un elemento no está en una lista::
ca: La sentència `no en 'és el contrari al judici'` in 'i retorna cert si un element no es troba en una llista ::

source: Ejercicios
ca: Exercicis

source: Escribe un programa que asigne a una lista el nombre de cinco compañeros/as o amigos/as.
ca: Escriviu un programa que assigna a una llista el nom de cinc companys o amics.

source: Añade al programa anterior otra lista con las edades de las personas anteriores. Si no las sabes, puedes escribirlas de forma aproximada.
ca: Afegiu al programa anterior una altra llista amb les edats de les persones anteriors. Si no els coneixeu, podeu escriure -les aproximadament.

source: Crea una tercera lista que contenga las dos listas anteriores::
ca: Creeu una tercera llista que conté les dues llistes anteriors ::

source: Escribe un programa que cree una lista multilínea con tres frases famosas que elijas desde `esta página web <https://psicologiaymente.com/reflexiones/frases-famosas>`__ u otra web de tu elección.
ca: Escriviu un programa que crei una llista multilínia amb tres frases famoses que trieu entre aquest lloc web <https://psicologiaymente.com/reflexions/frases-famosas> `` __ o un altre lloc web que escolliu.

source: Escribe una lista con los 10 primeros números primos. Puedes encontrar cuáles son en un buscador de Internet.
ca: Escriviu una llista amb els primers 10 números principals. Podeu trobar quins es troben en un motor de cerca a Internet.

source: Haz la lista en dos partes. Primero defines la lista con 5 primos y luego le sumas a la lista otros 5 primos más.
ca: Feu la llista en dues parts. Primer definiu la llista amb 5 cosins i, a continuació, afegiu -ne 5 cosins més.

source: Modifica el programa anterior para que compruebe si los números 3, 7, 9, 13 y 20 pertenecen a los primeros 10 números primos.
ca: Modifiqueu el programa anterior per comprovar si els números 3, 7, 9, 13 i 20 pertanyen als 10 primers números.

source: Para ello debes definir una función que compruebe si el número está en la lista y que imprima el resultado.
ca: Per fer -ho, heu de definir una funció que comprovi si el número es troba a la llista i que imprimeix el resultat.

source: Llama a la función 5 veces para comprobar los 5 números.
ca: Truqueu a la funció 5 vegades per comprovar els 5 números.
