Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/python-textos-indices.po
Languages: ca

source: Índices de cadenas de texto
ca: Índexs de la cadena de text

source: Las cadenas de texto están formadas por caracteres individuales que se pueden obtener con los índices. Un índice de cadena de texto es un número dentro de dos corchetes ``[]`` de apertura y de cierre::
ca: Les cadenes de text estan formades per caràcters individuals que es poden obtenir amb els índexs. Un índex de cadena de text és un número dins de dos claudàtors `` [] `` obertura i tancament ::

source: El primer carácter 'P' tiene el índice cero 'lang[0]'. Esta es una convención que utilizan muchos otros lenguajes de programación como el lenguaje C o el lenguaje JavaScript. La primera vez que se aprende no es sencillo acostumbrarse, pero es necesario para poder escribir código correcto.
ca: El primer personatge "P" té l'índex zero "Lang [0]". Es tracta d’una convenció utilitzada per molts altres llenguatges de programació com el llenguatge CNAASCRIPT. La primera vegada que apreneu no és fàcil d’utilitzar -se, però cal escriure codi correcte.

source: Los índices negativos comienzan por el final de la cadena de texto::
ca: Els índexs negatius comencen al final de la cadena de text ::

source: Los índices fuera de rango producen un error en el programa::
ca: Els índexs fora de rang produeixen un error al programa ::

source: Rebanadas o slicers
ca: Llesques o llesques

source: Los índices se pueden escribir para que obtengan varios caracteres de una cadena de texto, utilizando el carácter dos puntos ':' para separar el comienzo del final en un índice::
ca: Els índexs es poden escriure per obtenir diversos caràcters d'una cadena de text, utilitzant els dos punts del personatge ":" Per separar el començament del final en un índex ::

source: El siguiente esquema puede ayudar a entender mejor cómo funcionan los índices y las rebanadas::
ca: El següent esquema pot ajudar a comprendre millor el funcionament dels índexs i les llesques ::

source: Un índice tomará la letra de su derecha.
ca: Un índex agafarà la carta a la vostra dreta.

source: Una rebanada tomara los caracteres que hay entre los dos números. Por ejemplo, [1:-2] tomará todos los caracteres que se encuentran entre los índices 1 y -2 'yth' ::
ca: Una llesca portarà els caràcters entre els dos números. Per exemple, [1: -2] prendrà tots els caràcters entre els índexs 1 i -2 'yth' ::

source: Los números de las rebanadas también se pueden dejar sin escribir y esto es equivalente a decir que tome todos los caracteres desde el comienzo o que tome todos los caracteres hasta el final de la cadena::
ca: El nombre de les llesques també es pot deixar sense escriure i això equival a dir que agafeu tots els personatges des del principi o porteu tots els personatges fins al final de la cadena ::

source: Las rebanadas con índices fuera de rango no producen error, solo devuelven una cadena vacía::
ca: Les rodanxes amb els índexs de gamma fora no produeixen error, només retornen una cadena buida ::

source: Bucles con cadenas de texto
ca: Bucles amb cadenes de text

source: Un bucle ``for`` puede ir tomando los caracteres de una cadena de texto uno a uno::
ca: Un `` per '' es pot treure els caràcters d'una cadena de text un per un ::

source: Ejercicios
ca: Exercicis

source: Escribe una función que imprima uno a uno todos los caracteres de una cadena de texto que le pasemos como argumento, sin utilizar índices.
ca: Escriviu una funció que imprimeixi un per un tots els caràcters d’una cadena de text que gastem com a argument, sense utilitzar índexs.

source: Llama a la función dos veces con dos cadenas de texto distintas.
ca: Truqueu a la funció dues vegades amb dues cadenes de text diferents.

source: Escribe una función que imprima uno a uno todos los caracteres de una cadena de texto que le pasemos como argumento, utilizando índices.
ca: Escriviu una funció que imprimeixi un per un tots els caràcters d’una cadena de text que gastem com a argument, mitjançant índexs.

source: Escribe una función que acepte como argumento una cadena de texto y que vaya imprimiendo la cadena poco a poco imprimiendo al principio solo un carácter, luego dos caracteres, así hasta terminar imprimiendo todos los caracteres.
ca: Escriviu una funció que accepti una cadena de text com a argument i que la cadena està empresonant gradualment al principi només un personatge, després dos caràcters, de manera que fins que no s’imprimeixin tots els caràcters.

source: Ejemplo::
ca: Exemple ::

source: Modifica la función anterior para que imprima la cadena de texto comenzando desde la derecha, carácter por carácter, hasta terminar::
ca: Modifica la funció anterior de manera que imprimeix la cadena de text a partir de la dreta, caràcter per caràcter, fins que finalitzi ::

source: Escribe una función que acepte como argumento una cadena de texto y que imprima grupos de cinco caracteres del texto desde el comienzo de la cadena hasta el final::
ca: Escriviu una funció que accepti com a argument una cadena de text i que imprimeix grups de cinc caràcters del text des del començament de la cadena fins al final ::

source: Pista: añade espacios al comienzo y al final de la cadena de texto.
ca: Pista: afegiu espais al començament i al final de la cadena de text.
