Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/python-textos-formateo.po
Languages: ca

source: Formateo de cadenas de texto
ca: Format de la cadena de text

source: `Un literal de cadena de texto con formateo <https://docs.python.org/es/3/reference/lexical_analysis.html#f-strings>`__ es una cadena de texto que comienza por la letra ``'F'`` o ``'f'`` y que contiene campos de reemplazo delimitados por llaves ``{ }``. Los campos de reemplazo contienen variables de Python y, opcionalmente, el formato que se debe dar al contenido de la variable.
ca: `Una cadena de text literal amb format <https://docs.python.org/es/3/reference/lexical_analysis.html#f-strings>`__ és una cadena de text que comença amb la lletra `` `` `` ``} '. Els camps de substitució contenen variables Python i, opcionalment, el format que s’ha de donar al contingut de la variable.

source: Si se quiere imprimir una llave, es necesario duplicarla: ``{{`` o bien ``}}``.
ca: Si voleu imprimir una clau, cal doblar -la: `{{` `o '` `}}`.

source: Ejemplo::
ca: Exemple ::

source: Ejercicios
ca: Exercicis

source: Repite el siguiente ejercicio cambiando el valor de la variable 'nombre' con tu propio nombre.
ca: Repetiu l'exercici següent canviant el valor de la variable `` nom 'amb el vostre propi nom.

source: Ejercicio::
ca: Exercici ::

source: Salida::
ca: Sortida ::

source: Repite el siguiente ejercicio cambiando el valor de la variable ``num = 78``. En la última línea cambia el número por tu año de nacimiento.
ca: Repetiu l'exercici següent canviant el valor del `` num = 78` ``. A la darrera línia canvia el nombre per al vostre any de naixement.

source: Repite el siguiente ejercicio con la variable ``e = 2.718281828``. Recuerda que en Python los decimales siempre se separan con un punto, no con una coma.
ca: Repetiu l'exercici següent amb la variable `` e = 2.718281828``. Recordeu que a Python els decimals sempre es separen amb un punt, no amb una coma.

source: Repite el siguiente ejercicio cambiando el valor de los números utilizados para que aparezcan otros caracteres Unicode.
ca: Repetiu el següent exercici canviant el valor dels números utilitzats per aparèixer per a altres caràcters Unicode.

source: Escribe un programa que pida un carácter por el teclado y que devuelva los siguientes 20 caracteres Unicode.
ca: Escriviu un programa que sol·liciti un personatge al teclat i retorna els següents 20 caràcters Unicode.

source: Utiliza la función ``ord()`` para convertir el carácter en su número Unicode.
ca: Utilitzeu la funció `` ord () `` per convertir el caràcter en el seu número d'unicode.

source: Prueba a introducir diferentes caracteres desde el teclado. Prueba a copiar de Internet y pegar símbolos, emojis, letras griegas y cirílicas, etc.
ca: Proveu d’introduir diferents caràcters del teclat. Proveu de copiar des d’Internet i enganxar símbols, emojis, lletres gregues i cirilic, etc.

source: Escribe una función que imprima el valor de un color RGB en hexadecimal. Los tres parámetros de la función serán tres números decimales R, G y B (Red, Green y Blue) que deben estar en el rango de 0 a 255.
ca: Escriviu una funció que imprimeixi el valor d’un color RGB en hexadecimal. Els tres paràmetres de la funció seran tres números decimals R, G i B (vermell, verd i blau) que han d’estar entre 0 i 255.

source: Recuerda que los valores hexadecimales deben estar en mayúsculas y tener dos cifras obligatoriamente. La manera de convertir una variable a hexadecimal que tenga siempre dos cifras es añadir a la variable el siguiente formato: ``f'{variable:02X}'``.
ca: Recordeu que els valors hexadecimals s’han de capitalitzar i tenir dues xifres. La manera de convertir una variable en hexadecimal que sempre té dues figures és afegir a la variable el format següent: `` f '{variable: 02x}' `.
