Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/python-if-elif.po
Languages: ca

source: Sentencia ``elif``
ca: Judici `` elif ''

source: La sentencia ``elif`` es equivalente a escribir ``else: if`` y se utiliza para evaluar múltiples condiciones como en una estructura ``if`` anidada, con la ventaja de no necesitar sangrías sucesivas.
ca: La sentència `` elif`` equival a escriure `` Else: si '' i s'utilitza per avaluar diverses condicions com en una estructura `` si '`` `` anity, amb l'avantatge de no necessitar sagnat successiu.

source: Este es un ejemplo de la instrucción ``elif`` utilizada para traducir notas numéricas a texto::
ca: Aquest és un exemple de la instrucció `elif`` que s’utilitza per traduir notes numèriques al text ::

source: Ejercicios
ca: Exercicis

source: Escribe un programa que clasifique un número entero como positivo, negativo o cero
ca: Escriviu un programa que classifiqui un nombre enter com a positiu, negatiu o zero

source: Escribe un programa que traduzca el mes del año en la estación a la cual pertenece ese mes. Los meses de cada estación son:
ca: Escriviu un programa que tradueixi el mes de l'any a l'estació a la qual pertany aquest mes. Els mesos de cada estació són:

source: Invierno: 1, 2, 12
ca: Hivern: 1, 2, 12

source: Verano: 6, 7, 8
ca: Estiu: 6, 7, 8

source: Otoño: 9, 10, 11
ca: Tardor: 9, 10, 11

source: Escribe un programa que detecte si un número es una nota válida. Para ser una nota válida debe ser mayor o igual a 1 y menor o igual que 10. En el caso de que sea muy baja o muy alta, el programa avisará del error. Si la nota es válida, el programa lo escribirá en pantalla.
ca: Escriviu un programa que detecti si un número és una nota vàlida. Per ser una nota vàlida, ha de ser superior o igual a 1 i inferior o igual a 10. En cas que sigui molt baix o molt alt, el programa notificarà l’error. Si la nota és vàlida, el programa escriurà a la pantalla.

source: Números primos. Escribe un programa que verifique si un número positivo entre 1 y 10 es primo. En caso de no ser primo, escribe por qué número es divisible:
ca: Nombres primaris. Escriviu un programa que verifica si un nombre positiu entre 1 i 10 és cosí. En cas de no ser cosí, escriviu per què el número és divisible:

source: El número 1 no es primo por definición.
ca: El número 1 no és cosí per definició.

source: Los números 2, 3, 5 y 7 son primos.
ca: Els números 2, 3, 5 i 7 són cosins.

source: Los números 4, 6, 8 y 10 son divisibles por 2. No son primos.
ca: Els números 4, 6, 8 i 10 són divisibles per 2. No són cosins.

source: El número 9 es divisible por 3. No es primo.
ca: El número 9 és divisible per 3. No és cosí.

source: Los números mayores que 10 deben dar error por ser demasiado grandes.
ca: Els números més grans que han de donar un error per ser massa grans.
