Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/python-textos.po
Languages: ca

source: Cadenas de texto
ca: Cadenes de text

source: Además de números, Python puede manipular cadenas de texto o de caracteres. Las cadenas de texto pueden estar encerradas entre comillas dobles "" o entre comillas simples ''.
ca: A més dels números, Python pot manipular text o caràcters. Les cadenes de text es poden bloquejar en cites dobles \ "" o en cotitzacions simples. ''

source: Si necesitamos utilizar una comilla simple o una comilla doble dentro de una cadena de texto, podemos utilizar el carácter escape '\\'::
ca: Si hem d'utilitzar una cita senzilla o una cita doble dins d'una cadena de text, podem utilitzar el caràcter d'escapament '\\' ::

source: Los símbolos de escape más utilizados son::
ca: Els símbols d’escapament més utilitzats són ::

source: Las cadenas de texto pueden contener caracteres `Unicode <https://es.wikipedia.org/wiki/Unicode>`__, es decir que pueden contener las letras del alfabeto latino 'ñ', letras de alfabetos diferentes como el griego 'Ω', el cirílico 'Я' o, incluso, símbolos '☀' y emojis '😀'.
ca: Les cadenes de text poden contenir caràcters `Unicode <https://es.wikipedia.org/wiki/unicode>`__, és a dir que poden contenir les lletres de l'alfabet llatí 'ñ', diferents lletres de l'alfabet com el grec 'ω', el círílic 'я' o fins i tot, fins i tot, símbols 'i emojis' i emojis.

source: Cadenas de texto multilínea
ca: Cadenes de text multilínies

source: En el caso de querer escribir muchas líneas de texto se puede incluir en la cadena el carácter de nueva línea '\\n' o utilizar las cadenas multilínea que se encierran entre tres comillas simples o dobles::
ca: En el cas de voler escriure moltes línies de text, el nou personatge de la línia '\\ n' es pot incloure a la cadena o utilitzar les cadenes multilíniques que es troben entre tres cites simples o dobles ::

source: Salida::
ca: Sortida ::

source: Estos textos multilínea se pueden utilizar dentro de las funciones para añadir un texto de ayuda que explique su funcionamiento::
ca: Aquests textos multilineals es poden utilitzar dins de les funcions per afegir un text d’ajuda que expliqui la seva operació ::

source: La función ``help()`` nos devuelve la cadena de texto de la función para informarnos de su funcionamiento. Todas las funciones internas de Python tienen esta cadena de texto informativa para poder pedir ayuda sobre su funcionamiento.
ca: La funció `` help () retorna la cadena de text de la funció per informar -nos de la seva operació. Totes les funcions internes de Python tenen aquesta cadena de text informativa per demanar ajuda sobre la seva operació.

source: Unión de cadenas de texto
ca: Unió de cadenes de text

source: Para unir dos cadenas de texto podemos usar el símbolo de suma::
ca: Per unir -nos a dues cadenes de text, podem utilitzar el símbol de la suma ::

source: Dos o más cadenas literales se unen entre sí si van seguidas una delante de la otra::
ca: Dues o més cadenes literals s’uneixen entre elles si es troben davant de l’altra ::

source: Multiplicación de cadenas de texto
ca: Multiplicació de cadenes de text

source: El símbolo de multiplicación se puede utilizar para obtener varias veces un texto::
ca: El símbol de multiplicació es pot utilitzar per obtenir un text diverses vegades ::

source: Ejercicios
ca: Exercicis

source: `Symbol <https://symbl.cc/es/>`__
ca: `Símbol <https://symbl.cc/es/>`__

source: `Tabla de caracteres Unicode <https://www.rapidtables.org/code/text/unicode-characters.html>`__
ca: `Taula de caràcters Unicode <https://www.rapidtables.org/code/text/unicode-characters.html>`__

source: Mapa de caracteres de Windows
ca: Mapa de caràcters de Windows

source: Crea una cadena de texto multilínea con un recuadro doble alrededor de una frase inventada.
ca: Creeu una cadena de text multilínia amb una caixa doble al voltant d’una frase inventada.

source: Utiliza estos símbolos para hacer el recuadro::
ca: Utilitzeu aquests símbols per fer la caixa ::

source: Crea una función que imprima una tabla de 2 filas por 2 columnas en las que aparezcan 4 números inventados.
ca: Creeu una funció que imprimi una taula de 2 files per 2 columnes en què apareixen 4 números inventats.

source: La función debe tener una cadena de texto multilínea en la que se explique cuál es su propósito.
ca: La funció ha de tenir una cadena de text multilineal en què s’explica quin és el seu propòsit.

source: Utiliza estos símbolos para recuadrar la tabla::
ca: Utilitzeu aquests símbols per caixa de la taula ::

source: Escribe un programa que ingrese una cadena de texto por el teclado y escriba el número de caracteres que tiene esa cadena.
ca: Escriu un programa que entra en una cadena de text al teclat i escrigui el nombre de caràcters que té la cadena.

source: Pista: la función len('texto') devuelve la longitud, es decir el número de caracteres, de una cadena de texto.
ca: Pista: la funció len ("text") retorna la longitud, és a dir, el nombre de caràcters, d'una cadena de text.

source: Escribe una función que genere automáticamente un recuadro alrededor de cualquier cadena de texto que le pasemos como argumento.
ca: Escriviu una funció que generi automàticament un quadre al voltant de qualsevol cadena de text que dediquem com a argument.

source: Llama a la función varias veces con distintas cadenas de texto.
ca: Truqueu a la funció diverses vegades amb diferents cadenes de text.

source: Ejemplo::
ca: Exemple ::

source: Pistas:
ca: Pistes:

source: Utiliza la multiplicación de caracteres para imprimir el carácter '═' varias veces.
ca: Utilitzeu la multiplicació de caràcters per imprimir el personatge "Ç" diverses vegades.

source: Utiliza la función ``len(texto)`` para saber la longitud de la cadena de texto que deseamos imprimir.
ca: Utilitzeu la funció `` len (text) `` per conèixer la longitud de la cadena de text que volem imprimir.
