Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/python-for-range.po
Languages: ca

source: La función :py:func:`range`
ca: La funció: py: funció: `range '

source: La función range() sirve para crear un rango de números en un bucle ``for``. Tiene tres parámetros con valores por omisión, por lo que puede tener uno, dos o tres argumentos.
ca: La funció Range () serveix per crear una gamma de números en un `` `` té tres paràmetres amb valors d'omissió, de manera que podeu tenir un, dos o tres arguments.

source: Con tres argumentos:
ca: Amb tres arguments:

source: ``start`` es el primer número entero por el que comienza el rango.
ca: `` Start '' És el primer nombre enter pel qual comença la gamma.

source: ``stop`` es el número que finaliza el rango. Nunca se llega a ese valor.
ca: `parar '' És el número que acaba amb la gamma. No s’arriba mai a aquest valor.

source: ``step`` es el valor que se va añadiendo a ``start`` para conseguir los números consecutivos.
ca: `` Step`` és el valor que s’afegeix a `start`` per obtenir números consecutius.

source: Ejemplo::
ca: Exemple ::

source: Con dos argumentos:
ca: Amb dos arguments:

source: Solo se utilizan los parámetros ``start`` y ``stop``.
ca: Només s'utilitzen els paràmetres "start` i stop``.

source: El parámetro ``step`` se supone igual a uno.
ca: El paràmetre `` pas '' s'assumeix igual a un.

source: Con un argumento:
ca: Amb un argument:

source: El argumento se copia en el parámetro ``stop``.
ca: L'argument es copia al paràmetre "Stop".

source: El parámetro ``start`` se supone igual a cero.
ca: Se suposa que el paràmetre `` start 'és zero.

source: Como el rango comienza en el número cero, el número de elementos del rango será igual al número que escribimos dentro de la función rango.
ca: A mesura que el rang comença en el nombre zero, el nombre d’elements de l’interval serà igual al nombre que escrivim dins de la funció de rang.

source: Ejercicios
ca: Exercicis

source: Escribe un programa que imprima todos los números pares entre el 2 y el 20, ambos incluidos.
ca: Escriviu un programa que imprimeixi tots els números entre 2 i 20, tots dos inclosos.

source: Escribe un programa que imprima todos los números impares entre el 1 y el 19, ambos incluidos.
ca: Escriviu un programa que imprimeixi tots els nombres estranys entre 1 i 19, tots dos inclosos.

source: Escribe un programa que imprima una cuenta atrás que comience imprimiendo 10 y que acabe imprimiendo 0.
ca: Escriviu un programa que imprimeixi un compte enrere que comença imprimint 10 i acaba imprimint 0.

source: Escribe un programa que escriba el siguiente listado::
ca: Escriviu un programa que escrigui la llista següent ::

source: Escribe un programa que sume todos los primeros 'n' números impares y comprueba que el resultado es igual al cuadrado de 'n'.
ca: Escriviu un programa que afegeixi tots els primers números "n" i comproveu que el resultat sigui igual al quadrat de "N".
