Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/recursos-libro-4eso-tecno.po
Languages: ca

source: Libro 4ºESO Tecnología del CIDEAD
ca: 4t llibre Cidead Technology

source: Libro de Tecnología para 4º curso de la ESO del `CIDEAD <https://www.educacionyfp.gob.es/mc/cidead/portada.html>`__ (Centro para la Innovación y Desarrollo de la Educación a Distancia)
ca: Llibre de tecnologia per al quart curs del `Cidead <https://www.educionyfp.gob.es/mc/cidead/portada.html>`__ (Centre d'Innovació i Desenvolupament de l'Educació a Distància)

source: Unidades didácticas interactivas
ca: Unitats didàctiques interactives

source: `Unidad 1: Historia de la tecnología <../_static/4esotecno/quincena1/4q1_index.html>`__
ca: `Unitat 1: Historial de la tecnologia <../_ Static/4estecno/quinzenight1/4q1_index.html>`__

source: `Unidad 2: Los objetos técnicos y la sociedad <../_static/4esotecno/quincena2/4q2_index.html>`__
ca: `Unitat 2: objectes tècnics i societat <../_ static/4estecno/quinze night2/4q2_index.html>`__

source: `Unidad 3: Tecnologías de la comunicación <../_static/4esotecno/quincena3/4q3_index.html>`__
ca: `Unitat 3: Tecnologies de comunicació <../_ Static/4 Esecto/Finden3/4Q3_index.html>`__

source: `Unidad 4: Electrónica Analógica <../_static/4esotecno/quincena4/4q2_index.html>`__
ca: `Unitat 4: Electrònica analògica <../_ Static/4estecno/quinzenight4/4q2_index.html>`__

source: `Unidad 5: Lógica Binaria <../_static/4esotecno/quincena5/4q2_index.html>`__
ca: `Unitat 5: lògica binària <../_ static/4estecno/quinzenight5/4q2_index.html>`__

source: `Unidad 6: Puertas Lógicas <../_static/4esotecno/quincena6/index_4quincena6.html>`__
ca: `Unitat 6: Portes lògiques <../_ static/4estecno/quinze dies/index_4quinna6.html>`__

source: `Unidad 7: Instalaciones eléctricas en las viviendas <../_static/4esotecno/quincena7/index_4quincena7.html>`__
ca: `Unitat 7: Instal·lacions elèctriques a les cases <../_ static/4estecno/quinzenight7/index_4quinca7.html>`__

source: `Unidad 8: Otras instalaciones en las viviendas <../_static/4esotecno/quincena8/index_4quincena8.html>`__
ca: `Unitat 8: Altres instal·lacions a les cases <../_ static/4estecno/quinzenight8/index_4quincena8.html>`__

source: `Unidad 9: Neumática e Hidráulica I <../_static/4esotecno/quincena9/index_4quincena9.html>`__
ca: `Unitat 9: pneumàtic i hidràulic i <../_ estàtic/4 esecto/finden9/index_4quincena9.html>` `` ``

source: `Unidad 10: Neumática e Hidráulica II <../_static/4esotecno/quincena10/index_4quincena10.html>`__
ca: `Unitat 10: pneumàtic i hidràulic II <../_ estàtic/4 esecto/finden10/index_4quincena10.html>` `` `

source: `Unidad 11: Robótica <../_static/4esotecno/quincena11/index_4quincena11.html>`__
ca: `Unitat 11: Robòtica <../_ Static/4estecno/quinzenight11/index_4quinca11.html>`__

source: `Unidad 12: Control por ordenador <../_static/4esotecno/quincena12/index_4quincena12.html>`__
ca: `Unitat 12: Control de l'ordinador <../_ static/4estecno/finden22/index_4quincena12.html>`__

source: Unidades didácticas para imprimir
ca: Unitats didàctiques per imprimir

source: `Unidad 1: Historia de la tecnología <../_static/4esotecno/quincena1/pdf/4quincena1.pdf>`__
ca: `Unitat 1: Historial de la tecnologia <../_ Static/4estecno/quinze night1/pdf/4quinna1.pdf>`__

source: `Unidad 2: Los objetos técnicos y la sociedad <../_static/4esotecno/quincena2/pdf/4quincena2.pdf>`__
ca: `Unitat 2: objectes tècnics i societat <../_ static/4estecno/quinze night2/pdf/4quinna2.pdf>`__

source: `Unidad 3: Tecnologías de la comunicación <../_static/4esotecno/quincena3/pdf/quincena3.pdf>`__
ca: `Unitat 3: Tecnologies de comunicació <../_ Static/4estecno/finden3/pdf/finden3.pdf>`__

source: `Unidad 4: Electrónica Analógica <../_static/4esotecno/quincena4/pdf/quincena4.pdf>`__
ca: `Unitat 4: electrònica analògica <../_ estàtica/4 esecto/finden4/pdf/finden4.pdf>`__

source: `Unidad 5: Lógica Binaria <../_static/4esotecno/quincena5/pdf/quincena5.pdf>`__
ca: `Unitat 5: lògica binària <../_ estàtica/4estecno/quinzena 5/pdf/quinze night5.pdf>`__

source: `Unidad 6: Puertas Lógicas <../_static/4esotecno/quincena6/pdf/quincena6.pdf>`__
ca: `Unitat 6: Portes lògiques <../_ Static/4estecno/quinze dies/pdf/quinze night6.pdf>`__

source: `Unidad 7: Instalaciones eléctricas en las viviendas <../_static/4esotecno/quincena7/pdf/quincena7.pdf>`__
ca: `Unitat 7: Instal·lacions elèctriques a les cases <../_ static/4estecno/quinzenight7/pdf/quinzight7.pdf>`__

source: `Unidad 8: Otras instalaciones en las viviendas <../_static/4esotecno/quincena8/pdf/quincena8.pdf>`__
ca: `Unitat 8: Altres instal·lacions a les cases <../_ static/4estecno/quinze night8/pdf/quinight8.pdf>`__

source: `Unidad 9: Neumática e Hidráulica I <../_static/4esotecno/quincena9/pdf/quincena9.pdf>`__
ca: `Unitat 9: pneumàtic i hidràulica i <../_ static/4 esecto/finden9/pdf/finden9.pdf>`__

source: `Unidad 10: Neumática e Hidráulica II <../_static/4esotecno/quincena10/pdf/quincena10.pdf>`__
ca: `Unitat 10: pneumàtic i hidràulic II <../_ estàtic/4 esecto/findens10/pdf/findens10.pdf>`__

source: `Unidad 11: Robótica <../_static/4esotecno/quincena11/pdf/quincena11.pdf>`__
ca: `Unitat 11: Robòtica <../_ Static/4estecno/quinzenight11/pdf/quinzenight11.pdf>`__

source: `Unidad 12: Control por ordenador <../_static/4esotecno/quincena12/pdf/quincena12.pdf>`__
ca: `Unitat 12: Control de l'ordinador <../_ Static/4estecno/quinzenight12/pdf/quinzenight12.pdf>`__

source: Créditos del libro
ca: Crèdits de llibre

source: Licencia:
ca: Llicència:

source: `Creative Commons Reconocimiento-NoComercial-CompartirIgual 3.0 España <https://creativecommons.org/licenses/by-nc-sa/3.0/es/>`__
ca: `Creative Commons Reconeixement-Nocomercial- Compartyrrigual 3.0 Espanya <https://creatcommons.org/licenses/by-nc-sa/3.0/es/>` `` `` `` `` `` `` `` ``

source: Autores:
ca: AUTORS:

source: Angélica Carbonell González
ca: Angelica Carbonell González

source: Antonio Poyatos Dorado
ca: Antonio Poyatos Gold

source: `Créditos del libro <../_static/4esotecno/nota.html>`__
ca: `Crèdits del llibre <../_ Static/4estecno/nota.html>`__

source: Cuestiones para trabajar
ca: Problemes per treballar

source: Unidad 1: Historia de la tecnología
ca: Unitat 1: Història de la tecnologia

source: :download:`Unidad 1: Preguntas (PDF) <4esotecno/UD1_Preguntas_Historia_tecnologia.pdf>`
ca: : Descarregueu: `Unitat 1: Preguntes (PDF) <4estecno/ud1_ preguntes_historia_tecnologia.pdf>`

source: :download:`Unidad 1: Preguntas (Word) <4esotecno/UD1_Preguntas_Historia_tecnologia.doc>`
ca: : Descarregueu: `Unitat 1: Preguntes (paraula) <4estecno/ud1_ preguntes_historia_tecnologia.doc>` `

source: `Cuestionarios tipo test de la Unidad 1. <../test/index.html#tecnologia>`__
ca: `Test qüestionaris de la unitat. <../test/index.html#Technology>`__

source: Unidad 2: Los objetos técnicos y la sociedad
ca: Unitat 2: objectes tècnics i societat

source: `Cuestionarios tipo test de la Unidad 2. <../test/index.html#tecnologia>`__
ca: `Test qüestionaris de la unitat 2. <../test/index.html#Technology>`__

source: Simulador de neumática
ca: Simulador pneumàtic

source: `Simulador de neumática. <../_static/flash/simulador-neumatica.html>`__
ca: `Simulador pneumàtic. <../_ static/flash/simulator-neumatica.html>`__

source: Creado por Antonio Bueno en la página `www.portaleso.com <http://www.portaleso.com>`__ con licencia `Creative Commons Reconocimiento-NoComercial-CompartirIgual 2.5 España <https://creativecommons.org/licenses/by-nc-sa/2.5/es/>`__
ca: Creat per Antonio Bueno al `www.portaleso.com
