Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/recursos-images.po
Languages: ca

source: Imágenes con licencia libre
ca: Imatges de llicència gratuïtes

source: `Pexels <https://www.pexels.com/es-es/>`__ Imágenes y vídeos con `Licencia abierta <https://www.pexels.com/es-es/license/>`__.
ca: `Pexels <https://www.pexels.com/es-es/>`__ imatges i vídeos amb `llicència oberta <https://www.pexels.com/es-es/license/>`__.

source: `Pixabay <https://pixabay.com/es/>`__ Más de 1,9 millones de fotos `libres de derechos. <https://pixabay.com/es/service/faq/>`__.
ca: `Pixabay <https://pixabay.com/es/>`__ Més d'1,9 milions de fotos `lliures de drets. <https://pixabay.com/es/service/faq/>`__.

source: `Open Clipart <https://openclipart.org/>`__ Cliparts (imágenes vectoriales) de licencia libre.
ca: `Open Clipart <https://openclippart.org/>`__ cliparts (imatges vectorials) de llicència gratuïta.

source: `Freepik <https://www.freepik.es/>`__ Fotografías e imágenes vectoriales de licencia libre (con atribución).
ca: `FreePik <https://www.freepik.es/>`__ fotografies i imatges de llicències lliures vectorials (amb atribució).

source: `Public Domain Pictures <http://www.publicdomainpictures.net/>`__ Imágenes premium por encima de 2 megapixel.
ca: `Pub Imatges de domini <http://www.publicdomainpictures.net/>`__ imatges premium per sobre de 2 megapíxels.

source: `Shutterstock <http://www.shutterstock.com/es/>`__ Más de 60 millones de fotos, vectores, vídeos y pistas de música en stock.
ca: `Shuttersock <http://www.shuttersock.com/es/>`__ Més de 60 milions de fotos, vectors, vídeos i pistes de música en estoc.

source: `Dreamstime <http://www.dreamstime.com/free-photos>`__ 38 Million royalty-free stock images. Requiere registro.
ca: `DreamStime <http://www.dreamstime.com/free-photos>`__ 38 milions d'imatges d'estoc sense drets d'autor. Requereix el registre.

source: `Free digital photos <http://www.freedigitalphotos.net/>`__ Pay per high quality high than 400px. Requiere registro por e-mail.
ca: `Fotos digitals gratuïts <http://www.freedigitalphotos.net/>`__ pagar per alta qualitat superior a 400px. Requereix el registre per correu electrònic.

source: `Free Images <http://es.freeimages.com/>`__ 388 mil fotografías e ilustraciones gratis. 2,4 millones de fotos de pago. Requiere registro.
ca: `Imatges gratuïtes <http://es.freeimages.com/>`__ 388 mil fotografies i il·lustracions gratuïtes. 2,4 milions de fotos de pagament. Requereix el registre.

source: `Getty Free Images <http://www.gettyimages.es/creative-images/royaltyfree>`__ Imágenes libres y de pago de alta calidad.
ca: `Getty Free Images <http://www.gettyimages.es/creative-images/royaltyfree>` __ imatges de pagament gratuïtes i d'alta qualitat.

source: Listados de páginas con imágenes libres
ca: Llistes de pàgines amb imatges gratuïtes

source: `14 Amazingly Free Stock Photo Websites <http://www.entrepreneur.com/article/238646>`__.
ca: `14 llocs web de fotografies sorprenentment gratuïtes <http://www.entrepreneur.com/article/238646>`__.
