Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/recursos-copyright.po
Languages: ca

source: El derecho de autor
ca: Copyright

source: El `derecho de autor o copyright <https://es.wikipedia.org/wiki/Copyright>`__ es una **ley** que protege las **obras creativas** y permite que solo el autor decida cómo se usan, copian, distribuyen, adapten o exhiban sus obras.
ca: The Copyright o Copyright <https://es.wikipedia.org/wiki/copyright>`__ és una ** llei ** que protegeix les obres ** creatives ** i que només l’autor decideix com s’utilitzen, copien, distribueixen, s’adapten o exhibeixen les seves obres.

source: Entre las `obras creativas protegidas por derecho de autor <https://www.cultura.gob.es/cultura/areas/propiedadintelectual/mc/rpi/registro-obras/que-registrar.html>`__ se incluyen fotografías, dibujos, películas y vídeos, obras literarias, **trabajos escolares**, esculturas, música, investigaciones científicas, programas de ordenador, entre otras.
ca: Entre els treballs creatius protegits per copyright <https://www.cultura.gob.es/cultura/areas/propied ordinador, entre d’altres.

source: Logotipo de derechos de autor reservados (copyright).
ca: Logotip de copyright reservat (copyright).

source: `Masur <https://es.wikipedia.org/wiki/Archivo:Copyright.svg>`__, dominio público, via Wikimedia Commons.
ca: `Masur <https://es.wikipedia.org/wiki/archivo:copyright.svg>`__, domini públic, a través de Wikimedia Commons.

source: El derecho de autor protege las expresiones creativas, pero no las ideas, hechos, conocimientos o conceptos generales. Por eso, una obra puede tratar sobre un niño que descubre que es mago y asiste a una escuela de magia sin infringir ningún derecho de autor, ya que lo protegido es la novela de Harry Potter, no su estilo ni su idea general.
ca: Els drets d’autor protegeixen les expressions creatives, però no les idees, fets, coneixements o conceptes generals. Per tant, una obra pot tractar amb un nen que descobreix que és un mag i assisteix a una escola de màgia sense violar cap copyright, ja que la protecció és la novel·la de Harry Potter, no el seu estil ni la seva idea general.

source: No todas las creaciones están protegidas por **derecho de autor (copyright)**. Por ejemplo, las **invenciones técnicas** se protegen mediante **patentes**, mientras que los **logotipos y marcas comerciales** cuentan con otras formas de protección legal.
ca: No totes les creacions estan protegides per ** Copyright (copyright) **. Per exemple, les ** invencions tècniques ** estan protegides per ** patents **, mentre que els logotips ** i marques comercials ** tenen altres formes de protecció legal.

source: Todas las obras quedan protegidas por **derechos de autor** desde el momento en que se crean. Aunque no es obligatorio registrarlas, sí es recomendable hacerlo `en el registro de propiedad intelectual <https://www.cultura.gob.es/cultura/areas/propiedadintelectual/mc/rpi/inicio.html>`__ para poder demostrar la autoría.
ca: Totes les obres estan protegides per ** Copyright ** des del moment en què es creen. Tot i que no és obligatori registrar -los, és recomanable fer -ho `al Registre de Propietat Intel·lectual <https://www.cultura.gob.es/cultura/areas/propiedadintelecual/mc/rpi/inicio.html>` __ per poder demostrar la autoria.

source: Tipos de derechos
ca: Tipus de drets

source: Derechos morales.
ca: Drets morals.

source: Estos derechos no se pueden ceder a otros ni se pierden nunca.
ca: Aquests drets no es poden donar a d’altres ni es perden mai.

source: Reconocimiento de quién es el autor de la obra.
ca: Reconeixement de qui és l’autor de l’obra.

source: Oposición a modificaciones de la obra que atenten contra el honor o reputación del autor.
ca: Oposició a modificacions de l’obra que amenaça l’honor o la reputació de l’autor.

source: Derechos económicos.
ca: Drets econòmics.

source: Estos derechos se pueden ceder a través de una licencia.
ca: Aquests drets es poden produir mitjançant una llicència.

source: Reproducción.
ca: Reproducció.

source: Distribución.
ca: Distribució.

source: Traducción a otras lenguas.
ca: Traducció a altres idiomes.

source: Adaptación o modificación de la obra.
ca: Adaptació o modificació del treball.

source: Cesión de derechos
ca: Assignació de drets

source: Un autor puede ceder a otras personas o empresas sus derechos de copia, distribución o exhibición de una obra, por ejemplo a una **editorial**, una **discográfica** o una **red social**. Esto se realiza mediante contratos donde se establecen las condiciones de la cesión.
ca: Un autor pot cedir a altres persones o empreses els seus drets de còpia, distribució o exposició d’una obra, per exemple a una editorial ** **, un registre ** ** o una xarxa social ** **. Això es fa mitjançant contractes on s’estableixen les condicions de la tasca.

source: Al crear una cuenta en una red social, aceptamos un **contrato de cesión** por el cual nuestras fotos, textos o vídeos pueden ser publicados y utilizados por la plataforma, a menudo con muy pocas limitaciones.
ca: Creant un compte en una xarxa social, acceptem un contracte de cessió ** ** pel qual les nostres fotos, textos o vídeos poden ser publicats i utilitzats per la plataforma, sovint amb molt poques limitacions.

source: Existen también contratos estándar llamados **licencias libres**. Estas permiten a un autor conceder permisos a cualquier persona interesada en su obra sin necesidad de pedir autorización directa, favoreciendo la difusión y creación de nuevas obras a partir de las originales.
ca: També hi ha contractes estàndard anomenats ** Llicències gratuïtes **. Aquests permeten a un autor concedir a qualsevol persona interessada en la seva obra sense necessitat de sol·licitar l’autorització directa, afavorint la difusió i la creació de noves obres dels originals.

source: Las licencias **copyleft** son un tipo de licencias libres que el autor puede aplicar a su obra para permitir que otras personas la usen, copien, distribuyan o modifiquen. La condición principal es que cualquier versión modificada o derivada debe mantenerse bajo la **misma licencia copyleft**, garantizando que la obra y sus derivados sigan siendo libres.
ca: Les llicències ** COPYLEFT ** són un tipus de llicències gratuïtes que l’autor pot aplicar a la seva obra per permetre a altres persones utilitzar, copiar, distribuir o modificar. La condició principal és que qualsevol versió modificada o derivada s’ha de mantenir sota la llicència ** Same CopyleFT **, garantint que l’obra i els seus derivats es mantinguin lliures.

source: Logotipo de copyleft (algunos derechos de autor reservados).
ca: Logotip de CopyleFt (algun copyright reservat).

source: `Zscout370 <https://commons.wikimedia.org/wiki/File:Copyleft.svg>`__, dominio público, via Wikimedia Commons.
ca: `ZSCOU370 <https://commons.wikimedia.org/wiki/file:copyleft.svg>`__, domini públic, a través de Wikimedia Commons.

source: Este tipo de licencias fomentan el acceso al conocimiento, su difusión y la creación colaborativa de cultura, lo que explica su gran importancia.
ca: Aquest tipus de llicències fomenten l’accés al coneixement, la difusió i la creació col·laborativa de la cultura, que explica la seva gran importància.

source: Algunos ejemplos de licencias copyleft son la licencia Creative Commons BY-SA y la licencia de software GPL.
ca: Alguns exemples de llicències de CopyleFT són la llicència Creative Commons BY-SA i la llicència de programari GPL.

source: Creative Commons BY-SA
ca: Creative Commons by-s

source: La organización sin ánimo de lucro **Creative Commons** ha creado varias licencias estándar de cesión de derechos para fomentar la cultura libre.
ca: L’organització sense ànim de lucre ** Creative Commons ** ha creat diverses llicències estàndard per a la transferència de drets per promoure la cultura lliure.

source: Una de las licencias más conocidas es la **CC BY-SA (Reconocimiento-Compartir Igual)**, utilizada por **Wikipedia** para difundir sus contenidos. Esta licencia permite copiar, publicar y crear obras derivadas, siempre que se reconozca al **autor original** y que las obras resultantes se publiquen bajo la misma licencia CC BY-SA.
ca: Una de les llicències més conegudes és la ** cc by-sa (component el reconeixement el mateix) **, utilitzat per ** wikipedia ** per difondre el seu contingut. Aquesta llicència us permet copiar, publicar i crear obres derivades, sempre que es reconegui el ** Autor original ** i que les obres resultants es publiquen amb la mateixa llicència CC BY-SA.

source: Logotipo de la licencia Creative Commons Reconocimiento-Compartir igual.
ca: Logotip de la llicència de compartició de reconeixement de Creative Commons.

source: `Creative Commons <https://en.wikipedia.org/wiki/File:CC_BY-SA_icon.svg>`__, `licencia de uso <https://creativecommons.org/policies/>`__.
ca: `Creative Commons <https://en.wikipedia.org/wiki/file:cc_by-sa_icon.svg>`__, `llicència d'ús <https://creativecommons.org/policies/>`__.

source: Un estudiante puede añadir junto a su nombre, en un trabajo escrito, dibujo o póster, la frase:
ca: Un estudiant pot afegir al costat del seu nom, en una obra escrita, dibuix o pòster, la frase:

source: **"Bajo licencia CC BY-SA 4.0"**.
ca: ** \ "sota la llicència cc by-sa 4.0 " **.

source: Estará diciendo a los demás que pueden usar su obra en sus propios trabajos. Solo tienen que mencionar quién es el **autor original** y compartir lo que hagan con la **misma licencia**.
ca: Ell dirà als altres que poden utilitzar la seva obra en les seves pròpies obres. Només han d’esmentar qui és l’autor ** original ** i compartir el que fan amb la ** mateixa llicència **.

source: Licencia GPL
ca: Llicència GPL

source: La **licencia GPL (General Public License)** es una licencia destinada exclusivamente al **software de ordenador**. Por ejemplo, se utiliza en **Linux**, que es el núcleo de los teléfonos **Android**.
ca: La llicència ** GPL (llicència pública general) ** és una llicència destinada exclusivament al programari ** informàtic **. Per exemple, s'utilitza a ** Linux **, que és el nucli dels telèfons ** Android **.

source: Esta licencia permite usar el software libremente, estudiar su funcionamiento, copiarlo y modificarlo. La única condición que impone es que cualquier modificación se publique también como **código abierto** y bajo la misma licencia libre GPL, garantizando que siga siendo libre.
ca: Aquesta llicència permet utilitzar el programari lliurement, estudiar el seu funcionament, copiar -lo i modificar -lo. L’única condició imposada és que qualsevol modificació també es publiqui com a ** Open Source ** i sota la mateixa llicència GPL gratuïta, garantint que es mantingui lliure.

source: Logotipo de la licencia de software GPL versión 3.
ca: Logotip de llicència de programari GPL 3 Versió 3.

source: `Free Software Foundation <https://es.wikipedia.org/wiki/Archivo:GPLv3_Logo.svg>`__, `licencia de uso <https://www.gnu.org/graphics/license-logos.html>`__.
ca: `Free Software Foundation <https://es.wikipedia.org/wiki/archivo:gplv3_gogo.svg>`__, `llicència d'ús <https://www.gnu.org/graphics/license-license-logos.html>`__.

source: La idea principal de la licencia GPL es fomentar la **colaboración y la transparencia**. Esta licencia garantiza que el software siga siendo libre, incluso cuando otras personas lo modifican o mejoran.
ca: La idea principal de la llicència GPL és promoure ** col·laboració i transparència **. Aquesta llicència garanteix que el programari es manté gratuït, fins i tot quan altres persones la modifiquen o la milloren.

source: Dominio público
ca: Domini públic

source: Cuando han pasado muchos años desde la muerte del autor (por lo general 70), sus obras se vuelven de **dominio público**. Esto quiere decir que cualquier persona puede copiarla, modificarla, publicarla o usarla libremente sin pedir permiso.
ca: Quan han passat molts anys des de la mort de l’autor (en general 70), les seves obres es converteixen en ** domini públic **. Això significa que qualsevol pot copiar -lo, modificar -lo, publicar -lo o utilitzar -lo lliurement sense demanar permís.

source: Logotipo de dominio público (sin derechos de autor).
ca: Logotip de domini públic (sense drets d'autor).

source: `Waldir <https://commons.wikimedia.org/wiki/File:PD-icon-black.svg>`__, dominio público, via Wikimedia Commons.
ca: `Waldir <https://commons.wikimedia.org/wiki/file:pd-icon-black.svg>`__, domini públic, a través de Wikimedia Commons.

source: El autor también puede decidir regalar su obra al dominio público **en cualquier momento**, para que todos puedan usarla libremente sin pedir permiso.
ca: L’autor també pot decidir donar la seva obra al domini públic ** en qualsevol moment **, de manera que tothom pugui utilitzar -lo lliurement sense demanar permís.

source: Ejercicios
ca: Exercicis

source: ¿Qué es el derecho de autor o **copyright**? ¿Alguna vez has creado una obra que tenga derecho de autor? Explica brevemente.
ca: Què és el copyright o ** copyright **? Heu creat alguna vegada una obra que tingui l’autor? Expliqueu breument.

source: ¿Qué derechos tiene un **autor** sobre su obra solo por crearla?
ca: Quins drets té un ** autor ** sobre la seva obra només per crear -lo?

source: ¿Desde cuándo una obra está protegida por derechos de autor?
ca: Des de quan es protegeix una obra per copyright?

source: ¿Qué diferencia hay entre derechos de autor y una patente?
ca: Quina diferència hi ha entre drets d’autor i patent?

source: ¿Qué obras están protegidas por derechos de autor? Escribe 5 ejemplos.
ca: Quines obres estan protegides per copyright? Escriviu 5 exemples.

source: Nombra tres ideas, hechos o conceptos que **no** estén protegidos por derechos de autor.
ca: Anomeneu tres idees, fets o conceptes que ** no ** estan protegits pels drets d’autor.

source: ¿Qué significa ceder los derechos de una obra a una **red social**?
ca: Què significa donar els drets d’una obra a una xarxa social ** **?

source: Escribe dos tipos de obras que no estén protegidas por los derechos de autor. Da un ejemplo de cada una.
ca: Escriviu dos tipus d’obres que no estan protegides pels drets d’autor. Estableix un exemple de cadascun.

source: Escribe con tus palabras qué es copyleft.
ca: Escriviu amb les vostres paraules què és CopyleFt.

source: Escribe dos ejemplos de licencias copyleft.
ca: Escriviu dos exemples de llicències de CopyleFT.

source: ¿Por qué crees que las licencias de **Creative Commons** fomentan la difusión y creación cultural? Escribe un ejemplo práctico de su uso.
ca: Per què creieu que les llicències ** Creative Commons ** fomenten la difusió i la creació culturals? Escriviu un exemple pràctic del seu ús.

source: ¿Para qué sirve una licencia **GPL**? Escribe un ejemplo que utilice esta licencia.
ca: Què és una llicència ** GPL **? Escriviu un exemple per utilitzar aquesta llicència.

source: ¿Qué significa que una obra esté en **dominio público**?
ca: Què vol dir que una obra es troba en domini públic ** **?

source: Da un ejemplo de una **obra clásica** que sea de dominio público.
ca: Dóna un exemple de treball clàssic ** ** que es troba en el domini públic.

source: ¿Cuándo pasa una obra a dominio público?
ca: Quan passa un domini públic?

source: Dibuja los **logotipos** de copyright, copyleft y dominio público.
ca: Dibuixa els logotips ** ** de copyright, copyleft i domini públic.

source: Investiga qué es el convenio de Berna para la protección de obras y redacta a mano un breve trabajo de una hoja por las dos caras.
ca: Investigueu quin és l’acord de Berna per a la protecció d’obres i escrit a mà un breu treball de full a banda i banda.

source: Documento en formato DIN A4 con la unidad y los ejercicios:
ca: Format DIN A4 amb unitat i exercicis:

source: :download:`El derecho de autor. Formato PDF. <recursos/copyright/copyright.pdf>`
ca: : Descarregueu: `Copyright. Format PDF. <Recursos/copyright/copyright.pdf> `

source: :download:`El derecho de autor. Formato DOC. <recursos/copyright/copyright.doc>`
ca: : Descarregueu: `Copyright. Format DOC. <Recursos/Copyright/Copyright.doc>`

source: Enlaces para ampliar conocimientos:
ca: Enllaços per ampliar el coneixement:

source: `Guía práctica de licencias de uso para docentes <https://descargas.intef.es/cedec/proyectoedia/guias/contenidos/guiadelicencias/>`__.
ca: `Guia pràctica per a llicències útils per a professors <https://descargas.intef.es/cedec/proytoedia/guias/contenidos/guiadelizencias/>` __.

source: `Derechos de autor y licencias <https://formacion.intef.es/aulaenabierto/mod/book/tool/print/index.php?id=4360>`__.
ca: `Copyright i llicències <https://formacion.intef.es/aulaenabierto/mod/book/tool/print/index.php?id=4360>` __.

source: `Copyright en Wikipedia <https://es.wikipedia.org/wiki/Copyright>`__
ca: `Copyright on Wikipedia <https://es.wikipedia.org/wiki/copyright>` `` `
