Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/recursos-evaluacion-asignatura.po
Languages: ca

source: Evaluación de la asignatura
ca: Avaluació del tema

source: Cuestionario anónimo para evaluar las asignaturas de Tecnología.
ca: Qüestionari anònim per avaluar els temes de tecnologia.

source: El cuestionario tiene 6 posibles respuestas (del 0 al 5) de manera que no hay valor central, equivalente al 5 sobre 10. Esto obliga al alumno/a a decantarse hacia un valor mayor o menor de 5.
ca: El qüestionari té 6 respostes possibles (de 0 a 5) de manera que no hi ha cap valor central, equivalent a 5 de cada 10. Això obliga l'estudiant a optar per un valor superior o inferior a 5.

source: Todas las frases están escritas de forma afirmativa para no crear confusiones a la hora de puntuar cada item. Cada item deberá puntuarse según se esté de acuerdo con la frase, de manera que un valor 0 significa nada de acuerdo y un valor 5 significa completamente de acuerdo con la frase.
ca: Totes les frases s’escriuen afirmativament per no crear confusió en puntuar cada element. Cada element s’ha de perforar segons la frase, de manera que un valor 0 significa qualsevol cosa d’acord i un valor 5 significa completament la frase.

source: El cuestionario es anónimo para que no reste sinceridad a la hora de responder. Una vez recogidos los cuestionarios se puede añadir un número consecutivo a cada hoja para facilitar la tarea de pasar los resultados a la hoja de cálculo que evalúa los resultados.
ca: El qüestionari és anònim de manera que no resti la sinceritat en respondre. Un cop recollits els qüestionaris, es pot afegir un nombre consecutiu a cada full per facilitar la tasca de passar els resultats al full de càlcul que avalua els resultats.

source: Las preguntas de la primera cara del cuestionario pueden dar ideas de mejora para responder las preguntas abiertas de la segunda cara.
ca: Les preguntes de la primera cara del qüestionari poden donar idees de millora per respondre a les preguntes obertes de la segona cara.

source: :download:`Cuestionario de evaluación de la asignatura. Formato PDF. <didactica/evaluacion-asignatura-v11.pdf>`
ca: : Descarregueu: `Qüestionari per avaluar el tema. Format PDF. <DidActica/Avaluation-Assature-V11.pdf> '

source: :download:`Cuestionario de evaluación de la asignatura. Formato editable ODS. <didactica/evaluacion-asignatura-v11.ods>`
ca: : Descarregueu: `Qüestionari per avaluar el tema. Format editable ODS. <DidActica/Avaluation-Seasture-V11.ods> '

source: :download:`Cuestionario de evaluación de la asignatura. Formato de encuesta para Moodle XML. <didactica/evaluacion-asignatura-preguntas-v11.xml>`
ca: : Descarregueu: `Qüestionari per avaluar el tema. Format de l'enquesta per a XML Moodle. <Didactica/avaluació-fogurs-preguntes-v11.xml> '

source: :download:`Hoja de cálculo para la recogida de resultados. Formato ODS. <didactica/evaluacion-asignatura-resultados-v11.ods>`
ca: : Descarregueu: `Full de càlcul per a la col·lecció de resultats. Format ODS. <Didactica/avaluació-asdature-results-v11.ods> '
