Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/robotica-recursos.po
Languages: ca

source: Recursos para Robótica
ca: Recursos per a la robòtica

source: Recursos para Robótica y Programación en el marco del programa Código Escuela 4.0.
ca: Recursos per a la robòtica i la programació en el marc del programa Codi de l'escola 4.0.

source: Índice de contenidos:
ca: Índex de contingut:

source: Kit de bienvenida del Intef
ca: Kit de benvinguda a l’Intef

source: `Kit de bienvenida del Intef al programa Código Escuela 4.0 (PDF). <https://code.intef.es/wp-content/uploads/2023/11/NUEVO13_23_ProyInt_R3_kit_CE4.0_Maquetaci%C3%B3n.pdf>`__
ca: `INTEF Kit Welcome Kit al programa Codi de l'Escola 4.0 (PDF). <https://code.ininf.es/wp-content/uploads/2023/11/nuevo13_23_proyint_r3_kit_ce4.0_maquetci%C3%B3n.pdf> `` `

source: Recursos de programación y robótica
ca: Recursos de programació i robòtica

source: :ref:`Actividades desconectadas (Unplugged). <prog-unplugged>`
ca: : Ref: `Activitats desconnectades (desconnectades). <Prog-Unplugged> '

source: :ref:`Tutoriales de Code.org. <prog-code-org>`
ca: : Ref: `Tutorials Code.org. <Prog-Code-Org> '

source: `Lobo TIC. Cosas de programación y robótica. <http://www.lobotic.es/>`__
ca: `Wolf TIC. Programació i robòtica. <http://www.lobotic.es/>`__

source: `Programamos. Videojuegos y Apps <https://programamos.es/>`__
ca: `Programem. Videojocs i aplicacions <https://programmos.es/>`__

source: `Programamos. IA en la educación. <https://programamos.es/ia>`__
ca: `Programem. En educació. <https://programmos.es/ia>`__

source: Recursos para la placa Micro Bit
ca: Recursos per a la placa de micro -bit

source: `Placa micro:bit en Wikipedia. <https://es.wikipedia.org/wiki/Micro_Bit>`__
ca: `Micro Plate: Bit a Wikipedia. <https://es.wikipedia.org/wiki/micro_bit>`__

source: `Micro:bit. Resumen de la placa. <https://www.microbit.org/es-es/get-started/features/overview/>`__
ca: `Micro: bit. Resum de la placa. <https://www.microbit.org/es-es/get-started/features/overview/> `` `` `

source: `Micro:bit. Projects. <https://www.microbit.org/projects/make-it-code-it/>`__
ca: `Micro: bit. Projectes <https://www.microbit.org/projects/make-it-code-it/> `__

source: `Micro:bit. Lessons. <https://www.microbit.org/teach/lessons>`__
ca: `Micro: bit. Lliçons <https://www.microbit.org/teach/ssons>`__

source: `Micro:bit. Classroom resources. <https://www.microbit.org/teach/classroom-resources/>`__
ca: `Micro: bit. Recursos a l’aula. <https://www.microbit.org/teach/classroom-resources/>`__

source: Curso de robótica para 1ºESO de la Junta de Andalucía con la placa micro:bit en 7 sencillas lecciones y con licencia CC BY-NC-SA 4.0.
ca: Curs de robòtica per a la 1a Junta de Andalucía amb la Micro Plate: Bit en 7 lliçons simples i amb llicència CC BY-C-SA 4.0.

source: `Nuestra placa robótica se comunica con el mundo. <https://edea.juntadeandalucia.es/bancorecursos/file/0d1266b3-f173-4ae8-aada-2fbffea186de/1/nuestra_placa_robotica_se_comunica_con_el_mundo.zip/index.html>`__
ca: `La nostra placa robòtica es comunica amb el món. <https: /eedea.junteandalucia.es/bancorecities/file/0d1266b3-f173-4ae8-aada-2fbffea186de/1/nuestra_plapla_botica_se_comunica_con_el_mundo.zip/index.html> `` __

source: `Microsoft Makecode for micro:bit <https://makecode.microbit.org/>`__
ca: `Microsoft Makecode per a micro: bit <https://makecode.microbit.org/>`__

source: Encuentro sobre educación en robótica
ca: Reunió sobre l'educació de la robòtica

source: V Encuentro EDUCACIÓN 3.0 'Robótica y programación en el aula: todas las claves'. Con la participación de editorial Edelvives, BQ Educación, y profesores de la materia.
ca: V Educació 3.0 'Robòtica i programació a l'aula: totes les claus'. Amb la participació de l’editorial d’Edvisvés, l’educació BQ i els professors del tema.

source: Vídeo: `V Encuentro EDUCACIÓN 3.0 <https://www.youtube-nocookie.com/embed/fnMC1I7tCqA>`__
ca: Vídeo: `V Educació Educació 3.0 <https://www.youtube-nocoakie.com/embed/fnmc1i7tcqa>`__

source: Web Código Escuela 4.0 de la Comunidad de Madrid
ca: Codi de l'escola web 4.0 de la comunitat de Madrid

source: `Página principal de la web Código Escuela 4.0 Madrid. <https://www.educa2.madrid.org/web/centro.codigo-escuela-4.0/>`__
ca: `Pàgina principal del codi web 4.0 Madrid. <https://www.educa2.madrid.org/web/centro.codigo-escuela-4.0/> `` ``

source: `Normativa. <https://www.educa2.madrid.org/web/centro.codigo-escuela-4.0/normativa>`__
ca: `` Reglament. <https://www.educa2.madrid.org/web/centro.codigo-escuela-4.0/normativa>`__

source: `Orientaciones Metodológicas. <https://mediateca.educa.madrid.org/documentos/puask6s4fzo723x9/fs>`__
ca: `Orientacions metodològiques. <https://mediateca.educ.madrid.org/documentos/puask6s4fzo723x9/fs>`__

source: `Banco de Recursos para Educación Infantil. <https://www.educa2.madrid.org/web/centro.codigo-escuela-4.0/a.desenchufadas>`__
ca: `Banc de recursos per a l'educació infantil. <https://www.educa2.madrid.org/web/centro.codigo-escuela-4.0/a.desencufadas> `__

source: `Banco de Recursos para Educación Primaria. <https://www.educa2.madrid.org/web/centro.codigo-escuela-4.0/educacion-primaria>`__
ca: `Banc de recursos per a l'educació primària. <https://www.educa2.madrid.org/web/centro.codigo-escuela-4.0/educacion-primaria>`__

source: `Banco de Recursos para Educación Secundaria. <https://www.educa2.madrid.org/web/centro.codigo-escuela-4.0/educacion-secundaria>`__
ca: `Banc de recursos per a l'educació secundària. <https://www.educa2.madrid.org/web/centro.codigo-escuela-4.0/educacion-secundaria>`__
