Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/robotica-normativa.po
Languages: ca

source: Normativa Código Escuela 4.0
ca: Codi de l'escola 4.0

source: Normativa estatal y autonómica del programa Código Escuela 4.0.
ca: Reglament estatal i regional del programa Codi de l'escola 4.0.

source: Índice de contenidos:
ca: Índex de contingut:

source: Normativa Estatal
ca: Normes estatals

source: `Resolución de 5 de julio de 2023 <https://www.boe.es/boe/dias/2023/07/18/pdfs/BOE-A-2023-16620.pdf>`__
ca: `Resolució del 5 de juliol de 2023 <https://www.boe.es/boe/dias/2023/07/18/pdfs/boe-a-2023-16620.pdf>` `` `` `` `` `` `` `

source: Acuerdo de la Conferencia Sectorial de Educación de 7 de junio de 2023, por el que se aprueba la propuesta de distribución territorial y los criterios de reparto de los créditos gestionados por comunidades autónomas destinados al Programa Código Escuela 4.0, en el ejercicio presupuestario 2023.
ca: Acord de la Conferència d’Educació Sectorial del 7 de juny de 2023, que aprova la proposta de distribució territorial i els criteris per a la distribució de crèdits gestionats per les comunitats autònomes del Codi de l’escola del programa 4.0, a l’exercici pressupostari 2023.

source: `Resolución de 19 de diciembre de 2023 <https://www.boe.es/boe/dias/2023/12/26/pdfs/BOE-A-2023-26314.pdf>`__
ca: `Resolució del 19 de desembre de 2023 <https://www.boe.es/boe/dias/2023/12/26/pdfs/boe-a-2023-26314.pdf>`__ __

source: Acuerdo de la Conferencia Sectorial de Educación de 13 de diciembre de 2023, por el que se aprueba la propuesta de distribución territorial y los criterios de reparto de los créditos gestionados por Comunidades Autónomas destinados al Programa Código Escuela 4.0, en el ejercicio presupuestario 2023.
ca: Acord de la Conferència d’Educació Sectorial del 13 de desembre de 2023, que aprova la proposta de distribució territorial i els criteris de distribució de crèdits gestionats per comunitats autònomes per a l’Escola de Codi del programa 4.0, a l’exercici pressupostari 2023.

source: Normativa de Madrid
ca: Reglament de Madrid

source: `Circular sobre la implantación del programa Código Escuela 4.0 en Infantil y Primaria. <../_static/document/circular_ce40_madrid_primaria.pdf>`__
ca: `Circular sobre la implementació del programa Codi de l'escola 4.0 a la infància i a la primària. <../_ static/document/circular_ce40_madrid_primaria.pdf>`__

source: `Circular sobre la implantación del programa Código Escuela 4.0 en Secundaria. <../_static/document/circular_ce40_madrid_secundaria.pdf>`__
ca: `Circular sobre la implementació del programa de l'escola 4.0 a l'escola secundària. <../_ static/document/circular_ce40_madrid_secundaria.pdf>`__

source: `Licitación para el suministro de material y formación de Robótica. <https://contratos-publicos.comunidad.madrid/contrato-publico/suministro-equipamientos-necesarios-integracion-implantacion-desarrollo-contenidos>`__
ca: `Oferta per al subministrament de formació de material i robòtica. <https://contratos-publicos.comunidad.madrid/contrato-public

source: `Pliego de prescripciones técnicas de la licitación. <https://contratos-publicos.comunidad.madrid/medias/03pliegodeprescripcionestecnicas20240430anonimizadopdf/download>`__
ca: `Prescripcions tècniques de la licitació. <https://contratos-publicos.comunidad.madrid/medias/03pliegodePrescripctionscnicas20240430AniMedPdf/download> `` `` `` `` `` `` `` ``
