Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/robotica-robots-actuales.po
Languages: ca

source: Robots actuales
ca: Robots actuals

source: La robótica es un campo muy amplio que incluye áreas tan variadas como los brazos industriales, automóviles autónomos, drones, robots médicos o robots humanoides (androides).
ca: La robòtica és un camp molt ampli que inclou zones tan variades com els braços industrials, els cotxes autònoms, els drons, els robots mèdics o els robots humanoides (Androids).

source: En esta página vamos a ver algunos ejemplos de robots que ya están en funcionando en los laboratorios, en los hospitales y por nuestras calles.
ca: En aquesta pàgina veurem alguns exemples de robots que ja treballen en laboratoris, als hospitals i als nostres carrers.

source: Robot Unitree
ca: Unitree Robot

source: Robots de Unitree Robotics, empresa china fundada en 2016.
ca: Unitree Robotics Robots, companyia xinesa fundada el 2016.

source: Vídeo: febrero de 2025. `What Dance Would You Like to Perform with Unitree G1? <https://www.youtube-nocookie.com/embed/p0xFou30hWI>`__
ca: Vídeo: febrer de 2025. <Https://www.youtube-nocokie.com/embed/p0xfou30hwi> `__

source: Vídeo: diciembre de 2024. `Unitree B2-W Talent Awakening! <https://www.youtube-nocookie.com/embed/X2UxtKLZnNo>`__
ca: Vídeo: desembre de 2024. <https://www.youtube-nocoakie.com/embed/x2uxtklznno>`__

source: Atlas es un androide desarrollado por Boston Dynamics (propiedad de Google) para el departamento de investigación del ejército de Estados Unidos (DARPA).
ca: Atlas és un Android desenvolupat per Boston Dynamics (propietat de Google) per al Departament de Recerca de l'Exèrcit dels Estats Units (DARPA).

source: Se ha hecho famoso por los vídeos Deep Fakes que han aparecido mostrándole como un robot armado y descontrolado. Aquí solo vamos a ver los vídeos de su funcionamiento real, cada vez más avanzado.
ca: S'ha fet famós pels vídeos de Deep Fakes que han aparegut mostrant -lo com un robot armat i descontrolat. Aquí només veurem els vídeos del seu funcionament real, cada cop més avançats.

source: Vídeo: marzo 2025. `Walk, Run, Crawl, RL Fun | Atlas Electric <https://www.youtube-nocookie.com/embed/I44_zbEwz_w>`__
ca: Vídeo: març de 2025. `Walk, Run, Crawl, RL Fun | Atlas Electric <https://www.youtube-nocoakie.com/embed/i44_zbewz_w> `` `

source: Vídeo: abril de 2024. `All New Atlas Electric. <https://www.youtube-nocookie.com/embed/29ECwExc-_M>`__
ca: Vídeo: abril de 2024. `Tots els nous Atlas Electric. <https://www.youtube-nocokie.com/embed/29ecwexc-_m>`__

source: Vídeo: enero de 2023. `Atlas | Atlas Gets a Grip. <https://www.youtube-nocookie.com/embed/-e1_QhJ1EhQ>`__
ca: Vídeo: gener de 2023. `Atlas | Atlas Gep A Grow. <https://www.youtube-nocoakie.com/embed/-e1_qhj1ehq>`__

source: Vídeo: agosto de 2021. `Atlas | Partners in Parkour. <https://www.youtube-nocookie.com/embed/tF4DML7FIWk>`__
ca: Vídeo: agost de 2021. `Atlas | Partners a Parkour. <https://www.youtube-nocoakie.com/embed/tf4dml7fiwk>`__

source: Vídeo: diciembre de 2020. `Do You Love Me? <https://www.youtube-nocookie.com/embed/fn3KWM1kuAw>`__
ca: Vídeo: desembre de 2020. "M'estimes? <https://www.youtube-nocokie.com/embed/fn3kwm1kuaw>`__

source: Vídeo: septiembre de 2019. `More Parkour Atlas. <https://www.youtube-nocookie.com/embed/_sBBaNYex3E>`__
ca: Vídeo: setembre de 2019. `Més Parkour Atlas. <https://www.youtube-nocokie.com/embed/_sbbanyex3e>`__

source: Vídeo: octubre de 2018. `Parkour Atlas. <https://www.youtube-nocookie.com/embed/LikxFZZO2sk>`__
ca: Vídeo: octubre de 2018. `Parkour Atlas. <https://www.youtube-nocokie.com/embed/likxfzzo2sk>`__

source: Vídeo: noviembre de 2017. `What's new, Atlas? <https://www.youtube-nocookie.com/embed/fRj34o4hN4I>`__
ca: Vídeo: novembre de 2017. "Què hi ha de nou, Atlas? <https://www.youtube-nocookie.com/embed/frj34o4hn4i>`__

source: Tesla es una compañía de alta tecnología que está revolucionando el sector de la automoción fabricando y vendiendo automóviles autónomos.
ca: Tesla és una empresa d’alta tecnologia que està revolucionant la fabricació del sector de l’automoció i venda de cotxes autònoms.

source: En este caso vamos a ver una demostración de noviembre de 2016 con un Tesla model X en la que se pueden observar los cálculos internos del automóvil mientras conduce de forma autónoma por la carretera.
ca: En aquest cas, veurem una demostració de novembre de 2016 amb un model X Tesla en què es poden observar els càlculs interns del cotxe mentre conduïen de forma autònoma per la carretera.

source: Vídeo: `autopilot Full Self Driving Demonstration Nov 2016. <https://www.youtube-nocookie.com/embed/VG68SKoG7vE>`__
ca: VÍDEO: `Demostració de conducció automàtica automàtica Autopilot Nov 2016.

source: Este es un robot guiado, no es autónomo, que permite realizar cirugía a través de pequeños agujeros, llamada cirugía laparoscópica.
ca: Es tracta d’un robot guiat, no és autònom, que permet la cirurgia a través de petits forats, anomenat cirurgia laparoscòpica.

source: Vídeo: `el robot cirujano Da Vinci cosiendo una uva dentro de una botella. <https://www.youtube-nocookie.com/embed/rXXybevSa0o>`__
ca: Vídeo: `El robot cirurgià da vinci cosint un raïm dins d'una ampolla. <https://www.youtube-nocokie.com/embed/rxxybevsa0o>`__

source: Vídeo: `así funciona el robot Da Vinci - El Hormiguero. <https://www.youtube-nocookie.com/embed/ZYJaf25ZEAo>`__
ca: Vídeo: `Així funciona el robot da vinci - El Hormiguero. <https://www.youtube-nocokie.com/embed/zyjaf25zeao>`__

source: Google Assistant
ca: Assistent de Google

source: Este es uno de los campos donde más se está desarrollando la inteligencia artificial. Los asistentes virtuales como Google Assistant no son robots con partes móviles pero prometen ayudarnos en muchas tareas cotidianas.
ca: Aquest és un dels camps on la intel·ligència artificial es desenvolupa més. Els assistents virtuals com Google Assistant no són robots amb parts mòbils, sinó que prometen ajudar -nos en moltes tasques diàries.

source: Vídeo: `Google Duplex: A.I. Assistant Calls Local Businesses To Make Appointments. <https://www.youtube-nocookie.com/embed/D5VN56jQMWM>`__
ca: Vídeo: `Google Duplex: A.I. L’assistent truca a les empreses locals per fer aplicacions. <https://www.youtube-nocokie.com/embed/d5vn56jqmwm>`__

source: Vídeo: `next Generation Google Assistant Demo - Google I/O 2019 <https://www.youtube-nocookie.com/embed/GILvyiWB7xY>`__
ca: VÍDEO: `Demostració de Google Assistant de la propera generació - Google E/S

source: Robots industriales
ca: Robots industrials

source: La primera aplicación de los robots fue la fabricación industrial. En este apartado vamos a ver varios ejemplos de robots industriales en su entorno de trabajo.
ca: La primera aplicació de robots va ser la fabricació industrial. En aquesta secció veurem diversos exemples de robots industrials en el seu entorn laboral.

source: Vídeo: `ROBOTICA INDUSTRIAL | Curso de Automatización Industrial #2. <https://www.youtube-nocookie.com/embed/eR3JTR5nCjo>`__
ca: Vídeo: `Robòtica industrial | Curs d’automatització industrial #2. <https://www.youtube-nocokie.com/embed/er3jtr5ncjo>`__
