Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/scratch-flor.po
Languages: ca

source: Dibujar una flor
ca: Dibuixa una flor

source: En esta práctica vamos a programar una serie de funciones que dibujen varios tipos de flores en pantalla.
ca: En aquesta pràctica programarem una sèrie de funcions que atrauen diversos tipus de flors a la pantalla.

source: Iniciamos el |editor_de_Scratch|.
ca: Comencem el | Editor_de_scratch |.

source: Creamos una nueva función llamada **Inicio**.
ca: Creem una nova funció anomenada ** casa **.

source: Primero pulsamos en el botón más bloques
ca: Primer fem clic al botó més blocs

source: |mas-bloques|
ca: ; Mas-Blques |

source: A continuación pulsamos en crear un bloque |crear-bloque|
ca: A continuació, feu clic a Creació d’un bloc | Create-Bocate |

source: Luego cambiamos el nombre del nuevo bloque a **Inicio**
ca: A continuació, canviem el nom del nou bloc a ** start **

source: Por último pulsamos el botón **OK**
ca: Finalment, premeu el botó ** ok **

source: Programamos la función Inicio con los siguientes bloques.
ca: Programem l’inici amb els blocs següents.

source: Este programa coloca al gato en el centro de la pantalla, prepara el lápiz y borra cualquier dibujo anterior.
ca: Aquest programa col·loca el gat al centre de la pantalla, prepara el llapis i esborra qualsevol dibuix anterior.

source: Crearemos una nueva función llamada **Punto**.
ca: Crearem una nova funció anomenada ** punt **.

source: Luego cambiamos el nombre del nuevo bloque a **Punto**
ca: A continuació, canviem el nom del nou bloc a ** punt **

source: Ahora añadiremos la variable **Radio**.
ca: Ara afegirem la variable ** ràdio **.

source: Dentro de opciones, añadimos una entrada numérica
ca: A les opcions, afegim una entrada numèrica

source: |entrada-numerica|
ca: ; Entrada-numèrica |

source: A la nueva entrada la llamaremos **Radio**
ca: Anomenarem la nova entrada ** Ràdio **

source: Ahora programaremos la función que dibuja un punto en la pantalla (bajar lápiz y subir lápiz).
ca: Ara programarem la funció que dibuixa un punt a la pantalla (llapis inferior i pujada del bolígraf).

source: Este programa dibujará un punto de un tamaño que dependerá de la variable radio. Si el radio es muy grande, el punto será muy grande y si el valor de radio es pequeño, el punto dibujado será pequeño.
ca: Aquest programa traurà un punt de mida que dependrà de la variable de ràdio. Si el radi és molt gran, el punt serà molt gran i si el valor de la ràdio és petit, el punt dibuixat serà petit.

source: A continuación crearemos un pequeño programa de prueba para comprobar que se dibuja el punto en la pantalla.
ca: A continuació, crearem un petit programa de prova per comprovar que el punt es dibuixa a la pantalla.

source: Al ejecutar el programa, pulsando la bandera verde |bandera-verde|, aparecerá en la pantalla el siguiente dibujo.
ca: En executar el programa, prement la bandera verda | Flag-Verde |, apareixerà el següent dibuix a la pantalla.

source: El gato ha dibujado un punto de tamaño 50 a una distancia de 100 pasos
ca: El gat ha dibuixat un punt de 50 a una distància de 100 passos

source: Una vez que todo funcione bien, borraremos el programa de prueba.
ca: Una vegada que tot funcioni bé, esborrarem el programa de proves.

source: Ahora que podemos dibujar puntos, vamos a programar el dibujo de una flor.
ca: Ara que podem dibuixar punts, programarem el dibuix d’una flor.

source: Primero crearemos una nueva función llamada **Flor**.
ca: Primer crearem una nova funció anomenada ** Flor **.

source: Luego cambiamos el nombre del nuevo bloque a **Flor**
ca: A continuació, canviem el nom del nou bloc A ** Flor **

source: Ahora añadiremos la variable **Tamaño**.
ca: Ara afegirem la variable ** mida **.

source: A la nueva entrada la llamaremos **Tamaño**
ca: Anomenarem la nova entrada ** mida **

source: A continuación programaremos la función que dibujará una flor en la pantalla.
ca: A continuació, programarem la funció que una flor dibuixarà a la pantalla.

source: Para probar que la función está bien escrita, vamos a crear un pequeño programa de prueba que dibuje la flor en pantalla.
ca: Per demostrar que la funció està ben escrita, crearem un petit programa de proves que dibuixi la flor a la pantalla.

source: Después de pulsar la bandera verde |bandera-verde|, en la pantalla aparecerá una flor hecha con puntos de colores alrededor del gato como muestra la siguiente imagen.
ca: Després de prémer la bandera verda | Flag-Verde |, a la pantalla una flor feta amb punts de colors al voltant del gat apareixerà com es mostra la imatge següent.

source: Por último vamos a jugar con la función flor para que aparezcan en pantalla dibujos formados por flores de diferentes tamaños.
ca: Finalment, jugarem amb la funció Flower per aparèixer als dibuixos de la pantalla formats per flors de diferents mides.

source: El programa anterior dibuja en pantalla una imagen formada por varios anillos de colores alrededor del gato.
ca: El programa anterior dibuixa una imatge formada per diversos anells de colors al voltant del gat.

source: Pulsaremos en la bandera verde |bandera-verde| para ver el resultado.
ca: Premeu a la bandera verda | Flag-Verde | Per veure el resultat.

source: Con el siguiente programa, se dibujarán en distintos puntos de la pantalla varias flores. Al final el gato estará en medio de todas.
ca: Amb el programa següent, es dibuixaran diverses flors en diferents punts de la pantalla. Al final, el gat estarà al mig.

source: Ejercicios
ca: Exercicis

source: Modifica el programa para que todos los puntos de la función flor tengan el mismo color. Dibuja una flor compuesta por anillos grandes rojos en la parte exterior y anillos pequeños y verdes en la parte interior.
ca: Modifiqueu el programa de manera que tots els punts de la funció de la flor tinguin el mateix color. Dibuixa una flor composta per anells vermells grans a l’exterior i anells petits i verds a l’interior.

source: Realiza un programa que dibuje cinco anillos situados como el logotipo de los juegos olímpicos.
ca: Feu un programa que dibuixi cinc anells situats com a logotip dels Jocs Olímpics.
