Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/scratch3-volar-personaje.po
Languages: ca

source: Volar con un gato
ca: Gat

source: En esta práctica vamos a programar un gato que volará sobre un escenario de edificios que se mueven en el fondo.
ca: En aquesta pràctica programarem un gat que volarà en un etapa d’edificis que es moguin en segon pla.

source: Iniciamos el |editor_de_Scratch|.
ca: Comencem el | Editor_de_scratch |.

source: Pulsamos el botón idioma |boton-idioma| en la barra superior y elegimos **Español**.
ca: Premeu el botó d'idioma | Botó-Idioma | A la barra superior i va triar ** espanyol **.

source: Pulsamos el botón de tutoriales |boton-tutoriales| y luego el botón de animación |boton-animacion|.
ca: Premeu el botó tutorial | Botons-Tutorials | I després el botó d’animació | Botó-animació |.

source: Seleccionamos el tutorial "Hazlo volar" y lo visualizamos para aprender el funcionamiento básico del programa.
ca: Seleccionem el tutorial \ "Do it Fly " i el visualitzem per aprendre el funcionament bàsic del programa.

source: Una vez terminado el tutorial vamos a crear un programa en el que aparezca un gato volador entre edificios.
ca: Un cop finalitzat el tutorial, crearem un programa en el qual apareix un gat volador entre edificis.

source: Borramos el objeto gato presionando sobre el icono del cubo de basura.
ca: Eliminem l'objecte CAT prement a la icona del cub d'escombraries.

source: |borrar-gato|
ca: ; Suprimeix-Gato |

source: Añadimos un nuevo objeto, un **gato volador**.
ca: Afegim un objecte nou, un ** Cat Flying **.

source: Pulsamos el botón elige un objeto |seleccionar-objeto|.
ca: Premeu el botó Trieu un objecte | Select-objecte |.

source: Buscamos en la sección **Animales**.
ca: Mirem a la secció ** Animals **.

source: y seleccionamos el objeto **Cat Flying**.
ca: i seleccionem l'objecte ** Cat volant **.

source: Ahora vamos a programar la posición inicial del gato. Movemos al gato a la posición deseada y desde la sección movimiento |boton-movimiento| añadimos la instrucción ir a |instruccion-iraxy|.
ca: Ara programem la posició inicial del gat. Mouen el gat a la posició desitjada i des de la secció de moviment | Botó-Movimiento | Afegim la instrucció a | Instrucció-Heephexy |.

source: Por último en la sección apariencia |boton-apariencia| añadimos la instrucción ir a capa delantera. Con esta instrucción nos aseguramos de que el gato volador se pueda ver delante de los edificios y que estos no le tapen.
ca: Finalment a la secció d’aparença | Aparició de les ampolles | Afegim la instrucció Go a la capa frontal. Amb aquesta instrucció ens assegurem que el gat volador es pugui veure davant dels edificis i que no la cobreixin.

source: Añadimos movimiento al gato para que se desplace arriba y abajo con las teclas de flecha. El programa debe preguntarse si hemos apretado la tecla arriba para mover el gato hacia arriba, igualmente hacia abajo.
ca: Afegim moviment al gat per moure’s cap amunt i avall amb les tecles de fletxa. El programa hauria de preguntar -nos si hem espremit la clau superior per moure el gat cap amunt, també cap avall.

source: Pulsamos la bandera verde |bandera-verde| para probar el funcionamiento del programa.
ca: Premeu la bandera verda | Flag-Verde | Per provar el funcionament del programa.

source: El gato se moverá arriba y abajo con las teclas de flecha arriba y flecha abajo.
ca: El gat es desplaçarà amunt i avall amb les tecles de fletxa amunt i avall.

source: Ahora Añadimos un nuevo objeto, un **edificio**.
ca: Ara afegim un objecte nou, un ** edifici **.

source: Buscamos en la sección **Todos**.
ca: Estem buscant a la secció ** tot **.

source: y seleccionamos el objeto **Buildings**.
ca: i seleccionem l'objecte ** edificis **.

source: Ahora realizaremos el programa del edificio.
ca: Ara farem el programa d’edificació.

source: Se crearán varios clones para que aparezcan varios edificios a la vez moviéndose hacia la izquierda.
ca: Es crearan diversos clons perquè diversos edificis apareguin alhora que es traslladin a l'esquerra.

source: Cada clon de los edificios elige un disfraz diferente, se mueve a la derecha, aparece y se desplaza hacia la izquierda para luego desaparecer.
ca: Cada clon dels edificis tria un vestit diferent, es desplaça a la dreta, apareix i es mou a l’esquerra i després desapareix.

source: Por último vamos a añadir una nueva capa de edificios que se moverá más rápido y estará colocada entre el gato y los edificios lentos.
ca: Finalment, afegirem una nova capa d’edificis que es mouran més ràpidament i es col·locaran entre el gat i els edificis lents.

source: Primero pulsamos con el botón derecho sobre el objeto edificios para **duplicar** el objeto y poder aprovechar el programa ya realizado.
ca: Primer, feu clic al botó dret de l'objecte d'edificis per ** duplicar ** l'objecte i aprofitar el programa ja realitzat.

source: Seleccionamos el nuevo objeto Buildings2 y modificamos su programa para que se muevan más rápido y para que se visualicen entre el gato y los otros edificios.
ca: Seleccionem l’objecte New Buildings2 i modifiquem el seu programa per moure’s més ràpidament i per visualitzar entre el gat i els altres edificis.

source: Retos
ca: Reptes

source: Añade un fondo de noche con estrellas con el botón "Elige un fondo" |seleccionar-fondo|.
ca: Afegiu un fons amb estrelles amb el \ "Trieu un fons " | Select-Fondo |.

source: Añade al programa un objeto extra que se comporte como los edificios moviéndose de derecha a izquierda.
ca: Afegiu al programa un objecte addicional que es comporti com els edificis que es mouen de dreta a esquerra.

source: Primero elegiremos un objeto pájaro y a continuación en la pestaña disfraces |pestania-disfraces|
ca: Primer triarem un objecte Bird i després a la pestanya Vistules | Piñania-Disfraces |

source: Pinchamos **debajo a la izquierda** en el botón "elige un disfraz" |seleccionar-objeto|
ca: Feu clic a ** a continuació a l'esquerra ** a la \ "Trieu un vestit " | Select-Object |

source: Añadimos más pájaros, dragones y otros disfraces al objeto actual.
ca: Afegim més ocells, dracs i altres vestits a l’objecte actual.

source: Por último repetimos el mismo programa que tenían los edificios para mover los nuevos disfraces por la pantalla.
ca: Finalment, repetim el mateix programa que els edificis havien de moure els nous vestits de la pantalla.

source: Modifica el programa para que el gato vuele en la dirección contraria.
ca: Modifiqueu el programa perquè el gat voli en el sentit contrari.

source: Dentro del objeto gato, pulsamos en la opción de dirección y fijamos el giro de izquierda a derecha pulsando en las dos flechas enfrentadas. De esta manera el gato no quedará boca arriba al girar en sentido contrario.
ca: Dins de l'objecte CAT, feu clic a l'opció d'adreça i configureu l'esquerra a la dreta fent clic a les dues fletxes enfrontades. D’aquesta manera, el gat no serà la boca del sentit contrari.
