Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/scratch3-dibujar-disfraces.po
Languages: ca

source: Dibujar disfraces
ca: Dibuixar disfresses

source: En esta práctica vamos a programar un juego que consiste en dibujar en la pantalla diferentes personajes aplicando efectos como giro o tamaño.
ca: En aquesta pràctica, programarem un joc que consisteix a dibuixar a la pantalla diferents caràcters aplicant efectes com ara el torn o la mida.

source: Iniciamos el |editor_de_Scratch|.
ca: Comencem el | Editor_de_scratch |.

source: Pulsamos el botón idioma |boton-idioma| en la barra superior y elegimos **Español**.
ca: Premeu el botó d'idioma | Botó-Idioma | A la barra superior i va triar ** espanyol **.

source: Añadimos una nueva extensión con el botón **añadir extensión** |aniadir-extension| abajo a la izquierda.
ca: Afegim una nova extensió amb el botó ** ** | Aniadir-Extensió | fins a l’esquerra.

source: Seleccionamos la extensión **Lápiz** para poder dibujar.
ca: Seleccionem l’extensió ** llapis ** per dibuixar.

source: En la barra de código aparecerá un nuevo icono, el Lápiz |boton-lapiz|, con instrucciones de color verde oscuro.
ca: A la barra de codi apareixerà una nova icona, el llapis | Botó-lapiz |, amb instruccions de color verd fosc.

source: En la pestaña disfraces |pestania-disfraces|, borramos uno de los disfraces del gato y añadimos varios personajes más que nos gusten.
ca: A la pestanya Disfresses | Piñania-Disfrace |, eliminem un dels vestits del gat i afegim diversos personatges que ens agraden.

source: Ahora en la pestaña de código |pestania-codigo|, vamos a añadir un pequeño programa que se ejecute al hacer clic en la bandera.
ca: Ara a la pestanya Codi | Piñania-Codigo |, afegirem un petit programa que s’executa quan feu clic a la bandera.

source: Pulsamos la bandera verde |bandera-verde| para probar el funcionamiento del programa.
ca: Premeu la bandera verda | Flag-Verde | Per provar el funcionament del programa.

source: Al pulsar la bandera toda la pantalla se borra y al mover el ratón, el gato se moverá por la pantalla.
ca: En prémer la bandera, la pantalla sencera s’esborra i en moure el ratolí, el gat es desplaçarà a la pantalla.

source: Completaremos el programa con funciones para la pulsación de varias teclas.
ca: Completarem el programa amb funcions per a la pulsació de diverses claus.

source: Ahora al pulsar las teclas de flechas el disfraz aumenta y disminuye de tamaño y gira de derecha a izquierda.
ca: Ara, prement les tecles de fletxa, el vestit augmenta i disminueix de mida i gira de dreta a esquerra.

source: Con la tecla espacio cambiará el disfraz.
ca: Amb la clau d’espai, la disfressa canviarà.

source: Al hacer clic en la pantalla el disfraz quedará sellado.
ca: Quan feu clic a la pantalla, es segellarà el vestit.

source: Retos
ca: Reptes

source: Inventa un dibujo hecho con varios disfraces sellados en la pantalla, con diferentes tamaños y giros.
ca: Inventa un dibuix elaborat amb diversos vestits segellats a la pantalla, amb diferents mides i voltes.

source: Añade nuevos disfraces y un escenario para hacer un dibujo más completo.
ca: Afegiu nous vestits i una etapa per fer un dibuix més complet.

source: Añade una nueva función para que al presionar la tecla "a" se selle en la pantalla el disfraz 24 veces. Cada vez que se selle, el disfraz girará 15 grados.
ca: Afegiu una nova funció de manera que quan premeu la tecla \ "a " a la pantalla, el vestit 24 vegades. Cada vegada que es segella, la disfressa girarà 15 graus.

source: Añade una nueva función para que al presionar la tecla "b" se selle en la pantalla el disfraz 8 veces. Cada vez que se selle el disfraz cambiará de tamaño por -10.
ca: Afegiu una nova funció de manera que quan premeu la tecla \ "B " a la pantalla el vestit 8 vegades. Cada vegada que es segelli la disfressa, canviarà la mida per -10.
