Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/scratch3-retos-robotix.po
Languages: ca

source: Retos de Robotix para Scratch
ca: Robotix Reptes per Scratch

source: `Página principal de los retos de Robotix <https://www.robotix.es/es/actividades-scratch>`__
ca: `Pàgina principal de Robotx Reptes <https://www.robotix.es/es/activities-scratch>`__

source: `Reto 1: ¡Vamos a cantar! <https://scratch.mit.edu/projects/375835363/editor/>`__
ca: `Repte 1: cantem! <https://scratch.mit.edu/projects/375835363/editor/>`__ __

source: `Reto 2: Descubrimos la ciudad <https://scratch.mit.edu/projects/375854305/editor/>`__
ca: `Repte 2: Hem descobert la ciutat <https://scratch.mit.edu/projects/375854305/editor/>` `` `` `

source: `Reto 3: Fiesta de disfraces <https://scratch.mit.edu/projects/376182689/editor/>`__
ca: `Repte 3: Festa de disfresses <https://scratch.mit.edu/projects/376182689/editor/>` `` `` `` `

source: `Reto 4: Hemos perdido la memoria <https://scratch.mit.edu/projects/376814133/editor/>`__
ca: `Repte 4: Hem perdut la memòria <https://scratch.mit.edu/projects/376814133/editor/>` `` `` `

source: `Reto 5: La Maratón <https://scratch.mit.edu/projects/376833363/editor/>`__
ca: `Repte 5: La Marathon <https://scratch.mit.edu/projects/3768333363/editor/>` `` `` `` ``

source: `Reto 6: Jugamos al escondite <https://scratch.mit.edu/projects/376821003/editor/>`__
ca: `Repte 6: Hem jugat a amagar

source: `Reto 7: El partido de Baseball <https://scratch.mit.edu/projects/377076239/editor/>`__
ca: `Repte 7: The Baseball Party <https://scratch.mit.edu/projects/37076239/editor/>`__

source: `Reto 8: ¡A volar! <https://scratch.mit.edu/projects/377087143/editor/>`__
ca: `Repte 8: vola! <https://scratch.mit.edu/projects/377087143/editor/>`__ __

source: `Reto 9: ¿Encestamos? <https://scratch.mit.edu/projects/377110210/editor/>`__
ca: `Repte 9: Li encenem? <https://scratch.mit.edu/projects/377110210/editor/> `__

source: `Reto 10: Salvar la luna <https://scratch.mit.edu/projects/377125182/editor/>`__
ca: `Repte 10: Desa la lluna <https://scratch.mit.edu/projects/377125182/editor/>` `` `` ``

source: `Reto 11: Vamos al bosque <https://scratch.mit.edu/projects/378720291/editor/>`__
ca: `Repte 11: anem al bosc <https://scratch.mit.edu/projects/378720291/editor/>` `` `` ``

source: `Reto 12: Bailar <https://scratch.mit.edu/projects/378725200/editor/>`__
ca: `Repte 12: Dance <https://scratch.mit.edu/projects/378725200/editor/>` `` ``

source: `Reto 13: Tenemos que salir del Laberinto <https://scratch.mit.edu/projects/378727850/editor/>`__
ca: `Repte 13: hem de deixar el laberint <https://scratch.mit.edu/projects/378727850/editor/>`__

source: `Reto 14: Anima las letras <https://scratch.mit.edu/projects/381186087/editor/>`__
ca: `Repte 14: Animeu les cartes <https://scratch.mit.edu/projects/381186087/editor/>` `` `` `` `` ``

source: `Reto 15: Juego del Pong <https://scratch.mit.edu/projects/381189217/editor/>`__
ca: `Repte 15: joc de pong <https://scratch.mit.edu/projects/381189217/editor/>` `` `` `

source: `Reto 16: Cómete las frutas <https://scratch.mit.edu/projects/381189226/editor/>`__
ca: `Repte 16: Menja les fruites <https://scratch.mit.edu/projects/381189226/editor/>` `` `` `` ``

source: `Reto 17: ¡Nos persiguen! <https://scratch.mit.edu/projects/381189235/editor/>`__
ca: `Repte 17: ens persegueixen! <https://scratch.mit.edu/projects/381189235/editor/>`__

source: `Reto 18: Perseguimos el Pez <https://scratch.mit.edu/projects/382364150/editor/>`__
ca: `Repte 18: perseguim el peix <https://scratch.mit.edu/projects/382364150/editor/>` `` `` `` `

source: `Reto 19: Ping Pong <https://scratch.mit.edu/projects/382366579/editor/>`__
ca: `Repte 19: ping pong <https://scratch.mit.edu/projects/38236579/editor/>` `` `` `

source: `Reto 20: Pint ball <https://scratch.mit.edu/projects/383389623/editor/>`__
ca: `Repte 20: Ball de dolor <https://scratch.mit.edu/projects/383389623/editor/>` `` `` `

source: `Reto 21: Hacer desaparecer bloques <https://scratch.mit.edu/projects/383395425/editor/>`__
ca: `Repte 21: fer blocs <https://scratch.mit.edu/projects/383395425/editor/> __ __

source: `Reto 22: Carrera <https://scratch.mit.edu/projects/384038221/editor/>`__
ca: `Repte 22: Carrera <https://scratch.mit.edu/projects/384038221/editor/>` `` ``

source: `Reto 23: ¡Se nos escapan las gallinas! <https://scratch.mit.edu/projects/384041205/editor/>`__
ca: `Repte 23: Els pollastres ens escapen! <https://scratch.mit.edu/projects/384041205/editor/>`__

source: `Reto 24: Lugares del mundo <https://scratch.mit.edu/projects/384044578/editor/>`__
ca: `Repte 24: llocs al món <https://scratch.mit.edu/projects/384044578/editor/>` `` `` `

source: `Reto 25: Snake <https://scratch.mit.edu/projects/385215952/editor/>`__
ca: `Repte 25: Snake <https://scratch.mit.edu/projects/385215952/editor/>` `` ``

source: `Reto 26: Saltamos plataformas <https://scratch.mit.edu/projects/385527330/editor/>`__
ca: `Repte 26: Hem saltat les plataformes <https://scratch.mit.edu/projects/38527330/editor/>` `` `` `` ``

source: `Reto 27: Acierta <https://scratch.mit.edu/projects/385865891/editor/>`__
ca: `Repte 27: un dret <https://scratch.mit.edu/projects/385865891/editor/>` `

source: `Reto 28: Patitos <https://scratch.mit.edu/projects/385890622/editor/>`__
ca: `Repte 28: Patitos <https://scratch.mit.edu/projects/385890622/editor/>` `` `

source: `Reto 29: Esquivamos bloques <https://scratch.mit.edu/projects/385275687/editor/>`__
ca: `Repte 29: Hem esquivat els blocs <https://scratch.mit.edu/projects/385275687/editor/>` `` `` `

source: `Reto 30: Disparar dardos <https://scratch.mit.edu/projects/387425281/editor/>`__
ca: `Repte 30: dispara dards <https://scratch.mit.edu/projects/387425281/editor/>` `` `` ``

source: `Reto 31: Haz tu propia historia de Sant Jordi <https://scratch.mit.edu/projects/388132814/editor/>`__
ca: `Repte 31: feu la vostra pròpia història de Sant Jordi <https://scrat.mit.edu/projects/388132814/editor/>`__

source: `Reto 32: Vigila con las bombas <https://scratch.mit.edu/projects/387446761/editor/>`__
ca: `Repte 32: Mireu amb les bombes <https://scratch.mit.edu/projects/387446761/editor/>`__

source: `Reto 33: ¿Dónde está el Gato? <https://scratch.mit.edu/projects/388104036/editor/>`__
ca: `Repte 33: On és el gat? <https://scratch.mit.edu/projects/388104036/editor/>`__

source: `Reto 34: Carrera de clicks <https://scratch.mit.edu/projects/389295637/editor/>`__
ca: `Repte 34: feu clic a la cursa <https://scratch.mit.edu/projects/389295637/editor/>`__

source: `Reto 35: ¡Jugamos a Tenis! <https://scratch.mit.edu/projects/389300142/editor/>`__
ca: `Repte 35: Hem jugat al tennis! <https://scratch.mit.edu/projects/389300142/editor/>`__

source: `Reto 36: Marcianitos <https://scratch.mit.edu/projects/390081181/editor/>`__
ca: `Repte 36: Marcianitos <https://scratch.mit.edu/projects/390081181/editor/>` `` `

source: `Reto 37: Billar <https://scratch.mit.edu/projects/390495089/editor/>`__
ca: `Repte 37: Billiard <https://scratch.mit.edu/projects/390495089/editor/>

source: `Reto 38: Dale al guante <https://scratch.mit.edu/projects/390507989/editor/>`__
ca: `Repte 38: Doneu el guant <https://scratch.mit.edu/projects/390507989/editor/>` `` `` `` `

source: `Reto 39: ¡Tu primer día fuera de casa! <https://scratch.mit.edu/projects/391621662/editor/>`__
ca: `Repte 39: el vostre primer dia fora de casa! <https://scratch.mit.edu/projects/39162162/editor/>`__

source: `Reto 40: Cuenta un cuento <https://scratch.mit.edu/projects/392001686/editor/>`__
ca: `Repte 40: expliqueu una història <https://scratch.mit.edu/projects/392001686/editor/>` `` `` ``

source: `Reto 41: Juego de aventuras <https://scratch.mit.edu/projects/392788463/editor/>`__
ca: `Repte 41: joc d'aventura <https://scratch.mit.edu/projects/39278463/editor/>`__

source: `Reto 42: Compuertas del río <https://scratch.mit.edu/projects/392854781/editor/>`__
ca: `Repte 42: River Gates <https://scratch.mit.edu/projects/392854781/editor/>` __

source: `Reto 43: Concurso de preguntas <https://scratch.mit.edu/projects/392860241/editor/>`__
ca: `Repte 43: concurs de preguntes <https://scratch.mit.edu/projects/392860241/editor/>` `` `` `

source: `Reto 44: Relaciona colores <https://scratch.mit.edu/projects/393980950/editor/>`__
ca: `Repte 44: Relaciona els colors <https://scratch.mit.edu/projects/393980950/editor/>` `` `` ``

source: `Reto 45: Relives <https://scratch.mit.edu/projects/394389662/editor/>`__
ca: `Repte 45: reviu <https://scratch.mit.edu/projects/394389662/editor/>` `` `` `` ``

source: `Reto 46: Tráiler película <https://scratch.mit.edu/projects/394790754/editor/>`__
ca: `Repte 46: tràiler de cinema <https://scratch.mit.edu/projects/394790754/editor/>` `` `` ``

source: `Reto 47: ¡Vamos a comprar! <https://scratch.mit.edu/projects/395218585/editor/>`__
ca: `Repte 47: comprem! <https://scratch.mit.edu/projects/395218585/editor/>`__ __

source: `Reto 48: Juegos de recreo <https://scratch.mit.edu/projects/395628989/editor/>`__
ca: `Repte 48: Jocs de recreació <https://scratch.mit.edu/projects/395628989/editor/>`__

source: `Reto 49: 60 segundos <https://scratch.mit.edu/projects/396446327/editor/>`__
ca: `Repte 49: 60 segons <https://scratch.mit.edu/projects/396446327/editor/>` `` `` ``

source: `Reto 50: Animales marinos <https://scratch.mit.edu/projects/396841007/editor/>`__
ca: `Repte 50: Marine Animals <https://scratch.mit.edu/projects/396841007/editor/>` `` `

source: `Reto 51: Canción de cumpleaños <https://scratch.mit.edu/projects/397263808/editor/>`__
ca: `Repte 51: Cançó d'aniversari <https://scratch.mit.edu/projects/397263808/editor/>` `` `` ``

source: `Reto 52: ¡Nos vamos de vacaciones! <https://scratch.mit.edu/projects/397662533/editor/>`__
ca: `Repte 52: anem de vacances! <https://scratch.mit.edu/projects/397662533/editor/>`__

source: `Reto 53: Subimos una montaña <https://scratch.mit.edu/projects/398785551/editor/>`__
ca: `Repte 53: pengem una muntanya <https://scratch.mit.edu/projects/39878551/editor/>` `` `` ``

source: `Reto 54: La playa <https://scratch.mit.edu/projects/399459931/editor/>`__
ca: `Repte 54: The Beach <https://scratch.mit.edu/projects/399459931/editor/>` `` `` `

source: `Reto 55: Cuenta cuentos <https://scratch.mit.edu/projects/400156047/editor/>`__
ca: `Repte 55: Compte de contes <https://scratch.mit.edu/projects/400156047/editor/>` `` `` `

source: `Reto 56: ¡Nos vamos a la luna! <https://scratch.mit.edu/projects/401922853/editor/>`__
ca: `Repte 56: anem a la lluna! <https://scratch.mit.edu/projects/401922853/editor/>`__

source: `Reto 57: Dibuja tu propio fondo <https://scratch.mit.edu/projects/403052449/editor/>`__
ca: `Repte 57: dibuixa el teu propi fons <https://scratch.mit.edu/projects/403052449/editor/>` `` `` `

source: `Reto 58: Safari <https://scratch.mit.edu/projects/403053902/editor/>`__
ca: `Repte 58: Safari <https://scratch.mit.edu/projects/403053902/editor/>` `` `` ``

source: `Reto 59: Viajamos <https://scratch.mit.edu/projects/404991370/editor/>`__
ca: `Repte 59: viatgem <https://scratch.mit.edu/projects/404991370/editor/>` `` `` ``

source: `Reto 60: Vamos a una granja <https://scratch.mit.edu/projects/404992473/editor/>`__
ca: `Repte 60: anem a una granja <https://scratch.mit.edu/projects/404992473/editor/>`__

source: `Reto 61: Semáforos <https://scratch.mit.edu/projects/478403213/editor/>`__
ca: `Repte 61: semàfors <https://scratch.mit.edu/projects/478403213/editor/>`__ __

source: `Reto 62: Escapa de la habitación <https://scratch.mit.edu/projects/478932402/editor/>`__
ca: `Repte 62: Escapar de la sala <https://scratch.mit.edu/projects/478932402/editor/>`__

source: `Reto 63: Concurso de clics <https://scratch.mit.edu/projects/480079856/editor/>`__
ca: `Repte 63: feu clic al concurs <https://scratch.mit.edu/projects/480079856/editor/>` `` `` ``

source: `Reto 64: Pon a prueba tu memoria <https://scratch.mit.edu/projects/480585347/editor/>`__
ca: `Repte 64: proveu la vostra memòria <https://scratch.mit.edu/projects/480585347/editor/>`__

source: `Reto 65: ¡Tenemos hambre! <https://scratch.mit.edu/projects/480608726/editor/>`__
ca: `Repte 65: Tenim gana! <https://scratch.mit.edu/projects/480608726/editor/> `__

source: `Reto 66: Trucos de magia <https://scratch.mit.edu/projects/491552030/editor/>`__
ca: `Repte 66: trucs màgics <https://scratch.mit.edu/projects/491552030/editor/>` `` `` ``

source: `Reto 67: Busca tu color <https://scratch.mit.edu/projects/491561863/editor/>`__
ca: `Repte 67: busqueu el vostre color <https://scratch.mit.edu/projects/491561863/editor/>`__

source: `Reto 68: ¡Comemos fruta! <https://scratch.mit.edu/projects/492756524/editor/>`__
ca: `Repte 68: mengem fruita! <https://scratch.mit.edu/projects/492756524/editor/>`__

source: `Reto 69: Lluvia de meteoritos <https://scratch.mit.edu/projects/493337139/editor/>`__
ca: `Repte 69: Meteor Rain <https://scratch.mit.edu/projects/493337139/editor/>` __

source: `Reto 70: La canción del verano <https://scratch.mit.edu/projects/503500079/editor/>`__
ca: `Repte 70: la cançó d'estiu <https://scratch.mit.edu/projects/503500079/editor/>` `` ``

source: `Reto 71: Crea tu propia historia <https://scratch.mit.edu/projects/505169529/editor/>`__
ca: `Repte 71: crea la teva pròpia història <https://scratch.mit.edu/projects/505169529/editor/>` `` `` ``

source: `Reto 72: Dibujos animados <https://scratch.mit.edu/projects/507264012/editor/>`__
ca: `Repte 72: Dibuixos animats <https://scratch.mit.edu/projects/507264012/editor/>` `` `` `

source: `Reto 73: Coge las frutas <https://scratch.mit.edu/projects/515386746/editor/>`__
ca: `Repte 73: Agafeu fruites <https://scratch.mit.edu/projects/515386746/editor/>`__

source: `Reto 74: ¡Pon voz a tus personajes! <https://scratch.mit.edu/projects/515407287/editor/>`__
ca: `Repte 74: Posa la veu dels teus personatges! <https://scratch.mit.edu/projects/515407287/editor/>`__

source: `Reto 75: Evita los obstáculos <https://scratch.mit.edu/projects/515412842/editor/>`__
ca: `Repte 75: eviteu els obstacles <https://scratch.mit.edu/projects/515412842/editor/>`__

source: `Reto 76: Saltamos la cuerda <https://scratch.mit.edu/projects/528708285/editor/>`__
ca: `Repte 76: Hem saltat la corda <https://scratch.mit.edu/projects/528708285/editor/>`__

source: `Reto 77: Ideas locas <https://scratch.mit.edu/projects/532038299/editor/>`__
ca: `Repte 77: Idees esbojarrades <https://scratch.mit.edu/projects/532038299/editor/>` `` `` ``

source: `Reto 78: Premios Scratch <https://scratch.mit.edu/projects/535585508/editor/>`__
ca: `Repte 78: Premis Scratch <https://scratch.mit.edu/projects/53585508/editor/>` `` `` `` ``
