Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/scratch3-recorrer-laberintos.po
Languages: ca

source: Recorrer laberintos
ca: Walk Labyrinths

source: En esta práctica vamos a programar un juego que consiste en recorrer varios laberintos desde su comienzo hasta el punto final antes de que a nuestro personaje se le termine su energía.
ca: En aquesta pràctica, programarem un joc que consisteix a viatjar diversos laberints des del seu començament fins al punt final abans que el nostre personatge acabi la seva energia.

source: Iniciamos el |editor_de_Scratch|.
ca: Comencem el | Editor_de_scratch |.

source: Pulsamos el botón idioma |boton-idioma| en la barra superior y elegimos **Español**.
ca: Premeu el botó d'idioma | Botó-Idioma | A la barra superior i va triar ** espanyol **.

source: Borramos el objeto gato presionando sobre el icono del cubo de basura.
ca: Eliminem l'objecte CAT prement a la icona del cub d'escombraries.

source: |borrar-gato|
ca: ; Suprimeix-Gato |

source: A continuación añadimos un nuevo personaje, una pelota de **basketball**.
ca: A continuació, afegim un personatge nou, una pilota de ** bàsquet **.

source: Pulsamos el botón elige un objeto |seleccionar-objeto|.
ca: Premeu el botó Trieu un objecte | Select-objecte |.

source: Buscamos en la sección **Deportes**.
ca: Estem buscant a la secció ** Sports **.

source: y seleccionamos el objeto **Basketball**.
ca: I seleccionem l'objecte ** Bàsquet **.

source: Ahora crearemos la variable **Fase** que va a contar el número de laberintos que vamos recorriendo. Cuando esta variable supere los cinco laberintos, el programa terminará.
ca: Ara crearem la variable ** fase ** que comptarà el nombre de laberints que viatgem. Quan aquesta variable supera els cinc laberints, el programa s’acabarà.

source: Pulsamos el botón de variables |boton-variables|,
ca: Premeu el botó variable | Botó-Variables |,

source: pulsamos en crear una variable |boton-crear-variable|.
ca: Premeu per crear una variable | Botó-Crear-Variable |.

source: Cambiamos el nombre de la variable a **Fase**
ca: Canviem el nom de la variable a ** fase **

source: Por último pulsamos el botón **Aceptar**
ca: Finalment, feu clic al botó ** acceptar **

source: Crearemos también la variable **Energía** que va a contar la energía de que disponemos para recorrer todos los laberintos. Si la variable energía se vacía, perderemos el juego y el programa terminará.
ca: També crearem la variable ** energia ** que comptarà amb l’energia que tenim per recórrer tots els laberints. Si es buida la variable d’energia, perdrem el joc i el programa s’acabarà.

source: Cambiamos el nombre de la variable a **Energía**
ca: Canviem el nom de la variable a ** energia **

source: Creamos dos nuevos bloques llamados **mueve_x** y **mueve_y** que van a mover la pelota por la pantalla.
ca: Creem dos nous blocs anomenats ** mown_x ** i ** mow_y ** que mouran la pilota a la pantalla.

source: Primero pulsamos en el botón mis bloques |boton-misbloques|
ca: Primer, feu clic als meus blocs | Botó-Misblos |

source: A continuación pulsamos en crear un bloque |boton-crear-bloque|
ca: A continuació, feu clic a Creació d’un bloc | Botó-Crear-Block |

source: Luego cambiamos el nombre del nuevo bloque a **mueve_x**
ca: A continuació, canviem el nom del nou bloc a ** mueve_x **

source: Luego cambiamos el nombre del nuevo bloque a **mueve_y**
ca: A continuació, canviem el nom del nou bloc a ** mueve_y **

source: Realizamos un programa que mueve la pelota en las cuatro direcciones, consumiendo energía y rebotando en las paredes del laberinto para que no las pueda atravesar.
ca: Realitzem un programa que mou la pilota en les quatre direccions, consumint energia i rebotant a les parets del laberint de manera que no es pugui creuar.

source: La pelota aún no se moverá porque necesitamos que otra rutina llame a las funciones que hemos creado.
ca: La pilota encara no es mourà perquè necessitem una altra rutina per trucar a les funcions que hem creat.

source: Ahora creamos un nuevo bloque, **Inicia**, que mostrará la pelota con tamaño pequeño al comienzo del laberinto.
ca: Ara creem un bloc nou, ** Start **, que mostrarà la pilota amb una mida petita al començament del laberint.

source: Para continuar programaremos la rutina principal que llama a todos los bloques que hemos creado anteriormente.
ca: Per continuar programant la rutina principal que anomena tots els blocs que hem creat anteriorment.

source: Todavía no podremos cambiar el fondo a "Sin_energía" porque este fondo no ha sido creado aún. Recuerda cambiarlo después de crear el fondo.
ca: Encara no podem canviar els antecedents a \ "sense_energy " perquè encara no s'ha creat aquest fons. No oblideu canviar -ho després de crear el fons.

source: Para terminar el programa de la pelota, programaremos el comportamiento cuando recibe los mensajes de **Comenzar** y de **Terminar**.
ca: Per acabar el programa de pilota, programarem el comportament quan rebem els missatges de ** start ** i ** acabat **.

source: Ahora cambiaremos al **Escenario** y dentro de la pestaña de fondos vamos a crear los mensajes del juego.
ca: Ara canviarem a ** escenari ** i dins de la pestanya Fons crearem els missatges del joc.

source: Primero seleccionamos en fondos, pintar un fondo.
ca: Primer seleccionem en fons, pinta un fons.

source: A continuación, con la herramienta **Texto** escribimos en la pantalla el siguiente mensaje.
ca: A continuació, amb el text ** ** escrivim el missatge següent a la pantalla.

source: Cambia el nombre del disfraz a "Sin_energía".
ca: Canvieu el nom de la disfressa a \ "sense_energy ".

source: Recuerda modificar el programa de la pelota de basketball ahora que este fondo ya está creado.
ca: No oblideu modificar el programa de pilota de bàsquet ara que aquest antecedent ja està creat.

source: Ahora cambiaremos de nuevo al **Escenario** y dentro de la pestaña de fondos vamos a crear más mensajes del juego.
ca: Ara tornarem a canviar per ** escenari ** i dins de la pestanya Fons crearem més missatges de joc.

source: Seleccionamos en fondos, pintar un fondo.
ca: Seleccionem en fons, pintem un fons.

source: Cambiamos el nombre del disfraz a "Terminado".
ca: Canviem el nom de la disfressa per \ "acabat ".

source: Seleccionamos de nuevo pintar un fondo.
ca: Seleccionem de nou per pintar un fons.

source: Cambiamos el nombre del disfraz a "Finalizado".
ca: Canviem el nom de la disfressa per \ "acabat ".

source: Para completar los fondos, vamos a descargar el siguiente archivo comprimido que contiene varios laberintos en su interior.
ca: Per completar els fons, descarregarem el següent fitxer comprimit que conté diversos laberints al seu interior.

source: :download:`Laberintos para recorrer. Formato ZIP. <scratch3/scratch3-laberintos.zip>`
ca: : Descarregueu: `Labyrinths per viatjar. Format postal. <scratch3/scratch3-laberintos.zip> '

source: Una vez descargado, abrimos el archivo Zip y extraemos todos los archivos de laberinto que tiene en su interior en una carpeta conocida.
ca: Un cop descarregat, obrim el fitxer zip i extreuem tots els fitxers de laberint dins d’una carpeta coneguda.

source: Se pueden extraer todos los archivos pinchando con el botón derecho del ratón en el archivo Zip y seleccionando la opción ``Extraer todo...`` y pulsando luego el botón ``Extraer``.
ca: Podeu extreure tots els fitxers fent clic amb el botó dret del ratolí al fitxer zip i seleccionant el `` Extreu -ho tot ...

source: De nuevo en el **Escenario**, dentro de la pestaña de fondos, vamos a importar los distintos laberintos.
ca: De nou a l'escenari ** **, dins de la pestanya Fons, importarem els diferents laberints.

source: Primero seleccionamos en fondos, **carga un fondo**.
ca: Primer seleccionem en fons, ** Carregueu un fons **.

source: Elegimos la carpeta donde se ha descargado el archivo Zip anterior y la carpeta donde se han extraído los laberintos. Pregunta a tu profesor si no sabes cómo seguir en este paso.
ca: Hem escollit la carpeta on s’han descarregat el fitxer zip anterior i la carpeta on s’han extret els laberints. Pregunteu al vostre professor si no sabeu com continuar en aquest pas.

source: Una vez en la carpeta de los laberintos, pincha en el primer laberinto y pulsa el botón ``Abrir``.
ca: Un cop a la carpeta Labyrinth, feu clic al primer laberint i premeu el botó `` obert ''.

source: Repetimos el paso anterior con los cinco primeros laberintos.
ca: Repetim el pas anterior amb els cinc primers laberints.

source: Para continuar, vamos a programar el comportamiento del Escenario en la pestaña de Código.
ca: Per continuar, programarem el comportament de l’etapa a la pestanya Codi.

source: Al comenzar el programa establecemos el valor de la variable Fase en 1 (el número del laberinto) y mostramos el primer laberinto.
ca: Al començament del programa, establim el valor de la variable de fase en 1 (el número de laberint) i mostrem el primer laberint.

source: Cada vez que reciba el mensaje de **Comenzar** un nuevo laberinto, sumamos uno a la variable Fase y mostramos el laberinto que corresponda. Una vez llegado al valor 6 los laberintos se habrán acabado y podemos finalizar el programa con un mensaje ganador.
ca: Cada vegada que rebeu el missatge de ** Start ** Un nou laberint, afegiu -ne un a la variable de fase i mostreu el laberint corresponent. Un cop assolits 6 laberints, el programa haurà acabat i podem acabar el programa amb un missatge guanyador.

source: Llegado este punto, solo hace falta definir cuándo se termina cada laberinto. Para conseguirlo vamos a añadir un nuevo objeto, una flecha, que va a enviar el mensaje de laberinto terminado cuando toque la pelota de basketball.
ca: Quan arribi aquest punt, només cal definir quan acabi cada laberint. Per aconseguir -ho, afegirem un objecte nou, una fletxa, que enviarà el missatge de llicència acabat quan toqui la pilota de bàsquet.

source: Añadimos un nuevo personaje, **una flecha**.
ca: Afegim un personatge nou, ** una fletxa **.

source: Buscamos en la sección **Todos**.
ca: Estem buscant a la secció ** tot **.

source: y seleccionamos el objeto **Arrow1**.
ca: i seleccionem l'objecte ** Arrow1 **.

source: Realizamos un programa que muestre la flecha en la esquina inferior derecha al comenzar el programa. También debe estar siempre detectando si toca a la pelota de basketball, para terminar el laberinto y comenzar uno nuevo.
ca: Realitzem un programa que mostra la fletxa a la cantonada inferior dreta al començament del programa. També ha de ser sempre detectar si es juga la pilota de bàsquet, per acabar el laberint i començar -ne un de nou.

source: Además programaremos que la flecha se esconda desde que se termine un laberinto hasta que comience el siguiente laberinto.
ca: També programarem que la fletxa s’amaga des del final d’un laberint fins que comenci el laberint següent.

source: Pulsamos la bandera verde |bandera-verde| para probar el funcionamiento del programa.
ca: Premeu la bandera verda | Flag-Verde | Per provar el funcionament del programa.

source: Retos
ca: Reptes

source: Añade un rastro de color azul claro al movimiento de la pelota para que sepamos en todo momento qué recorrido ha realizado la pelota.
ca: Afegiu un sender blau clar al moviment de la pilota de manera que sabem en tot moment el que ha fet el viatge.

source: Mide cuánta energía consume la pelota para recorrer cada laberinto y establece al comienzo un valor de energía que sea justo el necesario para pasar el juego.
ca: Mesureu la quantitat d’energia que consumeix la pilota per recórrer cada laberint i estableix al principi un valor d’energia just per passar el joc.

source: Al comenzar cada laberinto, añade pequeñas frutas esparcidas de manera aleatoria. Cuando la pelota toque una de estas frutas, la fruta debe desaparecer y añadir energía a la pelota.
ca: Al començament de cada laberint, afegiu -hi petites fruites disperses aleatòriament. Quan la bola toca una d’aquestes fruites, la fruita ha de desaparèixer i afegir energia a la bola.

source: Las frutas se añadirán como clones de una fruta que debe permanecer escondida.
ca: S'afegiran fruites com a clons d'una fruita que han de romandre amagades.

source: Establece para la pelota un valor de energía inicial menor, de manera que sea necesario recoger varias frutas para poder terminar todos los laberintos con suficiente energía.
ca: Estableix per a la pilota un valor energètic inicial inferior, de manera que cal recollir diverses fruites per poder acabar tots els laberints amb energia suficient.

source: Ajusta el número de frutas y la energía que añade cada fruta para que el juego sea difícil, pero que se pueda terminar.
ca: Ajusteu el nombre de fruites i l’energia que afegeix cada fruita de manera que el joc sigui difícil, però es pot acabar.
