Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/scratch3-pasear-escenarios.po
Languages: ca

source: Pasear escenarios
ca: Escenaris de caminar

source: En esta práctica vamos a programar a un personaje que va a recorrer su casa y su barrio para mostrarnos cómo son.
ca: En aquesta pràctica programarem un personatge que viatjarà la seva casa i el seu barri per mostrar -nos com són.

source: Iniciamos el |editor_de_Scratch|.
ca: Comencem el | Editor_de_scratch |.

source: Pulsamos el botón idioma |boton-idioma| en la barra superior y elegimos **Español**.
ca: Premeu el botó d'idioma | Botó-Idioma | A la barra superior i va triar ** espanyol **.

source: Pulsamos el botón de tutoriales |boton-tutoriales| y luego el botón de "Arte".
ca: Premeu el botó tutorial | Botons-Tutorials | i després el botó \ "art ".

source: Seleccionamos el tutorial "Añadir un fondo" y lo visualizamos.
ca: Seleccionem el tutorial \ "Afegim un fons " i la visualitzem.

source: En este tutorial veremos el funcionamiento básico del programa.
ca: En aquest tutorial veurem el funcionament bàsic del programa.

source: Borramos el objeto gato presionando sobre el icono del cubo de basura.
ca: Eliminem l'objecte CAT prement a la icona del cub d'escombraries.

source: |borrar-gato|
ca: ; Suprimeix-Gato |

source: Después vamos a seleccionar un nuevo personaje pulsando seleccionar objeto |seleccionar-objeto| y luego en la pestaña gente escogemos al personaje que más nos guste.
ca: A continuació, seleccionarem un personatge nou fent clic a Selecciona Objecte | Select-Object | I després a la pestanya People triem el personatge que més ens agrada.

source: A continuación vamos a seleccionar los fondos que el personaje nos va a mostrar. Pulsamos en seleccionar fondo |seleccionar-fondo| y en la pestaña de interiores buscamos el dormitorio "Bedroom 3" y lo seleccionamos.
ca: A continuació, seleccionarem els fons que ens mostrarà el personatge. Fem clic sobre fons seleccionat | Select-Fondo | I a la pestanya interior busquem el dormitori \ "dormitori 3 " i el seleccionem.

source: Después volvemos a seleccionar fondo |seleccionar-fondo| y en la pestaña de exteriores buscamos el jardín "Garden-rock" y lo seleccionamos.
ca: A continuació, seleccionem fons | Select-Fondo | I a la pestanya exterior busquem el jardí \ "jardí-rock " i el seleccionem.

source: Si ahora pulsamos en la pestaña fondos |pestania-fondos| podemos ver todos los fondos que hemos elegido hasta este momento.
ca: Si ara fem clic als fons | Pijania-Fondos Tab | Podem veure tots els fons que hem triat fins ara.

source: Ahora vamos a programar que el personaje nos muestre su dormitorio. Para ello primero debemos seleccionar el personaje.
ca: Ara anem a programar que el personatge ens mostra el seu dormitori. Per això, primer hem de seleccionar el personatge.

source: Una vez seleccionado, vamos a la pestaña de código |pestania-codigo| y programamos las siguientes instrucciones.
ca: Un cop seleccionats, anem a la pestanya Codi | Paracania-Codigo | I programem les instruccions següents.

source: Primero añadimos la instrucción de cambiar el fondo actual a "Bedroom 3" |instruccion-cambiafondo|.
ca: Primer afegim la instrucció per canviar el fons actual a \ "dormitori 3 " | Instrucció-champland |.

source: Movemos al personaje a la **posición inicial** en un extremo de la pantalla y añadimos la instrucción ir a |instruccion-iraxy|.
ca: Mouen el personatge a la posició inicial ** ** en un extrem de la pantalla i afegim la instrucció a | Instrucció-iarxy |.

source: Movemos al personaje a la **posición en el medio de la pantalla** y añadimos la instrucción deslizar |instruccion-deslizarxy|.
ca: Movem el personatge a la posició ** al medi de la pantalla ** i afegim la instrucció a Slide | Instrucció-deslzarxy |.

source: Ahora añadimos la instrucción decir |instruccion-decir| con el mensaje "Este es el dormitorio", durante 2 segundos".
ca: Ara afegim la instrucció per dir | Instrucció-decir | Amb el missatge \ "Aquest és el dormitori ", durant 2 segons \ ".

source: Por último movemos al personaje al **otro extremo de la pantalla** y volvemos a elegir la instrucción deslizar |instruccion-deslizarxy|.
ca: Finalment, movem el personatge a ** un altre extrem de la pantalla ** i escollim triar la instrucció per lliscar | Instrucció-deslzarxy |.

source: Ahora completamos el programa:
ca: Ara completem el programa:

source: Pulsamos la bandera verde |bandera-verde| para probar el funcionamiento del programa.
ca: Premeu la bandera verda | Flag-Verde | Per provar el funcionament del programa.

source: Una vez que nos ha mostrado el dormitorio, vamos a mostrar el jardín. Continuamos el programa con las siguientes instrucciones siguiendo la misma pauta que seguimos para el dormitorio.
ca: Un cop el dormitori ens ha mostrat, anem a mostrar el jardí. Continuem el programa amb les instruccions següents seguint la mateixa directriu que seguim per al dormitori.

source: Retos
ca: Reptes

source: Modifica el programa para que el personaje visite y nos explique otros lugares de su casa y de su barrio.
ca: Modifiqueu el programa perquè el personatge visiti i expliqui altres llocs de casa seva i del seu barri.

source: Puedes bajar imágenes de Internet y añadirlas como nuevos escenarios en el apartado cargar un fondo.
ca: Podeu rebaixar les imatges a Internet i afegir -les com a nous escenaris a la secció carregueu un fons.

source: Haz que el personaje principal se encuentre con un personaje secundario en algún escenario. Recuerda utilizar la instrucción "enviar mensaje" en el momento adecuado para que el personaje secundario aparezca.
ca: Feu que el personatge principal tingui un personatge secundari en algun moment. No oblideu utilitzar la instrucció \ "Enviar missatge " en el moment adequat perquè aparegui el personatge secundari.

source: El personaje secundario debe programarse con las siguientes instrucciones para que aparezca en el escenario correcto.
ca: El caràcter secundari s'ha de programar amb les instruccions següents per aparèixer a l'escenari correcte.

source: Añade sonidos al comienzo de cada uno de los escenarios.
ca: Afegiu sons al començament de cadascun dels escenaris.
