Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/scratch-atrapa-bichos.po
Languages: ca

source: Atrapar bichos
ca: Captura d'errors

source: En esta práctica vamos a programar un juego que consiste en atrapar todos los escarabajos que aparecen en la pantalla. Una vez atrapados, ganamos el juego y un personaje nos avisa de ello.
ca: En aquesta pràctica programarem un joc que consisteix a atrapar tots els escarabats que apareixen a la pantalla. Un cop atrapats, vam guanyar el joc i un personatge ens avisa.

source: Iniciamos el |editor_de_Scratch|.
ca: Comencem el | Editor_de_scratch |.

source: Borramos el gato presionando sobre él con el botón derecho del ratón y luego pulsamos borrar.
ca: Eliminem el gat prement -li amb el botó dret del ratolí i, a continuació, fem clic.

source: |borrar-gato|
ca: ; Suprimeix-Gato |

source: A continuación añadimos un nuevo personaje, un **escarabajo**.
ca: A continuació, afegim un personatge nou, un ** escarabat **.

source: Pulsamos el botón de nuevo objeto |nuevo-objeto|
ca: Premeu el botó d'objecte nou | Objecte nou |

source: A continuación pulsamos en **Categoría Animales**.
ca: A continuació, premem els animals de la categoria ** **.

source: Luego seleccionamos el objeto **Ladybug2**.
ca: A continuació, seleccionem l'objecte ** Ladybug2 **.

source: Ahora crearemos la variable **Clones**
ca: Ara crearem la variable ** clons **

source: Dentro de la pestaña Datos |datos|,
ca: Dins de la pestanya Dades | Dades |,

source: pulsamos crear una variable |crear-variable|
ca: Premeu Creeu una variable | Create-variable |

source: Cambiamos el nombre de la variable a **Clones**
ca: Canviem el nom de la variable a ** clons **

source: Por último pulsamos el botón **OK**
ca: Finalment, premeu el botó ** ok **

source: Esta variable contará el número de escarabajos que hay en la pantalla. Cuando esta variable valga cero, el juego terminará.
ca: Aquesta variable indicarà el nombre d’escarabats a la pantalla. Quan aquesta variable zero, el joc s’acabarà.

source: En la pestaña de programa crearemos una nueva función llamada **Inicio**
ca: A la pestanya Programa crearem una nova funció anomenada ** Home **

source: Primero pulsamos en el botón más bloques
ca: Primer fem clic al botó més blocs

source: |mas-bloques|
ca: ; Mas-Blques |

source: A continuación pulsamos en crear un bloque |crear-bloque|
ca: A continuació, feu clic a Creació d’un bloc | Create-Bocate |

source: Luego cambiamos el nombre del nuevo bloque a **Inicio**
ca: A continuació, canviem el nom del nou bloc a ** start **

source: Ahora programamos la función **Inicio** con las siguientes órdenes.
ca: Ara programem la funció ** Home ** amb les següents comandes.

source: Este programa esconde el escarabajo, borra la pantalla y coloca cinco clones del escarabajo en la pantalla.
ca: Aquest programa amaga l'escarabat, suprimeix la pantalla i posa cinc clons de l'escarabat a la pantalla.

source: En este punto añadimos las instrucciones para que cada clon del escarabajo aparezca en un lugar distinto de la pantalla con tamaño pequeño. Cuando el puntero del ratón toque a un escarabajo, este desaparecerá.
ca: En aquest punt afegim les instruccions de manera que cada clon de l’escarabat aparegui en un lloc diferent de la pantalla amb mida petita. Quan el punter del ratolí toqui un escarabat, desapareixerà.

source: Para comprobar que todo funciona correctamente, pulsamos inicio con doble clic y aparecerán cinco escarabajos en la pantalla. Los escarabajos deben desaparecer cuando el puntero del ratón les toque.
ca: Per comprovar que tot funciona correctament, feu clic amb doble clic i cinc escarabats apareixeran a la pantalla. Els escarabats han de desaparèixer quan el punter del ratolí els toca.

source: Para que el juego funcione normalmente, programamos la función que hará aparecer escarabajos cada cierto tiempo hasta que termine el juego.
ca: Perquè el joc funcioni normalment, programem la funció que farà que els escarabats apareguin de tant en tant fins que el joc s’acabi.

source: Ahora tenemos que escoger un fondo adecuado para el juego. Cambiamos el fondo de escenario a una pared de una **calle**.
ca: Ara hem de triar un fons adequat per al joc. Canviem el fons escènic a una paret d’un carrer ** **.

source: Pulsamos el botón de Fondo nuevo.
ca: Premeu el botó nou.

source: |cambia-escenario|
ca: ; CHANGE-SCENARY |

source: A continuación pulsamos en **Tema Ciudad**.
ca: A continuació, fem clic al tema ** de la ciutat **.

source: Luego seleccionamos el fondo **brick wall 1**.
ca: A continuació, seleccionem el fons ** Wall de maó 1 **.

source: La pantalla quedará de la siguiente manera.
ca: La pantalla serà la següent.

source: Por último vamos a programar un personaje que avise del final del juego. En este caso se ha escogido a una **bailarina**.
ca: Finalment, programem un personatge que adverteixi del final del joc. En aquest cas, s'ha escollit un ** ballarí **.

source: A continuación pulsamos en **Categoría Gente**.
ca: A continuació, fem clic a la gent de la categoria ** **.

source: Luego seleccionamos el objeto **Ballerina**.
ca: A continuació, seleccionem l'objecte ** Ballerina **.

source: En la pestaña de programa del nuevo personaje
ca: A la pestanya del programa del nou personatge

source: añadimos las siguientes instrucciones.
ca: Afegiu les instruccions següents.

source: Ahora al finalizar el programa aparecerá la bailarina para felicitarnos.
ca: Ara, al final del programa, la ballarina sembla que ens feliciti.

source: Ejercicios
ca: Exercicis

source: Añade una nueva regla al juego. Si el número de escarabajos es mayor que 25, entonces perdemos el juego. El programa se detiene y un personaje nuevo nos avisa de que hemos perdido.
ca: Afegiu una nova regla al joc. Si el nombre d’escarabats és superior a 25, perdem el joc. El programa s’atura i un nou personatge ens adverteix que hem perdut.
