Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/scratch3-aterrizar-cohete.po
Languages: ca

source: Aterrizar cohete
ca: Rocket terrestre

source: En esta práctica vamos a programar un juego que consiste en aterrizar en la luna un cohete que tendrá un movimiento realista con la gravedad y con el encendido de los motores. El objetivo consiste en encender los motores en el momento correcto para que el cohete aterrize a baja velocidad y no se estrelle.
ca: En aquesta pràctica, programarem un joc que consisteix a desembarcar a la lluna un coet que tindrà un moviment realista amb la gravetat i amb l’encesa dels motors. L’objectiu és activar els motors en el moment adequat de manera que el coet aterri a baixa velocitat i no es bloquegi.

source: Iniciamos el |editor_de_Scratch|.
ca: Comencem el | Editor_de_scratch |.

source: Pulsamos el botón idioma |boton-idioma| en la barra superior y elegimos **Español**.
ca: Premeu el botó d'idioma | Botó-Idioma | A la barra superior i va triar ** espanyol **.

source: Borramos el objeto gato presionando sobre el icono del cubo de basura.
ca: Eliminem l'objecte CAT prement a la icona del cub d'escombraries.

source: |borrar-gato|
ca: ; Suprimeix-Gato |

source: Ahora escogemos un fondo adecuado para nuestro juego. Cambiamos el fondo de escenario a la **luna**.
ca: Ara escollim un fons adequat per al nostre joc. Canviem el fons de l'escenari per ** luna **.

source: Pulsamos el botón elige un fondo |seleccionar-fondo|.
ca: Premeu el botó Trieu un fons | Select-Fondo |.

source: Buscamos en la sección **Espacio**.
ca: Estem buscant a l’espai ** **.

source: y seleccionamos el fondo **Moon**.
ca: I seleccionem el fons ** lluna **.

source: A continuación añadimos un nuevo personaje, un **cohete**.
ca: A continuació, afegim un nou personatge, un coet ** **.

source: Pulsamos el botón elige un objeto |seleccionar-objeto|.
ca: Premeu el botó Trieu un objecte | Select-objecte |.

source: Buscamos en la sección **Todos**.
ca: Estem buscant a la secció ** tot **.

source: y seleccionamos el objeto **Rocketship**.
ca: i seleccionem l'objecte ** coetship **.

source: Ahora crearemos la variable **velocidad** que va a almacenar la velocidad de caída del cohete sobre la luna. Si esta variable es muy alta cuando el cohete choque con la luna, el cohete se destruirá.
ca: Ara crearem la variable ** velocitat ** que emmagatzemarà la velocitat de caiguda del coet a la lluna. Si aquesta variable és molt alta quan el coet xoca amb la lluna, el coet es destruirà.

source: Pulsamos el botón de variables |boton-variables|,
ca: Premeu el botó variable | Botó-Variables |,

source: pulsamos en crear una variable |boton-crear-variable|.
ca: Premeu per crear una variable | Botó-Crear-Variable |.

source: Cambiamos el nombre de la variable a **velocidad**
ca: Canviem el nom de la variable a ** velocitat **

source: Por último pulsamos el botón **Aceptar**
ca: Finalment, feu clic al botó ** acceptar **

source: Ahora crearemos la variable **combustible** que va a almacenar la cantidad de combustible que tiene el cohete para poder encender los motores y frenar la caída sobre la luna. Si el combustible se acaba, el cohete no podrá frenar la caída.
ca: Ara crearem la variable ** combustible ** que emmagatzemarà la quantitat de combustible que el coet ha de ser capaç d’encendre els motors i aturar la caiguda a la lluna. Si el combustible s’acaba, el coet no pot aturar la caiguda.

source: Cambiamos el nombre de la variable a **combustible**
ca: Canviem el nom de la variable a ** combustible **

source: Realizamos una subrutina que inicializa la posición y tamaño del cohete al iniciarse el programa. También establecerá los valores iniciales de las variables.
ca: Realitzem una subrutina que inicialitza la posició i la mida del coet al començament del programa. També establirà els valors inicials de les variables.

source: Realizamos una subrutina que mueva el cohete durante el vuelo. La velocidad aumentará hacia arriba cuando encendamos los motores y aumentará hacia abajo con los motores apagados.
ca: Realitzem una subrutina que mou el coet durant el vol. La velocitat augmentarà quan encenem els motors i augmentem amb els motors.

source: Realizamos una subrutina que detiene el cohete al llegar al suelo y determina si la velocidad es demasiado alta o es correcta para dar por bueno el aterrizaje.
ca: Realitzem una subrutina que atura el coet en arribar al terra i determina si la velocitat és massa alta o correcta per donar el desembarcament per bé.

source: Programamos el programa principal que reune todas las subrutinas.
ca: Programem el programa principal que compleix totes les subrutines.

source: A continuación añadimos un nuevo personaje, un **botón** que nos servirá de plataforma de aterrizaje.
ca: A continuació, afegim un caràcter nou, un botó ** ** que servirà com a plataforma de desembarcament.

source: y seleccionamos el objeto **Button2**.
ca: i seleccionem l'objecte ** Botó2 **.

source: Añadimos el programa de inicialización del Botón.
ca: Afegim el programa d’inicialització del botó.

source: Pulsamos la bandera verde |bandera-verde| para probar el funcionamiento del programa.
ca: Premeu la bandera verda | Flag-Verde | Per provar el funcionament del programa.

source: Retos
ca: Reptes

source: Añade meteoritos que se muevan de lado a lado lentamente para que el cohete tenga que sortearlos.
ca: Afegiu meteorits que es mouen d’un costat a l’altre lentament de manera que el coet els hagi de superar.

source: Juega varias veces para establecer la mejor marca de combustible sobrante una vez aterrizado el cohete. A partir de ahí puedes bajar en el programa el combustible inicial para hacer el juego más difícil.
ca: Juga diverses vegades per establir la millor marca de combustible sobrant un cop aterrat el coet. A partir d’aquí, podeu descarregar el combustible inicial del programa per dificultar el joc.
