Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/scratch3-romper-ladrillos.po
Languages: ca

source: Romper ladrillos
ca: Breaks Bricks

source: En esta práctica vamos a programar un juego que consiste en romper ladrillos con una pelota que rebota en una barra. Cada ladrillo roto nos dará un punto.
ca: En aquesta pràctica programarem un joc que consisteix a trencar els maons amb una pilota que rebota en un bar. Cada maó trencat ens donarà un punt.

source: Iniciamos el |editor_de_Scratch|.
ca: Comencem el | Editor_de_scratch |.

source: Pulsamos el botón idioma |boton-idioma| en la barra superior y elegimos **Español**.
ca: Premeu el botó d'idioma | Botó-Idioma | A la barra superior i va triar ** espanyol **.

source: Borramos el objeto gato presionando sobre el icono del cubo de basura.
ca: Eliminem l'objecte CAT prement a la icona del cub d'escombraries.

source: |borrar-gato|
ca: ; Suprimeix-Gato |

source: Añadimos un nuevo personaje, una **barra de control**.
ca: Afegim un personatge nou, una barra de control ** **.

source: Pulsamos el botón elige un objeto |seleccionar-objeto|.
ca: Premeu el botó Trieu un objecte | Select-objecte |.

source: Buscamos en la sección **Todos**.
ca: Estem buscant a la secció ** tot **.

source: y seleccionamos el objeto **Button2**.
ca: i seleccionem l'objecte ** Botó2 **.

source: Realizamos el siguiente programa para la barra de control.
ca: Realitzem el programa següent per a la barra de control.

source: Pulsamos la bandera verde |bandera-verde| para probar el funcionamiento del programa.
ca: Premeu la bandera verda | Flag-Verde | Per provar el funcionament del programa.

source: La barra debe moverse horizontalmente en la parte baja de la pantalla siguiendo la posición del ratón.
ca: La barra s'ha de moure horitzontalment a la pantalla inferior després de la posició del ratolí.

source: Añadimos un nuevo personaje, un **ladrillo**.
ca: Afegim un personatge nou, un ** maó **.

source: y seleccionamos el objeto **Button3**.
ca: i seleccionem l'objecte ** Botó3 **.

source: Añadimos un nuevo personaje, una **pelota de tenis**.
ca: Afegim un personatge nou, una ** bola de tennis **.

source: Buscamos en la sección **Deportes**.
ca: Estem buscant a la secció ** Sports **.

source: y seleccionamos el objeto **Tennis ball**.
ca: i seleccionem l'objecte ** Ball de tennis **.

source: Realizamos los siguientes programas para la pelota de tenis
ca: Realitzem els programes següents per a la pilota de tennis

source: Cada vez que pulsemos la barra espaciadora, debe aparecer una pelota de tenis que se mueve por la pantalla y rebota en las paredes y en la barra de control.
ca: Cada vegada que premem la barra d’espai, ha d’aparèixer una bola de tennis que es mou a la pantalla i es rebota a les parets i a la barra de control.

source: Cuando la pelota llega a la parte inferior de la pantalla, esta desaparece.
ca: Quan la bola arriba al fons de la pantalla, desapareix.

source: Ahora crearemos la variable **puntos** que va a almacenar los puntos que conseguimos rompiendo cada ladrillo.
ca: Ara crearem la variable ** punts ** que emmagatzemaran els punts que obtenim cada maó.

source: Pulsamos el botón de variables |boton-variables|,
ca: Premeu el botó variable | Botó-Variables |,

source: pulsamos en crear una variable |boton-crear-variable|.
ca: Premeu per crear una variable | Botó-Crear-Variable |.

source: Cambiamos el nombre de la variable a **puntos**
ca: Canviem el nom de la variable per ** punts **

source: Por último pulsamos el botón **Aceptar**
ca: Finalment, feu clic al botó ** acceptar **

source: A continuación crearemos la variable **posicion** que va a almacenar la posición de cada ladrillo a la hora de colocar los ladrillos en la pantalla.
ca: A continuació, crearem la variable ** POSICIÓ ** que emmagatzemarà la posició de cada maó en col·locar els maons a la pantalla.

source: Cambiamos el nombre de la variable a **posicion**
ca: Canviem el nom de la variable a ** POSICIÓ **

source: Por último crearemos el programa de los ladrillos.
ca: Finalment, crearem el programa de maó.

source: Al iniciarse el programa, aparecerán todos los ladrillos en la parte superior de la pantalla. Ahora podemos jugar con la pelota al pulsar la barra espaciadora.
ca: Al començament del programa, tots els maons apareixeran a la part superior de la pantalla. Ara podem jugar amb la pilota prement la barra espacial.

source: Retos
ca: Reptes

source: Modifica el programa para que aparezcan dos filas de ladrillos en la parte superior.
ca: Modifiqueu el programa de manera que apareguin dues files de maons a la part superior.

source: Hay que duplicar el personaje de **ladrillo**, crear otra variable **posicion2** y cambiarla en el nuevo ladrillo.
ca: Heu de doblar el caràcter de ** maó **, crear una altra variable ** posicionat2 ** i canviar -lo al nou maó.

source: Por último hay que bajar la posición **Y** del nuevo ladrillo desde 130 hasta 80.
ca: Finalment, la posició ** i ** del nou maó s’han de baixar de 130 a 80.

source: Modifica el programa para que el juego se acabe después de que se pierdan tres pelotas por la parte inferior.
ca: Modifiqueu el programa perquè el joc finalitzi després que es perdin tres pilotes a la part inferior.

source: Modifica el aspecto del los personajes para personalizarles a tu gusto.
ca: Modifiqueu l’aspecte dels personatges per personalitzar -los al vostre gust.
