Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/scratch-marcianitos.po
Languages: ca

source: Matar marcianitos
ca: Mata als Marcianitos

source: En esta práctica vamos a programar un juego que consiste en matar marcianos que caen desde la parte alta de la pantalla con el láser de una nave espacial.
ca: En aquesta pràctica programarem un joc que consisteix a matar marcians que cauen des de la part superior de la pantalla amb el làser d’una nau espacial.

source: Iniciamos el |editor_de_Scratch|.
ca: Comencem el | Editor_de_scratch |.

source: Borramos al gato presionando sobre él con el botón derecho del ratón y luego pulsamos borrar.
ca: Eliminem el gat prement -li amb el botó dret del ratolí i, a continuació, fem clic.

source: |borrar-gato|
ca: ; Suprimeix-Gato |

source: Cambiaremos el fondo del escenario con **estrellas**.
ca: Canviarem els antecedents de l’escenari amb ** estrelles **.

source: Pulsamos el botón de Fondo nuevo.
ca: Premeu el botó nou.

source: |cambia-escenario|
ca: ; CHANGE-SCENARY |

source: A continuación pulsamos en **Tema Espacio**.
ca: A continuació, fem clic al tema de l'espai ** **.

source: Luego seleccionamos el fondo **stars**.
ca: A continuació, seleccionem el fons ** estrelles **.

source: La pantalla quedará de la siguiente manera.
ca: La pantalla serà la següent.

source: Añadimos un nuevo personaje, una **nave espacial**.
ca: Afegim un caràcter nou, una nau espacial ** **.

source: Pulsamos el botón de nuevo objeto |nuevo-objeto|
ca: Premeu el botó d'objecte nou | Objecte nou |

source: Luego seleccionamos el objeto **Spaceship**.
ca: A continuació, seleccionem l'objecte ** naus espacial **.

source: Añadimos un nuevo personaje, un **botón azul** que servirá para hacer los disparos.
ca: Afegim un personatge nou, un ** botó blau ** que servirà per fer el rodatge.

source: A continuación pulsamos en **Categoría Cosas**.
ca: A continuació, fem clic a les coses de la categoria ** **.

source: Luego seleccionamos el objeto **Button2**.
ca: A continuació, seleccionem l'objecte ** Botó2 **.

source: Ahora, pulsando en el botón **i** del objeto, cambiamos su nombre a **Disparo**
ca: Ara, feu clic al botó ** i **, canviem el seu nom per ** Shot **

source: Añadimos una **estrella de mar**, que hará las veces de marciano.
ca: Afegim un ** Sea Star **, que actuarà com a Marciano.

source: A continuación pulsamos en **Categoría Animales**.
ca: A continuació, premem els animals de la categoria ** **.

source: Luego seleccionamos el objeto **Starfish**.
ca: A continuació, seleccionem l'objecte ** Starfish **.

source: Añadimos la variable **Puntos**, que contará el número de puntos acumulados mientras jugamos.
ca: Afegim la variable ** punts **, que comptarà el nombre de punts acumulats mentre juguem.

source: Dentro de la pestaña Datos |datos|,
ca: Dins de la pestanya Dades | Dades |,

source: pulsamos crear una variable |crear-variable|
ca: Premeu Creeu una variable | Create-variable |

source: Cambiamos el nombre de la variable a **Puntos**
ca: Canviem el nom de la variable per ** punts **

source: Por último pulsamos el botón **OK**
ca: Finalment, premeu el botó ** ok **

source: Ahora iremos al programa de la nave espacial
ca: Ara anirem al programa de naus espacials

source: y allí creamos el siguiente programa.
ca: I allà creem el següent programa.

source: Estas instrucciones inician el programa borrando la variable puntos, cambia el tamaño de la nave espacial y la coloca en la parte baja de la pantalla.
ca: Aquestes instruccions inicien el programa esborrant els punts variables, canvien la mida de la nau espacial i el col·loca a la part inferior de la pantalla.

source: Continuamos programando la nave espacial.
ca: Continuem programant la nau espacial.

source: Este bloque mueve la nave espacial de izquierda a derecha y finaliza el programa cuando un marciano toque la nave.
ca: Aquest bloc mou la nau espacial d’esquerra a dreta i acaba el programa quan un martic toca el vaixell.

source: Con otra pequeña función, la nave podrá disparar su láser.
ca: Amb una altra funció petita, el vaixell pot disparar el seu làser.

source: Probaremos que todo funciona correctamente presionando la bandera verde y moviendo la nave a izquierda y a derecha con las teclas de cursor.
ca: Intentarem que tot funcioni correctament prement la bandera verda i movent la nau a l’esquerra i a la dreta amb les tecles del cursor.

source: El láser funcionara más adelante cuando programemos el objeto **Disparo**.
ca: El làser funcionarà més tard quan programem l'objecte ** Shot **.

source: Disparo láser
ca: Xut làser

source: Ahora iremos al programa del objeto **Disparo**
ca: Ara anirem al programa d'objectes ** Shot **

source: y allí programaremos su funcionamiento.
ca: I allà programarem la seva operació.

source: Este programa sitúa el inicio del láser en la parte baja de la pantalla (y = -120),
ca: Aquest programa situa l’inici del làser a la pantalla inferior (y = -120),

source: coloca al botón en posición vertical (dirección 0)
ca: Col·loqueu el botó verticalment (adreça 0)

source: y reduce el tamaño para que el botón azul parezca un disparo (tamaño a 20%)
ca: i redueix la mida del botó blau per semblar un tret (mida fins al 20%)

source: A continuación, cada clon aparece en la posición actual de la nave espacial y se mueve hacia arriba hasta llegar al final de la pantalla, lugar donde desaparece.
ca: A continuació, cada clon apareix a la posició actual de la nau espacial i es mou fins arribar a la pantalla, on desapareix.

source: En este punto ya se puede probar el funcionamiento de los disparos con la nave espacial.
ca: En aquest moment, podeu provar el funcionament dels trets amb la nau espacial.

source: Marcianos
ca: Marcians

source: Ahora iremos al programa del objeto **Starfish**
ca: Ara anirem al programa d'objectes ** Starfish **

source: Y vamos a programar el comportamiento de los marcianos al comenzar el programa.
ca: I anem a programar el comportament dels marcians al començament del programa.

source: Este programa inicia 10 marcianos en la parte alta de la pantalla y va creando cada cierto tiempo más marcianos.
ca: Aquest programa inicia 10 marcians a la part superior de la pantalla i està creant cada moment més marcians.

source: El programa que maneja cada uno de los marcianos será el siguiente.
ca: El programa que gestioni cadascun dels marcians serà el següent.

source: Al iniciarse un nuevo marciano, aparece en la parte alta de la pantalla, en una posición aleatoria.
ca: Al començament d’un nou marcià, apareix a la part superior de la pantalla, en una posició aleatòria.

source: Si un disparo toca a un marciano, este desaparece y el contador de puntos aumenta un punto
ca: Si un tret toca un marcià, desapareix i el comptador de punts augmenta un punt

source: Si el marciano toca el borde inferior, esta desaparece y el contador de puntos disminuye 10 puntos.
ca: Si el martic toca la vora inferior, això desapareix i el comptador de punts disminueix 10 punts.

source: Cada medio segundo, el marciano baja hacia la parte baja de la pantalla.
ca: Cada segona meitat, el marcià baixa a la part inferior de la pantalla.

source: Este es el momento de probar todos los programas juntos y jugar un rato a los marcianitos.
ca: Aquest és el moment de provar tots els programes junts i jugar als Marcianitos durant un temps.

source: Ejercicios
ca: Exercicis

source: Cambia los parámetros del programa para ajustar su dificultad haciendo que aparezcan más marcianos por segundo y que bajen más rápido.
ca: Canvieu els paràmetres del programa per ajustar la vostra dificultat fent que apareguin més marcians per a la segona i baixa.

source: Añade una función de disparo doble para la nave espacial al pulsar la tecla "flecha arriba"
ca: Afegiu una funció de tir doble per a la nau espacial per prémer la tecla \ "fletxa up "

source: Añade una barrera que proteja durante un segundo a la nave espacial al pulsar "flecha abajo".
ca: Afegiu una barrera que protegeixi la nau espacial durant un segon per prémer \ "fletxa cap avall ".

source: Inventa otra modificación original para el programa.
ca: Inventeu una altra modificació original del programa.
