Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/scratch3-dibujar-flores.po
Languages: ca

source: Dibujar flores
ca: Dibuixa flors

source: En esta práctica vamos a programar varios bloques de usuario para que dibujen flores en la pantalla al presionar las teclas de dirección.
ca: En aquesta pràctica, programarem diversos blocs d’usuaris per dibuixar flors a la pantalla quan prement les tecles de direcció.

source: Iniciamos el |editor_de_Scratch|.
ca: Comencem el | Editor_de_scratch |.

source: Pulsamos el botón idioma |boton-idioma| en la barra superior y elegimos **Español**.
ca: Premeu el botó d'idioma | Botó-Idioma | A la barra superior i va triar ** espanyol **.

source: Añadimos una nueva extensión con el botón **añadir extensión** |aniadir-extension| abajo a la izquierda.
ca: Afegim una nova extensió amb el botó ** ** | Aniadir-Extensió | fins a l’esquerra.

source: Seleccionamos la extensión **Lápiz** para poder dibujar.
ca: Seleccionem l’extensió ** llapis ** per dibuixar.

source: En la barra de código aparecerá un nuevo icono, el Lápiz |boton-lapiz|, con instrucciones de color verde oscuro.
ca: A la barra de codi apareixerà una nova icona, el llapis | Botó-lapiz |, amb instruccions de color verd fosc.

source: Creamos un nuevo bloque llamado **inicio**.
ca: Creem un nou bloc anomenat ** Home **.

source: Primero pulsamos en el botón mis bloques |boton-misbloques|
ca: Primer, feu clic als meus blocs | Botó-Misblos |

source: A continuación pulsamos en crear un bloque |boton-crear-bloque|
ca: A continuació, feu clic a Creació d’un bloc | Botó-Crear-Block |

source: Luego cambiamos el nombre del nuevo bloque a **inicio**
ca: A continuació, canviem el nom del nou bloc a ** start **

source: El bloque **inicio** servirá para iniciar el programa. Borrará la pantalla, subirá el lápiz con color cero, y colocará al gato en el centro con tamaño pequeño.
ca: El bloc ** Start ** servirà per iniciar el programa. Esborreu la pantalla, pujareu el llapis amb color zero i col·locareu el gat al centre amb una mida petita.

source: Creamos un nuevo bloque llamado **Punto**.
ca: Creem un nou bloc anomenat ** punt **.

source: Luego cambiamos el nombre del nuevo bloque a **Punto**
ca: A continuació, canviem el nom del nou bloc a ** punt **

source: Pulsamos en **Añadir una entrada número o texto** y le damos el nombre **Radio**
ca: Premeu

source: Por último pulsamos el botón **Aceptar**
ca: Finalment, feu clic al botó ** acceptar **

source: El bloque **Punto** servirá para dibujar un punto en la pantalla con un tamaño que depende del parámetro Radio.
ca: El punt ** ** servirà per dibuixar un punt a la pantalla amb una mida que depèn del paràmetre de ràdio.

source: Creamos un nuevo bloque llamado **Flor**.
ca: Creem un nou bloc anomenat ** Flor **.

source: Luego cambiamos el nombre del nuevo bloque a **Flor**
ca: A continuació, canviem el nom del nou bloc A ** Flor **

source: El bloque **Flor** servirá para dibujar 12 puntos en círculo, alrededor del gato, con un tamaño que depende del parámetro Radio.
ca: La flor ** ** servirà per dibuixar 12 punts en un cercle, al voltant del gat, amb una mida que depèn del paràmetre de ràdio.

source: Ahora programamos un pequeño código para probar el bloque flor.
ca: Ara programem un petit codi per provar el bloc de flors.

source: Pulsamos la bandera verde |bandera-verde| para probar el funcionamiento del programa.
ca: Premeu la bandera verda | Flag-Verde | Per provar el funcionament del programa.

source: Al pulsar la tecla de **Flecha arriba** en el teclado, el gato dibujará una flor de círculos de colores en la pantalla.
ca: En prémer la ** fletxa ** al teclat, el gat dibuixarà una flor de colors a la pantalla.

source: A continuación realizamos un programa para dibujar una flor compuesta de varios círculos de puntos.
ca: A continuació, realitzem un programa per dibuixar una flor composta per diversos punts de punts.

source: Al pulsar la tecla de **Flecha abajo** en el teclado, el gato dibujará una flor de varios círculos de colores en la pantalla.
ca: En prémer la fletxa ** cap avall ** al teclat, el gat dibuixarà una flor de diversos cercles de colors a la pantalla.

source: Para terminar realizamos un programa para dibujar flores en varios lugares de la pantalla.
ca: Per acabar, realitzem un programa per dibuixar flors a diversos llocs de la pantalla.

source: Para definir los números de la instrucción **ir a x y** podemos mover al gato allí donde queremos que aparezca la flor.
ca: Per definir els números d’instruccions ** Vés a x i ** podem moure el gat on volem que aparegui la flor.

source: Al pulsar la tecla de **Flecha derecha** en el teclado, el gato dibujará cuatro flores en cuatro posiciones distintas de la pantalla.
ca: Si premeu la tecla de fletxa ** dreta ** al teclat, el gat dibuixarà quatre flors en quatre posicions diferents de la pantalla.

source: Retos
ca: Reptes

source: Modifica el programa para que la función flor no cambie el color de los puntos y todos tengan el mismo color. Dibuja una flor compuesta por un anillo de puntos grandes rojos en la parte exterior y un anillo pequeño de puntos verdes en la parte interior.
ca: Modifiqueu el programa de manera que la funció de la flor no canviï el color dels punts i tothom tingui el mateix color. Dibuixa una flor composta per un anell de grans punts vermells a l'exterior i un petit anell de punts verds a l'interior.

source: Realiza un programa que dibuje cinco flores situadas como en el logotipo de los juegos olímpicos.
ca: Feu un programa que atragui cinc flors situades com al logotip dels Jocs Olímpics.
