Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/scratch3-atrapar-manzanas.po
Languages: ca

source: Atrapar manzanas
ca: Agafar pomes

source: En esta práctica vamos a programar un juego que consiste en atrapar manzanas con un gato y evitar los rayos que matan. El gato se moverá con las teclas derecha e izquierda. Cuando el gato pierda sus tres vidas, el juego se acabará.
ca: En aquesta pràctica programarem un joc que consisteix a agafar pomes amb un gat i evitar els raigs que maten. El gat es mourà amb les tecles dreta i esquerra. Quan el gat perd les seves tres vides, el joc s’acabarà.

source: Iniciamos el |editor_de_Scratch|.
ca: Comencem el | Editor_de_scratch |.

source: Pulsamos el botón idioma |boton-idioma| en la barra superior y elegimos **Español**.
ca: Premeu el botó d'idioma | Botó-Idioma | A la barra superior i va triar ** espanyol **.

source: Ahora escogemos un fondo adecuado para nuestro juego. Cambiamos el fondo de escenario por **un desierto**.
ca: Ara escollim un fons adequat per al nostre joc. Canviem el fons d’escenari per ** un desert **.

source: Pulsamos el botón elige un fondo |seleccionar-fondo|.
ca: Premeu el botó Trieu un fons | Select-Fondo |.

source: Buscamos en la sección **Exteriores**.
ca: Estem buscant a la secció exterior ** **.

source: y seleccionamos el fondo **Desert**.
ca: I seleccionem el fons ** Desert **.

source: Cambiamos el nombre del objeto por **Gato**.
ca: Canviem el nom de l'objecte per ** cat **.

source: Creamos la variable **vidas** que guardará el número de vidas que tiene el Gato. Cuando esta variable valga cero, el programa terminará.
ca: Creem la variable ** vides ** que mantindrà el nombre de vides que té el gat. Quan valgui aquesta variable, el programa s’acabarà.

source: Pulsamos el botón de variables |boton-variables|,
ca: Premeu el botó variable | Botó-Variables |,

source: pulsamos en crear una variable |boton-crear-variable|.
ca: Premeu per crear una variable | Botó-Crear-Variable |.

source: Cambiamos el nombre de la variable a **vidas**
ca: Canviem el nom de la variable a ** viu **

source: Por último pulsamos el botón **Aceptar**
ca: Finalment, feu clic al botó ** acceptar **

source: Ahora programamos las instrucciones de iniciación para el objeto Gato. Este programa dará tres vidas al gato, mostrará el valor en pantalla, colocará al gato debajo de la pantalla y el estilo de rotación a derecha e izquierda.
ca: Ara programem les instruccions d’iniciació per a l’objecte CAT. Aquest programa donarà al gat tres, mostrarà el valor de la pantalla, situarà el gat sota la pantalla i l'estil de rotació dreta i esquerra.

source: Continuamos dando al gato movimiento a un lado y a otro. El siguiente programa comprueba si se ha pulsado una tecla de flecha izquierda o de flecha derecha y en caso afirmativo, mueve al gato en una u otra dirección.
ca: Continuem donant el moviment del gat cap a un costat i un altre. El programa següent comprova si s'ha premut una tecla de fletxa esquerra o fletxa dreta i, si és així, mou el gat en una o altra direcció.

source: Pulsamos la bandera verde |bandera-verde| para probar el funcionamiento del programa.
ca: Premeu la bandera verda | Flag-Verde | Per provar el funcionament del programa.

source: Ahora creamos la variable **puntos** que guardará el número de puntos que hemos conseguido al atrapar las manzanas.
ca: Ara creem la variable ** punts ** que mantindrà el nombre de punts que hem aconseguit en capturar pomes.

source: Cambiamos el nombre de la variable a **puntos**
ca: Canviem el nom de la variable per ** punts **

source: A continuación añadimos un nuevo personaje, una **manzana**.
ca: A continuació, afegim un personatge nou, un ** Apple **.

source: Pulsamos el botón elige un objeto |seleccionar-objeto|.
ca: Premeu el botó Trieu un objecte | Select-objecte |.

source: Buscamos en la sección **Comida**.
ca: Estem buscant al menjar ** **.

source: y seleccionamos el objeto **Apple**.
ca: i seleccionem l'objecte ** Apple **.

source: Vamos a crear otro disfraz para la manzana, una manzana aplastada. Primero vamos a la pestaña de disfraces |pestania-disfraces|
ca: Crearem una altra disfressa per a la poma, una poma aixafada. Primer anem a la pestanya de disfresses | Piñania-Disfraces |

source: A continuación duplicamos el disfraz de la manzana.
ca: Després doblem la disfressa de poma.

source: Ahora seleccionamos el disfraz duplicado y lo aplastamos.
ca: Ara seleccionem la disfressa duplicada i aixafem -la.

source: Ya podemos realizar el programa de la manzana dentro de la pestaña de código |pestania-codigo| de la manzana.
ca: Ja podem realitzar el programa Apple dins de la pestanya Codi | Paracania-Codigo | de la poma.

source: Primero vamos a esconder la manzana, asignamos cero a los puntos y vamos creando clones de la manzana para que aparezcan en pantalla, mientras el gato tenga vidas.
ca: Primer anem a amagar la poma, assignem zero als punts i creem clons de la poma per aparèixer a la pantalla, mentre que el gat tingui vides.

source: Antes de realizar el siguiente programa, se debe definir el bloque "caer suelo". Dentro del apartado Mis bloques |boton-misbloques| pulsamos "Crear un bloque" |boton-crear-bloque| y en el nombre del bloque escribimos "**caer suelo**".
ca: Abans de realitzar el programa següent, el bloc s'ha de definir "dins dels meus blocs | Button-Misblos | Premeu " Creeu un bloc \ "| Button-Crear-Block | i en nom del bloc que vam escriure " ** Fall Soil ** \ ".

source: El siguiente programa hará aparecer cada clon de la manzana en la parte superior en una posición aleatoria, para que luego caiga hacia el suelo.
ca: El següent programa apareixerà cada clon de la poma a la part superior en una posició aleatòria, de manera que després caigui cap a terra.

source: Por último programamos el bloque que hace caer la manzana hasta el suelo. En caso de tocar al gato, aumentará un punto y el clon de la manzana desaparece. Si el clon de la manzana toca el suelo, se aplastará.
ca: Finalment, programem el bloc que fa que la poma caigui a terra. En cas de tocar el gat, un punt augmentarà i el clon de poma desapareix. Si el clon de poma toca el terra, es triturarà.

source: Añadimos un nuevo objeto, un **rayo**.
ca: Afegim un objecte nou, un ** ray **.

source: Buscamos en la sección **Todos**.
ca: Estem buscant a la secció ** tot **.

source: y seleccionamos el objeto **Lightning**.
ca: i seleccionem l'objecte ** Lightning **.

source: Ahora realizamos el programa para que el se generen clones del rayo cada pocos segundos.
ca: Ara realitzem el programa per generar clons de llamps cada pocs segons.

source: Cada vez que se genera un clon su comportamiento será el siguiente.
ca: Cada vegada que es genera un clon, el seu comportament serà el següent.

source: Bajará desde la parte alta de la pantalla. Si toca al gato, las vidas se reducen en una. Si toca el borde inferior, el rayo desaparece.
ca: Passarà des de la part superior de la pantalla. Si és el gat, les vides es redueixen per un. Si la vora inferior toca, el llamp desapareix.

source: Por último programamos al gato para que se muera al llegar las vidas a cero. Primero seleccionamos el objeto gato.
ca: Finalment, programem el gat per morir quan les vides arriben a zero. Primer seleccionem l'objecte CAT.

source: A continuación añadimos el programa.
ca: A continuació, afegim el programa.

source: Retos
ca: Reptes

source: Añade un nuevo personaje que quite vidas igual que el rayo. Este nuevo personaje debe aparecer después de 10 segundos de juego.
ca: Afegiu un personatge nou que elimini vides igual que els llamps. Aquest nou personatge hauria d’aparèixer al cap de deu segons.

source: Modifica el programa para que el número de rayos aumente con el tiempo, de manera que el juego se haga cada vez más difícil.
ca: Modifiqueu el programa de manera que el nombre de raigs augmenti amb el pas del temps, de manera que el joc es faci cada cop més difícil.

source: Para conseguirlo, debes crear una nueva variable llamada Tiempo_entre_rayos. La variable debe iniciarse a 2 (dos segundos) al presionar la bandera verde. Al cabo de 10 segundos, cambiaremos el valor de la variable a 1 (un segundo). Después de otros 10 segundos cambiaremos el valor de la variable a 0.5 (medio segundo).
ca: Per aconseguir -ho, heu de crear una nova variable anomenada Time_rayos. La variable s’ha d’iniciar a 2 (dos segons) en prémer la bandera verda. Al cap de 10 segons, canviarem el valor de la variable a 1 (un segon). Al cap de deu segons més, canviarem el valor de la variable a 0,5 (mig segon).

source: Para que los rayos aparezcan a diferentes velocidades, debes cambiar el tiempo de espera entre creación de rayos por el valor de la variable 'Tiempo_entre_rayos'.
ca: Perquè els raigs apareguin a diferents velocitats, heu de canviar el temps d’espera entre la creació dels rajos pel valor de la variable `` `` rare_trey '.
