Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/scratch3-animar-nombre.po
Languages: ca

source: Animar nombre
ca: Animar el nom

source: En esta práctica vamos a mostrar en pantalla un nombre con efectos especiales en sus letras. Cuando el ratón pase sobre cada letra, esta mostrará un efecto especial.
ca: En aquesta pràctica mostrarem a la pantalla un nom amb efectes especials a les vostres lletres. Quan el ratolí va a cada carta, mostrarà un efecte especial.

source: Iniciamos el |editor_de_Scratch|.
ca: Comencem el | Editor_de_scratch |.

source: Pulsamos el botón idioma |boton-idioma| en la barra superior y elegimos **Español**.
ca: Premeu el botó d'idioma | Botó-Idioma | A la barra superior i va triar ** espanyol **.

source: Pulsamos el botón de tutoriales |boton-tutoriales| y luego el botón de "Animación".
ca: Premeu el botó tutorial | Botons-Tutorials | i després el botó \ "animació ".

source: Seleccionamos el tutorial "Animar un nombre" y lo visualizamos.
ca: Seleccionem el tutorial \ "Animeu un nom " i el visualitzem.

source: En este tutorial veremos el funcionamiento básico del programa.
ca: En aquest tutorial veurem el funcionament bàsic del programa.

source: Borramos el objeto gato presionando sobre el icono del cubo de basura.
ca: Eliminem l'objecte CAT prement a la icona del cub d'escombraries.

source: |borrar-gato|
ca: ; Suprimeix-Gato |

source: Después vamos a seleccionar un fondo para nuestro nombre. En el botón seleccionar fondo |seleccionar-fondo| escogemos el que más nos guste.
ca: Aleshores, seleccionarem un fons per al nostre nom. Al fons selecte | Select-Fondo | Escollim el que més ens agrada.

source: A continuación vamos a seleccionar varias letras con nuestro nombre pulsando seleccionar objeto |seleccionar-objeto| y luego en la pestaña "letras" escogemos las letras adecuadas con el estilo que deseemos.
ca: A continuació, seleccionarem diverses lletres amb el nostre nom fent clic a Selecciona Objecte | Select-Object | I després a les \ "lletres " triem les lletres adequades amb l'estil que volem.

source: Por último arrastramos las letras en la pantalla con el ratón y las colocamos en orden para formar un nombre.
ca: Finalment, arrosseguem les lletres a la pantalla amb el ratolí i les posem per formar un nom.

source: Ahora vamos a programar las letras para que tengan efectos especiales. Al hacer clic con el ratón sobre la primera letra, emitirá un sonido y cambiará de color mientras gira una vuelta completa.
ca: Ara programem les cartes per tenir efectes especials. Quan feu clic amb el ratolí de la primera lletra, emetrà un so i canviarà de color mentre gireu un gir complet.

source: Primero seleccionamos la **primera letra** y pinchamos en la pestaña de sonidos |pestania-sonidos|. En el botón seleccionar sonido |seleccionar-sonido| escogemos uno que sea breve y nos guste.
ca: Primer seleccionem la ** primera lletra ** i feu clic a la pestanya So | Piñania-Sonidos |. Al botó de so seleccionat | Selecciona: són | En triem un que és breu i ens agrada.

source: Después, en la pestaña de código |pestania-codigo| añadimos este programa.
ca: Després, a la pestanya Codi | Paracania-Codigo | Afegim aquest programa.

source: Pulsamos la bandera verde |bandera-verde| para probar el funcionamiento del programa.
ca: Premeu la bandera verda | Flag-Verde | Per provar el funcionament del programa.

source: En la **segunda letra** vamos a programar que al hacer clic sobre ella, aumentará de tamaño con el efecto de ojo de pez como si se estuviera inflando y luego volverá a su tamaño inicial. También añadiremos un nuevo sonido a los demás efectos.
ca: A la segona lletra ** ** programarem que fent -hi clic, augmentarà de mida amb l'efecte dels ulls de peix com si estigués inflant i després tornarà a la mida inicial. També afegirem un nou so als altres efectes.

source: En la **tercera letra**, vamos a mostrar efectos siempre que el ratón pase por encima, sin necesidad de hacer clic. Esto se consigue con el sensor "¿tocando puntero del ratón?".
ca: A la tercera lletra ** **, mostrarem efectes sempre que el ratolí passi per sobre, sense fer clic. Això s’aconsegueix amb el sensor \ "Puntar el punter del ratolí? ".

source: Al pasar el puntero sobre la letra vamos a hacer que cambie de color mientras gira.
ca: En passar el punter a la lletra, farem que canviï el color mentre gira.

source: Un bucle "por siempre" estará comprobando todo el tiempo si en algún momento el ratón toca la letra y en ese momento se aplica el efecto especial.
ca: Un bucle \ "per sempre " comprovarà tot el temps si en algun moment el ratolí toca les lletres i en aquell moment s'aplica l'efecte especial.

source: Por último vamos a programar la **cuarta letra** para que cambie su disfraz por una fruta cuando pase el ratón por encima.
ca: Finalment, programarem la ** quarta lletra ** per canviar la seva disfressa per una fruita quan el ratolí passi per sobre.

source: Primero debemos seleccionar la letra deseada e ir a la pestaña de disfraces |pestania-disfraces|, donde vamos a añadir el disfraz de una fruta.
ca: Primer hem de seleccionar les lletres desitjades i anar a la pestanya Disfressa | Piñania-Disfraces |, on anem a afegir la disfressa d’una fruita.

source: A continuación en la pestaña código |pestania-codigo| añadimos el siguiente programa que intercambia los disfraces cuando el ratón pasa por encima.
ca: A continuació, a la pestanya Codi | Piñania-Codigo | Afegim el següent programa que intercanvia els vestits quan el ratolí passa per sobre.

source: Retos
ca: Reptes

source: Completa el nombre con más letras que tengan efectos especiales basados en los que se han visto en este tutorial.
ca: Completa el nom amb més lletres que tinguin efectes especials basats en les que s’han vist en aquest tutorial.

source: Recuerda que puedes aplicar efectos cuando el ratón
ca: Recordeu que podeu aplicar efectes quan el ratolí

source: Clic sobre la letra.
ca: Feu clic a les lletres.

source: Pasar por encima de la letra.
ca: Passar per sobre de la carta.

source: Los efectos que se pueden aplicar son.
ca: Els efectes que es poden aplicar són.

source: De sonido.
ca: So.

source: De tamaño.
ca: Tamany

source: De movimiento o de giro.
ca: De moviment o gir.

source: De efectos gráficos (color, ojo de pez, remolino, pixelar, etc.)
ca: D'efectes gràfics (color, ull de peix, remolí, píxel, etc.)

source: Cambiar disfraz.
ca: Canviar el vestit.

source: Combinar **varios efectos a la vez**.
ca: Combina ** Diversos efectes alhora **.
