Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/scratch3-comer-peces.po
Languages: ca

source: Comer peces
ca: Menjar peix

source: En esta práctica vamos a realizar un juego que consiste en perseguir peces con un pingüino para que se los coma.
ca: En aquesta pràctica farem un joc que consisteix a perseguir els peixos amb un pingüí per menjar -los.

source: Iniciamos el |editor_de_Scratch|.
ca: Comencem el | Editor_de_scratch |.

source: Pulsamos el botón idioma |boton-idioma| en la barra superior y elegimos **Español**.
ca: Premeu el botó d'idioma | Botó-Idioma | A la barra superior i va triar ** espanyol **.

source: Pulsamos el botón de tutoriales |boton-tutoriales| y luego el botón de "Juegos".
ca: Premeu el botó tutorial | Botons-Tutorials | i després el botó \ "jocs ".

source: Seleccionamos el tutorial "Crear un juego de persecución" y lo visualizamos.
ca: Seleccionem el tutorial \ "Crear un joc de persecució " i la visualitzem.

source: En este tutorial veremos el funcionamiento básico del programa.
ca: En aquest tutorial veurem el funcionament bàsic del programa.

source: Borramos el objeto gato presionando sobre el icono del cubo de basura.
ca: Eliminem l'objecte CAT prement a la icona del cub d'escombraries.

source: |borrar-gato|
ca: ; Suprimeix-Gato |

source: Ahora vamos a realizar el programa. Primero seleccionamos un fondo para nuestro juego. En el botón seleccionar fondo |seleccionar-fondo| escogemos uno del fondo del mar "Underwater".
ca: Ara farem el programa. Primer seleccionem un fons per al nostre joc. Al fons selecte | Select-Fondo | En triem un del fons del mar \ "Underwater ".

source: A continuación añadimos un pez. Pulsando seleccionar objeto |seleccionar-objeto| en la pestaña de Animales seleccionamos un pez que nos guste.
ca: A continuació, afegim un peix. Prement objecte seleccionat | Select-Object | In the animal tab we select a fish that we like.

source: Ahora vamos a mover el pez por la pantalla de forma aleatoria. Para conseguirlo programamos las siguientes instrucciones.
ca: Ara anem a moure el peix a la pantalla aleatòriament. Per aconseguir -ho, programem les instruccions següents.

source: Pulsamos la bandera verde |bandera-verde| para probar el funcionamiento del programa.
ca: Premeu la bandera verda | Flag-Verde | Per provar el funcionament del programa.

source: Añadimos un nuevo personaje que va a perseguir al pez para comérselo. Pulsando seleccionar objeto |seleccionar-objeto| en la pestaña de Animales seleccionamos un pingüino.
ca: Afegim un nou personatge que perseguirà el peix per menjar -lo. Prement objecte seleccionat | Select-Object | A la pestanya Animal seleccionem un pingüí.

source: Creamos una nueva variable. En el botón variables |boton-variables| pulsamos "crear una variable" y la llamamos puntos.
ca: Creem una nova variable. Al botó variable | Botó-Variables | Premeu \ "Creeu una variable " i anomeneu -la punts.

source: Las siguientes instrucciones inician los puntos a cero, reducen el tamaño del pingüino para hacer más difícil el juego y escogen uno de los disfraces disponibles para el pingüino.
ca: Les instruccions següents inicien els punts a zero, redueixen la mida del pingüí per dificultar el joc i triar un dels vestits disponibles per al pingüí.

source: Por último vamos a añadir movimiento al pingüino. Cada vez que se pulse una tecla de flecha, la posición del pingüino cambiará en un paso.
ca: Finalment, afegirem moviment al pingüí. Cada vegada que es pressiona una tecla de fletxa, la posició del pingüí canviarà en un pas.

source: Como podemos comprobar, el pingüino puede perseguir al pez pero todavía no se lo puede comer. Para que pueda comerse al pez será necesario añadir algunas instrucciones más.
ca: Com podem veure, el pingüí pot perseguir el peix, però encara no el podeu menjar. Per menjar al peix, caldrà afegir algunes instruccions més.

source: Seleccionamos al pingüino y en la pestaña de código añadimos el siguiente programa.
ca: Seleccionem el pingüí i a la pestanya Codi afegim el programa següent.

source: Ahora seleccionamos al pez y en la pestaña de código añadimos el siguiente programa.
ca: Ara seleccionem el peix i a la pestanya Codi afegiu el programa següent.

source: Retos
ca: Reptes

source: Añade más disfraces de peces al pez actual. Cada vez que el pingüino se coma al pez, aparecerá un pez distinto.
ca: Afegiu més disfresses de peix al peix actual. Cada vegada que el pingüí menja el peix, apareixerà un peix diferent.

source: Para conseguirlo utiliza la instrucción "siguiente disfraz" en el lugar adecuado.
ca: Per aconseguir -ho, utilitzeu la instrucció \ "Següent vestit " al lloc adequat.

source: Añade un personaje nuevo que reste puntos al comérselo. Por ejemplo, puede ser una medusa o "jellyfish".
ca: Afegiu un personatge nou que envia punts per menjar -lo. Per exemple, pot ser una medusa o \ "medusa ".

source: El programa será similar al de comer un pez, pero en esta ocasión restará puntos en vez de sumar.
ca: El programa serà similar a menjar un peix, però aquesta vegada restarà punts en lloc d’afegir.

source: El nuevo personaje que resta puntos debe aparecer cuando hayan pasado 10 segundos desde el inicio de la partida.
ca: El nou personatge que queda punts ha d’aparèixer quan han passat 10 segons des del començament del partit.

source: Añade un nuevo personaje, por ejemplo, un tiburón que se coma al pingüino al tocarle. En este caso el pingüino desaparece y la partida se acaba.
ca: Afegiu un personatge nou, per exemple, un tauró que menja el pingüí quan el toca. En aquest cas, el pingüí desapareix i el joc s’acaba.

source: El nuevo personaje que resta puntos debe aparecer cuando hayan pasado 20 segundos desde el inicio de la partida.
ca: El nou personatge que queda punts ha d’aparèixer quan han passat 20 segons des del començament del partit.
