Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/scratch-ladrillos.po
Languages: ca

source: Romper ladrillos
ca: Breaks Bricks

source: En esta práctica vamos a programar un juego que consiste en romper ladrillos con una pelota que rebota en una barra. Cada ladrillo roto nos dará un punto.
ca: En aquesta pràctica programarem un joc que consisteix a trencar els maons amb una pilota que rebota en un bar. Cada maó trencat ens donarà un punt.

source: Iniciamos el |editor_de_Scratch|.
ca: Comencem el | Editor_de_scratch |.

source: Borramos el gato presionando sobre él con el botón derecho del ratón y luego pulsamos borrar.
ca: Eliminem el gat prement -li amb el botó dret del ratolí i, a continuació, fem clic.

source: |borrar-gato|
ca: ; Suprimeix-Gato |

source: Añadimos tres personajes nuevos. Un botón azul, una pelota de tenis y un botón gris.
ca: Afegim tres personatges nous. Un botó blau, una bola de tennis i un botó gris.

source: A continuación cambiaremos los nombres de los tres nuevos personajes pulsando el botón azul "i" de cada uno de los personajes.
ca: A continuació, canviarem els noms dels tres personatges nous prement el botó blau \ "i " de cadascun dels personatges.

source: Al botón azul le nombraremos barra.
ca: Anomenem el botó blau.

source: A la pelota de tenis la nombraremos pelota.
ca: Anomenem la pilota de tennis.

source: Al botón gris le nombraremos ladrillo.
ca: Anomenem el maó al botó gris.

source: Ahora crearemos la variable **Puntos**.
ca: Ara crearem la variable ** punts **.

source: Dentro de la pestaña Datos |datos|,
ca: Dins de la pestanya Dades | Dades |,

source: pulsamos crear una variable |crear-variable|
ca: Premeu Creeu una variable | Create-variable |

source: Cambiamos el nombre de la variable a **Puntos**
ca: Canviem el nom de la variable per ** punts **

source: Por último pulsamos el botón **OK**
ca: Finalment, premeu el botó ** ok **

source: Esta variable va a almacenar los puntos que conseguimos rompiendo cada ladrillo.
ca: Aquesta variable emmagatzemarà els punts que obtenim cada maó.

source: Ahora crearemos la variable **position**.
ca: Ara crearem la variable ** posició **.

source: Cambiamos el nombre de la variable a **position**
ca: Canviem el nom de la variable a ** POSICIÓ **

source: Esta variable va a almacenar la posición de cada uno de los ladrillos al iniciar el programa.
ca: Aquesta variable emmagatzemarà la posició de cadascun dels maons en iniciar el programa.

source: Ahora añadiremos el programa de la **Barra**.
ca: Ara afegirem el ** bar **.

source: Primero seleccionamos la Barra y luego la pestaña programas.
ca: Primer seleccionem la barra i després la pestanya Programes.

source: Añadimos los siguientes bloques.
ca: Afegim els blocs següents.

source: A continuación añadiremos el programa de la **Pelota**.
ca: A continuació, afegirem el programa ** Ball **.

source: Por último añadiremos el programa del **Ladrillo**.
ca: Finalment, afegirem el programa ** de maó **.

source: Primero seleccionamos el Ladrillo y luego la pestaña programas.
ca: Primer seleccionem el maó i després la pestanya Programes.

source: Ahora probaremos que todos los programas funcionan correctamente jugando una partida.
ca: Ara demostrarem que tots els programes funcionen correctament jugant a un joc.

source: Ejercicios
ca: Exercicis

source: Modifica el programa para que aparezcan más ladrillos en la parte superior.
ca: Modifiqueu el programa de manera que apareguin més maons a la part superior.
