Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/scratch-manzanas.po
Languages: ca

source: Atrapar manzanas
ca: Agafar pomes

source: En esta práctica vamos a programar un juego que consiste en atrapar manzanas con el gato y evitar los rayos que matan. El gato se moverá con las teclas derecha e izquierda. Cuando el gato pierda sus tres vidas, el juego se acabará.
ca: En aquesta pràctica, programarem un joc que consisteix a agafar pomes amb el gat i evitar els rajos que maten. El gat es mourà amb les tecles dreta i esquerra. Quan el gat perd les seves tres vides, el joc s’acabarà.

source: Iniciamos el |editor_de_Scratch|.
ca: Comencem el | Editor_de_scratch |.

source: Cambiaremos el fondo del escenario a un **desierto**.
ca: Canviarem els antecedents a un ** desert **.

source: Pulsamos el botón de Fondo nuevo.
ca: Premeu el botó nou.

source: |cambia-escenario|
ca: ; CHANGE-SCENARY |

source: A continuación pulsamos en **Tema Naturaleza**.
ca: A continuació, fem clic al tema de la naturalesa ** **.

source: Luego seleccionamos el fondo **Desert**.
ca: A continuació, seleccionem el fons ** Desert **.

source: La pantalla quedará de la siguiente manera.
ca: La pantalla serà la següent.

source: Ahora debemos pulsar sobre el gato para realizar su programa. El icono del gato debe estar seleccionado.
ca: Ara hem de fer clic al gat per realitzar el vostre programa. Cal seleccionar la icona del gat.

source: |gato-seleccionado|
ca: ; Selected Cat |

source: Pulsando en la letra **i** dentro del icono gato, podemos cambiar su nombre.
ca: Premant a la lletra ** i ** dins de la icona del gat, podem canviar el vostre nom.

source: En la pestaña programas del gato crearemos una nueva función llamada **Inicio**
ca: A la pestanya Programes CAT crearem una nova funció anomenada ** Home **

source: Primero pulsamos en el botón más bloques
ca: Primer fem clic al botó més blocs

source: |mas-bloques|
ca: ; Mas-Blques |

source: A continuación pulsamos en crear un bloque |crear-bloque|
ca: A continuació, feu clic a Creació d’un bloc | Create-Bocate |

source: Luego cambiamos el nombre del nuevo bloque a **Inicio**
ca: A continuació, canviem el nom del nou bloc a ** start **

source: Por último pulsamos el botón **OK**
ca: Finalment, premeu el botó ** ok **

source: Ahora crearemos la variable **Vidas**.
ca: Ara crearem la variable ** vides **.

source: Dentro de la pestaña Datos |datos|,
ca: Dins de la pestanya Dades | Dades |,

source: pulsamos crear una variable |crear-variable|
ca: Premeu Creeu una variable | Create-variable |

source: Cambiamos el nombre de la variable a **Vidas**
ca: Canviem el nom de la variable a ** viu **

source: Esta variable va a almacenar las vidas que aún tiene el gato. Cuando su valor llegue a cero, el gato morirá.
ca: Aquesta variable emmagatzemarà les vides que encara té el gat. Quan el seu valor arribi a zero, el gat morirà.

source: Ahora escribiremos el bloque de **Inicio**.
ca: Ara escriurem el ** Block Block **.

source: Colocamos los siguientes bloques en **Inicio**.
ca: Col·loquem els següents blocs a ** start **.

source: Este programa le da tres vidas al gato al comenzar.
ca: Aquest programa dóna tres vides al gat al principi.

source: Coloca al gato en la parte baja de la pantalla, con el modo de rotación izquierda-derecha.
ca: Col·loqueu el gat a la pantalla inferior, amb el mode de rotació esquerra-dreta.

source: También borra todas las imágenes de la pantalla.
ca: També suprimeix totes les imatges de la pantalla.

source: Por último espera a que se pulse la tecla espacio para continuar.
ca: Finalment, espereu que continuï la clau d’espai.

source: Ahora programaremos un bloque que moverá al gato a derecha y a izquierda con las teclas de dirección. El nuevo bloque se llamará **Mover_gato**
ca: Ara programarem un bloc que mourà el gat a la dreta i a l’esquerra amb les tecles de direcció. El nou bloc s’anomenarà ** move_gato **

source: Para terminar este apartado, realizaremos un pequeño programa que pondrá a prueba todo lo que hemos programado hasta el momento.
ca: Per acabar aquesta secció, realitzarem un petit programa que posarà a prova tot el que hem programat fins ara.

source: Al presionar la bandera verde |bandera-verde|, el gato esperará primero a que presionemos la barra de espacio, a continuación el gato se moverá a izquierda y a derecha al presionar las **teclas izquierda y derecha**.
ca: En prémer la bandera verda | Flag-Verde |, el gat primer esperarà que pressionem la barra d'espai, i el gat es desplaçarà cap a l'esquerra i a la dreta prement les tecles ** esquerre i dret **.

source: Programa de las manzanas
ca: Programa de pomes

source: A partir de este punto, todas las instrucciones se deben añadir en la pestaña Programas del objeto **manzana**.
ca: A partir d’aquest punt, s’han d’afegir totes les instruccions a la pestanya Programes d’objectes ** Apple **.

source: Lo primero que haremos será añadir un nuevo personaje, una **manzana**
ca: El primer que farem serà afegir un personatge nou, un ** Apple **

source: Pulsamos el botón de nuevo objeto |nuevo-objeto|
ca: Premeu el botó d'objecte nou | Objecte nou |

source: A continuación pulsamos en **Categoría Cosas**.
ca: A continuació, fem clic a les coses de la categoria ** **.

source: Luego seleccionamos el objeto **Apple**.
ca: A continuació, seleccionem l'objecte ** Apple **.

source: Ahora crearemos una nueva variable llamada **Puntos**
ca: Ara crearem una nova variable anomenada ** punts **

source: Cambiamos el nombre de la variable a **Puntos**
ca: Canviem el nom de la variable per ** punts **

source: Esta variable contará los puntos que acumula el personaje del juego.
ca: Aquesta variable dirà als punts que s’acumula el personatge del joc.

source: El gato ganará un punto cada vez que atrape una manzana y perderá dos puntos si la manzana cae al suelo.
ca: El gat guanyarà un punt cada vegada que agafeu una poma i perdeu dos punts si la poma cau a terra.

source: Ahora añadimos un nuevo mensaje llamado **Iniciar**
ca: Ara afegim un missatge nou anomenat ** start **

source: Pulsamos el botón de Eventos.
ca: Premeu el botó Esdeveniments.

source: |eventos|
ca: ; Esdeveniments |

source: y movemos a programas el bloque "al recibir mensaje1".
ca: i passa als programes el bloc \ "recepció del missatge1 ".

source: Pinchando en la flecha, seleccionamos **nuevo mensaje...**
ca: Feu clic a la fletxa, seleccionem ** Missatge nou ... **

source: |nuevo-mensaje|
ca: ; New-Mesate |

source: Nombramos el nuevo mensaje como **Iniciar**.
ca: Anomenem el nou missatge com a ** Start **.

source: Este mensaje servirá para avisar a las **manzanas** de que pueden empezar a caer después de que se presione la tecla espacio.
ca: Aquest missatge servirà per notificar a les pomes ** ** que poden començar a caure un cop premuda la tecla Space.

source: También borra los puntos para iniciar la partida y los muestra en la pantalla.
ca: També suprimeix els punts per iniciar el joc i els mostra a la pantalla.

source: Ahora podemos programar las instrucciones necesarias para que caigan las manzanas al recibir el mensaje **Iniciar**.
ca: Ara podem programar les instruccions necessàries perquè les pomes caiguin en rebre el missatge ** start **.

source: El programa esconde el objeto para que no se vea en la pantalla, inicia el contador de puntos a cero, y crea copias de la manzana (clones de la manzana) cada cierto tiempo aleatorio, mientras el gato tenga vidas.
ca: El programa amaga l'objecte de manera que no es vegi a la pantalla, inicieu els punts a zero i creeu còpies de la poma (clons de la poma) de tant en tant aleatòria, mentre que el gat té vides.

source: Vamos a crear otro disfraz que represente a la manzana aplastada en el suelo en el suelo.
ca: Anem a crear un altre vestit que representi la poma aixafada a terra a terra.

source: Primero seleccionamos la pestaña disfraces |disfraces| de la manzana.
ca: Primer seleccionem la pestanya Vistumes | Disfresses | de la poma.

source: A continuación seleccionamos con el botón derecho del ratón sobre el disfraz de la manzana para duplicarle.
ca: A continuació, seleccionem amb el botó dret del ratolí del vestit de poma per doblar.

source: En el disfraz Apple2 recién creado, aplastamos la imagen.
ca: Amb el vestit de recentment creat Apple2, aixafem la imatge.

source: En este apartado definiremos cómo se comportan los clones de la manzana. Crearemos los siguientes programas.
ca: En aquesta secció definirem com es comporten els clons de poma. Crearem els programes següents.

source: La manzana se coloca en la parte superior de la pantalla y va cayendo poco a poco (cambiar y por -10) hasta que toque al gato o hasta que caiga al suelo.
ca: La poma es col·loca a la part superior de la pantalla i cau a poc a poc (canvi i per a -10) fins que toqui el gat o fins que caigui a terra.

source: Si la manzana toca al gato, aumenta los puntos y desaparece.
ca: Si la poma toca el gat, augmenta els punts i desapareix.

source: Si la manzana toca el suelo, se aplastara y sonará un golpe.
ca: Si la poma toca el terra, aixafarà i sonarà un cop.

source: El programa se ha dividido en varias funciones para simplificar cada uno de los bloques.
ca: El programa s'ha dividit en diverses funcions per simplificar cadascun dels blocs.

source: Ahora vamos a comprobar que funcionan las nuevas instrucciones. **Modificamos el programa del gato** para añadir el mensaje **Iniciar**
ca: Ara verificarem que les noves instruccions funcionen. ** Modifiquem el programa CAT ** per afegir el missatge ** inici **

source: En este momento, el gato podrá jugar a recoger manzanas. Debemos mover al gato con las flechas izquierda y derecha para que toque las manzanas antes de que caigan al suelo.
ca: En aquest moment, el gat pot jugar per recollir pomes. Hem de moure el gat amb les fletxes esquerre i dret per tocar les pomes abans que caiguin a terra.

source: Programa de los rayos
ca: Programa de raigs

source: En este apartado vamos a programar que varios rayos caigan desde lo alto y que quiten vidas al gato. De esta forma damos al juego mayor dificultad y emoción.
ca: En aquesta secció programarem que diversos rajos cauen des de dalt i que eliminen vides al gat. D’aquesta manera donem al joc més dificultats i emocions.

source: A partir de este punto, todas las instrucciones se deben añadir en la pestaña Programas del objeto **rayo**.
ca: A partir d’aquest punt, s’han d’afegir totes les instruccions a la pestanya Programes d’objectes ** Rayo **.

source: Lo primero que haremos será añadir un nuevo personaje, un **rayo**.
ca: El primer que farem és afegir un personatge nou, un ** ray **.

source: Luego seleccionamos el objeto **Lightning**.
ca: A continuació, seleccionem l'objecte ** Lightning **.

source: Ahora vamos a programar la caída de los rayos desde la parte alta de la pantalla. Al igual que pasaba con las manzanas, caerán rayos mientras el gato tenga vidas.
ca: Ara programem la caiguda dels raigs des de la part superior de la pantalla. Igual que amb les pomes, els rajos cauran mentre el gat tingui vides.

source: Vamos a añadir un sonido nuevo al rayo, para que el gato se queje al caerle un rayo.
ca: Afegirem un nou so al raig, de manera que el gat es queixa quan cau un raig.

source: Seleccionamos la pestaña Sonidos |sonidos| del rayo.
ca: Seleccionem la pestanya So | Sons | del raig.

source: Pulsamos en seleccionar un sonido nuevo desde la librería |sonido-nuevo|.
ca: Premeu per seleccionar un so nou a la llibreria | So-Now |.

source: En la **Categoría Animal** seleccionamos el sonido **meow**
ca: A la categoria ** animal ** Seleccionem el so ** meow **

source: Ahora debemos crear un programa para cada clon del rayo.
ca: Ara hem de crear un programa per a cada clon de raigs.

source: Estos programas situarán a cada rayo en una posición aleatoria cada vez que se cree un clon. A continuación el rayo caerá (cambiar y por -1) hasta que toque al gato o toque el borde inferior.
ca: Aquests programes situaran cada raig en una posició aleatòria cada vegada que es crei un clon. A continuació, el llamp caurà (canviarà i per -1) fins que toqui el gat o toqui la vora inferior.

source: Si el rayo toca al gato, le quitará una vida y se borra.
ca: Si el raig toca el gat, es traurà una vida i esborrarà.

source: Si el rayo toca el suelo, desaparece.
ca: Si el raig toca el terra, desapareix.

source: Comprobaremos pulsando la bandera verde |bandera-verde| que todo funciona bien.
ca: Comprovarem prement la bandera verda | Flag-Verde | Que tot funciona bé.

source: Muerte del gato
ca: Mort del gat

source: Cuando el gato pierde todas sus vidas el juego termina y dejan de caer manzanas y rayos, pero el gato sigue en movimiento. En esta sección vamos a añadir las instrucciones necesarias para que el gato parezca muerto al acabar el juego.
ca: Quan el gat perd tota la vida, el joc s’acaba i deixa de caure pomes i rajos, però el gat continua movent -se. En aquesta secció afegirem les instruccions necessàries perquè el gat sembli mort al final del joc.

source: A partir de este punto, todas las instrucciones se deben añadir en la pestaña Programas del objeto **gato**.
ca: A partir d’aquest punt, s’han d’afegir totes les instruccions a la pestanya Programes d’objectes ** Cat **.

source: Añadimos la función Gato_muere, que se ejecuta cuando el gato pierde todas sus vidas.
ca: Afegim la funció CAT_MUERE, que funciona quan el gat perd tota la vida.

source: Y modificamos el programa del gato.
ca: I modifiquem el programa del gat.

source: En este punto, para finalizar, vamos a añadir un sonido de fondo al juego.
ca: En aquest moment, per acabar, afegirem un so de fons al joc.

source: Prueba el juego para comprobar que todo funciona correctamente.
ca: Proveu el joc per comprovar que tot funciona correctament.

source: Ejercicios
ca: Exercicis

source: Modifica el programa para que el número de rayos aumente con el tiempo, de manera que el juego se haga cada vez más difícil.
ca: Modifiqueu el programa de manera que el nombre de raigs augmenti amb el pas del temps, de manera que el joc es faci cada cop més difícil.
