Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/scratch3-dibujar-espirales.po
Languages: ca

source: Dibujar espirales
ca: Dibuixa espirals

source: En esta práctica vamos a mover a un personaje por la pantalla para que dibuje varias espirales con colores.
ca: En aquesta pràctica mourem un personatge a la pantalla per dibuixar diverses espirals amb colors.

source: Iniciamos el |editor_de_Scratch|.
ca: Comencem el | Editor_de_scratch |.

source: Pulsamos el botón idioma |boton-idioma| en la barra superior y elegimos **Español**.
ca: Premeu el botó d'idioma | Botó-Idioma | A la barra superior i va triar ** espanyol **.

source: Añadimos una nueva variable **Lado** que guardará el tamaño del lado que se está dibujando en este momento.
ca: Afegim una nova variable ** costat ** que mantindrà la mida del costat que s’està dibuixant en aquest moment.

source: Pulsamos el botón de variables |boton-variables|,
ca: Premeu el botó variable | Botó-Variables |,

source: pulsamos en crear una variable |boton-crear-variable|.
ca: Premeu per crear una variable | Botó-Crear-Variable |.

source: Cambiamos el nombre de la variable a **Lado**
ca: Canviem el nom de la variable a ** costat **

source: Añadimos una nueva extensión con el botón **añadir extensión** |aniadir-extension| abajo a la izquierda.
ca: Afegim una nova extensió amb el botó ** ** | Aniadir-Extensió | fins a l’esquerra.

source: Seleccionamos la extensión **Lápiz** para poder dibujar.
ca: Seleccionem l’extensió ** llapis ** per dibuixar.

source: En la barra de código aparecerá un nuevo icono, el Lápiz |boton-lapiz|, con instrucciones de color verde oscuro.
ca: A la barra de codi apareixerà una nova icona, el llapis | Botó-lapiz |, amb instruccions de color verd fosc.

source: Creamos un nuevo bloque llamado **inicio**.
ca: Creem un nou bloc anomenat ** Home **.

source: Primero pulsamos en el botón mis bloques |boton-misbloques|
ca: Primer, feu clic als meus blocs | Botó-Misblos |

source: A continuación pulsamos en crear un bloque |boton-crear-bloque|
ca: A continuació, feu clic a Creació d’un bloc | Botó-Crear-Block |

source: Luego cambiamos el nombre del nuevo bloque a **inicio**
ca: A continuació, canviem el nom del nou bloc a ** start **

source: El bloque **inicio** servirá para iniciar el programa. Moverá al gato al centro de la pantalla con tamaño pequeño. Esconde la variable Lado, baja el lápiz para que pinte, establece el grosor y color del lápiz y borra la pantalla.
ca: El bloc ** Start ** servirà per iniciar el programa. Moure el gat al centre de la pantalla amb una mida petita. Amagueu la variable lateral, baixeu el llapis per pintar, configureu el gruix i el color del llapis i esborreu la pantalla.

source: Creamos un nuevo bloque llamado **cuadrado**.
ca: Creem un nou bloc anomenat ** Square **.

source: Luego cambiamos el nombre del nuevo bloque a **cuadrado**
ca: A continuació, canviem el nom del nou bloc A ** Square **

source: El bloque **cuadrado** servirá para dibujar una espiral cuadrada en la pantalla.
ca: El bloc ** quadrat ** servirà per dibuixar una espiral quadrada a la pantalla.

source: El tamaño del lado se inicia con el valor 5 y va creciendo de 4 en 4 hasta que valga igual o más que 340.
ca: La mida lateral comença amb el valor 5 i creix de 4 de cada 4 fins que val la pena igual o superior a 340.

source: En cada paso se dibuja una línea de tamaño "Lado", aumenta el tamaño del lado, gira 90º y aumenta el color del lápiz.
ca: A cada pas es dibuixa una línia de mida \ "costat ", augmenta la mida del costat, gira 90º i augmenta el color del llapis.

source: Si hacemos clic sobre el bloque **"definir cuadrado"**, en la pantalla aparecerá la espiral cuadrada.
ca: Si feu clic al bloc ** \ "Definir quadrat " **, apareixerà l'espiral quadrada a la pantalla.

source: Ahora vamos a crear un nuevo bloque llamado **triangulo**.
ca: Ara crearem un nou bloc anomenat ** Triangle **.

source: Luego cambiamos el nombre del nuevo bloque a **triangulo**
ca: A continuació, canviem el nom del nou bloc a ** triangle **

source: El bloque **triángulo** es muy parecido al bloque **cuadrado**, solo cambia el ángulo de giro.
ca: El bloc ** Triangle ** és molt similar al bloc ** quadrat **, només cal canviar l'angle de rotació.

source: Para aprovechar el programa ya realizado, vamos a pulsar con el botón derecho del ratón sobre las instrucciones de **cuadrado** y elegimos la opción duplicar.
ca: Per aprofitar el programa ja fet, prémerem amb el botó dret del ratolí a les instruccions ** quadrat ** i triarem l’opció duplicada.

source: una vez duplicado el programa, lo enganchamos en el bloque triángulo y cambiamos el ángulo de giro.
ca: Un cop el programa duplicat, el enganxem al bloc del triangle i canviem l’angle de rotació.

source: Si hacemos clic sobre el bloque **"definir triangulo"**, en la pantalla aparecerá la espiral triangular.
ca: Si fem clic al bloc ** \ "Definir el triangle " **, l'espiral triangular apareixerà a la pantalla.

source: Retos
ca: Reptes

source: Haz un nuevo bloque que dibuje una espiral en estrella. Modifica los parámetros del nuevo bloque para girar 150 grados.
ca: Feu un bloc nou que dibuixi una espiral estrella. Modifiqueu els paràmetres del nou bloc per girar 150 graus.

source: Crea un nuevo bloque para dibujar una espiral octogonal. Los giros deben ser de 45 grados. El lado debe sumar 1 en cada repetición y se debe repetir hasta que el lado sea mayor que 150.
ca: Creeu un bloc nou per dibuixar una espiral octogonal. Les voltes han de ser de 45 graus. The side must add 1 in each repetition and should be repeated until the side is greater than 150.

source: Experimenta con el programa para crear nuevos dibujos originales.
ca: Experimenteu amb el programa per crear nous dibuixos originals.
