Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/scratch3-jugar-futbol.po
Languages: ca

source: Jugar al fútbol
ca: Juga a futbol

source: En esta práctica vamos a programar a dos personajes que jugarán al fútbol pasándose un balón de uno a otro.
ca: En aquesta pràctica programarem dos personatges que jugaran a futbol passant una pilota d’un a l’altre.

source: Iniciamos el |editor_de_Scratch|.
ca: Comencem el | Editor_de_scratch |.

source: Pulsamos el botón idioma |boton-idioma| en la barra superior y elegimos **Español**.
ca: Premeu el botó d'idioma | Botó-Idioma | A la barra superior i va triar ** espanyol **.

source: Pulsamos el botón de tutoriales |boton-tutoriales| y luego el botón de animación |boton-animacion|.
ca: Premeu el botó tutorial | Botons-Tutorials | I després el botó d’animació | Botó-animació |.

source: Seleccionamos el tutorial "Deslizarse" y lo visualizamos.
ca: Seleccionem el tutorial \ "diapositiva " i el visualitzem.

source: Después seleccionamos el tutorial "Animar un objeto" y lo visualizamos.
ca: A continuació, seleccionem el tutorial \ "Animeu un objecte " i el visualitzem.

source: En estos dos tutoriales veremos el funcionamiento básico del programa. Una vez terminados los tutoriales vamos a crear un programa en el que dos personajes dan patadas a un balón que se desplaza por la pantalla.
ca: En aquests dos tutorials, veurem el funcionament bàsic del programa. Un cop finalitzats els tutorials, crearem un programa en què dos personatges xuten una bola que es mou al llarg de la pantalla.

source: Borramos el objeto gato presionando sobre el icono del cubo de basura.
ca: Eliminem l'objecte CAT prement a la icona del cub d'escombraries.

source: |borrar-gato|
ca: ; Suprimeix-Gato |

source: Ahora escogemos un fondo adecuado para nuestro juego. Cambiamos el fondo de escenario a un **campo de futbol**.
ca: Ara escollim un fons adequat per al nostre joc. Canviem el fons de l'escenari per un camp de futbol ** **.

source: Pulsamos el botón elige un fondo |seleccionar-fondo|.
ca: Premeu el botó Trieu un fons | Select-Fondo |.

source: Buscamos en la sección **Exteriores**.
ca: Estem buscant a la secció exterior ** **.

source: y seleccionamos el fondo **Playing Field**.
ca: I seleccionem el fons ** camp de joc **.

source: A continuación añadimos un nuevo personaje, un **niño**.
ca: A continuació, afegim un personatge nou, un ** Child **.

source: Pulsamos el botón elige un objeto |seleccionar-objeto|.
ca: Premeu el botó Trieu un objecte | Select-objecte |.

source: Buscamos en la sección **Gente**.
ca: Estem buscant a la secció ** persones **.

source: y seleccionamos el objeto **Ben**.
ca: i seleccionem l'objecte ** Ben **.

source: Vamos a programar la posición inicial del niño. Movemos al niño a la posición deseada y en el botón movimiento |boton-movimiento| elegimos la instrucción |instruccion-iraxy|.
ca: Anem a programar la posició inicial del nen. Movem el nen a la posició desitjada i al botó de moviment | Botó-Movimiento | Hem escollit la instrucció | Instrucció-EXY |.

source: En el botón apariencia |boton-apariencia| elegimos el disfraz inicial del niño.
ca: Al botó d'aparença | Aparició de botons | Hem escollit el vestit inicial del nen.

source: Añadimos un nuevo personaje, una **niña**.
ca: Afegim un nou personatge, una ** noia **.

source: y seleccionamos el objeto **Jordyn**.
ca: i seleccionem l'objecte ** Jordyn **.

source: Vamos a programar la posición inicial de la niña. Movemos a la niña a la posición deseada y en el botón movimiento |boton-movimiento| elegimos la instrucción |instruccion-iraxy|.
ca: Anem a programar la posició inicial de la noia. Movem la noia a la posició desitjada i al botó de moviment | Botó-Movimiento | Hem escollit la instrucció | Instrucció-EXY |.

source: En el botón apariencia |boton-apariencia| elegimos el disfraz inicial de la niña.
ca: Al botó d'aparença | Aparició de botons | Hem escollit el vestit inicial de la noia.

source: Por último, dentro del objeto Jordyn, pulsamos en la opción de dirección y fijamos el giro a -90 grados y de izquierda a derecha pulsando en las dos flechas enfrentadas. De esta manera la niña no quedará boca arriba al girar en sentido contrario.
ca: Finalment, dins de l’objecte Jordyn, feu clic a l’opció d’adreça i configureu el gir a -90 graus i d’esquerra a dreta fent clic a les dues fletxes enfrontades. D’aquesta manera, la noia no serà la boca del sentit contrari.

source: Añadimos un nuevo personaje, un **balón de futbol**.
ca: Afegim un nou personatge, una bola de futbol ** **.

source: Buscamos en la sección **Deportes**.
ca: Estem buscant a la secció ** Sports **.

source: y seleccionamos el objeto **Soccer Ball**.
ca: i seleccionem l'objecte ** Ball de futbol **.

source: Programamos el movimiento del balón con dos deslizamientos a la izquierda y dos deslizamientos a la derecha, siguiendo las instrucciones del tutorial. Los dos movimientos a cada lado se utilizan para que parezca que el balón sube y baja de un lado a otro.
ca: Programem el moviment de la pilota amb dues esllavissades a l’esquerra i dues esllavissades a la dreta, seguint les instruccions del tutorial. Els dos moviments de cada costat s’utilitzen per semblar que la pilota s’aixeca i baixa d’un costat a un altre.

source: Pulsamos la bandera verde |bandera-verde| para probar el funcionamiento del programa.
ca: Premeu la bandera verda | Flag-Verde | Per provar el funcionament del programa.

source: El balón debe moverse a un lado y a otro entre las piernas de los dos personajes.
ca: La bola s’ha de moure cap a un costat i una altra entre les cames dels dos personatges.

source: Ahora vamos a coordinar a todos los objetos mediante mensajes para que los niños golpeen el balón cuando les llegue a los pies.
ca: Ara coordinarem tots els objectes a través de missatges perquè els nens toquin la pilota quan arribin als peus.

source: Primero modificamos el código del balón para que envíe mensajes al llegar a cada uno de los extremos.
ca: Primer modifiquem el codi de bola per enviar missatges quan arribeu a cada extrem.

source: El **mensaje2** se consigue pulsando en nuevo mensaje para crearlo.
ca: El ** Message2 ** s’aconsegueix prement un missatge nou per crear -lo.

source: Seleccionamos al **objeto Ben** para añadir el siguiente programa.
ca: Seleccionem a l'objecte ** Ben ** per afegir el programa següent.

source: Seleccionamos al **objeto Jordyn** para añadir el siguiente programa.
ca: Seleccionem l'objecte ** Jordyn ** per afegir el programa següent.

source: Retos
ca: Reptes

source: Añade un nuevo personaje que se mueva dando vueltas pasando por las cuatro esquinas del campo de futbol.
ca: Afegiu un nou personatge que mogui el cercle per les quatre cantonades del camp de futbol.

source: Utiliza la orden deslizar en 1 segundo hasta una posición.
ca: Utilitzeu la diapositiva de la comanda en 1 segon a una posició.

source: Añade un nuevo personaje, Casey, para que juegue al balón con los otros dos. El balón debe ir desde un personaje hasta el siguiente hasta que pase por los tres personajes y el ciclo vuelva a comenzar.
ca: Afegiu un personatge nou, Casey, per jugar la pilota amb els altres dos. La pilota ha d’anar d’un personatge a l’altre fins que passa pels tres personatges i el cicle torna a començar.

source: Añade otros dos personajes al juego desde la pestaña Deportes. Uno debe ser un lanzador (Pitcher) y el otro un bateador (Batter). El lanzador lanzará una pelota de baseball al bateador. El bateador dará un golpe a la pelota, que volverá al lanzador.
ca: Afegiu altres dos personatges al joc de la pestanya Sports. Un ha de ser un càntir (càntir) i l’altre un batedor (batedor). El càntir llançarà una pilota de beisbol al batedor. El batedor colpejarà la pilota, que tornarà al càntir.
