Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/scratch-dibuja-disfraz.po
Languages: ca

source: Dibujar disfraces
ca: Dibuixar disfresses

source: En esta práctica vamos a programar un juego que consiste en dibujar diferentes personajes por la pantalla con diferentes tamaños, giros y posiciones.
ca: En aquesta pràctica programarem un joc que consisteix a dibuixar diferents caràcters a la pantalla amb diferents mides, girs i posicions.

source: Iniciamos el |editor_de_Scratch|.
ca: Comencem el | Editor_de_scratch |.

source: En la pestaña disfraces, borramos uno de los gatos y añadimos varios personajes más.
ca: A la pestanya Disfresses, eliminem un dels gats i afegim diversos personatges.

source: A continuación programamos las siguientes instrucciones.
ca: Aquí teniu les instruccions següents.

source: En este momento podemos jugar con la pantalla a dibujar personajes con los siguientes controles.
ca: En aquest moment podem jugar amb la pantalla per dibuixar personatges amb els controls següents.

source: Flecha arriba = Más tamaño
ca: Fletxa amunt = més mida

source: Flecha abajo = Menos tamaño
ca: Per sota de la fletxa = menys mida

source: Flecha derecha = Girar a la derecha el disfraz
ca: Fletxa dreta = gira la disfressa

source: Flecha izquierda = Girar a la izquierda el disfraz
ca: Fletxa esquerra = gireu a l'esquerra la disfressa

source: Tecla Espacio = Cambiar el disfraz a otro personaje
ca: Clau d'espai = canvieu la disfressa a un altre personatge

source: Clic con el ratón = Hacer copia del disfraz en la pantalla
ca: Feu clic amb el ratolí = feu una còpia de la disfressa a la pantalla

source: Ejercicios
ca: Exercicis

source: Realiza un dibujo artístico en el que aparezcan todos los disfraces en algún escenario.
ca: Feu un dibuix artístic en què apareguin tots els vestits en algun escenari.

source: Añade nuevos disfraces para poder dibujar también otros objetos.
ca: Afegiu nous vestits per poder dibuixar altres objectes.

source: Modifica el programa para que al sellar el disfraz (clic del ratón) aparezcan seis imágenes del disfraz girados cada uno 60 grados.
ca: Modifiqueu el programa de manera que quan segelleu la disfressa (feu clic al ratolí) sis imatges del vestit girades cada 60 graus apareixen.

source: Modifica el programa para que al sellar el disfraz (clic del ratón) aparezcan cuatro imágenes del disfraz del tamaño original, un 50%, un 25%
ca: Modifiqueu el programa de manera que quan segelleu la disfressa (feu clic al ratolí), apareixen quatre imatges del vestit de mida original, 50%, 25%
