Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/taller-tesela-sombrero.po
Languages: ca

source: Teselado del sombrero
ca: Barret teslate

source: Un `teselado <https://es.wikipedia.org/wiki/Teselado>`__ es una forma de rellenar un plano repitiendo un conjunto de figuras, llamadas teselas, de forma infinita. Normalmente los teselados son periódicos, es decir, que se repiten una y otra vez.
ca: Un `Teselado <https://es.wikipedia.org/wiki/teselado>`__ és una manera d’omplir un avió repetint un conjunt de figures, anomenades Tessels, infinitament. Normalment els tesels són diaris, és a dir, es repeteixen una i altra vegada.

source: El teselado del sombrero es el primer teselado no periódico del plano con una sola tesela. La tesela ha sido descubierta en marzo de 2023 y ha sido un logro matemático de primer orden.
ca: La rajola del barret és el primer Tesseld de paper no nou del pla amb una sola Tesela. La Tesela ha estat descoberta el març del 2023 i ha estat un primer èxit matemàtic.

source: A continuación se puede ver el teselado del sombrero hecho con una sola tesela.
ca: A continuació, podeu veure els Tesselves del barret fet amb una sola Telela.

source: Teselado con tesela sombrero. Las teselas están coloreadas con cuatro colores, de manera que ninguna tesela toca otra del mismo color.
ca: Tesseld amb barret de Teasela. Les rajoles estan acolorides amb quatre colors, de manera que cap Tesla toca un altre del mateix color.

source: :download:`Teselado sombrero. Formato PDF. <taller/taller-figura-hat-03c.pdf>`
ca: : Descarregueu: `Teselado Hat. Format PDF. <Workshop/figura-hat-03c.pdf> '

source: Ejercicio
ca: Exercir

source: Imprime el siguiente documento en el que aparecen teselas sombrero. Coloca las teselas en un plano para que formen un teselado no periódico. Colorea las teselas con cuatro colores distintos, de manera que no se toquen dos teselas con colores iguales.
ca: Imprimeix el document següent en què apareixen els barrets. Col·loqueu les rajoles en un pla per formar un Tesseld no periòdic. Les rajoles de color amb quatre colors diferents, de manera que no es toquen dues rajoles amb colors iguals.

source: :download:`Teselas sombrero. Formato PDF. <taller/taller-figura-hat-02.pdf>`
ca: : Descarregueu: `Tessels Hat. Format PDF. <Workshop/figura-hat-02.pdf> '

source: :download:`Teselas sombrero. Formato editable SVG. <taller/taller-figura-hat-02.svg>`
ca: : Descarregueu: `Tessels Hat. Format editable SVG. <Workshop/figura-hat-02.svg> '
