Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/taller-tangram.po
Languages: ca

source: Tangram
ca: Tangrama

source: El `tangram <https://es.wikipedia.org/wiki/Tangram>`__ es un juego chino muy antiguo, que consiste en formar siluetas de figuras con las siete piezas dadas sin solaparlas. Las 7 piezas, llamadas "Tans", son las siguientes:
ca: El `Tangram <https://es.wikipedia.org/wiki/tangram>`__ és un joc xinès molt antic, que consisteix a formar siluetes de figures amb les set peces que es donen sense sobreposar -les. Les 7 peces, anomenades \ "tanans ", són les següents:

source: 5 triángulos, dos construidos con la diagonal principal del mismo tamaño, los dos pequeños de la franja central también son del mismo tamaño y uno de tamaño medio ubicado en una esquina.
ca: 5 triangles, dos construïts amb la diagonal principal de la mateixa mida, els dos fills de la franja central també són de la mateixa mida i un de mida mitjana situada en un cantó.

source: 1 cuadrado.
ca: 1 quadrat.

source: 1 paralelogramo o romboide.
ca: 1 Paral·lelograma o Rhomboid.

source: Normalmente los "Tans" se guardan formando un cuadrado.
ca: Normalment els \ "tanans " es mantenen formant un quadrat.

source: :download:`Tangram con piezas unidas. Formato PDF. <taller/taller-tangram-01.pdf>`
ca: : Descarregueu: `Tangram amb peces unides. Format PDF. <Workshop/Workshop-01.pdf>`

source: :download:`Tangram con piezas separadas. Formato PDF. <taller/taller-tangram-02.pdf>`
ca: : Descarregueu: `Tangrama amb peces separades. Format PDF. <Workshop/Workshop-02.pdf>`

source: :download:`Tangram con piezas unidas y coloreadas. Formato PDF. <taller/taller-tangram-03.pdf>`
ca: : Descarregueu: `Tangrama amb peces unides i de colors. Format PDF. <Workshop/Workshop-03.pdf>`

source: :download:`Tangram con piezas unidas. Formato SVG. <taller/taller-tangram-01.svg>`
ca: : Descarregueu: `Tangram amb peces unides. Format SVG. <Workshop/Workshop-01.svg>`

source: :download:`Tangram con piezas separadas. Formato SVG. <taller/taller-tangram-02.svg>`
ca: : Descarregueu: `Tangrama amb peces separades. Format SVG. <Workshop/Workshop-02.svg>`

source: :download:`Tangram con piezas unidas y coloreadas. Formato SVG. <taller/taller-tangram-03.svg>`
ca: : Descarregueu: `Tangrama amb peces unides i de colors. Format SVG. <Workshop/Workshop-03.svg>`

source: Figuras con tangram
ca: Figures amb tangrama

source: Figuras de ejemplo realizadas con el tangram.
ca: Exemple de figures fetes amb el tangrama.

source: :download:`Figuras con tangram. Formato PDF. <taller/taller-tangram-04.pdf>`
ca: : Descàrrega: `Figures amb Tangram. Format PDF. <Workshop/Workshop-04.pdf>`

source: :download:`Figuras con tangram. Formato SVG. <taller/taller-tangram-04.svg>`
ca: : Descàrrega: `Figures amb Tangram. Format SVG. <Workshop/Workshop-04.svg>`
