Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/taller-papercraft.po
Languages: ca

source: Modelos de papel de figuras en 3D
ca: Figures 3D Models de paper

source: Modelos de papel (papercraft) de figuras en tres dimensiones.
ca: Models de paper de paper) de tres dimensions.

source: Figuras simples
ca: Xifres simples

source: :download:`Figura en 3D 01. Formato PDF. <taller/taller-figura-3d-01.pdf>`
ca: : Descarregueu: `Figura en format 3d 01. PDF. <Workshop/Figura-3D-01.pdf> `

source: :download:`Figura en 3D 01. Formato SVG. <taller/taller-figura-3d-01.svg>`
ca: : Descarregueu: `Figura en format 3d 01. SVG. <Workshop/Figura-3D-01.svg> '

source: :download:`Figura en 3D 02. Formato PDF. <taller/taller-figura-3d-02.pdf>`
ca: : Descàrrega: `Figura en format 3d 02. PDF. <Workshop/Workshop-3d-02.pdf> '

source: :download:`Figura en 3D 02. Formato SVG. <taller/taller-figura-3d-02.svg>`
ca: : Descàrrega: `Figura en format 3d 02. SVG. <Workshop/Figura-3D-02.svg> '

source: :download:`Figura en 3D 03. Formato PDF. <taller/taller-figura-3d-03.pdf>`
ca: : Descarregueu: `Figura en format 3d 03. PDF. <Workshop/Workshop-3d-03.pdf> '

source: :download:`Figura en 3D 03. Formato SVG. <taller/taller-figura-3d-03.svg>`
ca: : Descarregueu: `Figura en format 3d 03. SVG. <Workshop/Workshop-3d-03.svg> '

source: :download:`Figura en 3D 04. Formato PDF. <taller/taller-figura-3d-04.pdf>`
ca: : Descàrrega: `Figura en format 3d 04. PDF. <Workshop/Workshop-3d-04.pdf> '

source: :download:`Figura en 3D 04. Formato SVG. <taller/taller-figura-3d-04.svg>`
ca: : Descarregueu: `Figura en format 3d 04. SVG. <Workshop/Workshop-3d-04.svg> '

source: Figuras con rampas
ca: Figures amb rampes

source: :download:`Figura en 3D 05. Formato PDF. <taller/taller-figura-3d-05.pdf>`
ca: : Descàrrega: `Figura en format 3d 05. PDF. <Workshop/Workshop-3d-05.pdf> '

source: :download:`Figura en 3D 05. Formato SVG. <taller/taller-figura-3d-05.svg>`
ca: : Descàrrega: `Figura en format 3d 05. SVG. <Workshop/Figura-3D-05.svg> '

source: :download:`Figura en 3D 06. Formato PDF. <taller/taller-figura-3d-06.pdf>`
ca: : Descàrrega: `Figura en format 3d 06. PDF. <Workshop/Workshop-3d-06.pdf> '

source: :download:`Figura en 3D 06. Formato SVG. <taller/taller-figura-3d-06.svg>`
ca: : Descarregueu: `Figura en format 3d 06. SVG. <Workshop/Workshop-3d-06.svg> '

source: :download:`Figura en 3D 07. Formato PDF. <taller/taller-figura-3d-07.pdf>`
ca: : Descarregueu: `Figura en format 3d 07. PDF. <Workshop/Workshop-3d-07.pdf> '

source: :download:`Figura en 3D 07. Formato SVG. <taller/taller-figura-3d-07.svg>`
ca: : Descarregueu: `Figura en format 3d 07. SVG. <Workshop/Figura-3D-07.svg> '
