Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/tecno-tecnologias.po
Languages: ca

source: Tecnologías
ca: Tecnologies

source: Tecnología
ca: Tecnologia

source: Productos
ca: Productes

source: Profesionales
ca: Professionals

source: Construcción
ca: Construcció

source: Casas, edificios, parques y jardines
ca: Cases, edificis, parcs i jardins

source: Albañil, fontanero/a, Arquitecto/a
ca: Maçon, lampista, arquitecte

source: Transporte por carretera
ca: Transport per carretera

source: Automóviles, motos, Camiones, autobuses
ca: Cotxes, motocicletes, camions, autobusos

source: Mecánicos,
ca: Mecànica,

source: Telecomunicaciones
ca: Telecomunicació

source: Radio, Televisión, Teléfono, Fibra óptica WiFi.
ca: Ràdio, televisió, telèfon, fibra òptica wifi.

source: Antenista, Ingeniero/a telecomunicaciones
ca: Antenista, enginyer de telecomunicacions

source: Alimentación
ca: Alimentació

source: Granjas de animales, Cultivos, Huertas Mataderos,
ca: Granges animals, conreus, ordres de matança,

source: Agricultores, Ganaderos, Ingenieros Agrónomos
ca: Agricultors, agricultors, enginyers agrònoms

source: Mecánica
ca: Mecànica

source: Mecánicos
ca: Mecànica

source: Electricidad
ca: Electricitat

source: Instalaciones eléctricas
ca: Instal·lacions elèctriques

source: Electricista, Ingeniero/a Eléctrico
ca: Electricista, enginyer elèctric

source: Electrónica
ca: Electrònica

source: Automatismos
ca: Automatismes

source: Ascensores,
ca: Ascensors,

source: Informática
ca: Informàtica

source: Transporte aeroespacial ------------------- Transporte naval
ca: Transport aeroespacial ------------------ Transport naval

source: Aviones, helicópteros, satélites, cohetes,
ca: Avions, helicòpters, satèl·lits, coets,

source: Ingeniero/a aeronáutico
ca: Enginyer aeronàutic

source: Vestimentas
ca: Ropa

source: Evacuación de residuos
ca: Evacuació de residus

source: Pinturas, fertilizantes
ca: Pintures, fertilitzants
