Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/writer-estilo-pagina.po
Languages: ca

source: Estilo de página
ca: Estil de pàgina

source: En este ejercicio vamos a configurar el **estilo de la página** donde luego podemos escribir. El estilo de la página define el tamaño de la hoja de papel, los márgenes, el fondo impreso en el papel, la cabecera de cada hoja y otras opciones.
ca: En aquest exercici, configurarem l’estil ** de la pàgina ** on podem escriure. L’estil de la pàgina defineix la mida del full de paper, els marges, el fons imprès al paper, el cap de cada full i altres opcions.

source: Abrimos un **nuevo documento de texto** en Writer.
ca: Obrim un ** nou document de text ** a Writer.

source: Ahora vamos a cambiar el **factor de escala** de la ventana para poder ver mejor el texto según lo escribimos.
ca: Ara canviarem el factor d’escala ** ** de la finestra per poder veure millor el text mentre escrivim.

source: En la parte **inferior derecha** de la ventana, cambiaremos el factor de escala a **120%** pulsando el botón - o el botón +.
ca: A la part inferior dreta ** de la finestra, canviarem el factor d’escala a ** 120%** prement el botó o el botó +.

source: Seleccionamos el menú de ``Formato... Estilo de página...``
ca: Seleccionem el menú `` Format ...

source: Y seleccionamos la **pestaña de Página** dentro de la ventana que se ha abierto.
ca: I seleccionem la pestanya ** pàgina ** dins de la finestra que s'ha obert.

source: Ahora configuramos el **Formato de papel** en A5 (tamaño de 148x210mm)
ca: Ara configurem el format ** de paper ** a A5 (mida de 148x210mm)

source: Cambiamos todos los **Márgenes** del papel a 15mm.
ca: Canviem tots els marges ** del paper a 15 mm.

source: A continuación seleccionamos la **pestaña de Área**, seleccionamos el botón **Mapa de bits** y escogemos el dibujo de papel arrugado.
ca: A continuació, seleccionem la pestanya Area ** **, seleccionem el botó de mapa ** bits ** i triem el dibuix de paper de dibuix.

source: Este será el fondo de nuestro texto.
ca: Aquest serà el fons del nostre text.

source: Continuamos seleccionamos la **pestaña de Transparencia** y cambiamos la transparencia al 50% para que el fondo del papel sea un poco más claro
ca: Continuem seleccionant la pestanya ** transparència ** i canviem la transparència a un 50% de manera que la part inferior del paper sigui una mica més clara

source: Por último en la **pestaña de Cabecera** pinchamos en **Activar cabecera**. Esto permitirá escribir un texto en la parte superior de la hoja que aparecerá en todas las páginas.
ca: Finalment a la pestanya ** de capçalera ** Fem clic a ** Activar Header **. Això permetrà escriure un text a la part superior del full que apareixerà a totes les pàgines.

source: Una vez terminado pulsamos en el botón de **Aceptar**
ca: Un cop finalitzat, feu clic al botó ** Accepta **

source: Ahora la ventana de Writer tendrá el siguiente aspecto.
ca: Ara es veurà la finestra de l'escriptor.

source: A continuación vamos a **escribir en la cabecera** de la página.
ca: A continuació, escriurem a la capçalera ** de la pàgina.

source: Para escribir en la cabecera pincharemos dos veces con el ratón en la parte superior de la hoja y el cursor se situará en la cabecera.
ca: Per escriure a la capçalera, farem clic dues vegades amb el ratolí a la part superior de la fulla i el cursor es situarà al cap.

source: Para volver a escribir en el área normal de texto, vuelve a pinchar con el ratón dos veces en la parte inferior de la hoja.
ca: Per reescriure a l’àrea de text normal, feu clic amb el ratolí dues vegades a la part inferior del full.

source: Escribe el siguiente texto.
ca: Escriviu el text següent.
