Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/writer-copiar-pegar.po
Languages: ca

source: Copiar y pegar
ca: Copiar i enganxar

source: En este ejercicio vamos a aprender a **copiar y pegar texto e imágenes** en Writer.
ca: En aquest exercici aprendrem a ** copiar i enganxar text i imatges ** a Writer.

source: Abrimos un **nuevo documento de texto** en Writer.
ca: Obrim un ** nou document de text ** a Writer.

source: Ahora vamos a cambiar el **factor de escala** de la ventana para poder ver mejor el texto según lo escribimos.
ca: Ara canviarem el factor d’escala ** ** de la finestra per poder veure millor el text mentre escrivim.

source: En la parte **inferior derecha** de la ventana, cambiaremos el factor de escala a **120%** pulsando el botón - o el botón +.
ca: A la part inferior dreta ** de la finestra, canviarem el factor d’escala a ** 120%** prement el botó o el botó +.

source: Buscamos información en Wikipedia sobre algún inventor, por ejemplo, **Nikola Tesla**.
ca: Estem buscant informació sobre Wikipedia sobre un inventor, per exemple, ** Nikola Tesla **.

source: Seleccionamos el primer párrafo de texto de Wikipedia y lo copiamos manteniendo pulsada la tecla control |tecla-control| y pulsando a continuación la tecla C |tecla-c|.
ca: Seleccionem el primer paràgraf de text de Wikipedia i el copiem mantenint la clau de control | Control de clau | i després feu clic a C | Key-C |.

source: Otra forma de copiar es seleccionar el texto, pinchar con el botón derecho del ratón y seleccionar **copiar**.
ca: Una altra manera de copiar és seleccionar el text, feu clic amb el botó dret del ratolí i seleccioneu ** Copia **.

source: Una vez copiado el texto, volvemos a Writer y **pegamos el texto** manteniendo pulsada la tecla control |tecla-control| y pulsando la tecla V |tecla-v|.
ca: Un cop copiat el text, tornem a l’escriptor i ** enganxem el text ** mantenint la clau de control | Control de clau | I fent clic a la tecla V | clau clau |.

source: Otra forma de pegar el texto es pinchar con el botón derecho del ratón y seleccionar pegar.
ca: Una altra manera de prémer el text és fer clic amb el botó dret del ratolí i seleccionar la pasta.

source: Una vez pegado, veremos que el texto aparece con enlaces a otras páginas web. Los enlaces se verán en color azul subrayado.
ca: Un cop adjunt, veurem que el text apareix amb enllaços a altres pàgines web. Els enllaços estaran subratllats.

source: Para que no aparezcan los enlaces es necesario pegar el texto sin formato.
ca: De manera que els enllaços no semblen, cal enganxar el text sense format.

source: Primero vamos a deshacer el pegado anterior con el botón deshacer |button-deshacer-accion| o con la combinación de teclas control |tecla-control| y Z |tecla-z|.
ca: Primer anem a desfer el botó anterior amb el botó desfer | Button-Desex-Action | o amb la combinació de tecles de control | Control de clau | i z | Key-Z |.

source: Ahora seleccionamos en el menú ``Editar... Pegado especial... Pegar texto sin formato``.
ca: Ara seleccionem al `` editar ... Stick especial ... Enganxeu el text sense format ''.

source: También podemos pinchar con el botón derecho del ratón y seleccionar ``Pegado especial... Texto sin formato``
ca: També podem fer clic amb el botó dret del ratolí i seleccionar `` cola especial ... text sense format ''

source: El aspecto del texto será el siguiente.
ca: L’aparició del text serà la següent.

source: Por último vamos a **copiar la imagen** de Tesla de la Wikipedia.
ca: Finalment, copiarem la imatge de Tesla de la Viquipèdia.

source: Primero pinchamos con el botón derecho del ratón sobre la imagen y seleccionamos ``Copiar imagen``
ca: Primer fem clic amb el botó dret del ratolí de la imatge i seleccionem `` Copia imatge ''

source: A continuación pinchamos en el comienzo del texto en Writer y pegamos la imagen con el botón derecho del ratón o pulsando la combinación de teclas control |tecla-control| más la tecla V |tecla-v|.
ca: A continuació, feu clic a l’inici del text a l’escriptor i enganxem la imatge amb el botó dret del ratolí o prement la combinació de tecles de control | Control de clau | A més de la clau V | clau clau |.

source: El resultado será el siguiente.
ca: El resultat serà el següent.

source: Créditos
ca: Crèdits

source: El texto utilizado en este ejercicio está basado, con cambios, en el `artículo de Wikipedia sobre Nikola Tesla <https://es.wikipedia.org/wiki/Nikola_Tesla>`__, bajo `licencia CC BY-SA 3.0 <https://creativecommons.org/licenses/by-sa/3.0/>`__, via Wikimedia Commons
ca: El text que s’utilitza en aquest exercici es basa, amb canvis, a l’article de Wikipedia sobre Nikola Tesla <https://es.wikipedia.org/wiki/nikola_tesla> `__, a` llicència cc by-sa 3.0 <https://creativecommons.org/licenses/by-sa/3.0/> `` `` `` `` `` `` `` `` `` `Wikimedia Commons

source: `La imagen utilizada es de Napoleon Sarony <https://commons.wikimedia.org/wiki/File:Tesla_Sarony.jpg>`__, con licencia de dominio público, via Wikimedia Commons
ca: "La imatge utilitzada és de Napoleon Sarary <https://commons.wikimedia.org/wiki/file:tesla_sarony.jpg>`__, amb una llicència de domini públic, a través de Wikimedia Commons
