Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/writer-texto-resaltado.po
Languages: ca

source: Texto resaltado
ca: Text destacat

source: En este ejercicio utilizaremos las herramientas para **resaltar el texto escrito**. En ocasiones necesitamos que una palabra o una frase se destaque del resto del texto y para ello disponemos de varios formatos de texto para resaltar.
ca: En aquest exercici utilitzarem les eines per*ressaltar el text escrit **. De vegades necessitem una paraula o una frase per destacar de la resta del text i, per a això, tenim diversos formats de text per ressaltar.

source: Abrimos un **nuevo documento de texto** en Writer.
ca: Obrim un ** nou document de text ** a Writer.

source: Ahora vamos a cambiar el **factor de escala** de la ventana para poder ver mejor el texto según lo escribimos.
ca: Ara canviarem el factor d’escala ** ** de la finestra per poder veure millor el text mentre escrivim.

source: En la parte **inferior derecha** de la ventana, cambiaremos el factor de escala a **160%** pulsando el botón - o el botón +.
ca: A la part inferior dreta ** de la finestra, canviarem el factor d’escala a ** 160%** prement el botó o el botó +.

source: A continuación utilizaremos los siguientes formatos de texto.
ca: A continuació, utilitzarem els formats de text següents.

source: Texto en **negrita** con la herramienta |button-negrita|
ca: Text a ** BOLD ** amb l'eina | Button-Negrita |

source: Texto **subrayado** con la herramienta |button-subrayado|
ca: Text ** subratllat ** amb l'eina | Botó-subrayed |

source: Texto en **itálica** con la herramienta |button-italica|
ca: Itàlic ** Text ** amb l'eina | Botó-Initica |

source: Para cambiar un texto normal a **texto en negrita**, primero escribimos el texto.
ca: Per canviar un text normal a ** text en negreta **, primer escrivim el text.

source: A continuación seleccionamos el texto pinchando con el cursor del ratón en el inicio del texto que queremos cambiar.
ca: A continuació, seleccionem el text fent clic amb el cursor del ratolí al començament del text que volem canviar.

source: Después arrastramos el cursor hasta el final del texto que queremos cambiar (mientras mantenemos pulsado el botón izquierdo del ratón)
ca: A continuació, arrosseguem el cursor fins al final del text que volem canviar (mentre mantenim el botó esquerre del ratolí)

source: También se puede seleccionar el texto situando el cursor al comienzo del texto y manteniendo pulsada la tecla shift |tecla-shift|, pinchar con el ratón al final del texto que queremos cambiar.
ca: També podeu seleccionar el text col·locant el cursor al començament del text i mantenint la clau de canvi | Key-Shift |, feu clic amb el ratolí al final del text que volem canviar.

source: Una vez seleccionado el texto, pinchamos con el ratón en la herramienta para cambiar el texto a negrita |button-negrita|
ca: Un cop seleccionat el text, feu clic amb el ratolí de l’eina per canviar el text a BOLD | Button-Negrita |

source: O bien podemos elegir en el menú ``Formato... Texto... Negrita``
ca: O podem triar en el format `` text ... '' `` ``

source: También podemos escribir un texto en negrita seleccionando primero el botón de negrita |button-negrita|
ca: També podem escriure un text en negreta seleccionant primer el botó BOLD | Button-Negrita |

source: Luego escribimos el texto que queramos en negrita y al finalizar volvemos a pinchar el botón |button-negrita| para volver a escribir texto con formato normal.
ca: A continuació, escrivim el text que volem en negreta i al final punxem el botó | Button-Negrita | Per escriure text amb format normal.

source: Escribe el siguiente texto en Writer.
ca: Escriviu el text següent a l'escriptor.

source: Recuerda que puedes copiar y pegar el texto repetido para facilitar la tarea.
ca: Recordeu que podeu copiar i enganxar el text repetit per facilitar la tasca.
