Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/writer-formato-parrafo-1.po
Languages: ca

source: Formato de párrafo I
ca: Format de paràgraf i

source: En este ejercicio daremos formato a los párrafos de texto ajustando el espacio con los bordes (sangría), el espacio entre líneas y entre párrafos, la división de palabras al final de cada línea y otras opciones semejantes.
ca: En aquest exercici, formatarem els paràgrafs de text ajustant l’espai amb les vores (sagnat), l’espai entre les línies i els paràgrafs, la divisió de paraules al final de cada línia i altres opcions similars.

source: Para dar el formato necesario al texto vamos a utilizar el menú ``Formato... Párrafo...``
ca: Per donar el format necessari al text, utilitzarem el menú `` format ... `` `

source: En la pestaña de **Sangría y espaciado** aparecerá la siguiente ventana.
ca: A la pestanya ** Sagnat i Espai ** apareixerà la finestra següent.

source: En esta ventana se puede elegir el espacio de sangría (espacio entre el borde y el texto), el espacio antes y después del párrafo o el espacio entre líneas de un párrafo (interlineado).
ca: En aquesta finestra podeu triar l’espai de sagnat (l’espai entre la vora i el text), l’espai abans i després del paràgraf o l’espai entre línies d’un paràgraf (espai entre línies).

source: Ahora descargamos y abrimos con LibreOffice Writer el documento de ejemplo.
ca: Ara descarreguem i obrim amb LibreOffice Writer el document d’exemple.

source: :download:`Ejercicio formato de párrafo I <writer/writer-formato-parrafo-1.odt>`
ca: : Descarregar: `Exercici Paràgraf Format I <escriptor/escriptor-format-paragraph-1.odt>`

source: Al abrir el archivo anterior nos encontraremos con el siguiente texto sin formato.
ca: En obrir el fitxer anterior, trobarem el text següent sense format.

source: El ejercicio consiste en dar formato a cada párrafo del texto para que coincida con las instrucciones que pueden leerse en la siguiente imagen. Esta imagen representa el resultado final del ejercicio.
ca: L’exercici consisteix a formatar cada paràgraf del text per coincidir amb les instruccions que es poden llegir a la imatge següent. Aquesta imatge representa el resultat final de l'exercici.

source: Otra forma de dar formato de párrafo es utilizar algunos botones de la barra de herramientas.
ca: Una altra manera de donar format de paràgraf és utilitzar alguns botons a la barra d’eines.

source: |button-justificado| Justifica el texto por ambos lados.
ca: ; Botó-justificat | Justifiqueu el text a banda i banda.

source: |button-izquierda| Justifica el texto a la izquierda.
ca: ; Botó-esquerra | Justifiqueu el text de l'esquerra.

source: |button-derecha| Justifica el texto a la derecha.
ca: ; Botó-Right | Justifiqueu el text a la dreta.

source: |button-centrado| Centra el texto en medio de la página.
ca: ; Centrat en els botons | Centreu el text al mig de la pàgina.

source: |button-aumenta-sangria| Aumenta la sangría del texto (desplaza a la derecha).
ca: ; Botó-Aucent-Sangria | Augmenta la hemorràgia del text (desplaçaments a la dreta).

source: |button-reduce-sangria| Reduce la sangría del texto (desplaza a la izquierda).
ca: ; Botó-Rest-Sangria | Redueix l’hemorràgia del text (desplaçaments a l’esquerra).

source: |button-interlineado| Aumenta o disminuye el interlineado (espacio entre líneas del párrafo).
ca: ; Botó-Interineado | Augmenta o disminueix l’espai (l’espai entre les línies de paràgraf).

source: |button-separa-parrafos| Aumenta la separación entre párrafos.
ca: ; Botó-Mare-Parafos | Augmentar la separació entre els paràgrafs.

source: |button-junta-parrafos| Reduce la separación entre párrafos.
ca: ; Botó-Junta-Parafos | Reduir la separació entre els paràgrafs.
