<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<!-- Mirrored from recursostic.educacion.es/secundaria/edad/4esotecnologia/quincena12/primitivasbasicas.html by HTTrack Website Copier/3.x [XR&CO'2014], Sat, 11 Sep 2021 14:01:00 GMT -->
<head>
<meta content="text/html; charset=utf-8" http-equiv="Content-Type">
<title>Primitivas b&aacute;sicas</title>
</head>

<body>





              <li><font size="2" face="Verdana, Arial, Helvetica, sans-serif"><strong>AVANZA (AV)</strong><br>
                Sirve para desplazar el cursor una determinada longitud que debe de especificarse a continuaci&oacute;n de AVANZA o de AV. Por ejemplo, AV 40 desplazar&aacute; el cursor 40 unidades. Es importante separar con un espacio la primitiva (AV) del par&aacute;metro (40) o el programa no entender&aacute; la orden.</font><br>
                <br>
              </li>
              <li><font size="2" face="Verdana, Arial, Helvetica, sans-serif"><strong>GIRADERECHA (GD) Y GIRAIZQUIERDA (GI)</strong><br>
                Sirven para cambiar la orientaci&oacute;n del cursor; el par&aacute;metro que acompa&ntilde;a a la primitiva ser&aacute; el n&uacute;mero de grados de giro y tendr&aacute; que ir separado mediante un espacio de la primitiva. Al abrir el programa, el cursor est&aacute; orientado en direcci&oacute;n vertical con sentido hacia arriba.<br>
                GD 90 desplazar&aacute; el cursor 90 grados en el sentido de las agujas del reloj. GD 180 o GI 180 da la vuelta al cursor y lo pone en posici&oacute;n de retroceso. <br>
              </font><br>
              </li>
              <li><font size="2" face="Verdana, Arial, Helvetica, sans-serif"><strong>RETROCEDE (RE)</strong> <br>
                Hace retroceder el cursor el n&uacute;mero de unidades que le indique el par&aacute;metro que venga a continuaci&oacute;n. Es equivalente a GD 180 o a GI 180 seguido de AV.</font><br>
                <br>
              </li>
              <li><font size="2" face="Verdana, Arial, Helvetica, sans-serif"><strong>BORRAPANTALLA (BP)</strong><br>
                Pone la pantalla en blanco y vuelve a llevar el cursor a su posici&oacute;n y su orientaci&oacute;n inicial.</font><br>
                <br>
              </li>
              <li><font size="2" face="Verdana, Arial, Helvetica, sans-serif"><strong>BORRATEXTO (BT)</strong><br>
                Borra todo el c&oacute;digo escrito en el &aacute;rea de comandos.</font><br>
                <br>
              </li>
<li><font size="2" face="Verdana, Arial, Helvetica, sans-serif"><strong> SUBELAPIZ (SL)</strong><br>
                Sirve para avanzar sin que el rastro quede marcado.</font><br>
                <br>
              </li>
              <li><font size="2" face="Verdana, Arial, Helvetica, sans-serif"><strong> BAJALAPIZ (BL)</strong><br>
                Al avanzar el rastro deja marca; es la opci&oacute;n que est&aacute; seleccionada por defecto si no hemos utilizado SL.</font><br>


      <br>
              </li>

</li>
              <li><font size="2" face="Verdana, Arial, Helvetica, sans-serif"><strong> CIRCLE </strong><br />
Dibuja un c&iacute;rculo; debe ir acompa&ntilde;ada de un par&aacute;metro que indique el valor del radio.</font></p>
</body>


      <br>
              </li>





<!-- Mirrored from recursostic.educacion.es/secundaria/edad/4esotecnologia/quincena12/primitivasbasicas.html by HTTrack Website Copier/3.x [XR&CO'2014], Sat, 11 Sep 2021 14:01:00 GMT -->
</html>
