Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/arduprog/add-library.po
Languages: ca

source: Arduino, Librería, Añadir librería, Instalar librería
ca: Arduino, llibreria, afegeix llibreria, instal·la la llibreria

source: Añadir una librería a Arduino
ca: Afegiu una llibreria a Arduino

source: El entorno de Arduino viene por defecto con las librerías más habituales. Pero, en ocasiones, es necesario añadir una nueva librería para que Arduino pueda manejar otros dispositivos tales como paneles TFT o emisores y receptores infrarrojos. En esta página se explica paso a paso cómo añadir una nueva librería o cómo actualizar una librería ya existente en el entorno gráfico de Arduino.
ca: L’entorn d’Arduino ve per defecte amb les llibreries més comunes. Però, de vegades, és necessari afegir una llibreria nova perquè Arduino pugui gestionar altres dispositius com ara panells TFT o emissors i receptors d’infrarojos. Aquesta pàgina explica pas a pas com afegir una llibreria nova o com actualitzar una llibreria existent a l’entorn gràfic d’Arduino.

source: Añadir una nueva librería a Arduino
ca: Afegiu una llibreria nova a Arduino

source: Copiar la librería en formato \*.zip a un directorio conocido del disco duro.
ca: Copieu la biblioteca en format \*. Zip a un conegut directori del disc dur.

source: Abrir el entorno gráfico de Arduino.
ca: Obrir l’entorn gràfic d’Arduino.

source: En el menú de Arduino, seleccionar ``Programa... Incluir Librería... Añadir Librería .ZIP...``
ca: Al menú Arduino, seleccioneu `` Programa ... Inclou la llibreria ... Afegeix la llibreria .zip ... ``

source: Buscar el directorio del disco duro donde se encuentra la librería
ca: Cerqueu el directori del disc dur on es troba la llibreria

source: Seleccionar el archivo \*.zip con la librería y pulsar [Abrir]
ca: Seleccioneu el \*. Arxiu Zip amb la llibreria i premeu [Obrir]

source: Si la librería se ha importado correctamente aparecerá un mensaje informando de ello. 'Library added to your libraries.'
ca: Si la llibreria s'ha importat correctament, apareixerà un missatge informant -ne. "Biblioteca afegida a les vostres biblioteques."

source: En el caso de que la librería estuviera ya instalada aparecerá un mensaje de error con color naranja indicando que la librería ya existe. 'A library name _ _ _ already exists'.
ca: En el cas que la llibreria ja estava instal·lada, apareixerà un missatge d’error amb color taronja que indica que la llibreria ja existeix. "Un nom de la biblioteca _ _ _ ja existeix".

source: Si se quiere actualizar la librería es necesario primero `eliminar la librería antigua`_.
ca: Si voleu actualitzar la llibreria, cal eliminar primer la llibreria antiga.

source: Comprobar que Arduino dispone de la nueva librería en el listado de librerías instaladas.
ca: Comproveu que Arduino tingui la nova llibreria a la llista de llibreries instal·lades.

source: ``Programa... Incluir Librería...``
ca: `` Programa ... Inclou la llibreria ...`

source: Eliminar una librería de Arduino
ca: Suprimeix una llibreria Arduino

source: Para actualizar una librería que ya está instalada en el entorno de Arduino, es necesario borrar antes la librería antigua. Estos son los pasos a seguir:
ca: Per actualitzar una llibreria que ja està instal·lada a l’entorn Arduino, cal eliminar l’antiga llibreria abans. Aquests són els passos a seguir:

source: Seleccionar en el menú ``Archivo... Preferencias...``
ca: Seleccioneu al fitxer `` preferències ... ``

source: También se puede pulsar las teclas [Ctrl] + Coma
ca: També podeu prémer les tecles [ctrl] + comes

source: Copiar la ruta de la 'Ubicación del Sketchbook' pulsando [Ctrl] + c
ca: Copieu la ruta "Ubicació del llibre d'esbossos" fent clic a [Ctrl] + C

source: En el explorador de archivos, pegar la ruta copiada y pulsar enter.
ca: A l'explorador de fitxers, enganxeu la ruta copiada i premeu Enter.

source: En el explorador, dentro de la ruta del Sketchbook seleccionar la carpeta Arduino... libraries...
ca: A l'Explorador, dins de la ruta del quadern de dibuixos, seleccioneu la carpeta Arduino ... biblioteques ...

source: En esta ubicación se pueden ver las librerías actualmente instaladas.
ca: En aquesta ubicació podeu veure les llibreries instal·lades actualment.

source: Seleccionar la librería que se desee borrar y pulsar la tecla de suprimir o pulsar el botón derecho del ratón y 'Eliminar'
ca: Seleccioneu la biblioteca que vulgueu suprimir i premeu el suprimir o premeu el botó dret del ratolí i "suprimiu"

source: Ver las librerías instaladas en Arduino
ca: Consulteu les biblioteques instal·lades a Arduino

source: Para ver qué librerías tiene ya instaladas Arduino es necesario seleccionar en el menú.
ca: Per veure quines biblioteques, Arduino ja és necessari seleccionar al menú.
