Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/arduprog/arduino-faq-misconceptions.po
Languages: ca

source: Arduino, dudas y conceptos erróneos
ca: Arduino, dubtes i conceptes errònics

source: Aparecen aquí agrupadas respuestas a diversas dudas sobre Arduino así como explicaciones a conceptos erróneos bastante extendidos.
ca: Les respostes s’agrupen aquí a diversos dubtes sobre Arduino, així com explicacions a conceptes errònics força estesos.

source: ¿Qué es Arduino?
ca: Què és Arduino?

source: Arduino es una marca registrada. Al igual que IBM, Apple o Samsung, Arduino fabrica y distribuye varios productos tecnológicos bajo su marca [#arduino_trademark]_. Cuando una tienda o distribuidor elige vender o distribuir productos Arduino, debe firmar un acuerdo exclusivo con la empresa, que le impide vender placas iguales a Arduino fabricadas por terceros. De esta forma Arduino protege sus ventas porque todos sus productos son de hardware y software libre y por lo tanto es legal realizar copias exactas de sus productos y de hecho existen muchos ejemplos en el mercado a precios más bajos.
ca: Arduino és una marca registrada. Igual que IBM, Apple o Samsung, Arduino fabrica i distribueix diversos productes tecnològics sota la seva marca [#arduino_trademark] _. Quan una botiga o distribuïdor opta per vendre o distribuir productes Arduino, heu de signar un acord exclusiu amb la companyia, que impedeix vendre plaques iguals a Arduino fabricades per tercers. D’aquesta manera, Arduino protegeix les seves vendes perquè tots els seus productes són de maquinari i programari gratuïts i, per tant, és legal fer còpies exactes dels seus productes i, de fet, hi ha molts exemples al mercat a preus més baixos.

source: Por lo tanto, es legal fabricar y distribuir copias los productos Arduino tanto en hardware como en software. Pero no es legal utilizar la marca Arduino para referirse a esos productos. Tampoco se podrán distribuir esas copias en tiendas y distribuidores que hayan firmado acuerdos exclusivos de distribución con Arduino. Por último, el número identificador de USB utilizado por los productos Arduino, pertenece a la empresa de Arduino y no se puede utilizar en productos copiados.
ca: Per tant, és legal fabricar i distribuir còpies de productes Arduino tant en maquinari com en programari. Però no és legal utilitzar la marca Arduino per referir -se a aquests productes. Tampoc es poden distribuir aquestes còpies en botigues i distribuïdors que han signat acords de distribució exclusius amb Arduino. Finalment, el número d’identificador USB utilitzat pels productes Arduino, pertany a la companyia d’Arduino i no es pot utilitzar en productes copiats.

source: Debido a ciertas disputas por la marca entre los diseñadores originales de Arduino, parte de estos han utilizado la marca Genuino para nombrar a los productos Arduino.
ca: A causa de certes disputes de marca entre els dissenyadors originals d'Arduino, part d'aquests han utilitzat la marca genuïna per anomenar Arduino Products.

source: ¿Qué productos engloba la marca Arduino?
ca: Quins productes inclou la marca Arduino?

source: El producto más conocido de Arduino es una placa de desarrollo denominada Arduino UNO. Esta placa hardware está basada en un microcontrolador de 8 bit Atmega328A e incluye una conexión USB para conectar la placa con un ordenador.
ca: El producte més conegut d’Arduino és una placa de desenvolupament anomenada Arduino One. Aquesta placa de maquinari es basa en un microcontrolador ATMEGA328A de 8 bits i inclou una connexió USB per connectar la placa amb un ordinador.

source: Para dar soporte a esta placa se programó un entorno de desarrollo de manejo sencillo y de código abierto, basado en el proyecto `Wiring <https://es.wikipedia.org/wiki/Wiring>`__.
ca: Per donar suport a aquesta placa, es va programar un entorn de desenvolupament de gestió de subministrament senzill i obert, basat en el cablejat <https://es.wikipedia.org/wiki/wiring>`__.

source: Esta placa Arduino puede ampliarse mediante otras placas, denominadas Shield porque van conectadas sobre la placa de desarrollo tapándola. Estos Shield añaden nuevas funciones a la placa original, como conexión a Ethernet, control de motores DC o paso a paso, conexión a tarjetas de memoria, etc.
ca: Aquesta placa Arduino es pot ampliar per altres plaques, anomenades Shield perquè estan connectades a la placa de desenvolupament que la cobreix. Aquests escut afegeixen noves funcions a la placa original, com ara la connexió Ethernet, el control de motors DC o STEP -BY -Step, la connexió de la targeta de memòria, etc.

source: Hoy en día `la oferta se ha ampliado bastante <https://www.arduino.cc/en/Main/Products>`__ y podemos encontrar muchos productos distintos:
ca: Avui "L'oferta s'ha ampliat força <https://www.arduino.cc/en/main/products>`__ i podem trobar molts productes diferents:

source: Placas de desarrollo de 8 bit
ca: Plaques de desenvolupament de 8 bits

source: Arduino Uno
ca: Arduino One

source: Arduino Esplora
ca: Arduino Sppleen

source: Placas de desarrollo de 32 bits
ca: Plaques de desenvolupament de 32 bits

source: Arduino DUE
ca: Arduino degut

source: Shields
ca: Escuts

source: Proto Shield
ca: Proto escut

source: Relay Shield
ca: Escut de relé

source: Wireless Shield
ca: Escut sense fils

source: Ethernet Shield
ca: Escut Ethernet

source: GSM Shield
ca: Escut GSM

source: Yun Shield
ca: Yun escut

source: Kits de desarrollo
ca: Kits de desenvolupament

source: Starter kit
ca: Kit d'arrencada

source: MKR IoT Bundle
ca: Mkr iot paquet

source: Entorno de programación Arduino IDE
ca: Entorn de programació Arduino IDE

source: Librerías de programación
ca: Llibres de programació

source: ¿Todos los productos Arduino deben utilizarse juntos?
ca: S'han d'utilitzar tots els productes Arduino junts?

source: No es obligatorio. Cuando se realiza un desarrollo típico con una placa Arduino UNO, en realidad se están utilizando muchos elementos distintos, todos ellos de marca Arduino, pero que pueden sustituirse sin problema por elementos distintos.
ca: No és obligatori. Quan es realitza un desenvolupament típic amb una placa Arduino One, s’utilitzen molts elements diferents, tots ells de la marca Arduino, però es poden substituir sense problemes per diferents elements.

source: Primero vamos a ver qué elementos se utilizan en un proyecto típico de Arduino:
ca: Primer vegem quins elements s’utilitzen en un projecte típic Arduino:

source: 1 Placa de desarrollo Arduino UNO 2 Entorno de programación Arduino IDE 3 Librerías de Arduino para la placa Arduino UNO 4 Compilador C++ (AVR-GCC) 5 Comunicación USB 6 Bootloader de Arduino 7 Shield Arduino 8 Librerias Arduino
ca: 1 Placa de desenvolupament Arduino One 2 Arduino Ide 3 Biblioteques Arduino per a la placa Arduino One 4 C ++ Compilador (AVR-GCC) 5 USB 6 Comunicació de botes d'arrencada d'Arduino 7 Shield Arduino 8 Arduino Libraries
