Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/arduprog/ardublock-intro.po
Languages: ca

source: Introducción a Ardublock
ca: Introducció a Ardublock

source: Ardublock es una herramienta para Arduino que permite programar con bloques gráficos. Está orientado a facilitar la programación a los usuarios sin experiencia previa, simplificando mucho la tarea de realizar programas con un sencillo entorno gráfico.
ca: Ardublock és una eina per a Arduino que permet programar amb blocs gràfics. Té com a objectiu facilitar la programació als usuaris sense experiència prèvia, simplificant la tasca de portar programes amb un entorn gràfic senzill.

source: Es una herramienta del entorno de programación de Arduino y no puede funcionar separado de él.
ca: És una eina de l’entorn de programació d’Arduino i no pot funcionar per separat.

source: La versión que se suministra en esta página web es una versión modificada de Ardublock original, en la que se han simplificado los colores, los menús y el número de bloques con el objetivo de que sea más sencillo de utilizar.
ca: La versió que es subministra en aquest lloc web és una versió modificada de Ardublock original, en la qual els colors, els menús i el nombre de blocs s’han simplificat amb l’objectiu de ser més fàcil d’utilitzar.

source: Instalación de Ardublock
ca: Instal·lació Ardublock

source: Para instalar la última versión de Ardublock-Picuino hay que seguir los siguentes pasos:
ca: Per instal·lar la versió més recent d’Ardublock-Picuino, heu de seguir els passos següents:

source: Descargar la :download:`herramienta Ardublock-Picuino <_downloads/ardublock-picuino.zip>`
ca: Descarregueu LA: Descarregueu: `eina Arcublock-Picuino <_downloads/arduck-picuino.zip>`

source: Copiar el archivo en el directorio de Arduino. El directorio se puede encontrar en el entorno de Arduino, pulsando el menú:
ca: Copieu el fitxer al directori Arduino. El directori es pot trobar a l’entorn Arduino, prement el menú:

source: ``Archivo... Preferencias... Localización del proyecto``.
ca: `` Arxiu ... preferències ... Ubicació del projecte ''.

source: Descomprir el archivo en el directorio de Arduino.
ca: Descomprimeix el fitxer al directori d'Arduino.

source: Cerrar y volver a abrir el entorno de Arduino. La nueva herramienta debe aparecer en el menú:
ca: Tancar i reobrir l’entorn d’Arduino. La nova eina ha d’aparèixer al menú:

source: ``Herramientas... Ardublock``
ca: `` Eines ... ardublock ''

source: Instalación de librerías auxiliares para Arduino
ca: Instal·lació de llibreries auxiliars per a Arduino

source: Estas librerías permiten que la placa Arduino controle periféricos tales como un un panel visualizador LCD o emisores y receptores infrarrojos.
ca: Aquestes biblioteques permeten a la placa Arduino controlar els perifèrics com ara un panell de visualitzadors LCD o emissors i receptors d’infrarojos.

source: Para **instalar todas las librerías a la vez**, hay que seguir los siguientes pasos:
ca: Per instal·lar totes les llibreries alhora **, heu de seguir els passos següents:

source: Descargar el `archivo con las librerías para Arduino. <../../_static/downloads/arduino-libraries.zip>`__
ca: Descarregueu l'arxiu amb les llibreries per a Arduino. <../../_ static/descàrregues/arduino-libraries.zip>`__

source: Cerrar y volver a abrir el entorno de Arduino. Las nuevas librerías deben aparecer en el menú:
ca: Tancar i reobrir l’entorn d’Arduino. Les noves llibreries haurien d’aparèixer al menú:

source: ``Programa... Incluir librería...``
ca: `` Programa ... Inclou la llibreria ... '

source: Para instalar librerías individuales utilizando el entorno Arduino, se puede leer el siguiente enlace sobre :ref:`cómo añadir una librería al entorno Arduino <add-library>`.
ca: Per instal·lar llibreries individuals mitjançant l’entorn Arduino, podeu llegir el següent enllaç a: Ref: `Com afegir una llibreria a l’entorn Arduino <den-library>`.

source: Manejo básico de Ardublock
ca: Gestió bàsica d’Arcublock

source: **Abrir el entorno de Arduino:** para abrir ardublock es necesario primero tener abierto el entorno Arduino, pulsando en el siguiente icono.
ca: ** Obriu l’entorn Arduino: ** Per obrir Ardublock, primer cal tenir l’entorn Arduino obert, fent clic a la icona següent.

source: **Conectar el puerto correcto:** en el menú de herramientas... puerto... hay que seleccionar el puerto al que esté conectada la placa Arduino. Para más información ver :ref:`solución de problemas con Arduino <troubleshooting-arduino>`
ca: ** Connecteu el port dret: ** Al menú de l'eina ... port ... heu de seleccionar el port al qual està connectada la placa Arduino. Per a més informació, vegeu: Ref: `Solució de problemes amb Arduino <resolució de problemes>` `

source: **Abrir Ardublock:** en el menú de herramientas del entorno de Arduino aparecerá la palabra Ardublock. Pulsando sobre ella, aparecerá el entorno sin ningún programa.
ca: ** Obrir Ardublock: ** Al menú Arduino Environment Tools apareixerà la paraula Arcublock. En fer -hi clic, l’entorn apareixerà sense cap programa.

source: **Realizar el programa:** desplazando los bloques desde los menús de la izquierda hasta conectarlos con el bloque de programa.
ca: ** Realitzeu el programa: ** Desplaçant els blocs dels menús de l'esquerra per connectar -los amb el bloc del programa.

source: **Duplicar bloques:** pulsando sobre un bloque con el botón derecho del ratón, aparece la opción de 'Clonar' que duplica el bloque y todos los bloques que cuelgan por debajo.
ca: ** Blocs duplicats: ** Premant sobre un bloc amb el botó del ratolí dret, apareix l’opció “clon” que duplica el bloc i tots els blocs que pengen a sota.

source: **Añadir comentarios:** pulsando sobre un bloque con el botón derecho del ratón, aparece la opción 'Añadir comentario' que permite escribir un texto que explique la función del bloque. El comentario se puede ocultar o mostrar pulsando el icono de interrogación '?' a la izquierda del bloque.
ca: ** Afegiu comentaris: ** fent clic a un bloc amb el botó dret del ratolí, apareix l’opció “Afegir comentari” que us permet escriure un text que expliqui la funció del bloc. El comentari es pot ocultar o mostrar prement la icona de la pregunta "?" A l’esquerra del bloc.

source: **Organizar los bloques:** pulsando sobre una zona vacía con el botón derecho del ratón, aparece la opción de 'Organizar todos los bloques'. pulsándola, todos los bloques se organizan de forma ordenada.
ca: ** Organitzar els blocs: ** fent clic a una zona buida amb el botó dret del ratolí, apareix l’opció d’organitzar tots els blocs. Premant -ho, tots els blocs s’organitzen de manera ordenada.

source: **Borrar bloques no deseados:** desplazando los bloques hacia la izquierda en la zona de los menús, los bloques desaparecerán.
ca: ** Eliminar blocs no desitjats: ** Displaçant els blocs a l'esquerra a la zona dels menús, els blocs desapareixeran.

source: **Cargar el programa a Arduino:** pinchando el botón superior 'Cargar a Arduino' los bloques se transformarán en código que se cargará en la placa Arduino que esté conectada. Si es el primer programa que se carga, el entorno pedirá confirmación para guardar el programa. Hay que responder 'guardar'.
ca: ** Carregueu el programa a Arduino: ** fent clic al botó superior 'Carrega a Arduino' Els blocs es transformaran en un codi que es carregarà a la placa Arduino connectada. Si és el primer programa que es carrega, l’entorn demanarà confirmació per desar el programa. Heu de respondre "desar".

source: Este proceso no es inmediato, hay que esperar unos segundos hasta que termina.
ca: Aquest procés no és immediat, heu d’esperar uns segons fins que s’acabi.

source: **Guardar el programa de Ardublock:** Pulsando el botón superior 'Guardar como' aparecerá un cuadro en el que escribir el nombre del programa y su localización.
ca: ** Desa el programa Arcublock: ** prement el botó superior "Desa com a" apareixerà una imatge per escriure el nom del programa i la seva ubicació.
