Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/arduprog/ardublock-key1.po
Languages: ca

source: Ejercicios con pulsadores
ca: Exercicis amb botons

source: Programar los bloques necesarios para resolver los siguientes problemas.
ca: Programa els blocs necessaris per resoldre els problemes següents.

source: **Encendido con pulsador.** Copiar el siguiente programa que enciende el led D1 si se presiona el pulsador 1.
ca: ** Poseu el botó.

source: Completar el ejercicio anterior para que apague el led D1 si se presiona el pulsador 2.
ca: Completa l'exercici anterior per desactivar el LED D1 si es prem el botó.

source: **Secuencia de encendido.** Copiar el siguiente programa que enciende dos led con pulsadores. El led D1 se encenderá al presionar el pulsador 1. A continuación el led D2 se encenderá al presionar el pulsador 2. El led D2 no se puede encender antes de que se encienda el led D1.
ca: ** Seqüència d’encesa. ** Copieu el programa següent que il·lumina dos LED amb botons. El LED D1 s’encendrà en prémer el botó 1. A continuació, el LED D2 s’encendrà quan prémer el botó 2. El LED D2 no es pot activar abans que el LED D1 s’encengui.

source: Completar el programa anterior para que los pulsadores enciendan todos los led hasta el D6.
ca: Completeu el programa anterior perquè els botons s’encenguin tots els LED al D6.

source: **Desplazamiento de luces.** Copiar el programa, que funciona de la siguiente manera:
ca: ** Desplaçament de llum. ** Copieu el programa, que funciona de la manera següent:

source: Al comenzar el programa, se enciende el led D1.
ca: Al començament del programa, el LED D1 està encès.

source: Al presionar el pulsador 1, se apagará el led D1 y se encenderá el led D2.
ca: En prémer el botó 1, el LED D1 s’apagarà i el LED D2 s’encendrà.

source: A continuación, cuando se presione el pulsador 2, se apagará el led D2 y se encenderá el led D3.
ca: A continuació, quan es prem el botó, el LED D2 s’apagarà i el LED D3 s’encendrà.

source: Completar el programa anterior para que continúe encendiendo los led hacia la derecha hasta llegar al led D5.
ca: Completeu el programa anterior per continuar il·luminant el LED a la dreta fins que arribeu al LED D5.

source: Al final, al presionar el pulsador 5, el led D5 se apagará y se encenderá de nuevo el led D1.
ca: Al final, prement el botó 5, el LED D5 s’apagarà i tornarà a apagar el LED D1.

source: **Desplazamiento inverso.** Modificar el programa anterior para que los ledes se enciendan desde el D5 hasta el D1.
ca: ** Desplaçament invers. ** Modifiqueu el programa anterior perquè els LED es mostrin de D5 a D1.

source: Cuando llegue el turno de apagar el led D1, se encenderá de nuevo el led D5.
ca: Quan el torn de desactivar el LED D1, el LED D5 s’encendrà de nou.

source: **Encendido bimanual** Copiar el siguiente programa que enciende los led D1 y D2 al presionar a la vez los pulsadores 1 y 2.
ca: ** Encenament bimanual ** Copieu el programa següent que s’encén els LED D1 i D2 en prémer els botons 1 i 2.

source: Este programa puede servir para accionar una prensa peligrosa cuando se presionen a la vez, con las dos manos, dos pulsadores separados entre sí. Esto protege las manos del peligro de la prensa.
ca: Aquest programa pot servir per actuar una premsa perillosa quan es pressionen alhora, amb les dues mans, dos botons separats els uns dels altres. Això protegeix les mans del perill de la premsa.

source: Modificar el programa anterior para que se enciendan los tres ledes D1, D2 y D3 al presionar a la vez los tres pulsadores 1, 2 y 3.
ca: Modifiqueu el programa anterior de manera que els tres LED D1, D2 i D3 s’encenguin prement alhora els tres botons 1, 2 i 3.

source: Los tres led se deben apagar al presionar el pulsador 4.
ca: Els tres LED s’han d’apagar en prémer el botó 4.

source: **Cerradura electrónica.** Copiar el siguiente programa que simula una cerradura electrónica. Al presionar en orden la secuencia de pulsadores 3, 1 y 5, una cerradura electrónica se abrirá. La apertura se indica con la palabra OPEN en el display.
ca: ** Bloqueig electrònic. ** Copieu el programa següent que simula un bloqueig electrònic. En prémer per ordre de la seqüència de botons 3, 1 i 5, s’obrirà un bloqueig electrònic. L’obertura s’indica amb la paraula oberta a la pantalla.

source: Modifica el ejercicio anterior para que la cerradura se abra al presionar la secuencia de pulsadores 2, 6, 1 y 4.
ca: Modifiqueu l'exercici anterior de manera que el bloqueig s'obri prement la seqüència del botó 2, 6, 1 i 4.
