Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/arduprog/ardublock-led1.po
Languages: ca

source: Ejercicios con led, encendido y apagado
ca: Exercicis amb LED, encès i desactivat

source: Programar los bloques necesarios para resolver los siguientes problemas.
ca: Programa els blocs necessaris per resoldre els problemes següents.

source: Encendido y apagado del led de la placa Arduino
ca: Llum i fora del LED de la placa Arduino

source: Copiar el siguiente programa para encender el led D13 de la placa Arduino.
ca: Copieu el programa següent per activar el LED D13 de la placa Arduino.

source: Copiar el siguente programa para hacer parpadear el led D13 de la placa Arduino.
ca: Copieu el programa següent per flash el LED D13 de la placa Arduino.

source: Realizar un programa que consiga el parpadeo del led D13 con un tiempo encendido de una décima de segundo y un tiempo apagado de dos segundos.
ca: Feu un programa que faci parpellejar el LED D13 amb un temps en una dècima de segon i dos segons.

source: Encendido y apagado de los led del panel de control
ca: Llum i desactivació dels LED del tauler de control

source: Copiar el siguiente programa para encender el led D1 del panel de control Picuino.
ca: Copieu el programa següent per activar el LED D1 del tauler de control Picuino.

source: Encender los ledes D1, D3 y D5 de forma permanente.
ca: Enceneu de forma permanent les LEDES D1, D3 i D5.

source: Encender el led D1, esperar un segundo, encender el led D2, esperar un segundo, continuar la secuencia hasta que estén encendidos los 4 primeros led. Una vez terminado, el programa mantendrá los 4 ledes encendidos.
ca: Enceneu el LED D1, espereu un segon, activeu el LED D2, espereu un segon, continueu la seqüència fins que els primers 4 LED estan encesos. Un cop finalitzat, el programa mantindrà els 4 LED encesos.

source: Encender los ledes rojo, ámbar y verde como en un semáforo.
ca: Enceneu els LEDs vermells, ambre i verds com en un semàfor.

source: Primero se encenderá el led verde y permanecerá encendido durante 4 segundos. A continuación se apagará el led verde y se encenderá el led ámbar durante 3 segundos. Por último se apagará el led ámbar y se encenderá el rojo, que permanecerá encendido durante 4 segundos.
ca: Primer el LED verd s’encendrà i es mantindrà durant 4 segons. El LED verd s’apagarà i el LED ambre s’encendrà durant 3 segons. Finalment, el LED ambre s’apagarà i el vermell s’encendrà, que es mantindrà durant 4 segons.

source: Esta secuencia se repetirá continuamente.
ca: Aquesta seqüència es repetirà contínuament.

source: Modificar el ejercicio anterior para que el led ámbar parpadee tres veces, cambiando de encendido a apagado cada medio segundo, antes de pasar a encender el led rojo.
ca: Modifiqueu l'exercici anterior de manera que el LED ambre parpelleja tres vegades, canviant l'encesa a la segona meitat, abans d'encendre el LED vermell.

source: Programar una baliza que encienda alternativamente el led rojo y el led azul. Cada led debe permanecer encendido durante un segundo. Siempre debe estar uno de los dos led encendidos y nunca estarán los dos led encendidos a la vez.
ca: Programa una balisa que s’encén alternativament el LED vermell i el LED blau. Cada LED ha de romandre un segon. Un dels dos LED sempre ha de ser i mai serà els dos LED alhora.

source: Al comenzar el programa se encenderá el led D1 Pasado un segundo se apagará el led D1 y se encenderá el led D2. De esta forma continuarán encendiéndose los 5 primeros ledes, de manera que en cada momento solo un led estará encendido. Una vez terminada la secuencia, comenzará de nuevo desde el principio.
ca: Al començament del programa, el LED D1 s'encendrà un segon desactivarà el LED D1 i el LED D2 s'encendrà. D’aquesta manera es continuaran activant els primers 5 LED, de manera que només hi hagi un LED. Un cop finalitzada la seqüència, tornarà a començar des del principi.

source: Realizar una modificación al ejercicio anterior para que en todo momento haya 2 ledes encendidos.
ca: Feu una modificació a l’exercici anterior de manera que en tot moment hi hagi 2 LEDES encès.

source: Al comenzar el programa deben encenderse los ledes D1 y D2.
ca: Al començament del programa, els LED D1 i D2 s’han d’encendre.

source: Pasado un segundo se encenderán los ledes D2 y D3.
ca: Al cap d'un segon, els LeDes D2 i D3 s'encendran.

source: La secuencia continuará hasta que estén encendidos los ledes D6 y D1.
ca: La seqüència continuarà fins que LEDES D6 i D1 s’encenguin.

source: A partir de este momento, el programa se repetirá comenzando otra vez desde el principio.
ca: A partir d’aquest moment, el programa es repetirà de nou des del principi.
