Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/arduprog/comm-infrared-receiver.po
Languages: ca

source: Receptor de infrarrojos
ca: Receptor infraroig

source: Librería IRremote
ca: Llibreria Irremote

source: La librería IRremote añade a Arduino la capacidad para manejar tanto emisores como receptores de control remoto por infrarrojos con los protocolos más habituales.
ca: La llibreria Irremote afegeix a Arduino la capacitat de gestionar tant els emissors com els receptors de control remot d’infrarojos amb els protocols més comuns.

source: `Descarga directa de la librería IRremote <../../_static/downloads/IRremote.zip>`__
ca: `Descàrrega directa de la llibreria Irremote <../../_ estàtica/descàrregues/irremote.zip>`__

source: `Página de GitHub de la librería IRremote <https://github.com/shirriff/Arduino-IRremote>`__
ca: `GitHub Pàgina de la llibreria Irremote <https://github.com/shirriff/Arduino-IRremote>`__

source: :ref:`Cómo añadir una nueva librería al entorno Arduino paso a paso. <add-library>`
ca: : Ref: `Com afegir una llibreria nova a l'entorn Arduino pas a pas. <Add-library> '

source: Conexión
ca: Conexió

source: Ejercicios
ca: Exercicis

source: Compila y carga el siguiente programa en Arduino.
ca: Compareu i carregueu el programa següent a Arduino.

source: Una vez cargado, abre el monitor serie y cambia la velocidad de recepción de datos para que sea igual a la velocidad de transmisión del programa.
ca: Un cop carregat, obriu el monitor de la sèrie i canvieu la velocitat de recepció de dades de manera que sigui igual a la velocitat de transmissió del programa.

source: Pulsa varias teclas del mando a distancia. Los códigos de las teclas aparecerán en el monitor serie y en el display de 7 segmentos.
ca: Premeu diverses tecles del comandament a distància. Els codis de claus apareixeran al monitor de la sèrie i a la pantalla 7 -segment.

source: Modifica el programa anterior para que se encienda el led D1 cuando se presione el número 1 en el mando a distancia.
ca: Modifiqueu el programa anterior perquè el LED D1 s’encengui quan es premeu el número 1 al comandament a distància.

source: A continuación aparece un ejemplo incompleto de código para realizar la tarea.
ca: A continuació, es mostra un exemple de codi incomplet per realitzar la tasca.

source: Modifica el programa anterior para que se apaguen todos los ledes cuando se presione el botón cero '0'.
ca: Modifiqueu el programa anterior per desactivar tots els LED quan es prem el botó zero.

source: Modifica el primer programa para que se encienda y apague una columna de ledes con los botones '+' y '-' del mando a distancia.
ca: Modifiqueu el primer programa per activar i desactivar una columna de LEDs amb els botons "+" i "--" del comandament a distància.

source: Al pulsar '+' del mando a distancia se encenderá un nuevo led de la columna. Según se presiona '+' se irán encendiendo uno a uno todos los ledes. Al presionar '-' del mando a distancia se apagará el último led. Según se presione '-' se irán apagando uno a uno todos los ledes.
ca: En prémer '+' del comandament a distància, un nou LED de columna s'encendrà. A mesura que es pressiona '+', totes les làmines s'encendran un per un. En prémer '-' del comandament a distància, l'últim LED s'apagarà. A mesura que premeu "-" Tots els LED seran apagats un per un.

source: Para programar el código es necesario crear una variable que contará el número de ledes que deben encenderse. Esa variable se incrementará o decrementará con las pulsaciones del mando. Una instrucción para cada led comprobará si la variable es mayor que cierto valor, encenderá el led. En caso contrario apagará el led.
ca: Per programar el codi, cal crear una variable que compti amb el nombre de LEDs que han d’estar en marxa. Aquesta variable s’incrementarà o disminuirà amb els clústers del control. Una instrucció per a cada LED comprovarà si la variable és superior a un valor determinat, s'encendrà el LED. En cas contrari, el LED s’apagarà.

source: Antes del bloque ``setup()``:
ca: Abans de la `` configuració () ``:

source: Dentro del bloque ``loop()``, se debe incrementar y decrementar la variable dependiendo del código recibido del mando a distancia:
ca: Dins del `` bucle () `` `` `` `` `, la variable s'ha d'augmentar i disminuir en funció del codi rebut del comandament a distància:

source: A continuación se deben encender o apagar los ledes dependiendo del valor de la variable:
ca: A continuació, els LED s’han d’encendre o desactivar segons el valor de la variable:

source: Modifica el ejercicio anterior para que la variable no aumente más que el número total de ledes y que no disminuya por debajo de cero. Se añadirán dos condiciones, una condición limitará la variable si aumenta demasiado y otra condición limitará la variable si se reduce por debajo de cero
ca: Modifica l'exercici anterior de manera que la variable no augmenta més que el nombre total de LED i que no disminueix per sota de zero. S’afegiran dues condicions, una condició limitarà la variable si augmenta massa i una altra condició limitarà la variable si es redueix per sota de zero
