Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/arduprog/component-kit.po
Languages: ca

source: Componentes para realizar proyectos con Arduino
ca: Components per dur a terme projectes amb Arduino

source: En esta página se van a recopilar los principales componentes electrónicos necesarios para realizar proyectos con Arduino.
ca: En aquesta pàgina es recolliran els principals components electrònics necessaris per dur a terme projectes amb Arduino.

source: Al confeccionar esta lista se ha intentado abarcar los componentes necesarios para que se puedan realizar la mayor cantidad y variedad de proyectos con la menor cantidad de componentes posible. Muchos proyectos se pueden realizar con menos componentes y algunos componentes de cierta relevancia no están en esta lista. El objetivo es llegar a un buen compromiso para que este kit consiga la mejor relación calidad/precio posible.
ca: Quan es fa aquesta llista, s’han intentat cobrir els components necessaris de manera que la quantitat més gran i la varietat de projectes es puguin fer amb la menor quantitat de components possibles. Molts projectes es poden dur a terme amb menys components i alguns components d’una certa rellevància no hi ha en aquesta llista. L’objectiu és assolir un bon compromís per a aquest kit per aconseguir la millor relació de qualitat/preu possible.

source: Componentes electrónicos para Arduino
ca: Components electrònics per a Arduino

source: Cantidad
ca: Quantitat

source: Componente
ca: Component

source: Placa `Arduino UNO <https://store.arduino.cc/products/arduino-uno-rev3>`__
ca: Placa `Arduino One <https://store.arduino.cc/products/arduino-uno-rev3>`__ __

source: Cable de comunicaciones `USB con terminaciones A y B <../_downloads/arduino-uno-cable-usb.jpg>`__
ca: `Cable de comunicacions USB amb terminacions a i b <../_ descàrregues/arduino-one-cable-useb.jpg>`__

source: Ledes de varios colores, de alta luminosidad. Rojo, Verde, Amarillo, Azul, Blanco.
ca: Ledes de diversos colors, alta lluminositat. Red, verd, groc, blau, blanc.

source: Led tricolor RGB de tipo ánodo común.
ca: Tricolor RGB Trice LED.

source: Display led de 7 segmentos.
ca: Pantalla LED de 7 segments.

source: Visualizador LCD alfanumérico 16x2.
ca: Visualitzador LCD alfanumèric 16x2.

source: Conversor de comunicación I2C a display LCD
ca: Convertidor de comunicació I2C a la pantalla LCD

source: Panel de control Picuino PC42.
ca: Tauler de control PC42 PICUINO.

source: Pulsadores normalmente abiertos para montaje sobre circuito impreso.
ca: Normalment els botons oberts per al conjunt de circuits impresos.

source: **Actuadores**
ca: ** Actuadors **

source: Zumbador piezoeléctrico o electromecánico.
ca: Buzzer piezoelèctric o electromecànic.

source: Servomotor Tower-Pro SG90 9G.
ca: Tower-Pro SG90 9G Servomotor.

source: Transistor de potencia BD135-16
ca: BD135-16 Transistor de potència

source: Diodo 1N4007.
ca: Diode 1N4007.

source: Motor de corriente continua con reductora.
ca: Corrent continu amb un reductor.

source: **Sensores**
ca: ** Sensors **

source: Sensor de distancia por ultrasonidos SR-04, SRF-05 o similar
ca: Sensor de distància d’ecografia SR-04, SRF-05 o similar

source: Resistencia LDR detectora de luz con resistencia nominal de 10k Ohmios.
ca: Detector de llum de resistència a la LDR amb 10k ohms nominals.

source: Fotodiodo (necesita electrónica añadida para acondicionar la señal)
ca: Photodiod (necessiteu afegir electrònica per condicionar el senyal)

source: Resistencia NTC detectora de temperatura con resistencia nominal de 10k Ohmios.
ca: Detector de temperatura de resistència NTC amb resistència nominal de 10k ohm.

source: Potenciómetro giratorio de 10k Ohmios.
ca: Potenciòmetre rotatiu de 10k ohm.

source: **Comunicaciones**
ca: ** Comunicacions **

source: Sensor de infrarrojos TSOP4838 o similar.
ca: Sensor infraroig TSOP4838.

source: Diodo emisor de infrarrojos.
ca: Díode emissor d’infrarojos.

source: Mando a distancia de infrarrojos.
ca: Control a distància infraroja.

source: Módulo de comunicaciones Bluetooth con adaptador para 5 voltios
ca: Mòdul de comunicacions Bluetooth amb adaptador de 5 volts

source: Módulo de comunicaciones WiFi ESP8266. (necesita regulador de tensión a 3,3v)
ca: Mòdul de comunicacions WiFi ESP8266. (Necessiteu un regulador de tensió de 3,3V)

source: **Otros componentes**
ca: ** Altres components **

source: Placa de prototipos (Breadboard) de 400 o más contactos
ca: Placa de prototip (tauler de pa) de 400 o més contactes

source: Cables flexibles tipo dupont macho-macho.
ca: Cables flexibles DuPont Macho-Macho.

source: Cables flexibles tipo dupont macho-hembra.
ca: Cables flexibles DuPont Machho-Hembra.

source: Resistencias de polarización de 220 Ohmios.
ca: 220 Ohms Resistàncies de polarització.

source: Resistencias de polarización de 10k Ohmios.
ca: Resistències de polarització de 10k Ohm.

source: Condensadores sin polaridad de 1uF y 16 voltios.
ca: Condensadors sense polaritat de 1UF i 16 volts.

source: Condensadores electrolíticos de 100uF y 16 voltios.
ca: 100UF Condensadors electrolítics i 16 volts.

source: Las resistencias de polarización para los led pueden valer entre 180 Ohm y 680 Ohm. No convienen utilizar valores menores para que en ningún caso se sobrepasen los 20 miliamperios que soporta como máximo un led típico sin fundirse. Valores de resistencia mayores, producen poca luz.
ca: Les resistències de polarització dels LED poden valer entre 180 ohms i 680 ohm. No accepten utilitzar valors menors de manera que en qualsevol cas els 20 mil·límetres que admetin un màxim d’un LED típic es superin sense fondre’s. Els valors de resistència més alts produeixen poca llum.

source: La placa de control **Arduino Nano** es más barata, más pequeña y puede insertarse en una placa de prototipos simplificando el montaje del circuito completo.
ca: La placa de control ** Arduino nano ** és més barata, més petita i es pot inserir en una placa de prototip que simplifica el conjunt de circuits complet.

source: Los inconvenientes de esta placa son que tiene menor capacidad de corriente de alimentación en el regulador de 3,3 voltios y que la alimentación de 5v desde el USB tiene caída de tensión, menor capacidad de corriente (0,5A del MBR0520)y no tiene fusible reseteable.
ca: Els desavantatges d’aquesta placa són que té un corrent de potència inferior al regulador de 3,3 volts i que l’alimentació 5V de l’USB té una caiguda de tensió, una capacitat de corrent inferior (0,5A del MBR0520) i no té fusible fusible.

source: Cuando la placa Arduino Nano se alimenta desde el USB y hay una sobrecarga, **el diodo interno se funde** y la placa deja de funcionar con alimentación desde el USB. La placa seguirá funcionando solo si se alimenta externamente con pilas.
ca: Quan la placa Arduino Nano s’alimenta de l’USB i hi ha una sobrecàrrega, ** El díode intern es fon ** i la placa deixa de treballar amb els aliments de l’USB. La placa continuarà funcionant només si s’alimenta externament amb bateries.

source: Los sensores de luz más sencillos de utilizar son las resistencias LDR. Por desgracia, estas resistencias contienen un metal muy contaminante, el cadmio. Esta es la razón de que muchos suministradores de componentes electrónicos no las incluyan ya en su catálogo. El sustituto de este sensor es el fotodiodo, pero su linealidad hace que sea más difícil de manejar en entornos con cambios grandes de luminosidad. Además los fotodiodos entregan una señal de muy baja corriente que es necesario amplificar con un circuito electrónico añadido.
ca: Els sensors de llum més senzills a utilitzar són les resistències de LDR. Malauradament, aquestes resistències contenen un metall molt contaminant, cadmi. Aquesta és la raó per la qual molts proveïdors de components electrònics no els inclouen al seu catàleg. El substitut d’aquest sensor és el fotodíode, però la seva linealitat fa que sigui més difícil manejar -lo en ambients amb grans canvis de llum. A més, els fotodíodes proporcionen un senyal de corrent molt baix que és necessari per amplificar amb un circuit electrònic afegit.

source: Proyectos y componentes necesarios
ca: Projectes i components necessaris

source: Se presentan a continuación algunos proyectos de ejemplo y los componentes electrónicos necesarios para realizarlos.
ca: A continuació es presenten alguns projectes d’exemple i els components electrònics necessaris per realitzar -los.

source: Robot sigue-líneas.
ca: Robot de seguiment.

source: Dos motores de corriente continua con reductora.
ca: Dos motors actuals directes.

source: Dos sensores de luz (LDR) para detectar la línea del suelo.
ca: Dos sensors de llum (LDR) per detectar la línia del sòl.

source: En todos los casos será necesario añadir el controlador (Arduino UNO)
ca: En tots els casos, caldrà afegir el controlador (Arduino One)

source: Downloads
ca: Descàrregues

source: :download:`Cable USB para Arduino Uno <_images/arduino-uno-cable-usb.jpg>`
ca: : Descarregueu: `Cable USB per a Arduino One <_images/arduino-one-cable-useb.jpg> '
