Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/arduprog/downloads.po
Languages: ca

source: Descargas
ca: Descàrregues

source: IDE de Arduino para Windows
ca: Arduino IDE per a finestres

source: IDE para programar las placas Arduino.
ca: IDE per programar plaques Arduino.

source: `Página de descarga de la página web oficial <https://www.arduino.cc/en/software>`__
ca: `Descarregueu la pàgina del lloc web oficial <https://www.arduino.cc/en/software>`__

source: `IDE versión 1.8.13 para Windows (mayo de 2021) <../../_static/downloads/arduino-1.8.13-windows.exe>`__
ca: `IDE Versió 1.8.13 per a Windows (maig de 2021) <../../_ Static/Downloads/Arduino-1.13-Windows.exe>`__

source: Drivers para Windows
ca: Controladors per a Windows

source: `Drivers de Arduino 1.8.1 <../../_static/downloads/arduino-1813-win-drivers.zip>`__
ca: `Controladors d'Arduino 1.8.1 <../../_ Static/Downloads/Arduino-1813-Win-Divers.zip>`__

source: `Drivers de Arduino 1.0.6 <../../_static/downloads/arduino-106-win-drivers.zip>`__
ca: `Controladors d'Arduino 1.0.6 <../../_ Static/Downloads/Arduino-106-Win- Drivers.zip>`__

source: `Drivers de chip de comunicaciones CH340. <../../_static/downloads/CH340-win-driver-v31.zip>`__ Versión 3.1
ca: `CH340 Controladors de xip de comunicacions. <../../_ static/descàrregues/ch340-win-driver-v31.zip>`__ Versió 3.1

source: `Drivers de chip de comunicaciones CH340. <../../_static/downloads/CH341-win-driver-v34.zip>`__ Versión 3.4
ca: `CH340 Controladors de xip de comunicacions. <../../_ static/descàrregues/ch341-win-driver-v34.zip>`__ versió 3.4

source: `Drivers de mBot y otros robots de Makeblock. <../../_static/downloads/mBlock_Driver_for_Windows.zip>`__ Versión 3.4
ca: `Els controladors MBOT i altres robots de mapa. <../../_ Static/Downloads/mBlock_Driver_For_Windows.zip>`__ Versió 3.4

source: Librerías para Arduino IDE
ca: Biblioteques Arduino Ide

source: `Todas las librerías para Arduino <../../_static/downloads/arduino-libraries.zip>`__ listas para instalar descomprimiendo en el directorio de Arduino.
ca: `Totes les llibreries per a Arduino <../../_ static/descàrregues/arduino-libraries.zip>`__ llest per instal·lar el descomprimir al directori d'Arduino.

source: **Librerías individuales para Arduino:**
ca: ** Llibres individuals per a Arduino: **

source: :download:`PC42 <_downloads/PC42.zip>` manejo del panel de control Picuino PC42
ca: : Descarregueu: `PC42 <_Downloads/PC42.ZIP>` PC42 Gestió del panell de control PICUINO

source: `IRremote <../../_static/downloads/IRremote.zip>`__ control de emisores y receptores de infrarrojos
ca: `Irremote <../../_ Static/Downloads/Irremote.Zip>`__ Control de emissors i receptors d'infrarojos

source: `dht11 <../../_static/downloads/dht11.zip>`__ control del sensor de humedad y temperatura DHT11
ca: `Dht11 <../../_ static/descàrregues/dht11.zip>`__ Control del sensor de la humitat i la temperatura DHT11

source: `LiquidCrystal <../../_static/downloads/LiquidCrystal.zip>`__ control de paneles visualizadores LCD
ca: `LiquidCrystal <../../_ Static/Descàrregues/LiquidCrystal.zip>`__ Visualització del control del panell LCD

source: `NewliquidCrystal <../../_static/downloads/NewliquidCrystal.zip>`__ control de paneles visualizadores LCD
ca: `NewLiquidcrystal <../../_ static/descàrregues/newliquidcrystal.zip>`__ Control de panells de visualitzadors LCD

source: `SCoop <../../_static/downloads/SCoop.zip>`__ programación multitarea
ca: `Scoop <../../_ static/descàrregues/scoup.zip>`__ Programació de multitasking

source: `SDPlus <../../_static/downloads/SDPlus.zip>`__ manejo de memorias SD
ca: `Sdplus <../../_ static/descàrregues/sdplus.zip>`__ gestió de memòries sd

source: `makeblock <../../_static/downloads/makeblock.zip>`__ manejo de mBot y otros robots de makeblock
ca: `MakeBlock <../../_ static/descàrregues/makeblock.zip>`__ gestió de mbot i altres robots de makeBlock

source: `Wire <../../_static/downloads/Wire.zip>`__ comunicaciones serie I2C/TWI
ca: `Filferro <../../_ static/descàrregues/wire.zip>`__ Comunicacions de la sèrie I2C

source: La librería Wire está incluída por defecto en el entorno de programación para Arduino. En el caso de que el entorno de programación sea muy antiguo y no incluya la librería, se puede descargar e instalar esta versión.
ca: La llibreria de filferro s’inclou de manera predeterminada a l’entorn de programació d’Arduino. En cas que l’entorn de programació sigui molt antic i no inclogui la llibreria, aquesta versió es pot descarregar i instal·lar.

source: Panel de control Picuino
ca: Tauler de control de Picuino

source: Librerías para el manejo del panel de control Picuino PC42
ca: PC42 PICUINO CONTROL BIBLIOTETES

source: :download:`PC42 versión 1.5.7 (marzo-2018) <_downloads/PC42_157.zip>`
ca: : Descarregueu: `PC42 Versió 1.5.7 (març de 2018) <_Downloads/PC42_157.zip>`

source: Entorno de programación por bloques para Arduino.
ca: Entorn de programació de blocs per a Arduino.

source: :download:`Ardublock-Picuino v1.4.4 <_downloads/ardublock-picuino-1.4.4.zip>`
ca: : Descarregueu: `ardublock-picuino v1.4.4 <_downloads/arduck-picuino-1.4.4.zip>`

source: :download:`Ardublock-Picuino v1.4.2 <_downloads/ardublock-picuino-1.4.2.zip>`
ca: : Descarregueu: `ardublock-picuino v1.4.2 <_downloads/arduck-picuino-1.4.2.zip>`

source: :download:`Ardublock-Picuino v1.3.1 <_downloads/ardublock-picuino-2017-3.zip>`
ca: : Descarregueu: `ardublock-picuino v1.3.1 <_downloads/arduck-picuino-2017-3.zip>`

source: `Ardublock Original <../../_static/downloads/ardublock-original.zip>`__
ca: `Ardublock original <../../_ static/descàrregues/ardublock-original.zip>`__ __

source: Fritzing
ca: Fregar

source: Fritzing es un programa libre (open-source) para Windows, Mac y Linux que permite realizar esquemas eléctricos y cableados con imágenes realistas para Arduino y protoboard.
ca: Fritzing és un programa gratuït (codi obert) per a Windows, Mac i Linux que permet esquemes elèctrics i per cable amb imatges realistes per a Arduino i Protoboard.

source: `Fritzing versión 0.9.4 64bits para Windows <../../_static/downloads/fritzing.0.9.4.64.pc_and_dll.zip>`__
ca: `Fritzing Versió 0.9.4 64 Bits per a Windows <../../_ Static/Downloads/Fritzing.0.9.4.64.pc_and_dll.zip>`__

source: `Página oficial de Fritzing <https://fritzing.org/home/>`__
ca: `Pàgina oficial de Fritzing <https://fritzing.org/home/>`__

source: `Código fuente de Fritzing en GitHub <https://github.com/fritzing>`__
ca: `Fritzing Codi font a GitHub <https://github.com/fritzing>`__
