Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/arduprog/pc42-key2.po
Languages: ca

source: Pulsadores y Eventos
ca: Botons i esdeveniments

source: Objetivos
ca: Els pendents

source: Leer los eventos asociados a un pulsador.
ca: Llegiu els esdeveniments associats a un botó.

source: Programar Arduino para que responda a los eventos de los pulsadores.
ca: Programa Arduino per respondre als esdeveniments del botó.

source: Eventos relacionados con los pulsadores
ca: Esdeveniments relacionats amb la factura

source: A la hora de leer un pulsador, se debe distinguir los estados de los eventos.
ca: En llegir un botó, s’han de distingir els estats dels esdeveniments.

source: Un **estado** se mantiene en el tiempo. Un ejemplo de estado es el valor presionado de un pulsador. Mientras el pulsador está presionado, el estado vale uno. Cuando el pulsador no está presionado, el estado vale cero.
ca: Un estat ** ** es manté amb el pas del temps. Un exemple d’estat és el valor premsat d’un botó. Mentre es prem el botó, l’estat val un. Quan no es prem el botó, l'estat val zero.

source: Un **evento**, por el contrario, solo es verdadero al comenzar un nuevo estado. En el caso anterior, al presionar un pulsador el evento presionado vale uno la primera vez que se lee. A partir de ese momento, siempre vale cero hasta que se vuelva a cumplir la condición de pulsador presionado.
ca: Un esdeveniment ** **, al contrari, només és cert al començament d’un nou estat. En el cas anterior, prement un botó, l'esdeveniment premsat val la primera vegada que llegeix. A partir d’aquest moment, sempre val la pena zero fins que es prement la condició d’un botó.

source: Los **eventos** son útiles cuando se desea realizar una sola acción al presionar una tecla. En el siguiente gráfico se puede ver la diferencia entre estado y evento.
ca: Els ** esdeveniments ** són útils quan voleu realitzar una sola acció en prémer una tecla. Al gràfic següent podeu veure la diferència entre estat i esdeveniment.

source: La función :cpp:func:`keyEvents`
ca: La funció: cpp: func: `keyales`

source: Esta función devuelve el valor de los eventos que se producen en un pulsador. Los eventos que puede devolver la función son los siguientes
ca: Aquesta funció retorna el valor dels esdeveniments que es produeixen en un botó. Els esdeveniments que la funció pot retornar són els següents

source: Evento
ca: Aconteixement

source: Significado
ca: Significat

source: El pulsador se ha presionado durante 0,02 segundos
ca: El botó ha estat premsat durant 0,02 segons

source: El pulsador se ha presionado durante 0,5 segundos
ca: El botó ha estat premsat durant 0,5 segons

source: El pulsador se ha presionado durante 2,0 segundos
ca: El botó s'ha premut durant 2,0 segons

source: KEY_RELEASED
ca: Key_releed

source: El pulsador se ha dejado de presionar
ca: El botó ha deixat de prémer

source: Estos valores de tiempo son los valores predefinidos después de iniciar la placa y se pueden cambiar en la configuración.
ca: Aquests valors de temps són valors predefinits després d’iniciar la placa i es poden canviar a la configuració.

source: Encender un led al presionar un pulsador cierto tiempo
ca: Encendre un LED prement un botó un cert temps

source: En este ejemplo, un led se encenderá después de que se presione su pulsador durante más de medio segundo
ca: En aquest exemple, un LED s'encendrà després que el botó es premeu més de mig segon

source: El ejemplo puede modificarse con facilidad para que se encienda después de presionar dos segundos.
ca: L’exemple es pot modificar fàcilment perquè s’encengui després de prémer dos segons.

source: Múltiples funciones en un pulsador
ca: Múltiples funcions en un botó

source: Este ejemplo es un poco más complejo y demuestra la capacidad de los eventos para dar más de un significado a un solo pulsador. Gracias a esta capacidad, un solo pulsador podrá realizar muchas funciones por sí solo.
ca: Aquest exemple és una mica més complex i demostra la capacitat dels esdeveniments per donar més d’un significat a un sol botó. Gràcies a aquesta capacitat, un sol botó pot realitzar moltes funcions només.

source: Ejercicios
ca: Exercicis

source: Programa el código necesario para resolver los siguientes problemas.
ca: Programa el codi necessari per resoldre els problemes següents.

source: El siguiente programa enciende el led D1 al presionar el pulsador D1 y apaga el led D1 al volver a presionar el pulsador 1. Se utiliza una variable para almacenar el estado del led D1. Se pide modificar el programa para que también el led D2 se encienda y apague con el pulsador 2.
ca: El programa següent encén el LED D1 en prémer el botó D1 i apaga el LED D1 en prémer el botó de nou 1. S'utilitza una variable per emmagatzemar l'estat LED D1. Es demana que modifiqui el programa de manera que el LED D2 també s’encengui i s’apagui amb el botó 2.

source: El siguiente programa mueve hacia la derecha un led cuando se presiona el pulsador 2. Modificar el programa para que el led se mueva hacia la izquierda al presionar el pulsador 1.
ca: El programa següent mou un LED a la dreta quan es prem el botó. Modifiqueu el programa de manera que el LED es mogui a l'esquerra prement el botó 1.

source: Modificar el programa anterior para que se encienda el led D1 y se apaguen el resto de ledes al presionar el pulsador 6 ``KEY_BACK`` durante dos segundos.
ca: Modifiqueu el programa anterior per activar el LED D1 i desactiveu la resta de LEDS prement el botó 6 `` key_back`` durant dos segons.
