Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/arduprog/pc42-intro.po
Languages: ca

source: Introducción al panel PC42
ca: Introducció al panell PC42

source: El panel de control Picuino PC42 es un componente electrónico que permite a una placa Arduino mostrar y recibir información por parte del usuario con luces led, pulsadores, sonidos y un display de 7 segmentos.
ca: El panell de control PC42 PICUINO és un component electrònic que permet que una placa Arduino mostri i rebi informació de l’usuari amb llums LED, botons, sons i una pantalla de 7 segments.

source: Con el panel de control, realizar programas interactivos para Arduino es más sencillo e intuitivo. Los numerosos ejemplos y ejercicios de este tutorial facilitan el aprendizaje desde cero, ayudando con ejercicios guiados que reducen la complejidad y las dudas.
ca: Amb el tauler de control, realitzar programes interactius per a Arduino és més fàcil i intuïtiu. Els nombrosos exemples i exercicis d’aquest tutorial faciliten l’aprenentatge des de zero, ajudant amb exercicis guiats que redueixen la complexitat i els dubtes.

source: La instalación es muy sencilla, solo es necesario conectar 4 cables e instalar una librería en el entorno IDE de Arduino. Todos los pasos están detallados en el :ref:`apartado de instalación <pc42-install>`.
ca: La instal·lació és molt senzilla, només cal connectar 4 cables i instal·lar una llibreria a l’entorn ARDUINO IDE. Tots els passos es detallen a: Ref: `Secció d'instal·lació <C42-install>`.

source: Las entradas del panel están protegidas contra inversión de polaridad, de manera que un error en la conexión no destruye el panel.
ca: Els bitllets del panell estan protegits contra la inversió de polaritat, de manera que un error en la connexió no destrueix el panell.

source: ¿Por qué utilizar el panel de control PC42?
ca: Per què utilitzar el tauler de control PC42?

source: Incluye un **tutorial** que sirve de guía de aprendizaje paso a paso.
ca: Inclou un ** tutorial ** que serveix com a guia d’aprenentatge a pas.

source: Incluye **ejercicios** para aprender a programar.
ca: Inclou ** exercicis ** per aprendre a programar.

source: Incluye **Ardublock** para programar con **bloques gráficos**.
ca: Inclou ** Arcublock ** per programar amb ** blocs gràfics **.

source: Evita errores porque **reduce conexiones** de cables con placas de prototipos.
ca: Eviteu els errors perquè ** redueix les connexions ** Cables amb plaques de prototip.

source: Agrupa en una **pequeña placa** muchos componentes discretos.
ca: Grup en una placa petita ** molts components discrets.

source: Es **robusto** y no se destruye por una mala conexión.
ca: És ** Robust ** i no es destrueix per una mala connexió.

source: Facilita el **montaje rápido** de proyectos complejos.
ca: Facilita el conjunt ràpid ** de projectes complexos.

source: Características técnicas
ca: Característiques tècniques

source: El panel de control está compuesto por los siguientes componentes:
ca: El tauler de control està compost pels components següents:

source: Un visualizador de 7 segmentos y 4 cifras
ca: Un segment de 7 i 4 figures es mostren

source: Seis led, uno de ellos RGB
ca: Sis leds, un d’ells RGB

source: Un zumbador para emitir tonos
ca: Un sonor per emetre tons

source: Seis pulsadores
ca: Sis botons

source: Un microcontrolador que controla todos los componentes
ca: Un microcontrolador que controla tots els components

source: Sus especificaciones técnicas son las siguientes:
ca: Les seves especificacions tècniques són les següents:

source: Tensión de alimentación: 5 voltios.
ca: Tensió alimentària: 5 volts.

source: Consumo eléctrico: 8mA en reposo, 80 mA con todos los led y display encendidos.
ca: Consum elèctric: 8è en repòs, 80 mA amb tots els LED i exhibició encesa.

source: Comunicación serie TWI / I2C con dirección 74 decimal (0x4A hexadecimal)
ca: Comunicació de la sèrie TWI / I2C amb 74 adreça decimal (0x4a hexadecimal)

source: Dimensiones: 50 x 55 x 12 mm
ca: Dimensions: 50 x 55 x 12 mm

source: Peso: 10 gr
ca: Pes: 10 GR

source: **Una tensión de alimentación mayor de 5 voltios dañará la placa de forma permanente.**
ca: ** Una tensió d'alimentació superior a 5 volts danyarà la placa de manera permanent. **
