Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/arduprog/pc42-led2.po
Languages: ca

source: Parpadeo de los LED
ca: Parpelleig LED

source: Objetivos
ca: Els pendents

source: Generar parpadeo de ledes mediante la función ledBlink.
ca: Generar parpelleig de LED mitjançant la funció LEDBLINK.

source: La función :cpp:func:`ledBlink`
ca: La funció: CPP: Fun: `ledblink '

source: Esta función hace parpadear a un led con una cadencia determinada. Sus parámetros son los siguientes:
ca: Aquesta funció parpelleja un LED amb una certa cadència. Els seus paràmetres són els següents:

source: ``ledNum``: led que va a parpadear. Los valores válidos van desde 1 para el led D1 hasta 8 para el color azul del led D6.
ca: `` lednum``: LED que parpellejarà. Els valors vàlids oscil·len entre 1 per LED D1 a 8 per al color blau del LED D6.

source: El led D6 es un led RGB, que integra 3 ledes en su interior. Los números 6, 7, 8 representan respectivamente los colores rojo, verde y azul del led D6.
ca: El LED D6 és un LED RGB, que integra 3 LEDs al seu interior. Els números 6, 7, 8 representen respectivament els colors vermells, verds i blaus del LED D6.

source: ``time_on``: tiempo, en milésimas de segundo, que el led debe permanecer encendido. Si este parámetro vale cero, el led permanecerá encendido todo el tiempo.
ca: `` Temps_on ': temps, en mil·lèsimes de segon, que el LED ha de romandre en marxa. Si aquest paràmetre val zero, el LED romandrà en tot el temps.

source: ``time_off``: tiempo, en milésimas de segundo, que el led debe permanecer apagado.
ca: `` Temps_off``: temps, en mil·lèsimes de segon, que el LED ha de romandre fora.

source: Cada vez que se ejecuta la función :cpp:func:`ledBlink`, el led comienza el ciclo encendiéndose durante el tiempo ``time_on``. Esto puede servir para sincronizar el comienzo del parpadeo de un led. Si la función :cpp:func:`ledBlink` se ejecuta repetidamente cada poco tiempo, el led permanecerá todo el tiempo encendido, puesto que su tiempo encendido se reinicia una y otra vez.
ca: Cada vegada que s’executa la funció: CPP: FUN: `LEDBLINK`, el LED comença la il·luminació del cicle al llarg del temps` TIME_ON``. Es pot utilitzar per sincronitzar l’inici del parpelleig d’un LED. Si la funció: CPP: Fun: `ledblink` s’executa repetidament cada poc temps, el LED es mantindrà tot el temps, ja que el seu temps es reinicia una i altra vegada.

source: Parpadeo del led D1
ca: LED D1 Flash

source: En este ejemplo se desea hacer parpadear al led D1 con un tiempo encendido de medio segundo y un tiempo apagado de medio segundo. El período de parpadeo será por lo tanto de un segundo. En este caso la función se dará desde el bloque ``setup()`` una sola vez.
ca: En aquest exemple, voleu parpellejar a la LED D1 amb un temps a mig segon i un temps de mig segon. Per tant, el període parpelleig serà de segon. En aquest cas, la funció es donarà a la `` configuració () `` `` `` `

source: Programa equivalente en el entorno Ardublock:
ca: Programa equivalent a l’entorn Arcublock:

source: En este enlace se puede descargar el :download:`archivo de programa para entorno Ardublock 'ledBlink' <_downloads/ardublock_ledBlink.abp>`
ca: En aquest enllaç podeu descarregar: Descarregueu: `Fitxer de programa per a Arcublock 'Ledblink' <_downloads/ardublock_ledblink.abp>` `

source: Ejercicios
ca: Exercicis

source: Programa el código necesario para resolver los siguientes problemas.
ca: Programa el codi necessari per resoldre els problemes següents.

source: Hacer parpadear el led D1 y el led D4 con un tiempo de encendido de medio segundo y un tiempo de apagado de medio segundo. Los dos ledes se deben encender y apagar al mismo tiempo. Utilizar la función :cpp:func:`ledBlink`.
ca: Flash el LED D1 i el LED D4 amb un temps d’encesa mig segon i mig segon de temps. Els dos LED s’han d’encendre i desactivar alhora. Utilitzeu la funció: CPP: Fun: `ledblink`.

source: Modificar el ejercicio anterior para que el encendido de los dos ledes D1 y D4 sea alternativo, de manera que solo un led esté encendido en cada momento. El tiempo de encendido de cada led será de medio segundo.
ca: Modifiqueu l'exercici anterior de manera que l'encesa dels dos LED D1 i D4 sigui alternativa, de manera que només un LED està en tot moment. El temps d’encesa de cada LED serà mig segon.

source: Hacer parpadear dos led a la vez con una frecuencia de un segundo. El led D1 se programará con la función ``ledBlink(1, 500, 500)``, por el contrario el led D3 se programará con el siguiente código.
ca: Feu que dos LED flaixin alhora amb una freqüència de segon. El LED D1 es programarà amb el `` ledblink (1, 500, 500) ``, al contrari, el LED D3 es programarà amb el codi següent.

source: Se debe intentar sincronizar los dos ledes para que parpadeen a la vez ajustando los tiempos de encendido modificando el tiempo de la función ``delay(500)``.
ca: Heu d’intentar sincronitzar els dos LED per parpellejar alhora ajustant els temps d’encesa modificant el temps de la funció `` de retard (500) `.

source: Corregir los errores sintácticos del siguiente programa para conseguir que funcione correctamente.
ca: Corregiu els errors sintàctics del programa següent per fer -lo funcionar correctament.

source: Hacer parpadear a un led de manera que se encienda durante dos décimas de segundo cada diez segundos, para indicar que el módulo está funcionando gastando muy poca energía.
ca: Feu un flaix LED d’una manera que s’encengui durant dues dècimes de segon cada deu segons, per indicar que el mòdul funciona gastant molt poca energia.

source: Hacer parpadear a un led de manera que se encienda durante dos décimas de segundo, cada segundo.
ca: Feu un flaix LED d’una manera que s’encengui durant dues dècimes de segon, cada segon.

source: Los seis primeros ledes se deben encender en secuencia de manera que comience por encenderse el led D1 y termine por encenderse el led D6. entre el encendido de un led y el siguiente debe pasar entre 250 y 500 milésimas de segundo. Una vez que todos los ledes estén encendidos, comenzarán a apagarse por el led D1 hasta que todos estén apagados. Nota: Para resolver este problema, se debe utilizar solo una función :cpp:func:`ledBlink` por cada led, junto con una función `delay()` para esperar un tiempo entre un encendido y el siguiente.
ca: Els primers sis LED s’han d’encendre en seqüència de manera que el LED D1 s’encengui i acabi en el LED D6. Entre l’encesa d’un LED i el següent ha de passar entre 250 i 500 mil·lèsimes de segon. Un cop s’encenguin tots els LED, començaran a sortir pel LED D1 fins que tothom estigui apagat. Nota: Per solucionar aquest problema, només s'ha d'utilitzar una funció: CPP: Fun: `LedBlink` per a cada LED, juntament amb la funció de retard ()` per esperar un temps entre una ignició i la següent.
