Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/arduprog/pc42-install.po
Languages: ca

source: Instalación del panel de control PC42
ca: Instal·lació del panell de control PC42

source: Objetivos
ca: Els pendents

source: Conectar el panel de control PC42 a una placa Arduino
ca: Connecteu el tauler de control PC42 a una placa Arduino

source: Instalar las :download:`librerías necesarias para programar el panel PC42 <_downloads/PC42.zip>`
ca: Instal·leu: Descarregueu: `Biblioteques necessàries per programar el panell PC42 <_downloads/pc42.zip>` `

source: Instalar la :download:`herramienta Ardublock-Picuino <_downloads/ardublock-picuino.zip>` para programar con bloques gráficos
ca: Instal·leu: Descarregueu: `eina Arcublock-Picuino <_Downloads/Arduck-Picuino.Zip>` Per programar amb blocs gràfics

source: Instalar otras `librerías auxiliares de Arduino. <../../_static/downloads/arduino-libraries.zip>`__
ca: Instal·leu altres "biblioteques auxiliars d'Arduino. <../../_ static/descàrregues/arduino-libraries.zip>`__

source: Instalación
ca: Instal·lació

source: Para instalar el panel de control Picuino PC42 es necesario realizar dos operaciones:
ca: Per instal·lar el tauler de control PC42 PICUINO, cal realitzar dues operacions:

source: Conectar el panel PC42 a un Arduino mediante 4 cables macho-hembra
ca: Connecteu el panell PC42 a un Arduino per 4 cables masculins-hembra

source: Instalar la librería de control PC42
ca: Instal·leu la biblioteca de control PC42

source: Además se puede añadir la herramienta Ardublock de programación por bloques.
ca: També podeu afegir l’eina de programació de blocs Ardublock.

source: Conexión con Arduino UNO
ca: Connexió amb Arduino One

source: Las conexiones necesarias para comunicar la placa Arduino UNO con el panel PC42 se listan en la siguiente tabla:
ca: A la taula següent es mostren les connexions necessàries per comunicar la placa Arduino UNO amb el panell PC42:

source: Pin
ca: Agulla

source: Panel PC42
ca: Tauler PC42

source: Arduino UNO
ca: Arduino One

source: Azul
ca: Blava

source: Marrón
ca: Marró

source: Las conexiones del panel PC42 están protegidas contra inversión de polaridad, de manera que el panel no se dañará aunque se intercambien los cables entre sí. La única conexión que puede causar daños permanentes en el panel es una alimentación por encima de 5 voltios, que se puede encontrar en el pin "Vin" de Arduino cuando este es alimentado con batería externa.
ca: Les connexions del panell PC42 estan protegides contra la inversió de polaritat, de manera que el panell no es danyarà encara que els cables s’intercanvien. L’única connexió que pot causar danys permanents al panell és una dieta per sobre de 5 volts, que es pot trobar al pin \ "d'Arduino quan s'alimenta amb bateria externa.

source: Conexión con Arduino Nano
ca: Connexió amb Arduino Nano

source: Las conexiones necesarias para comunicar la placa Arduino Nano con el panel PC42 se listan en la siguiente tabla:
ca: A la taula següent es mostren les connexions necessàries per comunicar la placa Nano Arduino amb el panell PC42:

source: Instalación del entorno Arduino
ca: Instal·lació de l’entorn Arduino

source: Para poder trabajar con la placa Arduino es necesario instalar el software de programación de Arduino y los drivers correspondientes.
ca: Per tal de treballar amb la placa Arduino, cal instal·lar el programari de programació Arduino i els controladors corresponents.

source: En la sección de :ref:`solución de problemas con Arduino <troubleshooting-arduino>` se pueden encontrar todos los pasos para instalar el software de la placa Arduino y resolver los errores de instalación más frecuentes.
ca: A la secció de: Ref: `Solució de problemes amb Arduino <Resolució de problemes-Supplies>` Tots els passos per instal·lar el programari de plaques Arduino i resoldre els errors d'instal·lació més freqüents es poden trobar.

source: Instalación de la librería para el panel PC42
ca: Instal·lació de la llibreria per al panell PC42

source: Para que el panel de control PC42 pueda funcionar es necesario descargar e instalar una librería para Arduino.
ca: Per tal que funcioni el tauler de control PC42, cal descarregar i instal·lar una llibreria per a Arduino.

source: Descargar la librería del panel de control PC42 para Arduino.
ca: Descarregueu la llibreria del panell de control PC42 per a Arduino.

source: :download:`Librería PC42 r3 <_downloads/PC42.zip>`
ca: : Descarregueu: `PC42 R3 Bookstore <_Downloads/PC42.zip>`

source: Seguir los pasos de instalación descritos en la siguiente página.
ca: Seguiu els passos d’instal·lació descrits a la pàgina següent.

source: Instalación de Ardublock
ca: Instal·lació Ardublock

source: Ardublock es una herramienta para Arduino que permite programar con bloques gráficos. Está orientada para facilitar la programación a los usuarios sin experiencia, simplificando mucho la tarea de realizar programas con un sencillo entorno gráfico.
ca: Ardublock és una eina per a Arduino que permet programar amb blocs gràfics. Està orientat a facilitar la programació als usuaris sense experiència, simplificant la tasca de realitzar programes amb un entorn gràfic senzill.

source: La versión de Ardublock-Picuino es aún más simple que el proyecto Ardublock original y contiene las instrucciones necesarias para la programación del panel de control PC42.
ca: La versió Arcublock-Picuino és encara més senzilla que el projecte Arcublock original i conté les instruccions necessàries per a la programació del panell de control PC42.

source: Para instalar la última versión de Ardublock-Picuino hay que seguir los siguentes pasos:
ca: Per instal·lar la versió més recent d’Ardublock-Picuino, heu de seguir els passos següents:

source: Descargar la :download:`herramienta Ardublock-Picuino <_downloads/ardublock-picuino.zip>`
ca: Descarregueu LA: Descarregueu: `eina Arcublock-Picuino <_downloads/arduck-picuino.zip>`

source: Copiar el archivo en el directorio de Arduino. El directorio se puede encontrar en el entorno de Arduino, pulsando el menú:
ca: Copieu el fitxer al directori Arduino. El directori es pot trobar a l’entorn Arduino, prement el menú:

source: ``Archivo... Preferencias... Localización del proyecto``.
ca: `` Arxiu ... preferències ... Ubicació del projecte ''.

source: Descomprir el archivo en el directorio de Arduino.
ca: Descomprimeix el fitxer al directori d'Arduino.

source: Cerrar y volver a abrir el entorno de Arduino. La nueva herramienta debe aparecer en el menú:
ca: Tancar i reobrir l’entorn d’Arduino. La nova eina ha d’aparèixer al menú:

source: ``Herramientas... Ardublock``
ca: `` Eines ... ardublock ''

source: Instalación de librerías auxiliares para Arduino
ca: Instal·lació de llibreries auxiliars per a Arduino

source: Estas librerías permiten que la placa Arduino controle periféricos tales como un un panel visualizador LCD o emisores y receptores infrarrojos.
ca: Aquestes biblioteques permeten a la placa Arduino controlar els perifèrics com ara un panell de visualitzadors LCD o emissors i receptors d’infrarojos.

source: `Archivo de librerías para Arduino. <../../_static/downloads/arduino-libraries.zip>`__
ca: `Arxiu de llibreries per a Arduino. <../../_ static/descàrregues/arduino-libraries.zip>`__

source: En este paquete se pueden encontrar juntas las siguientes librerías:
ca: En aquest paquet podeu trobar junts les següents llibreries:

source: `DHT11 <../../_static/downloads/dht11.zip>`__ control del sensor de humedad y temperatura DHT11
ca: `Dht11 <../../_ static/descàrregues/dht11.zip>`__ Control del sensor de la humitat i la temperatura DHT11

source: `IRremote <../../_static/downloads/IRremote.zip>`__ control de emisores y receptores de infrarrojos
ca: `Irremote <../../_ Static/Downloads/Irremote.Zip>`__ Control de emissors i receptors d'infrarojos

source: `LiquidCrystal <../../_static/downloads/LiquidCrystal.zip>`__ control de paneles visualizadores LCD
ca: `LiquidCrystal <../../_ Static/Descàrregues/LiquidCrystal.zip>`__ Visualització del control del panell LCD

source: `NewliquidCrystal <../../_static/downloads/NewliquidCrystal.zip>`__ control de paneles visualizadores LCD
ca: `NewLiquidcrystal <../../_ static/descàrregues/newliquidcrystal.zip>`__ Control de panells de visualitzadors LCD

source: `SCoop <../../_static/downloads/SCoop.zip>`__ programación multitarea
ca: `Scoop <../../_ static/descàrregues/scoup.zip>`__ Programació de multitasking

source: `SDPlus <../../_static/downloads/SDPlus.zip>`__ manejo de memorias SD
ca: `Sdplus <../../_ static/descàrregues/sdplus.zip>`__ gestió de memòries sd

source: `makeblock <../../_static/downloads/makeblock.zip>`__ manejo de robots y gadgets de Makeblock
ca: `MakeBlock <../../_ static/descàrregues/makeblock.zip>`__ Gestió de robots i aparells de makeBlock

source: :download:`PC42 <_downloads/PC42.zip>` manejo del panel de control Picuino PC42
ca: : Descarregueu: `PC42 <_Downloads/PC42.ZIP>` PC42 Gestió del panell de control PICUINO

source: Para **instalar todas las librerías a la vez**, hay que seguir los siguientes pasos:
ca: Per instal·lar totes les llibreries alhora **, heu de seguir els passos següents:

source: Descargar el `archivo con las librerías para Arduino <../../_static/downloads/arduino-libraries.zip>`__
ca: Descarregueu l'arxiu amb les llibreries per arduino <../../_ static/descàrregues/arduino-libraries.zip>`__

source: Cerrar y volver a abrir el entorno de Arduino. Las nuevas librerías deben aparecer en el menú:
ca: Tancar i reobrir l’entorn d’Arduino. Les noves llibreries haurien d’aparèixer al menú:

source: ``Programa... Incluir librería...``
ca: `` Programa ... Inclou la llibreria ... '

source: Para instalar librerías individuales utilizando el entorno Arduino, se puede leer el siguiente enlace sobre :ref:`cómo añadir una librería al entorno Arduino <add-library>`.
ca: Per instal·lar llibreries individuals mitjançant l’entorn Arduino, podeu llegir el següent enllaç a: Ref: `Com afegir una llibreria a l’entorn Arduino <den-library>`.
