Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/arduprog/pc42-key1.po
Languages: ca

source: Pulsadores y Estados
ca: Botons i estats

source: Objetivos
ca: Els pendents

source: Leer el estado de un pulsador.
ca: Llegiu l’estat d’un botó.

source: Programar Arduino para que responda a las pulsaciones del usuario.
ca: Programa Arduino per respondre a les pulsacions de l'usuari.

source: Pulsadores del panel de control PC42
ca: Botons de panell de control PC42

source: El panel PC42 dispone de un teclado con seis pulsadores. Cada pulsador se identifica con un número o con una constante que lleva su nombre. El nombre de cada pulsador puede verse en la serigrafía del circuito impreso. Las seis constantes y números que representan a los pulsadores son los siguientes.
ca: El tauler PC42 té un teclat amb sis botons. Cada botó s’identifica amb un número o una constant que porta el seu nom. El nom de cada botó es pot veure a la pantalla d'impressió del circuit imprès. Les sis constants i números que representen els botons són les següents.

source: Constante
ca: Constant

source: Pulsador
ca: Botó

source: El número de pulsador se representará en este manual como ``keyNum``.
ca: El nombre de botons es representarà en aquest manual com a `` keynum``.

source: La función :cpp:func:`keyPressed`
ca: La funció: CPP: Func: `KeyPressed`

source: Esta función devuelve el valor de un pulsador. Devuelve el valor 1 si el pulsador está presionado y 0 si no lo está. El valor de esta función filtra el ruido eléctrico y los rebotes.
ca: Aquesta funció retorna el valor d’un botó. Retorna el valor 1 Si es prem el botó i 0 si no ho és. El valor d’aquesta funció filtra el soroll elèctric i els rebots.

source: El **ruido eléctrico** son interferencias asociadas a los motores eléctricos, a los interruptores, a las modernas lámparas de bajo consumo o a los teléfonos móviles. Cualquiera de estos aparatos puede provocar que durante un breve momento un pulsador parezca estar presionado aunque no sea cierto. Es muy recomendable filtrar este ruido para evitar pulsaciones 'falsas' o 'fantasmas'.
ca: El soroll elèctric ** ** són interferències associades a motors elèctrics, interruptors, llums modernes de baix consum o telèfons mòbils. Qualsevol d'aquests dispositius pot fer que es prengui un botó durant un breu moment, fins i tot si no és cert. És molt recomanable filtrar aquest soroll per evitar pulsacions "falses" o "fantasmes".

source: Los rebotes son un fenómeno que provoca que el pulsador no haga contacto durante un período corto de tiempo, unos milisegundos, justo después de presionarle porque la chapa metálica 'rebota' y deja de hacer contacto. Este fenómeno puede provocar que se interprete una pulsación como dos pulsaciones, por lo que es recomendable que se filtre para eliminarlo.
ca: Els rebots són un fenomen que fa que el botó no es posi en contacte durant un període de temps curt, alguns mil·lisegons, just després de prémer -lo perquè la xapa metàl·lica "rebot" i deixa de posar -se en contacte. Aquest fenomen pot fer que la pulsació s’interpreti com a dues pulsacions, de manera que es recomana filtrar -la per eliminar -la.

source: La desventaja de este filtro de ruido consiste en que esta función tiene un retardo de 20 milisegundos en responder desde que cambia el estado real del pulsador hasta que devuelve el valor correcto.
ca: L’inconvenient d’aquest filtre de soroll és que aquesta funció té un retard de 20 mil·lisegons per respondre ja que l’estat real del botó canvia fins que retorna el valor correcte.

source: Si se utiliza el argumento ``KEY_ALL``, la función devuelve un número que depende de la suma de los pulsadores que se encuentren presionados.
ca: Si s'utilitza l'argument `` key_all``, la funció retorna un número que depèn de la suma dels botons que es pressionen.

source: Pulsador presionado
ca: Botó de pressió

source: Valor devuelto
ca: Valor retornat

source: Valor devuelto (binario)
ca: Valor retornat (binari)

source: Si se encuentra presionado el pulsador 4, la función devolverá el valor 8. Con el pulsador 6 presionado, la función devolverá el valor 32. Si se presionan los dos pulsadores 4 y 6 a la vez, la función devolverá la suma de 8 y 32, es decir 40.
ca: Si es prem el botó, la funció retornarà el valor 8. Amb el botó 6 pressionat, la funció retornarà el valor 32. Si els dos botons 4 i 6 es premsen alhora, la funció retornarà la suma de 8 i 32, és a dir, 40.

source: Encender un led con un pulsador
ca: Enceneu un LED amb un botó

source: El siguiente programa encenderá el led D1 cuando se presione el pulsador 1 (``KEY_LEFT``)
ca: El programa següent s'encendrà el LED D1 quan es prem el botó 1 (`` key_left`))

source: Programa equivalente en el entorno Ardublock:
ca: Programa equivalent a l’entorn Arcublock:

source: En este enlace se puede descargar el :download:`archivo de programa para entorno Ardublock 'keyPressed' <_downloads/ardublock_keyPressed.abp>`
ca: En aquest enllaç podeu descarregar: Descarregueu: `Program Archive for Environment

source: Apagar un led con un pulsador
ca: Apagueu un LED amb un botó

source: El siguiente programa realizará la función contraria al anterior, apagará el led D1 cuando se presione el pulsador 1 (``KEY_LEFT``)
ca: El programa següent realitzarà la funció contrària a l'anterior

source: El lenguaje de Arduino permite escribir la última función del programa anterior de muchas otras formas. Estas son algunas alternativas que consiguen el mismo resultado.
ca: El llenguatge d’Arduino permet escriure l’última funció del programa anterior en moltes altres formes. Aquestes són algunes alternatives que aconsegueixen el mateix resultat.

source: Como se puede ver, el lenguaje de Arduino es muy rico en expresiones. Gracias a esto es un lenguaje muy potente y, a su vez, complejo de aprender. Por esta razón en los ejemplos siguientes aparecerá el mínimo número de expresiones lógicas, para no complicar el aprendizaje.
ca: Com veieu, el llenguatge d’Arduino és molt ric en expressions. Gràcies a això, és un llenguatge molt potent i, al seu torn, complex per aprendre. Per aquest motiu, en els exemples següents apareixerà el nombre mínim d’expressions lògiques, per no complicar l’aprenentatge.

source: El programa equivalente en el entorno Ardublock resulta más sencillo:
ca: El programa equivalent a l’entorn Arcublock és més fàcil:

source: :download:`Programa para entorno Ardublock: 'keyPressed_2' <_downloads/ardublock_keyPressed_2.abp>`
ca: : Descarregueu: `Programa d'entorn Arcublock: 'keyPressed_2' <_downloads/ardublock_keypresssed_2.abp>` ``

source: La función :cpp:func:`keyValue`
ca: La funció: CPP: Fun: `KeyValue`

source: Esta función es semejante a la función :cpp:func:`keyPressed` vista anteriormente. Devuelve el valor de un pulsador. Si el pulsador está presionado, devuelve el valor 1 si el pulsador no está presionado devuelve el valor 0. Esta función no filtra el ruido eléctrico como lo hace la función :cpp:func:`keyPressed`.
ca: Aquesta funció és similar a la funció: CPP: Fun: `KeyPressed 'View abans. Retorna el valor d’un botó. Si es prem el botó, retorna el valor 1 Si no es prem el botó retorna el valor 0. Aquesta funció no filtra el soroll elèctric tal com fa la funció: CPP: Fun: `KeyPressed '.

source: Esta función devuelve el estado actual del pulsador sin filtro y, por lo tanto, puede devolver valores falsos producidos por el ruido eléctrico o los rebotes.
ca: Aquesta funció retorna l'estat actual del botó sense filtre i, per tant, pot retornar valors falsos produïts per soroll elèctric o rebots.

source: Como ventaja, esta función devuelve el valor del pulsador sin retraso de tiempo en la respuesta.
ca: Com a avantatge, aquesta funció retorna el valor del botó sense retard de temps en la resposta.

source: Ejercicios
ca: Exercicis

source: Programa el código necesario para resolver los siguientes problemas.
ca: Programa el codi necessari per resoldre els problemes següents.

source: Encender el led D1 con el pulsador 1 y apagar el led D1 con el pulsador 2. Corregir los errores sintácticos del siguiente programa. Los errores más comunes son: olvidar el punto y coma al final de la instrucción, cambiar mayúsculas y minúsculas, olvidar un corchete o paréntesis. Arduino ayuda a encontrar los errores de dos maneras. Al escribir una función correcta, esta aparece con un color naranja. Al compilar el código, la ventana inferior informa sobre los errores encontrados.
ca: Enceneu el LED D1 amb el botó 1 i desactiveu el LED D1 amb el botó 2. Corregiu els errors sintàctics del programa següent. Els errors més habituals són: oblideu el punt i coma al final de la instrucció, canvieu la part superior i la minúscula, oblideu un bracket o parèntesis. Arduino ajuda a trobar errors de dues maneres. Quan escriviu una funció correcta, apareix amb un color taronja. En recopilar el codi, la finestra inferior informa sobre els errors que es troben.

source: Encender todos los ledes de la siguiente manera. El led D1 se encenderá al presionar el pulsador 1. A continuación el led D2 se encenderá al presionar el pulsador 2. El programa seguirá de esta manera hasta llegar a encender 5 led. Completar el programa que aparece a continuación.
ca: Enceneu tots els LED de la següent manera. El LED D1 s’encendrà en prémer el botó 1. Aleshores el LED D2 s’encendrà quan prémer el botó 2. El programa continuarà d’aquesta manera fins a 5 LED encesa. Completeu el programa que apareix a continuació.

source: :download:`Programa para entorno Ardublock: 'keyPressed_3' <_downloads/ardublock_keyPressed_3.abp>`
ca: : Descarregueu: `Programa d'entorn Arcublock:

source: Al comenzar, se encenderá el led D1. Cuando se presione el pulsador 1, se apagará el led D1 y se encenderá el led siguiente. La luz se moverá así hacia la derecha hasta el led D5. Al presionar el pulsador 5, el led D5 se apagará y se encenderá de nuevo el led led D1. Completar el programa que aparece a continuación según los comentarios.
ca: Al principi, el LED D1 s’encendrà. Quan es prem el primer botó, el LED D1 s’apagarà i el següent LED s’encendrà. La llum es traslladarà a la dreta al LED D5. En prémer el botó 5, el LED D5 s’apagarà i s’encendrà el LED D1 LED. Completeu el programa que apareix a continuació segons els comentaris.

source: :download:`Programa para entorno Ardublock: 'keyPressed_4' <_downloads/ardublock_keyPressed_4.abp>`
ca: : Descarregueu: `Programa de l'entorn Arcublock: 'keyPressed_4' <_downloads/ardublock_keypresssed_4.abp>` ``

source: Modificar el programa anterior para que los ledes se enciendan desde el D6 hasta el D1. Cuando llegue el turno de apagar el led D1, se encenderá de nuevo el led D6.
ca: Modifiqueu el programa anterior perquè els LED es mostrin de D6 a D1. Quan arribi el torn de la LED D1, el LED D6 tornarà a encendre.

source: Los tres ledes D1, D2 y D3 se encenderán cuando se presione a la vez los tres pulsadores 1, 2 y 3. Utiliza el operador '&&' que evalúa si se producen dos condiciones a la vez. Completar el programa que aparece a continuación según los comentarios.
ca: Els tres LEDES D1, D2 i D3 s’encendran quan els tres botons 1, 2 i 3. Utilitzeu l’operador '&&&&&&&&AL que avalua si es produeixen dues condicions alhora. Completeu el programa que apareix a continuació segons els comentaris.

source: :download:`Programa para entorno Ardublock: 'keyPressed_5' <_downloads/ardublock_keyPressed_5.abp>`
ca: : Descarregueu: `Programa de l'entorn Arcublock: 'keyPressed_5' <_downloads/ardublock_keypresssed_5.abp>` ``

source: Después de presionar en orden la secuencia de pulsadores 2, 4 y 1, una cerradura electrónica se abrirá. La apertura se indicará encendiendo en secuencia los ledes rojo, amarillo y verde, uno cada segundo. Completar los huecos del programa que aparece a continuación según los comentarios.
ca: Després de prémer per tal de la seqüència del botó 2, 4 i 1, s’obrirà un bloqueig electrònic. L’obertura s’indicarà il·luminant els LEDs vermells, grocs i verds, un cada segon. Completa els forats del programa que apareix a continuació segons els comentaris.

source: :download:`Programa para entorno Ardublock: 'keyPressed_6' <_downloads/ardublock_keyPressed_6.abp>`
ca: : Descarregueu: `Programa de l'entorn Arcublock: 'keyPressed_6' <_downloads/ardublock_keypresssed_6.abp>` ``
