Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/arduprog/protoboard-led-d2.po
Languages: ca

source: Led controlado por la placa Arduino
ca: LED controlat per la placa Arduino

source: Monta en protoboard el siguiente esquema eléctrico.
ca: Monto a Protoboard El següent esquema elèctric.

source: Ahora es necesario programar la placa Arduino UNO para que el led rojo se encienda.
ca: Ara és necessari programar la placa Arduino One per al LED vermell.

source: :download:`Circuito eléctrico en formato Fritzing <protoboard/arduino-proto-02-led-d2.fzz>`
ca: : Descarregueu: `Circuit elèctric en format Fritzing <Protoboard/Arduino-Propo-02-Led-D2.fzz>`

source: Ejercicios
ca: Exercicis

source: Sube a la placa Arduino UNO el siguiente programa. El led rojo debe parpadear, encendido durante un segundo y apagado durante otro segundo.
ca: El següent programa puja a la placa Arduino. El LED vermell ha de parpellejar, encendre un segon i desactivar -lo durant un segon.

source: Modifica el programa anterior para que el led luzca como el de una alarma. Debe encenderse durante una décima de segundo y apagarse durante diez segundos.
ca: Modifiqueu el programa anterior perquè el LED sembli un alarma. Ha d’il·luminar durant una desena part i sortir durant deu segons.

source: Modifica el programa para que el led luzca como una vela artificial. El tiempo de encendido debe ser aleatorio entre 100 y 300 milisegundos. El tiempo de apagado debe ser aleatorio entre 50 y 150 milisegundos.
ca: Modifiqueu el programa perquè el LED sembli una espelma artificial. El temps d’encesa ha de ser aleatori entre 100 i 300 mil·lisegons. El temps lliure ha de ser aleatori entre 50 i 150 mil·lisegons.

source: Modifica el programa para que el led se encienda y se apague rápidamente (durante 100 milisegundos) y luego se encienda y se apague lentamente (durante 1 segundo).
ca: Modifiqueu el programa perquè el LED s’encengui i s’apagui ràpidament (durant 100 mil·lisegons) i després s’encengui i s’apagui lentament (durant 1 segon).

source: Modifica el programa para que el led parpadee dos veces rápido (cada 100 milisegundos) y luego se mantenga apagado durante 2 segundos.
ca: Modifiqueu el programa per al LED a parpellejar dues vegades ràpid (cada 100 mil·lisegons) i després romangueu fora de 2 segons.

source: Modifica el programa para que el led realice lo contrario que en el ejercicio anterior. Se debe apagar rápido dos veces (cada 100 milisegundos) y luego se debe mantener encendido durante 2 segundos.
ca: Modifiqueu el programa perquè el LED faci el contrari que en l'exercici anterior. S’ha d’apagar ràpidament dues vegades (cada 100 mil·lisegons) i s’ha de mantenir durant 2 segons.

source: Modifica el primer programa para que encienda y apague el led cada pocos milisegundos (de 1 a 100 milisegundos). Experimenta con varios tiempos para ver que ocurre.
ca: Modifiqueu el primer programa per encendre i apagar el LED cada pocs mil·lisegons (d’1 a 100 mil·lisegons). Experiència amb diverses vegades per veure què passa.

source: El ojo humano no puede ver parpadeos de luz demasiado rápidos. ¿A partir de cuántos milisegundos se puede observar el parpadeo?
ca: L’ull humà no pot veure parpellejos de llum massa ràpids. Des de quants mil·lisegons es pot observar el parpelleig?
