Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/arduprog/protoboard-recursos.po
Languages: ca

source: Guía de Arduino
ca: Guia Arduino

source: Guía en PDF con 27 lecciones y prácticas de Arduino, creada por el profesor **Francisco Trigueros** para programar con bloques y con código diversos sensores y actuadores.
ca: Guia en PDF amb 27 lliçons i pràctiques d’Arduino, creada pel professor ** Francisco Trigueros ** per programar amb blocs i amb codificació de diversos sensors i actuadors.

source: **Índice:**
ca: ** Índex: **

source: PRIMERAS LECCIONES Y PRÁCTICAS CON ARDUINO
ca: Primeres lliçons i pràctiques amb Arduino

source: Primeros pasos con Arduino.
ca: Primers passos amb Arduino.

source: Protoboard y conexión de componentes.
ca: Protoboard i connexió de components.

source: Repeticiones con el bucle for( ).
ca: Repeticions amb el bucle for ().

source: Graduar la intensidad de luz de un LED. Salidas PWM.
ca: Gradueu la intensitat de la llum d’un LED. Sortides PWM.

source: Comunicación serial. Recibiendo información de Arduino.
ca: Comunicació en sèrie. Rebre informació d’Arduino.

source: Comunicación serial. Enviando información a Arduino.
ca: Comunicació en sèrie. Enviant informació a Arduino.

source: Entradas digitales. Pulsadores. OR, AND, if, else.
ca: Entrades digitals. Botó. O, i, si, els altres.

source: Entradas analógicas. Sensores de luz con LDR.
ca: Entrades analògiques Sensors de llum amb LDR.

source: Servomotores.
ca: Servomotors.

source: Potenciómetro. Función map().
ca: Potenciòmetre. Funció map ().

source: PROGRAMACIÓN C++ (PROFUNDIZACIÓN)
ca: Programació C ++ (aprofundiment)

source: Tipos de variables más usados.
ca: Tipus de variables més utilitzades.

source: Variables para frases y caracteres.
ca: Variables per a frases i caràcters.

source: Variables globales y variables locales.
ca: Variables i variables globals locals.

source: Leer enteros, decimales y texto en el monitor serie.
ca: Llegiu nombres enters, decimals i text al monitor de la sèrie.

source: Formas de declarar una constante.
ca: Formes de declarar una constant.

source: MÁS SENSORES Y ACTUADORES PARA PROYECTOS
ca: Més sensors i actuadors per a projectes

source: Sensor ultrasónico de distancia HC-SR04
ca: Sensor ultrasònic de distància HC-SR04

source: Sensor de temperatura y humedad DHT11
ca: Sensor de temperatura i humitat DHT11

source: Sensor infrarrojo pasivo HC-SR501. Detector movimiento
ca: Sensor d’infrarojos passius HC-SR501. Detector de moviment

source: Tira de LEDs NeoPixel WS2812B.
ca: Neopixel WS2812B LEDs.

source: Sensores de sonido (de señal digital y de señal analógica).
ca: Sensors de so (senyal digital i senyal analògic).

source: Distintas formas de alimentar Arduino.
ca: Diferents maneres d’alimentar Arduino.

source: Controlador de Motores DC L298N.
ca: Controlador de motors DC L298N.

source: Motores de corriente continua.
ca: Motors de corrent continu.

source: Bluetooth. Módulo HC-05.
ca: Mòdul Bluetooth HC-05.

source: `Curso de Arduino con lecciones y prácticas. Formato PDF. <../../_static/document/arduino-guia-lecciones-practicas.pdf>`__
ca: `Curs Arduino amb lliçons i pràctiques. Format PDF. <../../_ Static/Document/Arduino-Guia-Lections-Practicas.pdf>`__

source: `Curso de Arduino con lecciones y prácticas. Formato ODT. <../../_static/document/arduino-guia-lecciones-practicas.odt>`__
ca: `Curs Arduino amb lliçons i pràctiques. Format ODT. <../../_ Static/Document/Arduino-Gui-Lections-Practicas.odt>`__
