Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/arduprog/protoboard-push-ledes.po
Languages: ca

source: Pulsadores y ledes
ca: Botons i Ledes

source: Monta en protoboard el siguiente esquema eléctrico.
ca: Monto a Protoboard El següent esquema elèctric.

source: :download:`Circuito eléctrico en formato Fritzing <protoboard/arduino-proto-04-push-ledes.fzz>`
ca: : Descarregueu: `Circuit elèctric en format Fritzing <Protoboard/Arduino-Propo-04-Push-les.fzz>` `

source: Ejercicios
ca: Exercicis

source: Sube a la placa Arduino UNO el siguiente programa. El led verde se encenderá al pulsar el pulsador 1.
ca: El següent programa puja a la placa Arduino. El LED verd s’encendrà prement el botó 1.

source: Modifica el programa anterior para añadir que el led rojo se encienda al presionar el pulsador 2.
ca: Modifiqueu el programa anterior per afegir que el LED vermell està activat quan premeu el botó 2.

source: Modifica el programa anterior para que los dos ledes se enciendan al presionar el pulsador 1 y que se apaguen al presionar el pulsador 2.
ca: Modifiqueu el programa anterior de manera que els dos LED es mostrin en la llista quan premeu el botó 1 i que surtin quan premeu el botó 2.

source: Realiza un programa para simular una luz temporizada de escalera. El led verde se encenderá al presionar el pulsador 1 y debe mantenerse encendido durante 4 segundos. Después de ese tiempo el led verde se apagará.
ca: Feu un programa per simular una llum de l'escala cronometrada. El LED verd s’encendrà quan prémer el botó 1 i s’hauria de mantenir durant 4 segons. Després d’aquell moment, el LED verd s’apagarà.

source: La instrucción que se debe utilizar para esperar cuatro segundos es:
ca: La instrucció que s’ha d’utilitzar per esperar quatre segons és:

source: Modifica el programa anterior para que el led rojo se encienda mientras el led verde esté apagado y que se apague cuando el led verde esté encendido.
ca: Modifiqueu el programa anterior per al LED vermell que s’encengui mentre el LED verd s’apaga i s’apaga quan el LED verd està activat.
