Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/arduprog/protoboard-tres-ledes.po
Languages: ca

source: Monta en protoboard el siguiente esquema eléctrico.
ca: Monto a Protoboard El següent esquema elèctric.

source: :download:`Circuito eléctrico en formato Fritzing <protoboard/arduino-proto-03-tres-ledes.fzz>`
ca: : Descarregueu: `Circuit elèctric en format Fritzing <Protoboard/Arduino-Propo-03-TRES-LEDES.FZZ> '

source: Ejercicios
ca: Exercicis

source: Sube a la placa Arduino UNO el siguiente programa. Los tres ledes deben encenderse a la vez.
ca: El següent programa puja a la placa Arduino. Les tres LED han d’encendre’s alhora.

source: Modifica el programa anterior para que se encienda primero el led verde, un segundo después el led ámbar y un segundo después el led rojo.
ca: Modifica el programa anterior per encendre el LED verd, un segon després del LED ambre i un segon després del LED vermell.

source: La instrucción que se debe utilizar para esperar un segundo es:
ca: La instrucció que s’ha d’utilitzar per esperar un segon és:

source: Modifica el programa anterior para que después de estar todos los ledes encendidos, se vayan apagando uno a uno, comenzando por apagar el led rojo y terminando por apagar el led verde. El tiempo entre apagados será de un segundo.
ca: Modifiqueu el programa anterior de manera que després que tots els LITES estiguin encesos, s’apaguen un per un, començant per apagar el LED vermell i acabar apagant el LED verd. El temps entre serà un segon.

source: La instrucción que se debe utilizar para apagar un led es:
ca: La instrucció que s'ha d'utilitzar per desactivar un LED és:

source: Modifica el programa para que funcione como un semáforo.
ca: Modifiqueu el programa per funcionar com a semàfor.

source: Primero se encenderá el led **verde** durante **3 segundos**.
ca: Primer el LED ** verd ** durant ** 3 segons ** s’encendrà.

source: A continuación se apagará el led verde y se encenderá el led **ámbar** durante **1 segundo**.
ca: El LED verd s’apagarà llavors i el LED ** Amber ** s’encendrà durant ** 1 segon **.

source: A continuación se apagará el led ámbar y se encenderá el led **rojo** durante **3 segundos**.
ca: El LED ambre sortirà a sota i el LED vermell ** ** durant ** 3 segons ** s'encendrà.

source: La secuencia se repetirá continuamente.
ca: La seqüència es repetirà contínuament.

source: Modifica el programa anterior para que el led ámbar parpadee tres veces. El tiempo de encendido y de apagado será de medio segundo.
ca: Modifiqueu el programa anterior per al LED ambre a parpellejar tres vegades. L’encesa i el temps d’execució seran mig segon.

source: Realiza un programa con una secuencia diferente a los ejercicios anteriores.
ca: Feu un programa amb una seqüència diferent dels exercicis anteriors.
