Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/arduprog/protoboard-led-vcc.po
Languages: ca

source: Led siempre encendido
ca: Led sempre en marxa

source: Monta en protoboard el siguiente esquema eléctrico.
ca: Monto a Protoboard El següent esquema elèctric.

source: El led rojo debe permanecer siempre encendido cuando se alimenta la placa Arduino Uno.
ca: El LED vermell sempre ha de romandre encès quan s’alimenta l’arduino una placa.

source: :download:`Circuito eléctrico en formato Fritzing <protoboard/arduino-proto-01-led-vcc.fzz>`
ca: : Descarregueu: `Circuit elèctric en format Fritzing <Protoboard/Arduino-Propo-01-Led-Vcc.fzz>`

source: Ejercicios
ca: Exercicis

source: Cambia el sentido del led para que los pines estén conectados al revés. Puedes comprobar que el led se apaga cuando está conectado al revés. Al ser un diodo, solo permite el paso de la electricidad en un sentido y no lo permite en el sentido contrario.
ca: Canvieu la direcció del LED de manera que els pins estiguin connectats cap per avall. Podeu comprovar que el LED s’apaga quan es connecta cap per avall. Al ser un díode, només permet el pas de l’electricitat en un sentit i no ho permet en el sentit contrari.

source: Si en algún momento un led no funciona, comprueba que está conectado en el sentido correcto.
ca: Si en algun moment un LED no funciona, comproveu que estigui connectat en la direcció correcta.

source: Cambia la resistencia de 220 Ohmios por otra resistencia de 1000 Ohmios. Comprobarás que la luminosidad del led disminuye.
ca: Canvieu la resistència de 220 ohms per una altra resistència de 1000 ohms. Vostè comprovarà que la lluminositat del LED disminueix.

source: Cambia la resistencia de 220 Ohmios por otra resistencia de 150 Ohmios. Comprobarás que la luminosidad del led aumenta.
ca: Canvieu la resistència de 220 ohms per una altra resistència de 150 ohms. Veureu que la lluminositat del LED augmenta.

source: La resistencia que acompaña al led sirve para limitar la corriente que circula. De esa manera se evita que el led o la salida de la placa Arduino se quemen.
ca: La resistència que acompanya el LED serveix per limitar el corrent actual. D’aquesta manera s’evita que el LED o la sortida de la placa Arduino es cremin.
