Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/arduprog/protoboard-pot.po
Languages: ca

source: Potenciómetro
ca: Potenciòmetre

source: Monta en protoboard el siguiente esquema eléctrico.
ca: Monto a Protoboard El següent esquema elèctric.

source: :download:`Circuito eléctrico en formato Fritzing <protoboard/arduino-proto-05-pot.fzz>`
ca: : Descarregueu: `Circuit elèctric en format Fritzing <Protoboard/Arduino-Propo-05-Pot.fzz>` `

source: Ejercicios
ca: Exercicis

source: Sube a la placa Arduino UNO el siguiente programa. El led rojo se encenderá más o menos según se gire el potenciómetro a la derecha o a la izquierda.
ca: El següent programa puja a la placa Arduino. El LED vermell s’encendrà més o menys depenent del potenciòmetre a la dreta o a l’esquerra.

source: Sube a la placa Arduino UNO el siguiente programa. El led rojo y el led verde se encenderán alternativamente con una frecuencia que dependerá de la posición del potenciómetro.
ca: El següent programa puja a la placa Arduino. El LED vermell i el LED verd activaran alternativament una freqüència que dependrà de la posició del potenciòmetre.

source: Gira el potenciómetro a la derecha y a la izquierda para comprobar el efecto que tiene sobre los led.
ca: Gireu el potenciòmetre a la dreta i a l'esquerra per comprovar l'efecte sobre els LED.

source: Sube a la placa Arduino UNO el siguiente programa.
ca: El següent programa puja a la placa Arduino.

source: Al girar el potenciómetro en un sentido, los dos ledes se apagarán.
ca: En girar el potenciòmetre en una direcció, els dos LED sortiran.

source: Al girar el potenciómetro en el sentido contrario primero se encenderá el led verde para indicar que el valor es mayor que cero.
ca: En girar el potenciòmetre en sentit contrari, el LED verd s’encendrà primer per indicar que el valor és superior a zero.

source: Si seguimos girando el potenciómetro, se encenderá el led rojo para indicar que llegamos al final del recorrido.
ca: Si continuem girant el potenciòmetre, el LED vermell s’encendrà per indicar que arribem al final de la ruta.
