Repository: picuino/tecno-recursos
Catalog: locale/*/LC_MESSAGES/arduprog/troubleshooting.po
Languages: ca

source: Solución de problemas
ca: Resolució de problemes

source: Lo más habitual es que los programas y circuitos no funcionen en el primer intento. Esto le ocurre hasta a los más experimentados, nadie se libra de la `ley de Murphy <https://es.wikipedia.org/wiki/Ley_de_Murphy>`__.
ca: El més comú és que els programes i els circuits no funcionen en el primer intent. Això passa fins i tot als més experimentats, ningú no es desfà de la 'Llei Murphy <https://es.wikipedia.org/wiki/ley_de_murphy>`__.

source: Los fallos más frecuentes y también los más difíciles de encontrar, suelen ser a su vez los más simples. Son fallos del tipo ¿por qué no funciona esta televisión? sin darse cuenta de que no está conectada.
ca: Els fracassos més freqüents i també els més difícils de trobar solen ser els més senzills. Són fallades de tipus Per què funciona aquesta televisió? Sense adonar -se que no està connectat.

source: A continuación se presenta una lista de los errores más comunes para que pueda servir de guía para encontrar esos fallos que se resisten y tanto trabajo dan.
ca: A continuació, es mostra una llista dels errors més habituals de manera que pot orientar -se per trobar aquells fracassos que resisteixen i tanta feina.

source: ¿Está Conectado?
ca: Està connectat?

source: Hay múltiples versiones de este fallo tan común. En este punto hay que destacar que la comprobación debe hacerse de forma que se asegure la buena conexión con total fiabilidad. No basta con mirar si el cable está en su sitio. También hay que comprobar que existe continuidad, se debe comprobar con un polímetro que llega la señal y que no hay otras conexiones indeseadas, como un cortocircuito. Antes de continuar buscando fallos más complejos debe quedar completamente comprobado que la conexión es correcta. A continuación se encuentra una lista con versiones muy comunes de este problema.
ca: Hi ha múltiples versions d’aquest fracàs comú. En aquest moment cal destacar que la verificació s’ha de fer de manera que es garanteixi la bona connexió amb la fiabilitat total. No n’hi ha prou de veure si el cable està al seu lloc. També cal verificar que hi hagi continuïtat, s’ha de comprovar amb una política que arribi el senyal i que no hi hagi altres connexions no desitjades, com ara un curtcircuit. Abans de continuar buscant fallades més complexes, s’hauria de demostrar completament que la connexió és correcta. A continuació es troba una llista de versions molt comunes d’aquest problema.

source: ¿Está conectada la alimentación y tiene la tensión correcta?
ca: El menjar està connectat i té la tensió correcta?

source: La comprobación más sencilla y más segura consiste en medir la tensión de alimentación del circuito con un polímetro. Si el circuito dispone de un led para comprobar la presencia de alimentación también servirá de ayuda, pero con un led no se puede asegurar que la tensión es la correcta.
ca: El control més senzill i segur consisteix a mesurar la tensió d’alimentació del circuit amb un canter. Si el circuit té un LED per comprovar la presència de menjar, també us ajudarà, però amb un LED no es pot assegurar que la tensió sigui correcta.

source: En general no es suficiente saber que el circuito está conectado, porque esto puede despistar. Imaginemos una placa conectada a un cable USB que la alimenta. Evidentemente la placa está conectada, pero ¿Está conectado el otro extremo del cable? ¿El hub al que está conectado el cable está a su vez conectado al ordenador? ¿El ordenador está en marcha? ¿Alguno de los cables está cortado? ¿Alguno de los interruptores de encendido no está en posición encendido o se ha quedado a medio camino? Lo más seguro es comprobar la tensión de alimentación en el circuito final.
ca: En general, no n’hi ha prou de saber que el circuit està connectat, perquè això pot enganyar. Imaginem una placa connectada a un cable USB que l’alimenta. Evidentment, la placa està connectada, però està connectat l’altre final del cable? El centre al qual està connectat el cable està connectat a l'ordinador? L’ordinador està en marxa? Es talla algun dels cables? Alguns dels interruptors d’encesa no estan en una posició ON o s’ha quedat a la meitat? El més segur és comprovar la tensió d’alimentació al circuit final.

source: ¿Está conectada la señal analógica?
ca: El senyal analògic està connectat?

source: Al igual que en el punto anterior, lo más seguro es medir con un polímetro el nivel de señal que llega al circuito. Al intentar medir una señal analógica, siempre mide lo mismo o solo se recibe ruido. En este caso hay que comprobar varias conexiones:
ca: Com en el punt anterior, el més segur és mesurar el nivell de senyal que arriba al circuit. Quan s’intenta mesurar un senyal analògic, sempre mesura el mateix o només es rep el soroll. En aquest cas, heu de comprovar diverses connexions:

source: ¿Está conectada la masa?
ca: La massa està connectada?

source: ¿Están conectadas las señales de referencia de tensión V+ y V-?
ca: Els senyals de referència de tensió estan connectats V+ i V-?

source: ¿Tiene continuidad el cable que va desde el sensor hasta el microcontrolador?
ca: Continua el cable que va del sensor al microcontrolador?

source: ¿Hay algún cortocircuito que no permite que llegue la señal?
ca: Hi ha un curtcircuit que no permeti arribar el senyal?

source: ¿Está conectada la señal a la patilla correcta?
ca: El senyal està connectat al passador adequat?

source: La primera entrada del puerto RA es RA0 y la segunda RA1 esto puede llevar a confusión en alguna ocasión ¿Está la señal conectada a su entrada? Si hay una confusión en el puerto de entrada/salida comienzan los problemas ¿Está conectada a RA o a RB? En algunos microcontroladores es posible asignar las entradas/salidas a las patillas por software ¿Está bien configurada la patilla de entrada/salida?
ca: La primera entrada de Puerto Ra0 i la segona RA1 pot provocar confusió en ocasions, el senyal està connectat a la seva entrada? Si hi ha una confusió al port d’entrada/sortida, comencen els problemes. Esteu connectat a RA o RB? En alguns microcontroladors és possible assignar les entrades/sortides als pints per programari, es configura el pin d'entrada/sortida?

source: ¿Está conectada la resistencia de Pull-Up o Pull-Down?
ca: Està connectada la resistència de desplegament o desplegable?

source: Ciertas salidas necesitan tener una resistencia conectada a la alimentación para que la salida pueda dar señal. Es el caso de algunos circuitos comparadores como el LM311 (salida en colector abierto) o algunas salidas especiales de microcontroladores (salida en drenador abierto). La mejor forma de comprobar el funcionamiento correcto es comprobar la tensión en la patilla con un polímetro. En estos casos una lectura detallada de la hoja de características (datasheet) puede evitar cometer este fallo.
ca: Algunes sortides han de tenir una resistència connectada a l'alimentació perquè la sortida pugui donar senyal. Aquest és el cas d'alguns circuits comparatius com LM311 (sortida del col·lector obert) o algunes sortides especials de microcontroladors (sortida de desguàs obert). La millor manera de comprovar l’operació correcta és comprovar la tensió del passador amb un canter. En aquests casos, una lectura detallada del full de característiques (full de dades) pot evitar cometre aquest fracàs.

source: ¿Está configurada la patilla como entrada o como salida?
ca: El PIN està configurat com a entrada o com a sortida?

source: Una confusión en la configuración y podemos pasar horas buscando el problema. Lo más sencillo es comprobar primero la configuración de los pines de entrada y salida.
ca: Una confusió en la configuració i podem passar hores buscant el problema. El més senzill és comprovar primer la configuració dels pins d’entrada i sortida.

source: ¿Está correctamente configurado el pin MCLR?
ca: Es configura correctament el pin MCLR?

source: ¿Está correctamente configurado el pin LVP para programación con bajo voltaje?
ca: Es configura correctament el pin LVP per a la programació de baixa tensió?

source: ¿Hay alguna entrada al aire que recoja ruido ambiente?
ca: Hi ha alguna entrada d'aire que reculli soroll ambient?

source: Se debe asegurar que todas las entradas digitales y las entradas analógicas estén por defecto conectadas a masa. Las entradas al aire pueden provocar fallos intermitentes muy difíciles de encontrar y mayor consumo del circuito. En especial los pines MCLR y LPV pueden provocar fallos que provocan el reset del microcontrolador si no están correctamente configurados y conectados a Vdd o GND.
ca: Cal assegurar -se que totes les entrades digitals i les entrades analògiques estan connectades per defecte a la massa. Les entrades a l’aire poden provocar fallades intermitents molt difícils de trobar i un major consum del circuit. Especialment els pins MCLR i LPV poden causar fallades que provoquen el restabliment del microcontrolador si no es configuren correctament i es connecten a VDD o GND.

source: ¿Está la polaridad cambiada?
ca: Es canvia la polaritat?

source: Ciertos conectores obligan a conectar una polaridad concreta. En otros casos, un conector tiene una sola posición pero los cables están cambiados de lugar. Una alimentación invertida puede destruir el circuito y una señal analógica con polaridad invertida no funcionará. ¿La polaridad es correcta?
ca: Alguns connectors obliguen a connectar una polaritat específica. En altres casos, un connector només té una posició, però els cables es canvien. Una dieta invertida pot destruir el circuit i un senyal analògic amb polaritat invertida no funcionarà. La polaritat és correcta?

source: Las entradas digitales pueden estar activas a nivel alto o a nivel bajo. ¿Es el nivel lógico correcto?
ca: Les entrades digitals poden estar actives a nivell alt o baix. És el nivell lògic correcte?

source: Si la patilla de reset /MCLR está conectada con una resistencia a masa y un pulsador al positivo (al revés de su conexión normal) a partir de ahí no funcionará nada. No es frecuente cometer ese error y por la misma razón se puede perder mucho tiempo intentando encontrar este fallo.
ca: Si el pin de restabliment /MCLR està connectat amb una resistència de massa i un botó al positiu (viceversa de la seva connexió normal), res no funcionarà. No és habitual cometre aquest error i, pel mateix motiu, podeu perdre molt de temps intentant trobar aquest fracàs.

source: Si un puerto del microcontrolador está configurado con entradas en Pull-up (resistencias a positivo) y se conectan los pulsadores externos al positivo de la alimentación... no funcionará ninguno.
ca: Si un port de microcontrolador està configurat amb entrades en pull-up (resistència positiva) i connecta els botons externs al positiu del menjar ... Cap funcionarà.

source: ¿Hay cortocircuito?
ca: Hi ha curtcircuit?

source: Puede que el polímetro señale continuidad en los cables, pero si hay un cortocircuito entre medias entonces el circuito no funcionará. Para comprobar la continuidad de un componente, hay que desconectar el componente del circuito. Hay que comprobar que no existen cortocircuitos antes de comprobar si existe continuidad.
ca: L’autor pot indicar continuïtat als cables, però si hi ha un curtcircuit entre el circuit, el circuit no funcionarà. Per comprovar la continuïtat d’un component, s’ha de desconnectar el component del circuit. Heu de comprovar que no hi ha curtcircuits abans de comprovar si hi ha continuïtat.

source: Si este error es frecuente, hay aparatos específicos para comprobar cortocircuitos. Desde un sencillo milióhmetro hasta un complejo `reflectómetro de dominio de tiempo <https://es.wikipedia.org/wiki/Reflect%C3%B3metro_de_dominio_de_tiempo>`__
ca: Si aquest error és freqüent, hi ha dispositius específics per comprovar els curtcircuits. Des d’un sol miliomimeter fins a un complex reflectòmetre de domini de temps <https://es.wikipedia.org/wiki/reflect%C3%B3meter_de_de_de_de_tiempo> `` __ __

source: ¿Se ha comprobado con seguridad?
ca: S'ha demostrat amb seguretat?

source: Vale la pena insistir de nuevo en este punto. En muchas ocasiones se da por supuesto que existe conexión solo porque vemos el cable en su sitio. Esto no es suficiente. La comprobación puede llevar muy poco tiempo y ahorrar bastante esfuerzo y algún dolor de cabeza.
ca: Val la pena tornar a insistir en aquest moment. En moltes ocasions se suposa que hi ha una connexió només perquè veiem el cable al seu lloc. Això no és suficient. El xec pot trigar molt poc i estalviar molt d’esforç i algun mal de cap.

source: Es fácil "ver" que dos bornas roja y negra están correctamente conectadas al polímetro... hasta que una mirada más atenta permite ver que las bornas están conectadas en modo tensión, mientras se intenta medir corriente.
ca: És fàcil "veure " que dos terminals vermells i negres estan connectats correctament a l'autor ... fins que un aspecte més atent ens permet veure que els terminals estan connectats en mode de tensió, mentre s'intenta mesurar el corrent.

source: ¿Las variables y constantes están correctamente configuradas?
ca: Es configuren correctament les variables i les constants?

source: Este es un apartado que genera fallos frecuentes y difíciles de encontrar porque se da por supuesto que debería funcionar correctamente. El lenguaje por defecto que se tratará es el C, porque es el lenguaje de alto nivel más frecuentemente utilizado para programar microcontroladores.
ca: Aquesta és una secció que genera freqüents i difícils de trobar perquè se suposa que hauria de funcionar correctament. El llenguatge predeterminat que es tractarà és el C, perquè és el llenguatge d’alt nivell més utilitzat per programar microcontroladors.

source: ¿Las variables pueden contener el dato?
ca: Les variables poden contenir dades?

source: Un bucle de 1000 repeticiones no podrá hacerse con una variable de 8 bits. Una variable de 8 bits con signo solo podrá contar hasta 127. Los valores mayores confundirán al bucle al pasar a valer negativo::
ca: Un bucle de repetició de 1000 no es pot fer amb una variable de 8 bits. Una variable de 8 bits amb un signe només pot comptar fins a 127. Els valors principals confonran el bucle quan el valor negatiu ::

source: Este código no imprimirá nada, puesto que i se inicializa con un valor menor que cero (i = 130 = -126 en formato de 8 bit con signo).
ca: Aquest codi no imprimirà res, ja que i s’inicialitza amb un valor inferior a zero (i = 130 = -126 en format de 8 bits amb signe).

source: ¿La base de numeración es correcta? Se debe comprobar que estamos utilizando una base de numeración adecuada::
ca: La base de numeració és correcta? Cal comprovar que utilitzem una base de numeració adequada ::

source: ¿Hay definiciones repetidas o fuera de contexto?
ca: Hi ha definicions repetides o fora de context?

source: Si hay una definición de una constante "#define" en un punto del programa y se vuelve a definir en otro punto, esto puede dar lugar a confusión a la hora de programar. Las definiciones deben aparecer solo una vez.
ca: Si hi ha una definició de constant \ "#define " en un moment del programa i es defineix de nou en un altre punt, això pot comportar confusió quan es programi. Les definicions han d’aparèixer només una vegada.

source: Las variables locales de una función se superponen a las variables globales. Hay que llamar a las variables globales de forma que no coincidan con las variables locales.
ca: Les variables locals d’una funció sobreposen les variables globals. Hem de trucar a variables globals perquè no coincideixin amb variables locals.

source: ¿Las condiciones están correctamente escritas?
ca: Les condicions estan escrites correctament?

source: Las condiciones son una frecuente fuente de errores. Algunos de los más frecuentes son:
ca: Les condicions són una font freqüent d’errors. Alguns dels més freqüents són:

source: Escribir un solo igual es incorrecto::
ca: Escriure un únic igual és incorrecte ::
